[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-662-annsbury-st-bedroom\/7512655535.html","post_id":7512655535,"result_date":"2022-07-23 23:09","title":"*\/\/662 E Annsbury St\/\/** 2 Bedroom Apartment Downtown Philadelphia, PA","description":"I said I was going to repost the apartment when we were ready to show it with more pictures. We have a lot of people that want to take a look at it. We are sorry we do not allow pets of any kind. Also there is no smoking on the property and we are very sorry we do not accept section 8. It is $700 a month with hot water, water\/sewer included only. Apartment has a brand new heating system with central air conditioning. Also $700 for security deposit. We are going to start showing it tomorrow morning July 20th. Plenty of parking and the apartment is on the 2nd floor.  Right downtown Philadelphia. Will be available August 1st. Still need to put a new kitchen floor in. We will be taking applications and we will also do a background check.  If you are interested please send me your number. I will contact you soon.","num_images":5,"lat":40.0343,"lng":-75.1213,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T22:58:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-bedroom-house\/7512655471.html","post_id":7512655471,"result_date":"2022-07-23 23:01","title":"Cozy 2 Bedroom House","description":"Cozy home with 2 bedrooms, living room, kitchen with stainless steel appliances, storage area under stairs, washer and dryer. Olive St home has access and use of a courtyard great for dogs and entertaining guests. Expanded Trinity style house is located off of Brown between 2nd Street and I95. Friendly street with great neighbors. Rent is $1,600 per month plus electric.","num_images":7,"lat":39.962779,"lng":-75.140247,"attrs":"['2BR \/ 1Ba', '890ft2', 'available aug 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T22:57:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-now-stunning\/7512654839.html","post_id":7512654839,"result_date":"2022-07-23 22:58","title":"Available Now!! Stunning 3 Bedroom unit in 1804 Federal St@@","description":"Available Now! This second floor 3-bedroom apartment in 1804 Federal St, Philadelphia, PA . features new flooring throughout the unit and an enclosed patio for additional storage, a sitting area, or home office. Conveniently located near local shopping, entertainment, and transportation. This house is in the good location, it’s close the E Cotati Ave and Snyder Ln, surroundings quite and safety area, the owner and other roommates are very friendly, $900 rental fees including WiFi, Water, Electric, Laundry, Dishes cleaners, and toilet papers. Welcoming who is no drugs, no smoking, no alcohol the nice person to come looking around house and room. Now the room is available. thanks! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! 1 mos rent, 1 mos security. Come take a look at a great rental available for a 1st home or if downsizing: newly updated 1 bedroom, 1 bathroom house on a spacious 1 acre lot with plenty of privacy, available after October 1st. Includes all new appliances w\/washer & dryer. Plenty of storage in a full basement as well as a shed on premises. Beautiful Hardwood floors through, Stainless steel Appliances, Ceramic tile kit & Baths, Vaulted ceiling in foyer, Solar panels, Updated Heat & hot water, 1 car attached Garage with elect opener. Conveniently located close to all public transportation, LIE highway, stores, restaurants, schools, parks, library. FOR MORE INFO:: Rebeca24360𝐆𝐦𝐚𝐢𝐥•𝐂𝐨𝐦*","num_images":3,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T22:54:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-picture-yourself-in-this\/7512640220.html","post_id":7512640220,"result_date":"2022-07-23 21:44","title":"Picture yourself in this lovely three bedroom home.","description":"This three bedroom home comes equipped with plush brand new carpet, along with vinyl flooring, and great lighting.\nThe basement area can be used for extra storage. This home also comes with a washer in the basement area.\nBrand new stove and refrigerator will be installed.\n","num_images":19,"lat":39.99905,"lng":-75.174439,"attrs":"['3BR \/ 1Ba', '816ft2', 'house', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T21:40:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-renovated-temple\/7512615752.html","post_id":7512615752,"result_date":"2022-07-23 20:09","title":"@New Renovated-Temple University- house for rent @","description":"Ready to view And move . Temple University campus. Two blocks from Subway station and bus stop on Broad street- many shopping and restaurants .\nNew Renovated house, safe, friendly neighborhood, two blocks to  Subway station; modern kitchen, stainless steel appliances, washer, dryer, full basement, hardwood floor, back yard, Central HVAC system.\nMove-in property ready .","num_images":16,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 1Ba', '1600ft2', 'available aug 1', 'air conditioning', 'cats are OK - purrr', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T20:05:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-natural-light\/7512590688.html","post_id":7512590688,"result_date":"2022-07-23 19:07","title":"Spacious natural light 1 bedroom 1 bathroom","description":"Spacious 1 bedroom with 1 bath available in Ludlow. Minutes away from N.Liberties. Located on the second floor it has tons of natural light, open floor plan with kitchen living room combo, gourmet kitchen with high end appliances and island. Gorgeous hardwood floors. Large bedroom with large closets and bathrooms with standing shower and bathtub. Washer and dryer in unit. Walking distance to tons of popular restaurants and parks in the area. 10 mins by car or train to Center City.","num_images":11,"lat":39.972232,"lng":-75.147808,"attrs":"['1BR \/ 1Ba', '946ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T18:44:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lambert-st-south-phila-3bd\/7512594915.html","post_id":7512594915,"result_date":"2022-07-23 19:01","title":"$1850 - 2204 S Lambert St - South Phila 3bd\/2bh with Roof Deck and Car","description":"$1850 - 2204 S Lambert St - South Phila 3bd\/2bh with Roof Deck and Car Garage -  (Passyunk > South)\nThis quaint 3 bedrooms and 2 full bath home with a garage and roof deck in South Philadelphia is waiting for you! Home has everything you need and more! Front porch and Hardwood floors throughout, plenty of closet space, Beautiful kitchen with granite countertop and double sink. New Windows throughout the house Bathroom in basement and rooftop deck where you can enjoy morning breakfast, watch the sunset or watch the fireworks. PARKING!! In South Philadelphia!! The garage is secured by a gated. House has a porch front home on a wide green street in the heart of South Philadelphia. Modern kitchen, plenty of closet space, central A\/C, finished basement with powder room. Close to all transportation, highways bridges, shopping, banking, eateries, and much more. The garage that fits one car in the rear, and storage!! Second floor rear deck!!\nThis is an impeccably well-maintained home located in a quiet South Philadelphia block neighborhood. The value and area cannot be beaten. Living here puts you only steps from all that Philly living can offer. It is just a short distance to the exciting East Passyunk corridor and Center City and all of the bars and restaurants. It is a short walk to Newbold, Point Breeze, and historic Girard Estates. House is also very convenient for transportation to Center City, great shopping, and amazing green spaces like Girard Park, Marconi Plaza, Passyunk Square, and FDR Park. The living and dining areas flow nicely into a very well-designed and recently upgraded kitchen. This galley-style kitchen boasts custom cabinetry and with access to a nice outdoor area to the rear private back patio of the home. This quaint street offers a great setting for this super well-maintained home—a 3 bedroom 2 bathroom house on a great block in South Philly. House has a new Anderson window for lots of natural light. Head out to the large patio that can fit a grill, chairs, and patio table. Tall ceilings, modern kitchen, private back patio perfect for grilling, full finish basement with washer and dryer, and much more. Very cool home, a must-see home. The home has a garage with Private Street on the back.\nGREAT starter home in the heart of South Philadelphia. Just a few blocks to Passyunk Square, Broad Street Subway, Sports Complex area, and more! Seconds to Center City, University City, and Rittenhouse square. Extremely accessible to highways I-76, I-95 and Columbus Blvd.\nProperty boasts:\n- Car Garage\n- Big spacious rooms\n- Full basement\n- Private back patio\n- Open floor plan\n- Laundry\n- Great Location\nCOMMUNITY FEATURES\n________________________________________\n•\tSecured entry\n•\tNear transportation\n•\tLot of the on-street parking\nThe rental is responsible for all utilities (gas, electric, and water).\nLast month's rent was due at signing.\nNo smoking allowed. Up to small pets permitted.","num_images":24,"lat":39.9227,"lng":-75.1812,"attrs":"['3BR \/ 2Ba', '1200ft2', 'available sep 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'townhouse', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T18:57:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-condo-for-rent\/7512588873.html","post_id":7512588873,"result_date":"2022-07-23 18:48","title":"Condo for rent","description":"This 1460 square foot condo home has 1 bedrooms and 1.0 bathrooms. This home is located at 701 N 5th St #2, Philadelphia, PA 19123. eady to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! Beautiful Hardwood floors through, Stainless steel Appliances, Ceramic tile kit & Bath, Vaulted ceiling in foyer, Solar panels, Updated Heat & hot water, 1 car attached Garage with elect opener. The apartment features laminate floors, quarts counter tops, tile backsplash, quality stainless steel appliances, including an electric stove, microwave, dishwasher and garbage disposal. Central A\/C and heat. Washer and Dryer in the unit. *Please text me your phone number for quick response.","num_images":1,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '1460ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T18:38:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-updated-2br-ft2\/7512541657.html","post_id":7512541657,"result_date":"2022-07-23 18:37","title":"💖Lovely updated, 2br - 1200 ft2 - Gated, Remolded apartment for rent","description":"show contact info\nApartments for rent include newly renovated one bedroom, tow  bedroom  loft,  apartments for rent feature gourmet kitchens with granite counters, black appliances,  and new cabinetry. Upgrade any home to Furnished+ and enjoy the convenience of turnkey living. Find whatever you need for a peaceful lifestyle in our apartment, including amenities like spas, an Olympic sized swimming pool, and a great recreation room.  apartment living. This is living up.. Find everything here you could want in an apartment community,You will also have easy access to bus and public transportation, several well-established schools, and local attractions like Johnny Carson Park and McCambridge Park and Recreation Center. In addition\nSq Footage: Approx. 1200 sq ft. (Estimated)\nBedrooms: 2 Beds\nBathrooms:  Baths\nParking: One Parking Spot\nLaundry: Washer-dryer\nFloor: One Floor, Open floor plan\nBBQ\/Picnic Areas\nDog Park with Pet Stations\nMicrowave, Dishwasher, Refrigerator\nshow contact info","num_images":9,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1200ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-23T16:39:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-bedrooms-are-in-high-demand\/7512569977.html","post_id":7512569977,"result_date":"2022-07-23 18:29","title":"2 bedrooms are in HIGH DEMAND! elevate your lifestyle w\/ new special","description":"Two Bedroom unit located in Coatesville, Valley Township; Home of the Farms. Nearby the Route 30 Bypass, Considered one of the fastest growing communities in Chester County. Shopping close to Caln Plaza and Barley Station; Driving distance from West Chester, Lincoln and Immaculata Universities.\nOff-street parking will be expanded in May.\nBrand new kitchen, bath and floors.\nFresh paint, Eat in kitchen. Laundry on site in basement. Off street parking\nSORRY, NO PETS ALLOWED\nQuestions and Application Process\nApplications and reviewed in the order they were received following the FHA Guidelines\nApplicants are fully screened for rental history,background and credit worthiness\nRental history and credit background are major criteria of consideration for all applicants.\n","num_images":4,"lat":39.971,"lng":-75.827,"attrs":"['2BR \/ 1Ba', '1006ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T17:47:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-more-spacious-1bedrm-and\/7512580173.html","post_id":7512580173,"result_date":"2022-07-23 18:27","title":"More spacious 1bedrm and 1.5bath Apt in Philadelphia","description":"More spacious 1bedrm and 1.5bath Apt in Philadelphia! Great amount of natural sunlight. Good size of bedroom. Private entrance! New bathroom! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! Beautiful Hardwood floors through, Stainless steel Appliances, Ceramic tile kit & Bath, Vaulted ceiling in foyer, Solar panels, Updated Heat & hot water, 1 car attached Garage with elect opener. The apartment features laminate floors, quarts counter tops, tile backsplash, quality stainless steel appliances, including an electric stove, microwave, dishwasher and garbage disposal. Central A\/C and heat. Washer and Dryer in the unit. FOR MORE INFO, massage here::  show contact info\nThank you and WELCOME TO YOUR NEW DREAM HOME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1.5Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T18:14:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-manayunk-sweet-townhouse\/7512582868.html","post_id":7512582868,"result_date":"2022-07-23 18:25","title":"Manayunk: sweet townhouse, great light, private patio","description":"*Great Manayunk townhouse, comfortable living\n*Large living room, front windows, newly refinished hard wood flooring\n*Large dining room with ceiling fan, great light, newly refinished hard wood flooring\n*Nice, newer rehabbed kitchen-tile flooring, tiled back splash, dishwasher, garbage disposal, ample new cabinetry\n*Kitchen with all appliances opens to large, enclosed private back patio with access to rear street\n*Basement has washer\/dryer, ample storage\n*Full tiled upstairs hall bath with skylight\n*Second floor has 2.5 bedrooms, all with new w\/w carpeting\n*Front bedroom has large closets, ceiling fan, great light and front windows\n*Back bedroom has large closet and great light\/cross breeze windows\n*Smaller room in middle can be a study or office with window\n*Smick Street and Green Lane, great Manayunk neighborhood\n*Easy walk to main Street, the Canal, the train, public trans, close access to I76 & I476\n","num_images":17,"lat":40.028039,"lng":-75.225786,"attrs":"['2BR \/ 1Ba', 'available jul 25', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T18:21:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-bedroom-bath\/7512575557.html","post_id":7512575557,"result_date":"2022-07-23 18:17","title":"BRIGHT 2 bedroom 1 bath apartment available in Philadelphia.","description":"BRIGHT 2 bedroom 1 bath apartment available in Philadelphia. FOR MORE INFO MASSAGE:   show contact info\nfeatures new flooring throughout the unit and an enclosed patio for additional storage, a sitting area, or home office. Conveniently located near local shopping, entertainment, and transportation. This house is in the good location, it’s close surroundings quite and safety area, New kitchen! Lovely 1 bedroom first floor apt. Private entrance! New bathroom! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! Freshly painted ready to move in! This house is in the good location, it’s close the E Cotati Ave and Snyder Ln, surroundings quite and safety area, the owner and other roommates are very friendly, $660 rental fees including WiFi, Water, Electric, Laundry, Dishes cleaners, and toilet papers. Now the room is available. thanks! New kitchen! Lovely duplex 2 broom first floor apt. Private entrance! New bathroom! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC.. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities!. Includes all new appliances w\/washer & dryer. Plenty of storage in a full basement as well as a shed on premises. FOR MORE INFO MASSAGE:  (716) 217-645+2\n","num_images":4,"lat":40.0118,"lng":-75.1456,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T18:02:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-bedroom-bath\/7512575562.html","post_id":7512575562,"result_date":"2022-07-23 18:13","title":"BRIGHT 2 bedroom 1 bath apartment available in Philadelphia.","description":"BRIGHT 2 bedroom 1 bath apartment available in Philadelphia. FOR MORE INFO MASSAGE:   show contact info\nfeatures new flooring throughout the unit and an enclosed patio for additional storage, a sitting area, or home office. Conveniently located near local shopping, entertainment, and transportation. This house is in the good location, it’s close surroundings quite and safety area, New kitchen! Lovely 1 bedroom first floor apt. Private entrance! New bathroom! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! Freshly painted ready to move in! This house is in the good location, it’s close the E Cotati Ave and Snyder Ln, surroundings quite and safety area, the owner and other roommates are very friendly, $660 rental fees including WiFi, Water, Electric, Laundry, Dishes cleaners, and toilet papers. Now the room is available. thanks! New kitchen! Lovely duplex 2 broom first floor apt. Private entrance! New bathroom! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC.. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities!. Includes all new appliances w\/washer & dryer. Plenty of storage in a full basement as well as a shed on premises. FOR MORE INFO MASSAGE:  (716) 217-645+2\n","num_images":4,"lat":40.0118,"lng":-75.1456,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T18:02:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-updated-br-apt\/7512545473.html","post_id":7512545473,"result_date":"2022-07-23 18:08","title":"Spacious updated 1 br apt, first floor (Philadelphia)","description":"Spacious updated 2 br apt, first floor. Private entrance! New bathroom! New kitchen! Freshly painted ready to move in! Light and airy!Living rm, dining area, kitchen.\nBedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! 1 mos rent, 1 mos security\n*******PLEASE SEND ME YOUR TEXT NUMBER********\n","num_images":1,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', '1058ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T16:47:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bike-storage-package\/7512547679.html","post_id":7512547679,"result_date":"2022-07-23 17:54","title":"Bike Storage, Package Receiving, Microwave","description":"Bedrooms: 1\nBathrooms: 1\nDate Available: 2022-07-23\nAddress: 510 Broad St\nNestled in the heart of Philadelphia's Avenue of the Arts neighborhood, LVL North offers a home built with creative details, modern features, and sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes, LVL North is an artful blend of stylish apartments and luxury living.\nAmenities Include:\nBike Storage\nHardwood Floors\nWasher\/Dryer\nFitness Center w\/ Peloton Bikes\nElectronic Thermostat\nRooftop Deck\nElevator\nPackage Receiving\nDishwasher\nFOB Controlled Access\nOn-Site Management\nParking Garage (Additional Fees)\n+++++++++++ please send me your text number ++++++++++++\n","num_images":3,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', '1029ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T16:52:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-of-the-best-values-in\/7512366811.html","post_id":7512366811,"result_date":"2022-07-23 11:29","title":"One of the best values in Center City.","description":"$500 Security Deposit!!! 1600 Walnut is surrounded by the performing arts and numerous other cultural venues. One of the best values in Center City. Secure entry, Gym, Bike room! Bright and sunny units with hardwood floors, large windows, marble baths and open layouts with great closet space. Known for its popular restaurants and nightlife spots, Just steps away from some of Philadelphia's best culinary experiences Midtown Philadelphia is a fun and exciting place to live. Pictures are of a similar unit.\nLaundry in Building\nHardwoodfloors\nGym Available\nPets Allowed\n1600 Walnut St #601","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '550ft2', 'available aug 20', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T10:49:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath-unit\/7512368661.html","post_id":7512368661,"result_date":"2022-07-23 11:27","title":"Spacious 2 bedroom \/ 2 bath unit","description":"Spacious 2 bedroom \/ 2 bath unit at the pet-friendly Metro Club with a washer\/dryer in unit and 1 secured gated parking spot included. Great natural lighting, expansive windows, open layout, modern stainless steel appliances, beautiful hardwood floors, pendant lights above the breakfast bar. Closet galore, double bathroom sinks! Metro Club in an elevator high-rise with a heated outdoor pool, Boutique hotel-style lobby, fireplace, and lounge seating. Secured entry and controlled building access with a full gym. Easy access to Market East SEPTA station and SEPTA bus routes and many area local attractions including Reading Terminal Market, Maggiano's Italy, The Melting Pot etc. Pictures are of a similar unit!\nCentral Air\nMain Floor Laundry\nParking available\nPets Allowed\nStainless Steel Appliances\nHardwoodfloors\n201 N 8th St #902,","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1193ft2', 'available aug 26', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T10:53:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-microwave-refrigerator\/7512380557.html","post_id":7512380557,"result_date":"2022-07-23 11:22","title":"Microwave, Refrigerator, Fitness Center w\/ Peloton Bikes","description":"Bedrooms: 0Bathrooms: 1Square Feet: 390Date Available: 2022-07-23Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:FOB Controlled AccessDishwasherBike StorageHigh Speed InternetOn-Site ManagementFitness Center w\/ Peloton BikesHardwood FloorsRefrigeratorWasher\/DryerSmart Home FeaturesElevatorRecyclingCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/xqccrq74\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '390ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:18:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-full-baths-washer-dryers\/7512371338.html","post_id":7512371338,"result_date":"2022-07-23 11:20","title":"2 full baths, 2 washer-dryers","description":"Split two bedroom two bath, perfect for a roommate situation, or possibly a home office. One bedroom attached to an adjacent studio. 2 full baths, 2 washer-dryers. Main one bedroom has an open kitchen, and all windows have an amazing city view. Best of all one parking space is included. Available 10\/5\/2022. If interested, listing agent will prepare lease\nCentral Air\nMain Floor Laundry\nParking available\n2001 Hamilton St #1704","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '1074ft2', 'available oct 5', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T10:59:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-live-at-park-towne-place\/7512369428.html","post_id":7512369428,"result_date":"2022-07-23 11:20","title":"Live at Park Towne Place Apartment Homes","description":"Live at Park Towne Place Apartment Homes in Center City Philadelphia, and you'll be blocks from the center of nightlife in Logan Square and Rittenhouse Square. Unit features modern kitchens, quartz countertops, stainless steel appliances, in-unit washers and dryers, breakfast bars, pendant lighting, tile backsplashes, wood plank flooring throughout, walk-in closets. Stunning city and museum views are offered in a variety of floor plans! Mainstreet Market and Caf , featuring gourmet coffee and tea and much more! Fitness center with Technogym equipment, Queenax boxing gym, yoga\/spin studio with indoor\/outdoor workout space. It boasts Philadelphia's largest pools, an art studio, fitness center with boxing gym, yoga\/spin studio, social lounge with demonstration kitchen, gourmet market and cafe, outdoor lounge with fire pit, 24-hour concierge, 24\/7 package acceptance, resident shuttle service to Center City and University City and more. Make Whole Foods as your second kitchen conveniently located just 1 block away. Our apartments are within one mile of several institutions of higher education: Drexel University, Temple University, University of Penn, CHOP, Moore college of Arts, Community College of Philadelphia. You won't find a better building to live with amenities in the Fairmount Area. Park Towne Place includes 948 apartment and penthouse homes within four high-rise towers. The community is nestled between green acres on the Benjamin Franklin Parkway in the heart of Center City Philadelphia's Museum District. Park Town. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\nCentral Air\nMain Floor Laundry\nParking available\nPets Allowed\nStainless Steel Appliances\n2200 Benjamin Franklin Pkwy #0B-N0201","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['0BR \/ 1Ba', '425ft2', 'available oct 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T10:55:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-apartment-has-been\/7512370321.html","post_id":7512370321,"result_date":"2022-07-23 11:11","title":"This apartment has been recently renovated","description":"Welcome to 334 Queen Street #F. This apartment has been recently renovated from top to bottom! As you enter your home you will be greeted by the spacious and sunny living room with a beautiful view of Queen Street. Right off your living room is a perfectly appointed kitchen featuring stainless steel appliances, white cabinets, and designer flooring and backsplash. Down the hall you will find your updated bathroom with an oversized shower with a rain shower head, floor to ceiling tile walls, LED mirror and your in unit washer\/dryer combo! Lastly, you will love the cozy bedroom with HUGE closet. If all that wasn't enough, enjoy easy access to major highways and some of the best restaurants and parks the City has to offer!\nCentral Air\nMain Floor Laundry\nParking available\nStainless Steel Appliances\n334 Queen St #F,","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '614ft2', 'available sep 5', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T10:57:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lg-sunny-bedroom-loft\/7512374273.html","post_id":7512374273,"result_date":"2022-07-23 11:09","title":"Lg Sunny 1 Bedroom Loft - Private Deck","description":"Sunny, large 1 bedroom with loft and private deck 1\/2 block off of Rittenhouse Square.\nHighlights:\n- Huge Apartment with Natural Light\n-Fantastic Private Deck\n-Washer\/Dryer\n- Pet Friendly!!\n-A\/C\n-2 Large Closets\n-Heat & Water Included\n-Ceiling Fan\n-Cable & Internet-ready\n","num_images":11,"lat":39.948474,"lng":-75.17426,"attrs":"['1BR \/ 1Ba', '950ft2', 'available aug 1', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T11:05:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-sweeping-views-are-just\/7512372715.html","post_id":7512372715,"result_date":"2022-07-23 11:06","title":"Sweeping views are just outside your window! 1 Bd, 1 Ba, 648 SqFt!","description":"The Glen at Lafayette Hill Visit our community today! 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nUnit Rates:  $1671 - $2088\/month Unit Type: 1-BR 1-BA Unit Size: 648 sq ftLease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.What you’ll find in our community: ➢ 24 Hour Availability➢ Barbecue\/Grill➢ Cardio Machines➢ Elevator➢ Furnished Units Available➢ Multi-Use Room➢ Online Services➢ Package Service➢ Pet Friendly➢ Planned Social Activities➢ BBQ Picnic Garden➢ Billiards, Club Lounge, Cafe Area, Library and Community Room➢ Fitness Center w\/ Free Weights, Weight Machines➢ Message Therapist Practice On-site➢ Outdoor Cafe & Coffee Bar➢ Outdoor Patio Lounge➢ Sprinkler System➢ Storage Space➢ Wi-Fi at ClubhouseDescription: Our residents enjoy luxurious amenities including an amazing outdoor cafe area, a clubhouse with flat screen TVs, and a full kitchen and fitness center. Open-concept floor plans accompanied by a variety of upscale features define the one-of-a-kind luxury lifestyle only found at our Lafayette Hill apartments.This unit comes with: ➢ Air Conditioning & Heating➢ Cable Ready➢ Carpet➢ Ceiling Fans (Select Floor Plans)➢ Dining Room➢ Heating➢ Refrigerator, Freezer and Ice Maker➢ Tub\/Shower➢ Wi-Fi➢ Window Coverings➢ Crown Molding (Select Floor Plans)➢ Dishwasher➢ High Speed Internet Access➢ Microwave➢ Storage Units➢ Tile Floors➢ Trash Compactor➢ Vaulted Ceiling (Select Floor Plans)➢ Walk-In Closets (Select Floor Plans)➢ Washer\/DryerCall or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.comProperty Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYF383D5FEDB994E05\n","num_images":16,"lat":40.0896,"lng":-75.2601,"attrs":"['1BR \/ 1Ba', '648ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-23T11:02:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/huntingdon-valley-heart-of-huntingdon\/7512365591.html","post_id":7512365591,"result_date":"2022-07-23 11:04","title":"Heart of Huntingdon","description":"Elegant 1 bedroom, 2 full bathrooms and Den Unit in luxury condominium in the Heart of Huntingdon Valley. This BALFOR model offers spacious open floor plan? High ceiling and features Entry Foyer, full of natural light Leaving Room with access to a beautiful terrace.","num_images":9,"lat":40.1284,"lng":-75.0607,"attrs":"['1BR \/ 2Ba', '1210ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-07-23T10:46:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-bed-bath\/7512363526.html","post_id":7512363526,"result_date":"2022-07-23 10:45","title":"2 bed 1 bath","description":"2 bedroom 1 bathroom apt available in West Chester.\nThis apartment is located on the 3rd floor of a 19th century gothic style house converted in to 4 apartments. Blocks from restaurants, shopping and parks.\nIt is available 8\/1.\nIncluded is heat, water, hot water, trash and off street parking.\nPlease email to set up a showing. I will only be showing the apartment after 5 on Mon, Tues, Thurs, and will schedule some on Saturdays. Thank you\n","num_images":6,"lat":39.966641,"lng":-75.600097,"attrs":"['2BR \/ 1Ba', 'available aug 1', 'application fee details: $35 nonrefundable', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T10:41:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-junior-one-bedroom-with\/7512361456.html","post_id":7512361456,"result_date":"2022-07-23 10:40","title":"Junior one bedroom with parquet wood floors","description":"Junior one bedroom with parquet wood floors throughout, magnificent city views from oversized windows in all rooms providing excellent natural light, as well as a balcony accessible from the living room. Residents of The Dorchester enjoy a 24-hour doorman, fitness center, all utilities, and basic cable for TV. There is a garage and rooftop pool available for additional fees.\nCentral Air\nGym Available\n224 W Rittenhouse Sq #1008","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '611ft2', 'available aug 17', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T10:36:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-window-coverings\/7512360201.html","post_id":7512360201,"result_date":"2022-07-23 10:37","title":"Window Coverings, Refrigerator, Washer\/Dryer","description":"Bedrooms: 0Bathrooms: 1Square Feet: 390Date Available: 2022-07-23Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:DishwasherRooftop DeckSmart Home FeaturesLarge ClosetsOn-Site ManagementParking Garage (Additional Fees)Electronic ThermostatMicrowave24\/7 Front Desk AttendantHardwood FloorsRefrigeratorBike StorageCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/jokbt524\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '390ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T10:33:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-studio-apartment\/7512353572.html","post_id":7512353572,"result_date":"2022-07-23 10:33","title":"Renovated Studio Apartment Home, Wood Floors, City View, Package Room","description":"The studio apartment home at 2005 is available for lease at this moment! This 425 square foot Dali studio apartment home on the 20th floor features large windows that face north and have a city view. This renovated kitchen features white cabinets and granite countertops. This kitchen is fully-equipped with a dishwasher, disposal, microwave, and gas stove. The renovated bathroom tile is white. This home has wood floors. The Rittenhouse Claridge is located on Rittenhouse Square. Move into your new home as early as November 10, 2022!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to shopping, dining, and more! Go grocery shopping at the Rittenhouse Market, Trader Joe's, Giant, Target, or Di Bruno Bros. Browse the books at Barnes & Noble. Shop at the retail stores on Rittenhouse Row such as Anthropologie, Lagos, Tumi, Lovesac, Athleta, lululemon, Indochino, Madewell, and Paper Source. Experience fine dining at Rouge, Devon, Parc, Barclay Prime, or Pietro's. Savor a coffee at La Colombe, Ultimo, Alchemy, or Elixr. Have a French dessert at Miel Patisserie. Savor scoops of gelato from Gran Caffe L'Aquila. Indulge in ice cream at Van Leeuwen. Stroll across the park and then buy a baguette at Metropolitan Bakery. Grab scones from The Bakeshop on 20th. Catch a show at the Walnut Street Theatre. Wander around the Rodin Museum. Shop at the weekly farmer's market every Saturday and Tuesday. There is so much to do in this area!\nCommunity Amenities:\n* Package lockers\n* 8,000 square foot resident lounge with free wifi\n* Top-of-the-line fitness center with park view\n* Sauna\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Fitness\/yoga studio\n* Bike storage\n* Amazing roof deck with fantastic views\n* Nightly guest suites for the family and friends of current residents\n* Elevator building with 24\/7 front door attendant and concierge desk staff\n* 24\/7 maintenance\n* Laundry room on every floor\n* Larger laundry facility on the 3rd floor\n* Attached valet parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Studio apartment home on 20th floor\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* White kitchen cabinets\n* Granite kitchen countertops\n* Wood floor\n* Large north-facing windows\n* City skyline view\n* All utilities included (except cable and internet)\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 2005 is still listed under the Dali floor plan! Please make an appointment to tour using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com 24\/7. Live virtual tours in Zoom available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 6 month lease term.\n2-22 month lease terms available!\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24,"lat":39.949737,"lng":-75.170538,"attrs":"['0BR \/ 1Ba', '425ft2', 'available nov 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T10:17:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-huge-bed-bath-apartment-in\/7512343718.html","post_id":7512343718,"result_date":"2022-07-23 10:25","title":"Huge 2 bed 1 bath apartment in Upper Darby!!","description":"Sansom St Huge 2 bed 1 bath apartment available in the heart of Upper Darby, PA. Minutes from everything in the city. LED lighting throughout, washer dryer in unit, bay windows throughout. Central Air, Pets Allowed, Main Floor Laundry.  Schedule your showing today. Available September 1st, move in.","num_images":3,"lat":39.9579,"lng":-75.2681,"attrs":"['1BR \/ 1Ba', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T09:51:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-laundry-in-unit-lease\/7512355110.html","post_id":7512355110,"result_date":"2022-07-23 10:25","title":"Laundry in Unit, Lease Today, Convenient Location","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nLooking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Wood-Like Floors\n* Granite Countertops\n* Extra Storage\n* Full sized Washer and Dryer in unit","num_images":18,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T10:21:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-studio-available-near\/7512355033.html","post_id":7512355033,"result_date":"2022-07-23 10:25","title":"Nice Studio available near Upenn","description":"---Nice Studio available near UPENN\/CHOP\/HUP\/USP\n---Located in a very convenient, safe and nice neighborhood in University City.\n---Great for professionals and graduate students.\n---Hardwood floor\n---High ceiling \/ Sunny Room\n---Dishwasher \/ Central AC\n---Front porch with front yard and large backyard.\n---Near public transit (#34 trolley to center city)\n---Enjoy the Farmers market in Clark Park weekly.\n---Spacious backyard with grill, perfect for entertaining\n---Laundry in the basement. Water included.\n---Pets Friendly\n---Available from August 1st (could be earlier).","num_images":21,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'available jul 30', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T10:21:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-now-this-1st\/7512347567.html","post_id":7512347567,"result_date":"2022-07-23 10:06","title":"Available Now! This 1st floor 2-bedroom apartment in Philadelphia.","description":"Available Now! This 1st floor 2-bedroom apartment in Philadelphia. features new flooring throughout the unit and an enclosed patio for additional storage, a sitting area, or home office. Conveniently located near local shopping, entertainment, and transportation. This house is in the good location, it’s close the E Cotati Ave and Snyder Ln, surroundings quite and safety area, the owner and other roommates are very friendly, $640 rental fees including WiFi, Water, Electric, Laundry, Dishes cleaners, and toilet papers. Now the room is available. thanks! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities!. Includes all new appliances w\/washer & dryer. Plenty of storage in a full basement as well as a shed on premises. Beautiful Hardwood floors through, Stainless steel Appliances, Ceramic tile kit & Baths, Vaulted ceiling in foyer, Solar panels, Updated Heat & hot water, 1 car attached Garage with elect opener. Conveniently located close to all public transportation, LIE highway, stores, restaurants, schools, parks, library. FOR MORE INFO::  show contact info","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T10:02:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated-bd-ba\/7512347402.html","post_id":7512347402,"result_date":"2022-07-23 10:05","title":"Completely Renovated 3 Bd 2 Ba Home, Central Air, Private Rear Deck","description":"Completely Renovated 3 Bedroom 2 Bath Home, Central Air, Private Rear Deck, brand new rehab in Elmwood Park\/Kingsessing\nProperty Address\n6345 Kingsessing Ave | Philadelphia, PA 19142\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Stunning renovation in Elmwood Park\/Kingsessing! ⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 2 Bath\n✔️Updated Kitchen w\/ custom designer backsplash\n✔️Master Bedroom has a Private brand new full bath\n✔️Located just minutes to schools, parks, and University City\n✔️All New Appliances\n✔️Hardwood flooring throughout\n✔️Recessed Lighting\n✔️Spacious bedrooms\n✔️Open layout, plenty of closet space.\n✔️Large basement perfect for storage\n✔️Central Air\n✔️Private Rear Deck\n✔️Washer\/Dryer Hookup\n✔️Located just minutes to schools, parks, and University City\n✔️Easy commute to and from the city\n✔️This property won't last long, inquire now!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1330\nRental Terms\nRent: $1700\nApplication Fee: $35\nSecurity Deposit: $3400\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nVirtual Tour: https:\/\/my.matterport.com\/show\/?m=xG8QmjAkkCh\nStunning renovation in Elmwood Park\/Kingsessing! This immaculate home has been completely renovated from top to bottom! Located just minutes to schools, parks, and University City. Brand new renovation! Steps to UPENN, Drexel, USciences, Center City CHOP, and Hospital of the University of Pennsylvania. Home features 3 bedrooms, 2 baths! Central air! Private Rear Deck! Washer\/dryer hookup! Absolutely everything here is brand new!\nFor security purposes, all of our properties are under live video and audio surveillance. All access and showings are recorded and monitored remotely\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,332\nRental Terms\nRent: $1,700.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,400.00\n\nPet Policy\nCats allowed\nDogs not allowed\n#nata\n","num_images":24,"lat":39.928403,"lng":-75.236155,"attrs":"['3BR \/ 2Ba', '1332ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T10:01:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-hardwood-floors\/7512339092.html","post_id":7512339092,"result_date":"2022-07-23 10:05","title":"beautiful hardwood floors, updated kitchen","description":"Massive 1bedroom + den apartment right in the heart of all that Fishtown has to offer. Very large open living space with beautiful hardwood floors, updated kitchen with stainless stel appliances, tons of cabinets and counter space. Tenant responsible for $50 towards buiding water monthly with rent. Easy application process, par application, ID and income verification.\nPets Allowed\nParking available\nHardwoodfloors\nStainless Steel Appliances\n1309 Marlborough St","num_images":4,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:38:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedrooms-bath-apt\/7512344712.html","post_id":7512344712,"result_date":"2022-07-23 09:58","title":"SPACIOUS 2 BEDROOMS & 1 BATH APT W\/BACKYARD LOCATED IN UNIVERSITY CITY","description":"AMAZING VALUE! SPACIOUS 2 BEDROOMS & 1 BATH APARTMENT W\/BACKYARD LOCATED IN UNIVERSITY CITY!\nProperty Address\n613 N 32nd St | Philadelphia, PA 19104\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ BEST VALUE APARTMENT!\n✔️ JUST A MILE AWAY FROM THE ART MUSEUM AT 1\/2 THE PRICE!\n✔️ SPACIOUS 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN UNIVERSITY CITY!\n✔️ 1ST- FLOOR APARTMENT IN A TRIPLEX\n✔️ EAT-IN KITCHEN\n✔️ OPEN KITCHEN\/LIVING ROOM LAYOUT\n✔️ LOTS OF NATURAL LIGHT\n✔️ LAMINATE FLOORING\n✔️ HIGH CEILINGS\n✔️ DESIGNER COLORS\n✔️ SPACIOUS BEDROOMS\n✔️ CEILING FANS\n✔️ CENTRAL AIR\/HEAT\n✔️ SPACIOUS BACKYARD\n✔️ CLOSE COMMUTE TO CENTER CITY\n✔️ CLOSE TO DREXEL, PENN, HUP, CHOP, USP\n✔️ EASY ACCESS TO SEPTA, MAJOR ROUTES I-95,  I-76, I-676\nLink to Virtual Tour:  https:\/\/my.matterport.com\/show\/?m=SdacbFAGf9M\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant is responsible for electric, gas, and water fee\nBuild your credit! We report rent payments to Experian!\n***Please apply online at https:\/\/redblock.com\/apartment\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: Drexel, UPENN, Penn, Powelton, University City, campus, art museum, clean, renovated, hardwood, center city, west Philly, west Philadelphia, redblock realty inc, redblock, red block, center city,2 bedroom, two-bedroom, 2BD, two BD, bedroom, septa, high ceilings, clean, spacious, close to center city, septa, transportation, easy commute\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 950\nRental Terms\nRent: $1,400.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,800.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":13,"lat":39.964772,"lng":-75.188784,"attrs":"['2BR \/ 1Ba', '950ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:54:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-bedroom-bathroom\/7512339717.html","post_id":7512339717,"result_date":"2022-07-23 09:57","title":"##Nice 2 bedroom, 1 bathroom apartment located in Southwest Philadelph","description":"Nice 2 bedroom, 1 bathroom apartment located in the Eastwick area of Southwest Philadelphia. The unit has hardwood floors throughout with the exception of tile flooring in the kitchen and bathroom. Amenities include central AC, large back yard, coin operated laundry and storage area in the basement of the building for tenants use. Available now.\nClose to Penrose Plaza Shopping Center and Suffolk Park. Also, about 10 minutes from the Philadelphia International Airport, 15 minutes from South Philly Sports Stadiums and FDR Park.\nRent is $650 with parking garage\/driveway $650 without.\nTenants responsible for all utilities except cold water\/sewer.\nPlease contact Text or call .. show contact info\n.. for more info and to schedule an appointment to view this apartment.\n","num_images":4,"lat":39.9055,"lng":-75.2444,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:40:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated\/7512343358.html","post_id":7512343358,"result_date":"2022-07-23 09:54","title":"Completely Renovated 3 bedrooms and 2.5 bath home in East Germantown","description":"Completely Renovated 3 bedrooms and 2.5 bath home in East Germantown\nProperty Address\n6128 Lensen Street | Philadelphia, PA 19144\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE HOUSE! ⭐⭐⭐⭐⭐\n✔️Completely Renovated 3 bedrooms and 2.5 bath home\n✔️Spacious living room\n✔️Large dining area\n✔️Updated eat-in kitchen\n✔️Open Concept 1st Floor\n✔️Large Master Suite with private Master Bath\n✔️Contemporary Designs\n✔️Plenty of Natural Light\n✔️Washer\/Dryer Hook Up\n✔️Brand New Central Air\n✔️Large backyard\n✔️Spacious front yard\n✔️Plenty of closet space\n✔️Unfinished basement for storage\n✔️Custom color paint\n✔️Easy access to and from the city\n✔️Easy access to public transportation\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2.5 BA\nSquare Feet: 1528\nRental Terms\nRent: $2000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n\nDetails\nBeds\/Baths: 3BD\/2.5BA\nSquare Feet: 1,528\nRental Terms\nRent: $1,800.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,600.00\n\n#nata\n","num_images":19,"lat":40.047156,"lng":-75.172877,"attrs":"['3BR \/ 2.5Ba', '1528ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:50:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7512332846.html","post_id":7512332846,"result_date":"2022-07-23 09:50","title":"Spacious 1 Bedroom apartment in a landmark building","description":"FREE MONTH SPECIAL FOR APPLICATIONS SUBMITTED BY 6\/30!!! $500 Security Deposit - Limited Time Move In Special!! Spacious 1 Bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block away from Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit in the building.\nCentral Air\nLaundry in Building\nPets Allowed\nParking available\nHardwoodfloors\nGym Available\n1411 Walnut St #1207,","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '684ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:18:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-bedroom-bathroom\/7512339623.html","post_id":7512339623,"result_date":"2022-07-23 09:48","title":"##Nice 2 bedroom, 1 bathroom apartment located in Southwest Philadelph","description":"Nice 2 bedroom, 1 bathroom apartment located in the Eastwick area of Southwest Philadelphia. The unit has hardwood floors throughout with the exception of tile flooring in the kitchen and bathroom. Amenities include central AC, large back yard, coin operated laundry and storage area in the basement of the building for tenants use. Available now.\nClose to Penrose Plaza Shopping Center and Suffolk Park. Also, about 10 minutes from the Philadelphia International Airport, 15 minutes from South Philly Sports Stadiums and FDR Park.\nRent is $650 with parking garage\/driveway $650 without.\nTenants responsible for all utilities except cold water\/sewer.\nPlease contact Text or call .. show contact info\n.. for more info and to schedule an appointment to view this apartment.\n","num_images":4,"lat":39.9055,"lng":-75.2444,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:39:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-totally-renovated-1-house\/7512328722.html","post_id":7512328722,"result_date":"2022-07-23 09:48","title":"Totally-Renovated 2\/1 T-House w\/Granite Counters, W\/D, SS Appliances!!","description":"This 2 bedroom\/1 bath home was totally renovated a few years ago. It is in A-1 shape and ready to go.\nL shaped maple kitchen with butter rum granite counter tops. Recessed lighting. Open air floor plan. Hardwood floors t\/o living and dining rooms.2 bedrooms with plenty of closet space. Wall to wall on 2nd floor. Neutral 2 tone paints. Open front porch. Fenced in rear yard. Full basement for storage. Full appliance package - range, refrig., micro and WASHER\/DRYER included.\nConvenient to South Philadelphia, Point Breeze, Newbold, Grays Ferry, Avenue of the Arts, Graduate Hospital, Queen Village, Bella Vista, Rittenhouse Square, Center City, shopping and public transit.\n$1,195\/mo. Tenant pays all utilities. To schedule a showing, please text or email. Thanks for finding us.\nONLY $1,195\/mo. rent. Tenant pays all utilities. Security deposit and the first mos. rent are required to move. Avail for immediate occupancy. Min. lease of 12 mos. Cats are OK. Small dogs negotiable.\n","num_images":10,"lat":39.929633,"lng":-75.184686,"attrs":"['2BR \/ 1Ba', '840ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:05:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-3br-for-rent\/7512326755.html","post_id":7512326755,"result_date":"2022-07-23 09:44","title":"Charming 3BR for Rent","description":"1621 N 4th St #4 - Premium quality 2 bed 1 bath apt with W\/D, C\/A, private balcony & more! -  Enjoy all the accents of modern luxury at The Courts at North Fourth--located in midst of Northern Liberties\/Olde Kensington\/ Fish town just blocks from Human Robot, Tufas, Ciderworks, and just a block from your morning coffee run at Luna Cafe and soooo much more. Easy access to highways, public transit, and parking. This building includes garage parking and a HUGE roof deck for its tenants. Step inside this unit into an open concept living room\/ kitchen area with hardwood floors, great natural light, tall ceilings, a private balcony & so much more! Discover dazzling quartz counter tops in the kitchen along with a spacious breakfast bar, and a high end appliance package completely dressed in stainless steel. Both bedrooms have spacious & naturally bright personalities, and feature closet space as well as equal access to an exclusive-serene private balcony area. This space is a modern flex & just way too good to pass up!2 bed 1 bath private balcony Hardwood floors\/S appliances Washer and dryer Central air and heat Pet Friendly Roof deck","num_images":12,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-07-23T08:59:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-splendidly-renovated\/7512330022.html","post_id":7512330022,"result_date":"2022-07-23 09:43","title":"This splendidly renovated warehouse in Franklin","description":"FREE MONTH SPECIAL FOR APPLICATIONS SUBMITTED BY 6\/30!!! Just 1st month's rent and $500 security deposit to move-in!!! This splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. The Warehouse is located in a highly walkable area with access to all forms of public transportation. Amenities include secured entry and controlled building access, on-site parking (additional $200\/month), full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit in the building!\nCentral Air\nMain Floor Laundry\nPets Allowed\nParking available\n9 N 9th St #518,","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '718ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:09:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7512339120.html","post_id":7512339120,"result_date":"2022-07-23 09:42","title":"Pets Welcome, Lease Today, Quiet Community","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '789ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:38:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-is-an-amazing-home\/7512327289.html","post_id":7512327289,"result_date":"2022-07-23 09:39","title":"This is an amazing home located on a quiet block","description":"This is an amazing home located on a quiet block in the heart of Northern Liberties, just around the corner from the Piazza and Liberties Walk, and steps away from dozens of neighborhood restaurants including Apricot Stone, El Camino Real, Hikari Sushi and Urban Village Brewing Company. Upon entering you will notice the open and inviting floor plan. The first floor has hardwood flooring, high ceilings , a bathroom, a gas fireplace, and a piano. Light pours through the kitchen from the backyard through a glass door that leads to an outdoor city oasis, including a patio AND grass! The basement has a custom bar and pool table for entertaining. Venturing upstairs to the 2nd floor, you will find a cozy back bedroom and large front bedroom with a renovated bathroom, a front-loading washer and dryer, and large walk-in closet. The 3rd floor features a large home office that could double as an extra bedroom. French doors open into the primary bedroom, which boasts large closet space, hardwood flooring, and a fully renovated bath with dual shower heads. The home is full of character, with custom built-ins and solid wood doors, and has been featured in Design Home, Nest, Apartment Therapy, and Philadelphia Magazine. The home has a nest thermostat and ADT security set up. There is permit parking on the block, neighborhood favorite One Shot Cafe on the corner, and both Heirloom Market and Acme only a block away!\nCentral Air\nLaundry in Building\nParking available\nPets Allowed\nHardwoodfloors\n213 W George St","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2.5Ba', '1963ft2', 'available aug 12', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:00:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-fully-renovated-bd\/7512337927.html","post_id":7512337927,"result_date":"2022-07-23 09:38","title":"LARGE FULLY RENOVATED 2 BD & 1 BA LOCATED IN OAKLANE\/LOGAN AREA!!","description":"⭐⭐⭐ LARGE FULLY RENOVATED 2 BEDROOMS & 1 BATH LOCATED IN OAKLANE\/LOGAN AREA!!!! ⭐⭐⭐\nProperty Address\n4830 N 12th St - 2F | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT!!!!⭐⭐⭐⭐⭐\n✔️HUGE!!! FULLY RENOVATED 2 BEDROOM AND 1 BATH\n✔️BEAUTIFUL NEW KITCHEN WITH ISLAND\n✔️LARGE KITCHEN\/LIVING ROOM AREA!\n✔️NEW FLOORING THROUGHOUT\n✔️TILED KITCHEN\n✔️EVERYTHING IS ELECTRIC\n✔️BRAND NEW STOVE\/FRIDGE\/MICROWAVE\n✔️CABLE READY\n✔️MOVE-IN READY\n✔️LARGE BEDROOMS\n✔️LARGE COMPLETELY RENOVATED CONTEMPORARY BATHROOM\n✔️SHARED FRONT PORCH\n✔️DESIGNER PAINT\n✔️CONVENIENTLY LOCATED\n✔️EASY ACCESS TO SEPTA\n✔️EASY ACCESS TO AND FROM THE CITY\n✔️WILL NOT LAST LONG!!!! INQUIRE TODAY!!!!\nLINK TO VIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=tX7pmFvXWn8\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 1100\nRental Terms\nRent: $1300\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2600\nPet Policy\nCats allowed\nDogs not allowed\nNotic\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nTAGS: 2 bedroom, 2 bd, 1 bath, large apartment, spacious, cozy, Logan, Oak Lane, West Oak Lane, Philly, Philadelphia, Pa, Pennsylvania, house, apartment, septa, Philadelphia County Assistance Office District F Glendale, Logan Library, LOGAN Hope School, Logan Station, Einstein Medical Center Philadelphia Emergency Medicine, Central High School, La Salle University, Widener Memorial School, Fern Rock Transportation Center Station, Community College of Philadelphia - Northwest Regional Center, Eye Institute of Penna College, City Of Philadelphia Office Of Supportive Housing, 19144, 19138, 19126, 19141, 19140, 19120\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 1,100\nRental Terms\nRent: $1,300.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,600.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":10,"lat":40.026118,"lng":-75.143684,"attrs":"['2BR \/ 1Ba', '1100ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:34:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-fully-renovated-bd\/7512336460.html","post_id":7512336460,"result_date":"2022-07-23 09:34","title":"LARGE FULLY RENOVATED 2 BD & 1 BA LOCATED IN OAKLANE\/LOGAN AREA!","description":"⭐⭐⭐ LARGE FULLY RENOVATED 2 BEDROOMS & 1 BATH LOCATED IN OAKLANE\/LOGAN AREA!!!! ⭐⭐⭐\nProperty Address\n4830 N 12th St - 1F | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT!!!!⭐⭐⭐⭐⭐\n✔️HUGE!!! FULLY RENOVATED 2 BEDROOM AND 1 BATH\n✔️LOCATED ON THE 1ST FL, PROVIDING EASY ACCESS\n✔️BEAUTIFUL NEW KITCHEN WITH ISLAND\n✔️LARGE KITCHEN\/LIVING ROOM AREA!\n✔️NEW FLOORING THROUGHOUT\n✔️TILED KITCHEN\n✔️EVERYTHING IS ELECTRIC\n✔️BRAND NEW STOVE\/FRIDGE\/MICROWAVE\n✔️CABLE READY\n✔️MOVE-IN READY\n✔️LARGE BEDROOMS\n✔️LARGE COMPLETELY RENOVATED CONTEMPORARY BATHROOM\n✔️UNFINISHED BASEMENT PERFECT FOR STORAGE\n✔️WASHER\/DRYER HOOKUP\n✔️REAR YARD\n✔️SHARED FRONT PORCH\n✔️DESIGNER PAINT\n✔️CONVENIENTLY LOCATED\n✔️EASY ACCESS TO SEPTA\n✔️EASY ACCESS TO AND FROM THE CITY\n✔️WILL NOT LAST LONG!!!! INQUIRE TODAY!!!!\nLINK TO VIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=THbFKiM2RFR\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 1100\nRental Terms\nRent: $1400\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs not allowed\nNotic\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nTAGS: 2 bedroom, 2 bd, 1 bath, large apartment, spacious, cozy, Logan, Oak Lane, West Oak Lane, Philly, Philadelphia, Pa, Pennsylvania, house, apartment, septa, Philadelphia County Assistance Office District F Glendale, Logan Library, LOGAN Hope School, Logan Station, Einstein Medical Center Philadelphia Emergency Medicine, Central High School, La Salle University, Widener Memorial School, Fern Rock Transportation Center Station, Community College of Philadelphia - Northwest Regional Center, Eye Institute of Penna College, City Of Philadelphia Office Of Supportive Housing, 19144, 19138, 19126, 19141, 19140, 19120\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 1,100\nRental Terms\nRent: $1,400.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,800.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":10,"lat":40.026118,"lng":-75.143684,"attrs":"['2BR \/ 1Ba', '1100ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:30:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7512336224.html","post_id":7512336224,"result_date":"2022-07-23 09:33","title":"Lease Today, Playground, Luxurious Bathrooms","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nSchedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Dry Cleaning and Laundry Service\n* Garage Parking\n* Credit Cards Accepted\n* Landscaped Courtyards\n* Outdoor Grill Area\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Billiards\n* Community Kitchen\n* Easy Freeway Access\n* Extra Storage\n* EV Charging\n* Gaming Area\n* Fitness Studio\n* WiFi Access\n* Bike Racks\n* Controlled Access\n* Non Smoking Community\n* Pet Salon\n* Bark Park\n* Package Acceptance\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Short or Long Term Lease Available\n* Elevator\n* Professionally Managed\n* Swimming Pool\n* Minutes from Restaurants, Shopping, and Much More\n* Renters Insurance is Required\n* After-Hours Emergency Maintenance\n* Sun Deck\n* TV Lounge\n* Playground\n* Movie Theatre\n* Long Term Lease Available\n* Community Lounge","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '833ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:29:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-courtyard-level-at\/7512328636.html","post_id":7512328636,"result_date":"2022-07-23 09:31","title":"1 bedroom courtyard level at Chancery Lane","description":"$500 Security Deposit!!! 1 bedroom courtyard level at Chancery Lane offers loft-style apartment homes with elevator in a gated courtyard setting within historic Old City and boasts a community rooftop deck with panoramic views of the city. Beautiful large loft style 1 bedroom apartment. Pictures are of a similar unit.\nCentral Air\nMain Floor Laundry\nPets Allowed\n130 Arch St #108,","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T09:04:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-modern-2br\/7512335165.html","post_id":7512335165,"result_date":"2022-07-23 09:30","title":"Newly renovated MODERN 2BR in booming Brewerytown!","description":"Newly renovated MODERN 2BR in booming Brewerytown\nProperty Address\n2515 INGERSOLL ST | Philadelphia, PA 19121\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED, 2 BEDROOMS AND 1.5 BATHS HOME!\n✔️ BEST VALUE HOUSE! ⭐⭐⭐⭐⭐\n✔️ SPACIOUS 2 BEDROOMS!!!!\n✔️ AMPLE CLOSET SPACE\n✔️ GENEROUS LIVINGROOM\n✔️ CHARMING EXPOSED BRICK WALL\n✔️ IMMACULATE TRIM AND RECESSED LIGHTING\n✔️ UPDATED KITCHEN WITH GRANITE COUNTERTOPS\n✔️ STAINLESS STEEL APPLIANCES(RANGE, MICROWAVE AND DISHWASHER)\n✔️ FINISHED BASEMENT\n✔️ BASEMENT POWDER ROOM\n✔️ LAUNDRY HOOKUP\n✔️ CENTRAL AIR\n✔️ SMALL REAR BACKYARD\n✔️ MINUTES TO UNIVERSITY CITY, CENTER CITY,AND ALL MAJOR ROADS AND BRIDGES\n✔️ CLOSE TO SEPTA\n✔️ CLOSE TO SHOPPING\n✔️ YOU'LL ABSOLUTELY LOVE IT HERE!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant pays own Electric and Water\n*** Build your credit! We report rent payments to Experian! ***\n***Please apply online at https:\/\/redblock.com\/apartment\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 2BD\/1.5BA\nSquare Feet: 1,200\nRental Terms\nRent: $1,700.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,400.00\n\nPet Policy\nCats allowed\nDogs allowed\n#nata\n","num_images":24,"lat":39.976433,"lng":-75.177151,"attrs":"['2BR \/ 1.5Ba', '1200ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:26:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-steps-away-from\/7512334658.html","post_id":7512334658,"result_date":"2022-07-23 09:28","title":"just steps away from Fairmount Avenue","description":"Located in the heart of the desirable Francisville neighborhood, just steps away from Fairmount Avenue, Ridge Avenue, the Art Museum, Kelly Drive, and so much more. You will absolutely love this quiet and serene block. As you walk in you are greeted by a spacious living room with oak flooring area right off of the contemporary kitchen with stainless steel appliances and generous sized quartz countertops. Walk out of your kitchen to enjoy these warm summer months entertaining in your private rear yard with pressure treated fencing and a newly poured cement patio. Going up to the second floor you will find two large bedrooms with high hat lighting, large windows, and roomy closets. For convenience your washer and dryer is also located on this floor with a full bathroom. The top floor master suit is laid out perfectly with tons of closet space, a large master bedroom, and a gorgeous master bath with Delta shower fixtures, Fresca double vanity, and imported tile. The best is left for last. Private roof deck overlooking the city skyline.\nCentral Air\nLaundry in Building\nParking available\nStainless Steel Appliances\n1719 Erdman St,","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2.5Ba', '1336ft2', 'available sep 1', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:24:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-modern-3br\/7512332889.html","post_id":7512332889,"result_date":"2022-07-23 09:23","title":"Newly Renovated MODERN 3BR in booming Brewerytown","description":"Newly Renovated MODERN 3BR in booming Brewerytown\nProperty Address\n2312 W Thompson Street | Philadelphia, PA 19121\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ NEW! BEST VALUE APARTMENT! ⭐⭐⭐\n✔️ NEW! SPACIOUS 3 BEDROOMS AND 2 BATHS HOME IN BREWERYTOWN\n✔️ NEW! GRANITE COUNTERTOP KITCHEN\n✔️ NEW! CUSTOM BACKSPLASH AND FLOOR TILES\n✔️ NEW! MODERN PARQUET FLOORING\n✔️ NEW! DESIGNER PAINTER COLORS\n✔️ NEW! CUSTOM TILED BATHROOM W\/ ALL-NEW VANITIES\n✔️ NEW! CENTRAL AIR\n✔️ WASHER\/DRYER HOOKUP\n✔️ BACKYARD\n✔️ FINISHED BASEMENT\n✔️ ALL ELECTRIC\n✔️ CLOSE TO PUBLIC TRANSPORTATION!\n✔️ EASY ACCESS TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO AND FROM THE CITY!\n✔️ APPLY TODAY!!!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- Tenant pays all own utilities\n*** Build your credit! We report rent payments to Experian! ***\n*** Please apply online at https:\/\/redblock.com ***\nVIRTUAL TOUR:  https:\/\/my.matterport.com\/show\/?m=SFUoEj4haDk\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,200\nRental Terms\nRent: $1,700.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,400.00\n\n#nata\n","num_images":21,"lat":39.97512,"lng":-75.173886,"attrs":"['3BR \/ 2Ba', '1200ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:19:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-right-in-the-heart-of\/7512319911.html","post_id":7512319911,"result_date":"2022-07-23 09:17","title":"Right in the heart of Center City Philadelphia","description":"Right in the heart of Center City Philadelphia, you will find this furnished GEM! This cozy, fresh and fly furnished apartment has everything you could possibly need - all you need is a suitcase and some groceries!!! On the first floor you'll find the cozy comforts of home with tastefully done artwork and touches all throughout. All the appliances are sized to be used and enjoyed (read: no dorm room sized refrigerator, for instance) and although a laundromat is a couple blocks away, you won't need to round up quarters because the dual washer\/dryer will handle that! The first floor also boosts a little outside nook for when you need to get air without sitting on a stoop and to grow your fresh herbs or whatever you prefer! A snazzy spiral staircase takes you up to the second floor where your queen sized bed, flat screen TV and nicely updated bathroom await you. Don't want to take the spiral route? For those long days when you just need to crash, you can bypass that and take the staircase in the foyer right to your second floor door. It could not be more convenient! As for the location? Groceries, restaurants, entertainment, transportation.... just EVERYTHING is right outside the door! Here you can have the best of both worlds; a beautiful, cozy, quiet furnished home on the inside and a city rich in culture and diversity with convenience galore on the outside. Win, win!\nCentral Air\nMain Floor Laundry\nParking available\nPets Allowed\n335 S 12th St #1B","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '448ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:32:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7512330285.html","post_id":7512330285,"result_date":"2022-07-23 09:14","title":"SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN OGONTZ!","description":"SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN OGONTZ!\nProperty Address\n1526 W Grange Ave | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED, 1 BEDROOM & 1 BATH APARTMENT LOCATED IN OGONTZ!\n✔️ OPEN LAYOUT\n✔️ SPACIOUS KITCHEN\n✔️ SPACIOUS BEDROOM\n✔️ LAMINATE FLOORING\n✔️ LARGE CLOSETS\n✔️ LOTS OF NATURAL LIGHT\n✔️ ALL-ELECTRIC\n✔️ CUSTOM BATHROOM TILES\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nVirtual tour\nhttps:\/\/my.matterport.com\/show\/?m=pyB5PLfGNLG\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- The tenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\n***Please apply online at https:\/\/redblock.com\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\ntags: redblock realty, red block, septa, 1BD, 1 bedroom, La salle University, Ogontz, Mount airy, Logan, Germantown, Olney, brand new, route 309, spacious, cozy, nice, buses, schools, Philadelphia, broad st, Kembel park, Albert Einstein Medical Center, Pennsylvania College of Optometry, SEPTA, commuter, Fern rock, Gratz College, 19144, 19141, 19138, 19126, 19120\n\nAmenities\n1BR\n1BA\n1 bedroom\n1 bath\nStove\nrefrigerator\nmicrowave\nCable ready\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 700\nRental Terms\nRent: $900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,800.00\n\n#nata\n","num_images":7,"lat":40.041456,"lng":-75.146421,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:10:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7512329234.html","post_id":7512329234,"result_date":"2022-07-23 09:11","title":"Spacious 2 Bedroom apartment located close to La Salle University!","description":"Spacious 2 Bedroom apartment located close to La Salle University!\nProperty Address\n1434 West Grange Ave - 2F | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED, 2 BEDROOM & 1 BATH APARTMENT LOCATED IN OLNEY!\n✔️ CLOSE TO LASALLE UNIVERSITY\n✔️ OPEN LAYOUT\n✔️ SPACIOUS KITCHEN\n✔️ SPACIOUS BEDROOM\n✔️ LAMINATE FLOORING\n✔️ LARGE CLOSETS\n✔️ LOTS OF NATURAL LIGHT\n✔️ ALL-ELECTRIC\n✔️ CUSTOM BATHROOM TILES\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nVirtual tour\nhttps:\/\/my.matterport.com\/show\/?m=TFXBcH5qeyc\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- The tenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\n***Please apply online at https:\/\/redblock.com\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\ntags: red block realty, red block, septa, 2BD, 2 bedrooms, La Salle University, Ogontz, mount airy, logan, Germantown, Olney, brand new, route 309, spacious, cozy, nice, buses, schools, Philadelphia, broad st, Kembel park, Albert Einstein Medical Center, Pennsylvania College of Optometry,SEPTA, commuter, Fern rock, Gratz College\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 800\nRental Terms\nRent: $1,100.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,200.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":9,"lat":40.04127,"lng":-75.145067,"attrs":"['2BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:07:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bd-15-ba\/7512327994.html","post_id":7512327994,"result_date":"2022-07-23 09:06","title":"NEWLY RENOVATED 2 BD & 1.5 BA\/MINUTES AWAY FROM TEMPLE UNIVERSITY!","description":"NEWLY RENOVATED 2 BEDROOM AND 1.5 BATHS LOCATED MINUTES AWAY FROM TEMPLE UNIVERSITY!!!\nProperty Address\n1138 W Nevada Street | Philadelphia, PA 19133\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED, 2 BEDROOMS AND 1.5 BATHS HOME!\n✔️ BEST VALUE HOUSE! ⭐⭐⭐⭐⭐\n✔️ SPACIOUS 2 BEDROOMS!!!!\n✔️ GENEROUS LIVINGROOM\n✔️ 1 ST FL POWDER ROOM\n✔️ LAUNDRY HOOKUP\n✔️ 2 BEDROOMS UPSTAIRS AND A FULL SIZES BATH\n✔️ SPACIOUS BACKYARD\n✔️ SHORT WALK TO TEMPLE UNIVERSITY\n✔️ CLOSE TO SEPTA\n✔️ CLOSE TO SHOPPING\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant pays own Electric and Water\n*** Build your credit! We report rent payments to Experian! ***\n***Please apply online at https:\/\/redblock.com\/apartment\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\ntags: TEMPLE UNIVERSITY, 2BR, 2 bedrooms, Penrose Recreation Center, Philadelphia Military Academy, Edberg-Olson Football Complex, Tyler School of Art and Architecture, Temple University College of Engineering, Temple University Science Education and Research Center, The Fresh Grocer of Progress Plaza, Sullivan Progress Plaza Shopping Center, Achieving Independence Center, Tyler School of Art and Architecture, University train station, 19123, 19130, 19122, 19121, 19125, 19102\n\nDetails\nBeds\/Baths: 2BD\/1.5BA\nSquare Feet: 950\nRental Terms\nRent: $950.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,900.00\n\nPet Policy\nCats allowed\nSmall dogs allowed\n#nata\n","num_images":10,"lat":39.986735,"lng":-75.151291,"attrs":"['2BR \/ 1.5Ba', '950ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T09:02:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-full-baths-washer-dryers\/7512319220.html","post_id":7512319220,"result_date":"2022-07-23 09:05","title":"2 full baths, 2 washer-dryers","description":"Split two bedroom two bath, perfect for a roommate situation, or possibly a home office. One bedroom attached to an adjacent studio. 2 full baths, 2 washer-dryers. Main one bedroom has an open kitchen, and all windows have an amazing city view. Best of all one parking space is included. Available 10\/5\/2022. If interested, listing agent will prepare lease\nCentral Air\nMain Floor Laundry\nParking available\n2001 Hamilton St #1704","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '1074ft2', 'available oct 5', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T08:29:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-size-one-bedroom-one\/7512321334.html","post_id":7512321334,"result_date":"2022-07-23 09:03","title":"Nice size one bedroom one bath Unit flat","description":"Nice size one bedroom one bath Unit flat in the heart of Chinatown. With all the comforts of home at your fingertips. Newer dishwasher, washer and dryer in the unit. Basement storage convenient for bicycle storage and much more. Welcoming Lobby with a concierge makes this an awesome place to live. Walking distance to the Convention Center, Reading Terminal Market and other iconic Phila areas. Close to Rt 676that will take you to the airport and shore.\nCentral Air\nParking available\nMain Floor Laundry\n1010 Race St #2K","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '706ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:38:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-live-at-park-towne-place\/7512316500.html","post_id":7512316500,"result_date":"2022-07-23 08:58","title":"Live at Park Towne Place Apartment Homes","description":"Live at Park Towne Place Apartment Homes in Center City Philadelphia, and you'll be blocks from the center of nightlife in Logan Square and Rittenhouse Square. Unit features modern kitchens, quartz countertops, stainless steel appliances, in-unit washers and dryers, breakfast bars, pendant lighting, tile backsplashes, wood plank flooring throughout, walk-in closets. Stunning city and museum views are offered in a variety of floor plans! Mainstreet Market and Caf , featuring gourmet coffee and tea and much more! Fitness center with Technogym equipment, Queenax boxing gym, yoga\/spin studio with indoor\/outdoor workout space. It boasts Philadelphia's largest pools, an art studio, fitness center with boxing gym, yoga\/spin studio, social lounge with demonstration kitchen, gourmet market and cafe, outdoor lounge with fire pit, 24-hour concierge, 24\/7 package acceptance, resident shuttle service to Center City and University City and more. Make Whole Foods as your second kitchen conveniently located just 1 block away. Our apartments are within one mile of several institutions of higher education: Drexel University, Temple University, University of Penn, CHOP, Moore college of Arts, Community College of Philadelphia. You won't find a better building to live with amenities in the Fairmount Area. Park Towne Place includes 948 apartment and penthouse homes within four high-rise towers. The community is nestled between green acres on the Benjamin Franklin Parkway in the heart of Center City Philadelphia's Museum District. Park Town. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\nCentral Air\nMain Floor Laundry\nParking available\nPets Allowed\nStainless Steel Appliances\n2200 Benjamin Franklin Pkwy #0B-N0201","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['0BR \/ 1Ba', '425ft2', 'available oct 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:17:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautiful-2nd-and-3rd\/7512325274.html","post_id":7512325274,"result_date":"2022-07-23 08:57","title":"This beautiful 2nd and 3rd floor unit","description":"Welcome to 1932 Christian St. This beautiful 2nd and 3rd floor unit is in the perfect location for your new home! Through the main vestibule you'll enter your unit on the main floor where you'll have access to a fully unfinished basement offering a load of storage space and your washer\/dryer. Up on the main floor you have an open floor plan with your eat-in kitchen and living space. Large windows let in a ton of natural light and high ceilings make this space feel twice it's size. Off the hallway you have your first full bathroom as well as a large main floor bedroom with double closets. Venturing up to the second floor you have another large bedroom with access to the HUGE back deck where you can spend summer nights entertaining friends and grilling! On the other end of the hall you have another bedroom and full bathroom. This apartment is one of a kind in a great location in Graduate Hospital with 94 Walkscore and 92 bike score you'll have everything you need at your fingertips! This unit won't last so schedule your tour today!\nCentral Air\nLaundry in Building\nParking available\nPets Allowed\n1932 Christian St #B","num_images":4,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '2000ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:53:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-hardwood-floors\/7512314521.html","post_id":7512314521,"result_date":"2022-07-23 08:52","title":"beautiful hardwood floors, updated kitchen","description":"Massive 1bedroom + den apartment right in the heart of all that Fishtown has to offer. Very large open living space with beautiful hardwood floors, updated kitchen with stainless stel appliances, tons of cabinets and counter space. Tenant responsible for $50 towards buiding water monthly with rent. Easy application process, par application, ID and income verification.\nPets Allowed\nParking available\nHardwoodfloors\nStainless Steel Appliances\n1309 Marlborough St","num_images":4,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:08:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-of-the-best-values-in\/7512315114.html","post_id":7512315114,"result_date":"2022-07-23 08:52","title":"One of the best values in Center City.","description":"$500 Security Deposit!!! 1600 Walnut is surrounded by the performing arts and numerous other cultural venues. One of the best values in Center City. Secure entry, Gym, Bike room! Bright and sunny units with hardwood floors, large windows, marble baths and open layouts with great closet space. Known for its popular restaurants and nightlife spots, Just steps away from some of Philadelphia's best culinary experiences Midtown Philadelphia is a fun and exciting place to live. Pictures are of a similar unit.\nLaundry in Building\nHardwoodfloors\nGym Available\nPets Allowed\n1600 Walnut St #601","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '550ft2', 'available aug 20', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T08:11:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-constructed-apartment\/7512320255.html","post_id":7512320255,"result_date":"2022-07-23 08:52","title":"New constructed apartment building.","description":"New constructed apartment building. Unit 7 with 2B2B. One month FREE with 24 months lease, mini 12 months lease. Open kitchen with all new appliances, washer and dryer in unit. Balcony along the living room. Aurdal style closets with specious spaces bedroom. Water fee $60\/month. Ask for video if you need.\nCentral Air\nMain Floor Laundry\nParking available\nPets Allowed\n700 N Marshall St #7,","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:34:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-townhome-bedrooms-35\/7512319624.html","post_id":7512319624,"result_date":"2022-07-23 08:51","title":"This townhome 3 bedrooms 3.5 baths","description":"Amazing NEW CONSTRUCTION rental with all the bells and whistles in the HOT HOT 19122 area. This townhome features: 3 bedrooms 3.5 baths plus an additional spacious finished basement which is fantastic for an office area. One car garage with storage, TWO decks: 1 on the main level \/kitchen area and the other a full roof deck. Luxurious amenities abound in this beautiful open floor plan which includes: hardwood floors throughout, iron railings, and huge windows with great City views from the upper floors and from the full roof deck. The kitchen has quartz countertops, built in shelving, stainless steel appliances and an abundance of designer cabinets. Half bath off the kitchen with a balcony perfect for grilling in the summer! Two bedrooms and two more baths on the next level, space and privacy for everyone in the house! Master bedroom comes with beautiful built-ins, incredible views and plenty of sunlight. Master bath with glass encased shower with slate tile and double vanity. Washer and dryer included on the upper level. Basement currently used as a gym or could be the perfect bonus space for your needs! Walking distance to amazing restaurants : Wm. Mulherin's Sons, Hiroki, NuNu, Suraya and Frankford Hall to name a few. One of the few rentals in Fishtown\/Kensington area with private parking and a 5 min. walk to Girard station and The EL . $500 non refundable pet deposit $75 flat fee for water APPLICATION PROCESS: 1. submit PAR application (we will send upon request) 2. Pending Approval of PAR; submit Rent Spree application w\/ pay stubs (see clickable link in lease details)\nCentral Air\nStainless Steel Appliances\nParking available\nHardwoodfloors\n1411 N Howard St,","num_images":4,"lat":39.978,"lng":-75.1459,"attrs":"['3BR \/ 3.5Ba', '1069ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T08:31:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-looking-for-luxury-corner\/7512320803.html","post_id":7512320803,"result_date":"2022-07-23 08:50","title":"Looking for a luxury corner condo with parking","description":"Looking for a luxury corner condo with parking - Look no further! Introducing 501 Vine, a spacious flat located in a boutique designer condo building in Old City. This 1bd + room converted to second bedroom\/office)\/1ba unit features a spaciously functional 942 SF open concept with urban chic charms such as exposed ductwork, plus modern conveniences like central air, recessed micro lighting, hardwood floors, tons of windows and natural light, and high ceilings throughout. The gourmet kitchen is the centerpiece of the unit, with matching stainless steel appliances, central island, pendant lighting, contemporary cabinetry, and quartz counters. Washer and Dryer, Wine bar, and plenty of storage! Have an electric car? There is a charging station for you to use free of charge. Access to I-95 and I-76 make this a commuter-friendly property. Easy access to downtown Philadelphia and fun surrounding neighborhoods like Northern Liberties, Delaware River Waterfront and Spring Arts, plus it's just a short walk to the many galleries, bars + restaurants, cafes and shops in Old City proper.\nCentral Air\nMain Floor Laundry\nParking available\nStainless Steel Appliances\nHardwoodfloors\n501-7 Vine St #3,","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '942ft2', 'available sep 1', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:36:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath-unit\/7512316015.html","post_id":7512316015,"result_date":"2022-07-23 08:47","title":"Spacious 2 bedroom \/ 2 bath unit","description":"Spacious 2 bedroom \/ 2 bath unit at the pet-friendly Metro Club with a washer\/dryer in unit and 1 secured gated parking spot included. Great natural lighting, expansive windows, open layout, modern stainless steel appliances, beautiful hardwood floors, pendant lights above the breakfast bar. Closet galore, double bathroom sinks! Metro Club in an elevator high-rise with a heated outdoor pool, Boutique hotel-style lobby, fireplace, and lounge seating. Secured entry and controlled building access with a full gym. Easy access to Market East SEPTA station and SEPTA bus routes and many area local attractions including Reading Terminal Market, Maggiano's Italy, The Melting Pot etc. Pictures are of a similar unit!\nCentral Air\nMain Floor Laundry\nParking available\nPets Allowed\nStainless Steel Appliances\nHardwoodfloors\n201 N 8th St #902,","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1193ft2', 'available aug 26', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:15:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-huge-bed-bath-apartment\/7512322002.html","post_id":7512322002,"result_date":"2022-07-23 08:45","title":"Huge 2 bed 1 bath apartment available","description":"Huge 2 bed 1 bath apartment available in the heart of Queen Village. Minutes from everything in the city. LED lighting throughout, washer dryer in unit, bay windows throughout. Schedule your showing today. Available September 1st, move in.\nCentral Air\nPets Allowed\nMain Floor Laundry\n761 S 3rd St #2,\n","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available sep 1', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T08:41:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-apartment-has-been\/7512318868.html","post_id":7512318868,"result_date":"2022-07-23 08:39","title":"This apartment has been recently renovated","description":"Welcome to 334 Queen Street #F. This apartment has been recently renovated from top to bottom! As you enter your home you will be greeted by the spacious and sunny living room with a beautiful view of Queen Street. Right off your living room is a perfectly appointed kitchen featuring stainless steel appliances, white cabinets, and designer flooring and backsplash. Down the hall you will find your updated bathroom with an oversized shower with a rain shower head, floor to ceiling tile walls, LED mirror and your in unit washer\/dryer combo! Lastly, you will love the cozy bedroom with HUGE closet. If all that wasn't enough, enjoy easy access to major highways and some of the best restaurants and parks the City has to offer!\nCentral Air\nMain Floor Laundry\nParking available\nStainless Steel Appliances\n334 Queen St #F,","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '614ft2', 'available sep 5', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:28:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-is-an-amazing-home\/7512313063.html","post_id":7512313063,"result_date":"2022-07-23 08:35","title":"This is an amazing home located on a quiet block","description":"This is an amazing home located on a quiet block in the heart of Northern Liberties, just around the corner from the Piazza and Liberties Walk, and steps away from dozens of neighborhood restaurants including Apricot Stone, El Camino Real, Hikari Sushi and Urban Village Brewing Company. Upon entering you will notice the open and inviting floor plan. The first floor has hardwood flooring, high ceilings , a bathroom, a gas fireplace, and a piano. Light pours through the kitchen from the backyard through a glass door that leads to an outdoor city oasis, including a patio AND grass! The basement has a custom bar and pool table for entertaining. Venturing upstairs to the 2nd floor, you will find a cozy back bedroom and large front bedroom with a renovated bathroom, a front-loading washer and dryer, and large walk-in closet. The 3rd floor features a large home office that could double as an extra bedroom. French doors open into the primary bedroom, which boasts large closet space, hardwood flooring, and a fully renovated bath with dual shower heads. The home is full of character, with custom built-ins and solid wood doors, and has been featured in Design Home, Nest, Apartment Therapy, and Philadelphia Magazine. The home has a nest thermostat and ADT security set up. There is permit parking on the block, neighborhood favorite One Shot Cafe on the corner, and both Heirloom Market and Acme only a block away!\nCentral Air\nLaundry in Building\nParking available\nPets Allowed\nHardwoodfloors\n213 W George St","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2.5Ba', '1961ft2', 'available aug 12', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:00:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-courtyard-level-at\/7512313372.html","post_id":7512313372,"result_date":"2022-07-23 08:34","title":"1 bedroom courtyard level at Chancery Lane","description":"$500 Security Deposit!!! 1 bedroom courtyard level at Chancery Lane offers loft-style apartment homes with elevator in a gated courtyard setting within historic Old City and boasts a community rooftop deck with panoramic views of the city. Beautiful large loft style 1 bedroom apartment. Pictures are of a similar unit.\nCentral Air\nMain Floor Laundry\nPets Allowed\n130 Arch St #108,","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T08:01:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7512315689.html","post_id":7512315689,"result_date":"2022-07-23 08:33","title":"Spacious 1 Bedroom apartment in a landmark building","description":"FREE MONTH SPECIAL FOR APPLICATIONS SUBMITTED BY 6\/30!!! $500 Security Deposit and 1st Month's Rent to move-in!! Spacious 1 Bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block away from Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit.\nCentral Air\nLaundry in Building\nHardwoodfloors\nPets Allowed\nGym Available\n1411 Walnut St #208","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '472ft2', 'available aug 3', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:13:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7512313995.html","post_id":7512313995,"result_date":"2022-07-23 08:32","title":"Spacious 1 Bedroom apartment in a landmark building","description":"FREE MONTH SPECIAL FOR APPLICATIONS SUBMITTED BY 6\/30!!! $500 Security Deposit - Limited Time Move In Special!! Spacious 1 Bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block away from Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit in the building.\nCentral Air\nLaundry in Building\nPets Allowed\nParking available\nHardwoodfloors\nGym Available\n1411 Walnut St #1207,","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '684ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:05:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-philadelphia-pa\/7512312352.html","post_id":7512312352,"result_date":"2022-07-23 08:26","title":"Amazing Philadelphia, PA house for rent","description":"Then imagine that is has every single feature thoughtfully planned out that is on your list! Welcome to 700 Caledonia Street! This semi-custom home features an amazing open floor plan that is ideal for todays lifestyle. Love to entertain? The stunning first floor features a huge living space with tall ceilings and a fireplace that flows directly to a 30 x 20 outdoor deck space! Love to cook? You will be wowed by this chef inspired kitchen which features gorgeous white upgraded cabinetry with transom glass, quartzite counter-tops and backsplash, top of the line appliances including a gas GE double oven with a pot filler, Thor range cook top, exhaust and wine cooler as well as a Samsung smart refrigerator. Enter the second floor via a stunning stair case to 3 large bedrooms and perfectly placed laundry room. The large primary suite features a beautifully appointed bathroom with a double vanity with quartzite countertops, a walk in shower, curved tub and a massive Hollywood style closet that will dazzle you! The second and third bedrooms are a generous size and feature great closet space and share a gorgeous hall bathroom.\nCall for more information___ show contact info","num_images":3,"lat":39.9362,"lng":-75.1563,"attrs":"['4BR \/ 4Ba', '3599ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T07:56:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-room-for-rent-in-brand-new\/7512312152.html","post_id":7512312152,"result_date":"2022-07-23 08:24","title":"Room for Rent in Brand NEW Town house w\/ amazing sunset","description":"Hello! I am looking for a 20 something to share my beautiful brand new 3 bedroom townhouse located in Dublin Crossing. An end unit, outdoor deck with an amazing sunset, garage spot, laundry in unit, whole house will be furnished besides for bedrooms, and so much more. Utilities not included in this price. You will not only have access to a room, but the whole house. I am looking for someone respectful, clean, and responsible. I work a 9-5 job and travel frequently so a lot of the time you will have the entire house to yourself. call at- show contact info","num_images":3,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 4Ba', '2088ft2', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T07:55:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-terrific-4br-family-home\/7512312731.html","post_id":7512312731,"result_date":"2022-07-23 08:20","title":"Terrific 4BR Family Home","description":"BRAND-NEW wall to wall carpeting JUST installed, last 8 pics show new carpeting!! Move right in to this charming 4 bedroom cape style house in Croydon! Spend the evenings relaxing on the covered porch on a very quiet street. Large driveway with plenty of parking. Upstairs has been remodeled in to a master suite with full master bathroom. Large dining room with crown molding and open concept kitchen area with recessed lighting, oak cabinetry and beautiful center kitchen island. Full bath on main floor with laundry area. New windows and shed in the huge backyard. Low taxes, close to State Park, NJ, I-95 and PA Turnpike. CALL NOW FOR MORE INFO- show contact info","num_images":3,"lat":39.9362,"lng":-75.1563,"attrs":"['4BR \/ 2Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T07:58:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-splendidly-renovated\/7512313695.html","post_id":7512313695,"result_date":"2022-07-23 08:18","title":"This splendidly renovated warehouse in Franklin","description":"FREE MONTH SPECIAL FOR APPLICATIONS SUBMITTED BY 6\/30!!! Just 1st month's rent and $500 security deposit to move-in!!! This splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. The Warehouse is located in a highly walkable area with access to all forms of public transportation. Amenities include secured entry and controlled building access, on-site parking (additional $200\/month), full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit in the building!\nCentral Air\nMain Floor Laundry\nPets Allowed\nParking available\n9 N 9th St #518,","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '718ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:03:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-junior-one-bedroom-with\/7512314804.html","post_id":7512314804,"result_date":"2022-07-23 08:13","title":"Junior one bedroom with parquet wood floors","description":"Junior one bedroom with parquet wood floors throughout, magnificent city views from oversized windows in all rooms providing excellent natural light, as well as a balcony accessible from the living room. Residents of The Dorchester enjoy a 24-hour doorman, fitness center, all utilities, and basic cable for TV. There is a garage and rooftop pool available for additional fees.\nCentral Air\nGym Available\n224 W Rittenhouse Sq #1008","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '611ft2', 'available aug 17', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T08:09:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-steps-away-from\/7512314218.html","post_id":7512314218,"result_date":"2022-07-23 08:10","title":"just steps away from Fairmount Avenue","description":"Located in the heart of the desirable Francisville neighborhood, just steps away from Fairmount Avenue, Ridge Avenue, the Art Museum, Kelly Drive, and so much more. You will absolutely love this quiet and serene block. As you walk in you are greeted by a spacious living room with oak flooring area right off of the contemporary kitchen with stainless steel appliances and generous sized quartz countertops. Walk out of your kitchen to enjoy these warm summer months entertaining in your private rear yard with pressure treated fencing and a newly poured cement patio. Going up to the second floor you will find two large bedrooms with high hat lighting, large windows, and roomy closets. For convenience your washer and dryer is also located on this floor with a full bathroom. The top floor master suit is laid out perfectly with tons of closet space, a large master bedroom, and a gorgeous master bath with Delta shower fixtures, Fresca double vanity, and imported tile. The best is left for last. Private roof deck overlooking the city skyline.\nCentral Air\nLaundry in Building\nParking available\nStainless Steel Appliances\n1719 Erdman St,","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2.5Ba', '1366ft2', 'available sep 1', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T08:06:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sought-after-bi-level\/7512308262.html","post_id":7512308262,"result_date":"2022-07-23 08:09","title":"Sought-after bi-level 1 bedroom residence in historic Biddle Hall","description":"Sought-after bi-level 1 bedroom residence in historic Biddle Hall, Naval Square's iconic, architecturally significant 18th-century centerpiece. Enjoy a large private terrace overlooking lush parade grounds, vaulted ceilings and imposing skylights allowing for exceptional natural light. Large kitchen features shaker-style cabinets, sleek granite counters & GE stainless appliance suite. Living\/ dining area opens to the serene terrace, perfect for relaxing or entertaining. Just upstairs you will find a private, sunlit owners suite featuring an oversized bathroom with dual vanities, granite counters, soaking tub and separate stall shower. Washer\/ dryer is also located on this level. Deeded parking space #28 is only steps away from the home & separate storage locker included within the building. Enjoy the ease of having the seasonal pool & state-of-the-art fitness center only minutes from your home and the concierge close by. The dramatic community room in Biddle Hall rotunda is perfect to reserve for private parties. Enjoy the outdoor amenities of the 20-acre park-like setting: including picnic areas, well-kept gardens & mature landscaping. 24-hour secure, gated community. Very close proximity to South Street Bridge, UPenn, CHOP, HUP & Drexel, Rittenhouse & Fitler Sq's! Exciting restaurants, shops and cafes, including the brand new Heirloom Market by Giant are all just steps outside the gates. Directly out the back gate you can enjoy the Schuylkill River Park, including the Award Winning Trail & Boardwalk, Markward playground, tennis courts & dog park","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T07:31:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautiful-2nd-and-3rd\/7512312783.html","post_id":7512312783,"result_date":"2022-07-23 08:03","title":"This beautiful 2nd and 3rd floor unit","description":"Welcome to 1932 Christian St. This beautiful 2nd and 3rd floor unit is in the perfect location for your new home! Through the main vestibule you'll enter your unit on the main floor where you'll have access to a fully unfinished basement offering a load of storage space and your washer\/dryer. Up on the main floor you have an open floor plan with your eat-in kitchen and living space. Large windows let in a ton of natural light and high ceilings make this space feel twice it's size. Off the hallway you have your first full bathroom as well as a large main floor bedroom with double closets. Venturing up to the second floor you have another large bedroom with access to the HUGE back deck where you can spend summer nights entertaining friends and grilling! On the other end of the hall you have another bedroom and full bathroom. This apartment is one of a kind in a great location in Graduate Hospital with 94 Walkscore and 92 bike score you'll have everything you need at your fingertips! This unit won't last so schedule your tour today!\nCentral Air\nLaundry in Building\nParking available\nPets Allowed\n1932 Christian St #B","num_images":4,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '2000ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T07:59:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-port-richmond\/7512309633.html","post_id":7512309633,"result_date":"2022-07-23 07:43","title":"Beautiful Port Richmond New Construction for Rent!","description":"Port Richmond New Construction (with EXTRAS!) available early September: $2,650\/month, 12+ month lease only. Welcome to 2070 E Rush St! This stunning 3 bedroom \/ 3 bathroom features hardwood floors, recessed and custom lighting, finished basement, modern finishes, backyard AND two roof decks, and so much more! You enter into a lovely entryway with hardwood floors and natural light pouring in from the front window. Living\/dining room areas have built in Bluetooth speakers installed. Smart Yale lock and smart thermostat panel. Continue back to the sleek kitchen offering white shaker cabinets, tile backsplash, and stainless steel appliances including a double-door fridge, gas oven\/stove, built-in overhead microwave, and a dishwasher. There is a small backyard off of the kitchen - WITH 4 BURNER PERFORMANCE CHAR-BROIL GRILL INCLUDED FOR DURATION OF RENTAL! Head downstairs to the finished basement to find your spacious living area, a FULL bathroom for your convenience, grass accent wall (removable) and mounted 65 INCH 4K QUANTUM TV AND ELECTRIC FIREPLACE WITH AMBIENT LIGHTING INCLUDED FOR DURATION OF RENTAL! Currently set up as guest suite, would also make a perfect office, playroom or home gym area.  Upstairs, the second level features 2 sizable bedrooms with windows and closet space, as well as a full bathroom boasting gorgeous tile, shower\/tub combo, and a vanity with additional storage underneath. The second level also has a laundry room with stacked Electrolux washer and dryer. The third floor is home to the master bedroom with tasteful baroque accent wall, mounted 4K 55 INCH LG TV FIRESTICK INCLUDED FIR DURATION OF RENTAL!!! Room also showcases a large, wall-to-ceiling window, double walk-in closets, tray ceiling ambient lighting, built in Bluetooth system (master and bath) and a giant master bathroom with double sinks\/vanities, and a walk-in shower with dual shower heads and a sliding glass door. Third floor also features wet bar with beverage fridge. This incredible home also features TWO roof decks with BLUETOOTH speakers - enjoy both sunset and city views in GORGEOUS ROYAL BLUE SECTIONAL, OUTDOOR RUG AND MATCHING UMBRELLA FOR SUNNY DAYS AND GAS FIRE PIT FOR THOSE CHILLY FALL NIGHTS INCLUDED FOR DURATION OF RENTAL! Property currently occupied and at least 24 hour notice required for showings available 9am-3pm! About the Neighborhood: This rental lies in the Port Richmond\/ North of Lehigh neighborhood of Philadelphia. Walking distance to public transportation via the MFL and the Frankford Avenue Garden. You'll be near local favorite spots like Fishtown Crossing, Tacconelli's Pizza and Hinge Cafe, Hello Donuts + Coffee, Franny Lou's Porch, Martha, Philadelphia Brewing, Circles and Squares, the Memphis Taproom, and more! Close proximity to Fishtown offering more local entertainment, dining, and nightlife. Proximity to I-95 and enjoy driving to New Jersey, Center City and other areas within fifteen minutes! Street parking available. Lease Terms: Generally, first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord. $55 application fee per applicant. Pets are conditional on owner's approval and may require an additional fee, if accepted. Tenants responsible for: electricity, gas, cable\/internet, water, renter’s insurance and trash\/snow removal.","num_images":22,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 3Ba', 'available sep 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T07:39:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-updated-unit-and\/7512304631.html","post_id":7512304631,"result_date":"2022-07-23 07:43","title":"Fully updated unit and great neighbors too. Just unpack and enjoy!","description":"You must see this adorable yet spacious ranch home with an off-the-charts walkability score! From the moment you enter the living room, you’ll notice the warmth of the hardwood floors and the lovely bay window with deep sill for all your plants. The dining area is sizeable, with room for a large table. The kitchen has been updated with granite counters and stainless appliances, and has a charming bead board backsplash. In the main bedroom, you’ll find a ceiling fan and double-closet with organizer. The finished basement will serve as an awesome family room, with its charming stone accent wall and recessed lighting. There is so much space that you could easily add a home office and\/or workout area down there as well. The lower level also offers 2 large storage rooms and 2 additional closets. Need one more room? Convert the large storage room in the back! There is also exterior access to the rear yard from the basement. The rear, fenced, flat yard is stunning. Enjoy privacy while you entertain guests on the large deck for a Sunday BBQ. The shed with work benches offers plenty of workshop space and outdoor storage for your mower and garden supplies. The 1-car garage can fit a small car or be used for storage. If you commute, you’ll have your choice of 3 train stations within walking distance. On the weekends, walk into town to stroll downtown Glenside or catch a show at the Keswick. All this and great neighbors too. Just unpack and enjoy! Text me if interested:~  show contact info","num_images":3,"lat":39.9954,"lng":-75.1698,"attrs":"['1BR \/ 1Ba', '980ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T07:02:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-for-rent\/7512305798.html","post_id":7512305798,"result_date":"2022-07-23 07:23","title":"3 bedroom for rent !!!","description":"Stunning former David Weekley model home complete with staged furnishings from the builder!\nAvail of this rare opportunity to rent this furnished home with an amazing backyard which is an entertainer's dream complete with pavers and artificial turf, built in BBQ, and Pergola covered seating area. The interior features tons of upgradeu offering upgraded flooring, custom paint, draperies, fixtures and more. Home was bought professionally decorated from builder and maintained as is. The gourmet kitchen includes top of the line cabinets and appliances.Please call me at:  show contact info","num_images":1,"lat":39.9523,"lng":-75.1638,"attrs":"['3BR \/ 2Ba', '1875ft2', 'available now', '\\nsaturday 2022-07-23\\n', '\\nmonday 2022-07-25\\n', '\\nfriday 2022-07-29\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'listed by: chad', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T07:12:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-for-rent\/7512305796.html","post_id":7512305796,"result_date":"2022-07-23 07:22","title":"3 bedroom for rent !!!","description":"Stunning former David Weekley model home complete with staged furnishings from the builder!\nAvail of this rare opportunity to rent this furnished home with an amazing backyard which is an entertainer's dream complete with pavers and artificial turf, built in BBQ, and Pergola covered seating area. The interior features tons of upgradeu offering upgraded flooring, custom paint, draperies, fixtures and more. Home was bought professionally decorated from builder and maintained as is. The gourmet kitchen includes top of the line cabinets and appliances.Please call me at:  show contact info","num_images":1,"lat":39.9523,"lng":-75.1638,"attrs":"['3BR \/ 2Ba', '1875ft2', 'available now', '\\nsaturday 2022-07-23\\n', '\\nsunday 2022-07-24\\n', '\\nfriday 2022-07-29\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'listed by: chad', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T07:12:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-updated-single\/7512296850.html","post_id":7512296850,"result_date":"2022-07-23 06:22","title":"BEAUTIFULLY UPDATED SINGLE FAMILY HOME IN GREAT NEIGHBORHOOD!","description":"We have a great opportunity for an owner occupant who wants to put their own personal touches on this large end unit row home with an unfinished basement and attached garage. This would also be a great opportunity for an investor looking to add to their rental portfolio. This home has 1 bedrooms and 1 bathroom with carpet throughout and large windows that bring in lots of natural light. This home has lots of potential to make it your own. A covered front porch offers space for outdoor living and the unfinished basement provides extra storage and laundry. This is an \"As-is\" sale and the Buyer is responsible for U&O. Buyer, at buyer's expense, will be responsible for submitting the use and occupancy application through the municipality, paying the associated fee, scheduling, attending the inspection and obtaining the certificate of occupancy or violation report. In the event that repairs are needed, the buyer, at buyer's expense, will have all necessary repairs completed in order to receive a final certificate of occupancy or obtain a conditional certificate prior to closing.\nPlease text me if you are interested -->> (660) 324-27^24\n","num_images":5,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T05:08:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-find-bed-bath-home\/7512262893.html","post_id":7512262893,"result_date":"2022-07-22 23:45","title":"Amazing find! 3 bed\/ 2 Bath home available!","description":"I am looking to rent a single house in Philadelphia. Christian excellent credit no convictions of any kind. references. Looking for a single home a garage is a must. barn or extra garage is a plus would need parking Looking for a very reasonable rent I am a handy man able to do house repairs equipped for lawn maintenance. I am a dependable respectful person ...This one storey small house design comes with three bedrooms, two toilet and baths, and one garage fit for a family car. The total area of this small house design is 162 sq.m., which can be built in a lot with at least 300 sq.m. lot area.Apply with your name and phone number .","num_images":1,"lat":40.0343,"lng":-75.1213,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-22T23:09:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ardmore-bedroom-apt-near-suburban\/7512561054.html","post_id":7512561054,"result_date":"2022-07-23 17:29","title":"2 Bedroom Apt near Suburban Square & Train","description":"2 bedroom apartment sublet available for $1500.00 within walking distance of Suburban Square and the Amtrak\/Septa train station.  Could start sublet late August through December 31.  Landlord is looking for a new lease to be signed at the end of the year.","num_images":0,"lat":40.002,"lng":-75.2966,"attrs":"['2BR \/ 1Ba', 'available now', '\\nmonday 2022-07-25\\n', '\\nthursday 2022-07-28\\n', '\\nfriday 2022-07-29\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'carport', 'rent period: monthly']","posted_date":"2022-07-23T17:25:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/north-wales-check-us-out-we-offer\/7512554046.html","post_id":7512554046,"result_date":"2022-07-23 17:12","title":"Check us out! We offer washers and dryers in all of our apartments!","description":"Hunt Club ApartmentsRENT: $1770 \/ MONTH SIZE: 798 sq ft  BEDROOMS: 1 BATHROOMS: 1 LEASE TERMS: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nUNIT FEATURES:   ✓ Accent Walls✓ Dishwasher✓ Kitchen✓ Linen Closet✓ Range\/Oven✓ Refrigerator\/Freezer✓ Satellite TV✓ Views✓ Washer\/Dryer✓ Window Coverings✓ Cable-Ready✓ Central Air Conditioning✓ Full-size Washer And Dryer✓ Individual Patio or Balcony✓ Private Entrance✓ Storage Spaces (select homes)✓ Upgraded Kitchens (select homes)✓ Walk-In Closets (select homes)✓ Wood Burning Fireplaces (select homes)Exceptional Apartment Living!  Located just off Route 63 and a half mile from English Village Shopping Center, The Hunt Club offers spacious apartment homes in North Wales, PA. Residents love the beautiful setting and the convenient amenities that can only be found at our community. With our combination of great floor plans and lavish features, The Hunt Club offers the best North Wales apartment rentals. Choose from a great selection of one, two or three bedroom homes that delight any lifestyle. Our apartments in North Wales, PA offer private entrances to provide you with a more unique setting. Convenience can be found with a washer & dryer in each unit making your day-to-day routine a breeze. All of our rentals also come with a private patio or balcony for you to take in the scenic country views right from the comfort of your North Wales, PA home. Routes 309 and 202 are just a mile away making your travel needs quick and easy. The Hunt Club is near the Northeast Extension of the PA Turnpike so you will never be far from great dining, shopping and entertainment venues. Our North Wales apartment homes offer a wealth of community features that include a fitness center, business center, basketball & tennis courts and a playground. You can also enjoy a peaceful afternoon stroll around the beautiful nature trail. Schedule a tour with our on-site management team and let us show you why The Hunt Club offers the best apartments in North Wales, PA.PROPERTY FEATURES: ✓ Barbecue & Picnic Area✓ Business Center✓ Coffee Bar✓ Courtyard✓ Fitness Center✓ Free Weights, Weight & Cardio Machines✓ Furnished Units Available✓ Planned Social Activities✓ Playground✓ Walking\/Biking Trails✓ 1\/2 Mile from English Village Shopping Center✓ 24 Hour Availability✓ Corporate Suites✓ Less than 1 Mile to Route 309 and 202✓ Located on Route 63✓ Online Payment Options✓ Pet Play Area✓ Recycling✓ Wi-Fi at Pool and Clubhouse✓ Within 10 Miles of the Northeast Extension of the PA Turnpike PET POLICY: Breed Restriction The Hunt Club is a pet-friendly apartment community. We welcome cats and dogs (breed restrictions apply). Exotic pets are approved on a case by case basis. You may have two pets per apartment. There is a monthly pet rent of $35 for 1 pet and $50 for 2 pets. There is also a one-time, non-refundable fee of $350 for 1 pet and $500 for 2 pets.VISIT OR CALL US TODAY!  10 Hunt Club TrlNorth Wales, PA 19454 show contact info\nWebsite: https:\/\/www.huntclubnorthwales.com\/ All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY16A1072A18A143\n","num_images":7,"lat":40.211229,"lng":-75.235922,"attrs":"['1BR \/ 1Ba', '798ft2', 'available sep 29', 'air conditioning', 'application fee details: $60 application fee per applicant', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T17:08:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-remodeled-2bd\/7512525554.html","post_id":7512525554,"result_date":"2022-07-23 16:59","title":"BEAUTIFUL @@REMODELED 2BD AND 2 BATH APT TO RENT@@","description":"show contact info\nBeautiful 2 bedroom 2  bathroom home  in quiet tree lined street. $800\/month  rent. Clean naturally varnished Hard wood floor in the living room and bed room. Wall heater and new AC included. Fully rehabbed kitchen with new tile floors, cabinets, and granite counter top. Electric baseboard heat controlled room by room with individual thermostats. Laundry hook ups available in basement for an extra fee. Approximately 1200 square feet of living space. Available rent  . Only $800 rent. Garbage, Water, Sewage, Hot Water, and Lawn Care are included in the rentWe cannot rent to anyone  Beautiful kitchen with granite countertops, stainless steel appliances, and a breakfast bar. Step out to the large Philadelphia backyard and notice an additional bonus storage shed that has been renovated as well. Going upstairs you will notice large bedrooms with great closet space and a renovated bathroom. Washer and dryer are included in-unit. Laundry hook ups available in basement for an extra fee. Fully Furnished with Stove, Fridge, and private Laundry (Washer & Dryer in kitchen). Clean naturally varnished Hard wood floor in the living room and bed room. Wall heater and new AC included. Fully rehabbed kitchen with new tile floors, cabinets, and granite counter top. The unit comes with a private garage with a lock. The building is a quite -unit Complex and it's located in a desirable West neighborhood and conveniently located to shops, restaurants,  and the new Metro\/Expo Line. If you are interested please Text\n❖ Built-In Microwave\n❖ Central Heat & Air Conditioning\n❖ Disability Access In Select Units\n❖ Dishwasher\n❖ Full-Size Washer & Dryer In Every Apartment\n❖ Mini Blinds On All Windows\n❖ Refrigerator\/Freezer With Ice Maker\n❖ Walk-In Closets\n❖ Business Center\n❖ On-Site Leasing Office\n❖ Pet-Friendly\n❖ Private Garages In Select Units\n❖ Coffee Bar Clubhouse Kitchen","num_images":8,"lat":40.0178,"lng":-75.0895,"attrs":"['2BR \/ 2Ba', '1200ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-23T16:05:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxurious-and-more\/7512538587.html","post_id":7512538587,"result_date":"2022-07-23 16:52","title":"Luxurious and more spacious 2bedr and 1.5bth Apts, in Philadelphia!","description":"Luxurious and more spacious 2bedr and 1.5bth Apts, in Philadelphia! Great amount of natural sunlight. Good size of both bedrooms. Private entrance! New bathroom! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! 1 mos rent, 1 mos security. Beautiful Hardwood floors through, Stainless steel Appliances, Ceramic tile kit & Baths, Vaulted ceiling in foyer, Solar panels, Updated Heat & hot water, 1 car attached Garage with elect opener. The apartment features laminate floors, quarts counter tops, tile backsplash, quality stainless steel appliances, including an electric stove, microwave, dishwasher and garbage disposal. Central A\/C and heat. Washer and Dryer in the unit.FOR MORE INFO, Text here::  show contact info\nThank you and WELCOME TO YOUR NEW DREAM HOME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T16:32:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-ready-for-move-in\/7512501607.html","post_id":7512501607,"result_date":"2022-07-23 16:46","title":"Ready for move in","description":"Welcome to this adorable cozy row home in sunny South Philly. Featuring 3bedrooms and 1 bath. Enter the front door into a spacious open living room nicely done with sleek laminate flooring which leads into a full sized kitchen with granite counters and stainless appliances. The basement has a washer and dryer and is clean and dry. The 2nd floor boasts 3 ample sized bedrooms and a full tile bathroom. This property is located in a prime spot being so close to the subway which is one block away that can have you in Center City in minutes and with public transportation down the street you really can access just about anywhere from here. There are so many bakeries and sandwich shops along with cafe's and restaurants just a hop skip and a jump from here you really will be happy to call this one home.\nApplication fee; $50 per adult\nRent;$1100\nDeposit;$1100\nPlease text me if you are interested -->> (202) 85eight-4three37\n2425 S Rosewood St, Philadelphia, PA 19145\n","num_images":10,"lat":39.9227,"lng":-75.1812,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T15:14:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-rent-an-amazing-bed-bath\/7512533688.html","post_id":7512533688,"result_date":"2022-07-23 16:25","title":"Rent an amazing 2 bed 2 bath – Close to transit and bus lines!","description":"Welcome to The Glen at Lafayette Hill!555 Andorra Glen Ct Lafayette Hill, PA 19444Rental Size: 2 BR - 2 BA - 1157 sq ft | Per Month: $2370 - $2960 | Lease Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nExclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.  Our community features:   ➢ 24 Hour Availability➢ Business Center➢ Elevator➢ Furnished Units Available➢ Gated, Controlled Access➢ Package Service➢ Pet Friendly➢ Planned Social Activities➢ Recycling➢ Renters Insurance Program➢ BBQ Picnic Garden➢ Billiards, Club Lounge, Cafe Area, Library and Community Room➢ Fitness Center w\/ Free Weights, Weight Machines➢ Message Therapist Practice On-site➢ Outdoor Cafe & Coffee Bar➢ Outdoor Patio Lounge➢ Sprinkler System➢ Storage Space➢ Wi-Fi at Clubhouse  Our unit features: ➢ Air Conditioning & Heating➢ Carpet➢ Ceiling Fans (Select Floor Plans)➢ Dining Room➢ Heating➢ Range, Oven, Disposal, Oven➢ Refrigerator, Freezer and Ice Maker➢ Tub\/Shower➢ Wi-Fi➢ Window Coverings➢ Crown Molding (Select Floor Plans)➢ High Speed Internet Access➢ Linen Closet➢ Microwave➢ Storage Units➢ Trash Compactor➢ Vaulted Ceiling (Select Floor Plans)➢ Walk-In Closets (Select Floor Plans)➢ Washer\/Dryer➢ Wheelchair Accessible (Rooms)   Contact us for more information! --  show contact info\n--Our Pet-Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.Website: https:\/\/www.the-glen-apartments.comProperty Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":16,"lat":40.091441,"lng":-75.260553,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-23T16:21:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-now-this-second\/7512510871.html","post_id":7512510871,"result_date":"2022-07-23 16:10","title":"Available Now! This second floor e-bedroom apartment in","description":"Available Now! This second floor e-bedroom apartment in, features new flooring throughout the unit and an enclosed patio for additional storage, a sitting area, or home office. Conveniently located near local shopping, entertainment, and transportation. This house is in the good location, it’s close the transportation, surroundings quite and safety area, the owner and other roommates are very friendly, $630 rental fees including WiFi, Water, Electric, Laundry, Dishes cleaners, and toilet papers. Now the room is available. thanks! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities!. Includes all new appliances w\/washer & dryer. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! Beautiful Hardwood floors through, Stainless steel Appliances Know More Information Please Text Here: emily85055𝐆𝐦𝐚𝐢𝐥com","num_images":1,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 2Ba', 'apartment', 'laundry in bldg', 'detached garage', 'rent period: monthly']","posted_date":"2022-07-23T15:33:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/media-twin-brick-home-in-rose-tree\/7512515805.html","post_id":7512515805,"result_date":"2022-07-23 15:48","title":"Twin Brick Home in Rose Tree Media SD with garage!","description":"Twin Brick Home in Rose Tree Media SD with garage!\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\nTO SEE MORE PROPERTIES GO TO: www.eliterps.com\/inventory\nOffered by: ELITE Rental Properties Inc.  show contact info\nx1\nTwin Brick Home in Rose Tree Media SD with garage!\n*PROPERTY INFORMATION*\n-PROPERTY STATUS: For Rent Only\n-ADDRESS: 605 North Jackson Street Media, PA 19063\n-UNIT TYPE: Twin 3+1\n-RENTAL SPECIALS: If credit score for all applicants is greater than 800 or above, total move-in costs are reduced*.\n-MONTHLY RENT: $2,000\n-MOVE-COSTS: Typically, three (3) times the monthly rent depending on credit\n-MOVE-IN DATES: 1st or 15th of the month\n-MINIMUM LEASE TERM: Through May 31st 2024\n-HEATING: Gas forced air\n-AIR CONDITIONING: Window A\/C Not included\n-LAUNDRY: Washer\/Dryer in basement\n-PARKING: One (1) off-street, One (1) car garage, Permit on-street parking\n-UTILITIES INCLUDED: None\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\nTO SEE MORE PROPERTIES GO TO: www.eliterps.com\/inventory\n*LANDLORD'S RENTAL REQUIREMENTS*\nEVERYONE AGE 18 OR OVER MUST HAVE THE FOLLOWING:\n-COMBINED MONTHLY NET INCOME: Three (3) times the monthly rent in documented monthly net income\n-MIN. CREDIT SCORE: 700\n-MAX. IN COLLECTIONS: $0\n-PET OCCUPANTS: Not Accepted\n-SMOKING: Not Allowed\n-SECTION 8: Not Accepted\n*NEARBY*\nNether Providence Township, Rose Tree, Moylan, Upper Providence Township, Media Borough, Granite Run, Swarthmore College, Springfield, Swarthmore, Elwyn\n*CONSUMER NOTICE*\nAs per Pennsylvania Real Estate Commission requirements, ELITE Rental Properties Inc. is hereby informing you that we represent the Landlord as its agent. ELITE Rental Properties Inc. does not represent any other person other than the Landlord.\n*DISCLAIMER*\nAny and all information provided is deemed accurate but not guaranteed. It is up to the individual to conduct their own due diligence to ensure the information provided is accurate.\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\nTO SEE MORE PROPERTIES GO TO: www.eliterps.com\/inventory\nRental Terms\nRent: $2,000\nApplication Fee: $100\nSecurity Deposit: $2,000\nAvailable Now\nPet Policy\nCats not allowed\nDogs not allowed\n","num_images":4,"lat":39.9188,"lng":-75.3991,"attrs":"['3BR \/ 1Ba', '1306ft2', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T15:44:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-put-smile-on-your-face\/7512514844.html","post_id":7512514844,"result_date":"2022-07-23 15:45","title":"Put a smile on your face! You've just found the right place!","description":"Community Location: 100 Cobblestone Dr - Coatesville, PA 19320 Rental Information: $1757 - $2371\/Month | 2 Bedroom 2 Bath | 1178 sq ftLeasing Options:  Variable show contact info\nApartment Amenities:  ✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In ClosetsProperty Features: ✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral Bonuses Description: Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Call: Millview Apartments at  show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available aug 27', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T15:41:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-amazing-views-spacious-bed\/7512514071.html","post_id":7512514071,"result_date":"2022-07-23 15:44","title":"Amazing views, spacious 2 bed \/ 2 bath, great amenities, 1088 sq ft","description":"Millview ApartmentsVisit Our Community Today!100 Cobblestone Dr Coatesville, PA 19320  show contact info\nNestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!Bedrooms: 2 |  Bathrooms:  2  Square Footage: 1088 sq ft Rental Pricing: $1656 - $2216\/Month  Our Residents Enjoy:  ✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral Bonuses This Unit Comes With: ✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In ClosetsWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ Phone-Number:  show contact info\nPet-Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Lease-Length: VariableCall for Directions  EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":11,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'available sep 10', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T15:40:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-ready-to-lease-bed-bath\/7512513407.html","post_id":7512513407,"result_date":"2022-07-23 15:42","title":"Ready to lease! 1 bed 1 bath home. Check us out!","description":"Millview ApartmentsLocated at: 100 Cobblestone Dr Coatesville, PA 19320Featured unit: 1 bed | 1 bath | 845 sq ft Prices start at: $1661 - $2188\/month Call Today!  show contact info\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort-style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Wonderful Amenities!✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral BonusesApartment Features!✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In Closets  show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.EQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":11,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'available jul 30', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T15:38:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-annual-lease-required-20\/7512497952.html","post_id":7512497952,"result_date":"2022-07-23 15:32","title":"Annual lease required. $20 application fee per adult.","description":"Must see brick 3Bed\/2Bath home at Deerfield in  Philadelphia. This home features an open split floor plan, granite countertops, bonus room, and two car garage. Fireplace is not operational. Large primary bedroom with oversized walk in closet and ensuite bath. No pets allowed. Annual lease required. $20 application fee per adult.\nTo schedule a walk-through call Ripple Management at -- farninadanial72gmail.com. We show by appointment 6 days\/week plus an occasional Sunday.","num_images":5,"lat":40.0402,"lng":-75.2231,"attrs":"['3BR \/ 2Ba', 'house', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T15:07:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-philadelphia-will-be-ready\/7512497855.html","post_id":7512497855,"result_date":"2022-07-23 15:29","title":"Philadelphia-will be ready to occupy by July 2022.","description":"I can show the house at any time. Short notice ok. This is a brand new construction home for rent in the heart of Philadelphia-will be ready to occupy by July 2022. Close to EVERYTHING! 5BR, 3BA, 2-car garage, driveway could probably fit 4 cars, screened in porch, hard wood floors, beautiful cabinetry and appliances. No smoking, no pets. NO application fee required. That’s a rip off! Sec dep of 1 month’s rent is due at lease signing, 1st month rent due at move-in. I pro-rate if the lease begins mid-month.\nFOR QUICK RESPONSE CONTRACT ME==>> zasminezarra28gmail.com\n","num_images":6,"lat":40.0402,"lng":-75.2231,"attrs":"['5BR \/ 3Ba', '2600ft2', 'house', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T15:07:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-updated-br-apt\/7512503709.html","post_id":7512503709,"result_date":"2022-07-23 15:27","title":"Spacious updated 2 br apt, first floor","description":"Spacious updated 2 br apt, first floor. Private entrance! New bathroom! New kitchen! Freshly painted ready to move in! Light and airy!Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! 1 mos rent, 1 mos security. Your questions At -- * show contact info","num_images":1,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-07-23T15:18:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/north-wales-enjoy-serenity-and\/7512504481.html","post_id":7512504481,"result_date":"2022-07-23 15:24","title":"Enjoy serenity and tranquility in our lovely garden-style 2 bd\/1 ba","description":"Welcome to Hunt Club Apartments Rental Information  Pricing: $1476\/Month | 2 Bedroom 1 Bath | 841 sq ftLease Term: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nApartment Amenities   ✓ Accent Walls✓ Carpet✓ Dishwasher✓ Heating✓ Kitchen✓ Range\/Oven✓ Refrigerator\/Freezer✓ Washer\/Dryer✓ Wheelchair Accessible (Rooms)✓ Window Coverings✓ Cable-Ready✓ Central Air Conditioning✓ Full-size Washer And Dryer✓ Individual Patio or Balcony✓ Private Entrance✓ Storage Spaces (select homes)✓ Upgraded Kitchens (select homes)✓ Walk-In Closets (select homes)✓ Wood Burning Fireplaces (select homes)Community Features  ✓ Barbecue & Picnic Area✓ Basketball & Tennis Courts✓ Business Center✓ Car Wash Area✓ Coffee Bar✓ Fitness Center✓ Free Weights, Weight & Cardio Machines✓ Playground✓ Swimming Pool & Sundeck✓ Walking\/Biking Trails✓ 1\/2 Mile from English Village Shopping Center✓ 24 Hour Availability✓ Abundant Parking✓ Adjacent to Oxford Park✓ Corporate Suites✓ Located on Route 63✓ Online Payment Options✓ Renters Insurance Program✓ Wi-Fi at Pool and Clubhouse✓ Within 10 Miles of the Northeast Extension of the PA TurnpikeAbout CommunityDescription: Exceptional Apartment Living!  Hunt Club Apartments offers unique one bedroom, two bedroom, and three bedroom apartment homes in a beautiful setting that combines the comfort of home with exceptional resident services and outstanding community amenities. Options like fireplaces and storage spaces help you choose one of the apartment homes and create a style that is perfect for you. You will enjoy the convenience of living just minutes from major highways (Routes 63, 309, 202, & the PA Turnpike) and having easy access to transportation, employers, fine dining, parks and recreational areas, cultural events, historic attractions and shopping! By living luxuriously with a maintenance free lifestyle, you will find the serenity and convenience of Hunt Club Apartments to be your refreshing paradise. Schedule a tour of our beautiful North Wales apartments today and see why residents love coming home to Hunt Club.  Location: 10 Hunt Club Trl  North Wales, PA 19454  show contact info\nOffice Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMAdditional InformationPet Policy: Breed Restriction The Hunt Club is a pet-friendly apartment community. We welcome cats and dogs (breed restrictions apply). Exotic pets are approved on a case by case basis. You may have two pets per apartment. There is a monthly pet rent of $35 for 1 pet and $50 for 2 pets. There is also a one-time, non-refundable fee of $350 for 1 pet and $500 for 2 pets. Website: https:\/\/www.huntclubnorthwales.com\/Our Management Company: Paradise Management, LLC All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY5C36A345C5D24E3\n","num_images":19,"lat":40.211229,"lng":-75.235922,"attrs":"['2BR \/ 1Ba', '841ft2', 'available sep 29', 'application fee details: $60 application fee per applicant', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T15:20:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-now-this-1st\/7512495759.html","post_id":7512495759,"result_date":"2022-07-23 15:17","title":"Available Now! This 1st floor 2-bedroom apartment in Philadelphia.","description":"Available Now! This 1st floor 2-bedroom apartment in Philadelphia. features new flooring throughout the unit and an enclosed patio for additional storage, a sitting area, or home office. Conveniently located near local shopping, entertainment, and transportation. This house is in the good location, it’s close the E Cotati Ave and Snyder Ln, surroundings quite and safety area, the owner and other roommates are very friendly, $650 rental fees including WiFi, Water, Electric, Laundry, Dishes cleaners, and toilet papers. Now the room is available. thanks! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities!. Includes all new appliances w\/washer & dryer. Plenty of storage in a full basement as well as a shed on premises. Beautiful Hardwood floors through, Stainless steel Appliances, Ceramic tile kit & Baths, Vaulted ceiling in foyer, Solar panels, Updated Heat & hot water, 1 car attached Garage with elect opener. Conveniently located close to all public transportation, LIE highway, stores, restaurants, schools, parks, library. FOR MORE INFO:: 518 468-163.6","num_images":1,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T15:02:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bike-storage-package\/7512495702.html","post_id":7512495702,"result_date":"2022-07-23 15:06","title":"Bike Storage, Package Receiving, Microwave","description":"Bedrooms: 1Bathrooms: 1Square Feet: 518Date Available: 2022-07-23Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Bike StorageHardwood FloorsWasher\/DryerFitness Center w\/ Peloton BikesElectronic ThermostatRooftop DeckElevatorPackage ReceivingDishwasherFOB Controlled AccessOn-Site ManagementParking Garage (Additional Fees)Call:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/xysjijgz\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '518ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T15:02:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gardens-of-mt-airy-large\/7512494908.html","post_id":7512494908,"result_date":"2022-07-23 15:05","title":"Gardens of Mt. Airy Large 2 bedrooms w\/walk-in closet available","description":"GARDENS OF MT. AIRY\n1133 E. Mt. Airy Ave\nPhiladelphia, PA 19150\nCats are welcome!!\nApartment -2 bedroom apartment available for May at Gardens of Mt. Airy Apartments.\nMt. Airy apartments for rent with nice high ceilings, generous closet space and other fine amenities.\n* Free heat, hot water, and cooking gas\n* Hardwood flooring in select apartment homes\n* Over-The-Range Microwave\n* Large Closets\n* Controlled Access\n* Cats Welcome\nGardens of Mt. Airy apartments is a jewel located in the Mt. Airy section of Philadelphia identified by MONEY Magazine as one of the \"Best Big City Neighborhoods.\"\nThis apartment will rent quickly, so call us to schedule an appointment and reserve this unit today","num_images":9,"lat":40.0726,"lng":-75.1706,"attrs":"['2BR \/ 1Ba', '991ft2', 'available now', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T15:01:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-bed-barth-apartment\/7512493771.html","post_id":7512493771,"result_date":"2022-07-23 15:02","title":"NICE! 2 BED 2 BARTH apartment FOR RENT in Philadelphia.","description":"NICE! 2 BED 2 BARTH apartment FOR RENT in Philadelphia. features new flooring throughout the unit and an enclosed patio for additional storage, a sitting area, or home office. Conveniently located near local shopping, entertainment, and transportation. This house is in the good location, it’s close the E Cotati Ave and Snyder Ln, surroundings quite and safety area, the owner and other roommates are very friendly, $600rental fees including WiFi, Water, Electric, Laundry, Dishes cleaners, and toilet papers. Welcoming who is no drugs, no smoking, no alcohol the nice person to come looking around house and room. Now the room is available. thanks! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! 2 mos rent, 1 mos security. THIS APARTMENT IS CENTRALLY LOCATED TO ALL RESTATURANTS, SHOPS, ART GALLERIES AND BARS ON LIBERTY STREET AND THE NEWBURGH WATERFRONT PLUS ACCESS TO METRO-NORTH FERRY SERVICE TO BEACON TRAIN STATION. Come take a look at a great rental available for a 1st home or if downsizing: newly updated 2 bedroom, 1 bathroom house on a spacious 1 acre lot with plenty of privacy, available after October 1st. Includes all new appliances w\/washer & dryer. Plenty of storage in a full basement as well as a shed on premises. Beautiful Hardwood floors through, Stainless steel Appliances, Ceramic tile kit & Baths, Vaulted ceiling in foyer, Solar panels, Updated Heat & hot water, 1 car attached Garage with elect opener. Text me:  show contact info","num_images":4,"lat":40.0634,"lng":-74.999,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T14:58:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sedgwick-terrace\/7512490297.html","post_id":7512490297,"result_date":"2022-07-23 14:55","title":"Sedgwick Terrace Apartments Special *$500 off 1st rent Call Lisa","description":"Sedgwick Terrace Apartments Located in the beautiful Mt. Airy neighborhood of Philadelphia. Nestled between Chestnut Hill and Fairmount Park, this area of the city has a lot to offer—from the charming stretch of trendy cafés and shops, to quick highway access to Center City. You’ll be just a few minutes from Mt. Airy Playground, Earth Bread + Brewery, Wawa, Trolley Car Diner, Jansen, Hokka Hokka, and The Mermaid Inn, with easy access to public transportation. Apt A1\nSpecial **$500 off 1st month rent if, you move in by 8\/5\/2022\nCall Lisa for details\nhttps:\/\/www.lindyproperty.com\/properties\/sedgwick-terrace\/\nWe have a 2 bedroom ready to move in.\nThis is a smoke free communities\nCold water included in rent\nOpen concept living room\nGood storage space\nSleek tile work in the kitchen\nCoin-operated common laundry facilities in the basement\nOff- street parking provided\nQuick highway access to Center City\nAmple closet space\nWhite shaker cabinetry\nSubway tiling\n","num_images":10,"lat":40.0547,"lng":-75.1866,"attrs":"['2BR \/ 1Ba', '640ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T14:51:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/morrisville-luxury-apartment-bed-bath\/7512489614.html","post_id":7512489614,"result_date":"2022-07-23 14:54","title":"Luxury Apartment 1 Bed 1 Bath Apartment The Edge at Yardley","description":"The Edge at Yardley is a great place to be if you are looking for apartments in Yardley, PA. We offer spacious one-, two-, and three-bedroom floor plans with bi-level living options. The Edge at Yardley features a rare combination of great location, open generous space, and fantastic amenities and features.\nTo schedule a tour of our amazing Yardley, PA apartments, call us at  show contact info\n!\nLeasing Office Hours:\nMon – Fri: 9:00 am – 5:30pm\nSaturday: 9:00 am – 5:00pm","num_images":1,"lat":40.2084,"lng":-74.8291,"attrs":"['1BR \/ 1Ba', 'available aug 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T14:50:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-bedroom-bathroom\/7512489426.html","post_id":7512489426,"result_date":"2022-07-23 14:53","title":"Bright 2-bedroom 2 bathroom duplex apartment available in philadelphia","description":"Bright 2-bedroom 2 bathroom duplex apartment available in philadelphia . features new flooring throughout the unit and an enclosed patio for additional storage, a sitting area, or home office. Conveniently located near local shopping, entertainment, and transportation. This house is in the good location, it’s close the E Cotati Ave and Snyder Ln, surroundings quite and safety area, the owner and other roommates are very friendly, $700 rental fees including WiFi, Water, Electric, Laundry, Dishes cleaners, and toilet papers. Now the room is available. thanks! New kitchen! Lovely duplex 2 broom first floor apt. Private entrance! New bathroom! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Ready to move in! 1 mos rent, 1 mos security. Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities!. Includes all new appliances w\/washer & dryer. Plenty of storage in a full basement as well as a shed on premises. FOR MORE INFO:: show contact info","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-23T14:49:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-now3-bedroom\/7512480984.html","post_id":7512480984,"result_date":"2022-07-23 14:44","title":"Available Now!3-bedroom\/2bathroom Apartment","description":"Available Now! This 1st floor 3-bedroom apartment in Philadelphia. features new flooring throughout the unit and an enclosed patio for additional storage, a sitting area, or home office. Conveniently located near local shopping, entertainment, and transportation. This house is in the good location, surroundings quite and safety area, the owner and other roommates are very friendly, $900 rental fees including WiFi, Water, Electric, Laundry, Dishes cleaners, and toilet papers. Now the room is available. thanks! New kitchen! Freshly painted ready to move in! Light and airy! Living rm, dining area, kitchen. Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities! Bedroom, with full wall closets! Full bath. CAC. Sep thermostat, large closets. INCLUDES: heat, cooking gas, water and all clubhouse amenities!. Includes all new appliances w\/washer & dryer. Plenty of storage in a full basement as well as a shed on premises. Beautiful Hardwood floors through, Stainless steel Appliances, Ceramic tile kit & Baths, Vaulted ceiling in foyer, Solar panels, Updated Heat & hot water, 1 car attached Garage with elect opener. Conveniently located close to all public transportation, LIE highway, stores, restaurants, schools, parks, library. For more information or to schedule a viewing email me your contact number. Thanks","num_images":5,"lat":39.9487,"lng":-75.1593,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T14:33:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recycling-smart-home\/7512477679.html","post_id":7512477679,"result_date":"2022-07-23 14:31","title":"Recycling, Smart Home Features, Dishwasher","description":"Bedrooms: 1Bathrooms: 1Square Feet: 643Date Available: 2022-07-23Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Large ClosetsMicrowaveParking Garage (Additional Fees)DishwasherBike StorageHigh Speed InternetOn-Site ManagementRecyclingRooftop Deck24\/7 Front Desk AttendantElectronic ThermostatPackage ReceivingCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/sy3s4j2w\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '643ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T14:27:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-fitness-center-professionally\/7512476914.html","post_id":7512476914,"result_date":"2022-07-23 14:29","title":"Fitness Center, Professionally Managed, Lease Today","description":"When you call The Point at Exton home you will enjoy an amazing line up of amenities including a resort style pool, fashionable outdoor space, and a controlled access parking garage. Call now for a tour!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, walk-in closet, and a washer\/dryer!\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm","num_images":24,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '668ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T14:25:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7512473290.html","post_id":7512473290,"result_date":"2022-07-23 14:22","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Stainless Steel Appliances\n* Private Patio or Private Balcony (on select apartments)\n* Linen Closet\n* Garden Tub\n* Walk-in Closet\n* Washer and Dryer in unit\n* Kitchen Island\nCommunity Features\n* Professionally Managed\n* Bark Park\n* Billiards\n* Easy Freeway Access\n* Pet Salon\n* Outdoor Grill Area\n* Fitness Studio\n* Minutes from Restaurants, Shopping, and Much More\n* Swimming Pool\n* TV Lounge\n* Sun Deck\n* Yoga Lounge\n* Spa\n* Community Lounge","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T14:18:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7512472416.html","post_id":7512472416,"result_date":"2022-07-23 14:20","title":"Schedule a Tour, Granite Countertops, Playground","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathroom, walk-in closet, and a large patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":22,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '833ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T14:16:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-lambert-street\/7512472143.html","post_id":7512472143,"result_date":"2022-07-23 14:20","title":"LOVELY LAMBERT STREET","description":"Don't miss 2305 S Lambert!\n3 bedroom, 1 bathroom townhome with wonderful amenities in the West Passyunk-Girard Estates section of Philadelphia!\nFeatures include Living Room with hardwood floors and modern maple kitchen with stainless steel appliances and granite countertop.\nUpstairs, the 3 bedrooms are each bright and nicely sized with brand new wall to wall carpets.\nThere is no shortage of charm in this updated home that is closely situated on a great well kept quiet block off West Passyunk Avenue 1 block from historic Stephen Girard Park.\nJust a quick bike ride to center city and one step close to public transportation including the 17 bus which get's you to Center City in 10 minutes.\nThis home is within walking distance to East Passyunk as well as many fantastic restaurants in the area (Brewery ARS, TapRoom, Stina Pizzeria, Melrose Diner, Second District Brewing and more!) and several supermarkets (ShopRite, Acme, Aldi) Ross and other stores only a few blocks away. Walking distance to FDR Park.\n1 year lease.\nUtilities bills not included.\nStandard credit, job and rental history\nNeed good credit score.\nNo smoking. No sublet. Pets TBD\n","num_images":8,"lat":39.92343,"lng":-75.180899,"attrs":"['3BR \/ 1Ba', '1036ft2', 'available aug 1', 'air conditioning', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T14:16:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-unit-of-626-br\/7512451399.html","post_id":7512451399,"result_date":"2022-07-23 14:19","title":"Welcome to unit 3 of 626 s @!! 2 Br-** 2 B@ H*O*M*E!","description":"Welcome to unit 3 of 626 s. 12th street in queen village. This large two bedroom, 1 bathroom gem is located in a prime location, between washington square and bella vista. You’ll be blocks from washington square, seger dog park, and palumbo park. Plus you’re walking distance from acme, sprouts, whole foods, and great restaurants\/bars. The apartment features a spacious living room with lots of natural sunlight and a kitchen with stainless steel appliances. Best of all, there is a large shared roof deck, lounge, and bar where you’ll be able to enjoy wonderful views. Laundromat no longer! There is a washer\/dryer in-unit. Tenant pays utilities (.Water, electric, heat, internet\/cable) subject to credit and income requirements, small dogs ok with landlord approval and additional fee.\nText to schedule a showing or for more information!++++jaelynmoriah76514gmail.com  ++++ Short\/Long term leases are an option!","num_images":4,"lat":40.0402,"lng":-75.2231,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T13:35:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-incredible-amenities\/7512469113.html","post_id":7512469113,"result_date":"2022-07-23 14:14","title":"Incredible Amenities, Stylish Features, Lease Today","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nLease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nApartment Features\n* Wood-Like Floors\n* Granite Countertops\n* Private Patio or Private Balcony (on select apartments)\n* Extra Storage\n* Full sized Washer and Dryer in unit","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T14:10:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-dishwasher-package\/7512459509.html","post_id":7512459509,"result_date":"2022-07-23 13:55","title":"Dishwasher, Package Receiving, Bike Storage","description":"Bedrooms: 1Bathrooms: 1Square Feet: 551Date Available: 2022-07-23Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Smart Home FeaturesRooftop DeckPackage ReceivingElevatorOn-Site ManagementHigh Speed Internet24\/7 Front Desk AttendantRefrigeratorBike StorageMicrowaveLarge ClosetsElectronic ThermostatCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/zwbvcg4p\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '551ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T13:51:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-in-the-heart-of\/7512441897.html","post_id":7512441897,"result_date":"2022-07-23 13:32","title":"Located in the heart of Manayunk and just a few blocks from the Wissah","description":"Located in the heart of Manayunk and just a few blocks from the Wissahickon or Cresson Street Train Station, this two story row home is ready for a new owner! Home has gleaming hardwoods as soon as you enter, an open floor plan concept on the main floor, recessed lighting, large kitchen with stainless steel appliance package , powder room, great natural sunlight, large back yard, 3 bedrooms, bathroom, and great finished great room in the basement. House was freshly painted, new carpet, central air, and close to restaurants and shops. More professional pics to come.\nCall Only:  show contact info","num_images":1,"lat":40.0402,"lng":-75.2231,"attrs":"['3BR \/ 2Ba', '1462ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-23T13:17:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom\/7512439635.html","post_id":7512439635,"result_date":"2022-07-23 13:17","title":"Beautiful 4 Bedroom","description":"Beautiful and spacious 4 Bedroom 1 and 1\/2 bath. Great back yard. Located in the heart of Manayunk. Walk to Main Street, train station and transportation. Enjoy the shops and many restaurants on Main Street. Just minutes to Center City. Available August 15. 2022.","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['4BR \/ 1.5Ba', '1500ft2', 'available aug 15', 'house', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T13:13:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath-unit\/7512416250.html","post_id":7512416250,"result_date":"2022-07-23 13:01","title":"Spacious 2 bedroom \/ 2 bath unit","description":"Spacious 2 bedroom \/ 2 bath unit at the pet-friendly Metro Club with a washer\/dryer in unit and 1 secured gated parking spot included. Great natural lighting, expansive windows, open layout, modern stainless steel appliances, beautiful hardwood floors, pendant lights above the breakfast bar. Closet galore, double bathroom sinks! Metro Club in an elevator high-rise with a heated outdoor pool, Boutique hotel-style lobby, fireplace, and lounge seating. Secured entry and controlled building access with a full gym. Easy access to Market East SEPTA station and SEPTA bus routes and many area local attractions including Reading Terminal Market, Maggiano's Italy, The Melting Pot etc. Pictures are of a similar unit!\nCentral Air\nMain Floor Laundry\nParking available\nPets Allowed\nStainless Steel Appliances\nHardwoodfloors\n201 N 8th St #902,","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1193ft2', 'available aug 26', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T12:29:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-of-the-best-values-in\/7512404528.html","post_id":7512404528,"result_date":"2022-07-23 12:51","title":"One of the best values in Center City.","description":"$500 Security Deposit!!! 1600 Walnut is surrounded by the performing arts and numerous other cultural venues. One of the best values in Center City. Secure entry, Gym, Bike room! Bright and sunny units with hardwood floors, large windows, marble baths and open layouts with great closet space. Known for its popular restaurants and nightlife spots, Just steps away from some of Philadelphia's best culinary experiences Midtown Philadelphia is a fun and exciting place to live. Pictures are of a similar unit.\nLaundry in Building\nHardwoodfloors\nGym Available\nPets Allowed\n1600 Walnut St #601","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '550ft2', 'available aug 20', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T12:06:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7512406196.html","post_id":7512406196,"result_date":"2022-07-23 12:50","title":"Spacious 1 Bedroom apartment in a landmark building","description":"1st Month's Rent to move-in!! Spacious 1 Bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block away from Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit.\nCentral Air\nLaundry in Building\nHardwoodfloors\nPets Allowed\nGym Available\n1411 Walnut St #208","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '472ft2', 'available aug 3', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T12:09:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-bedroom-15-bath-house\/7512407281.html","post_id":7512407281,"result_date":"2022-07-23 12:39","title":"3 bedroom, 1.5 bath house located in the town of Phoenixville","description":"Located in the bustling town of Phoenixville, this beautiful 3 bedroom, 1.5 bath house with a yard and patio will make you feel right at home. The house is on a quiet one-way street and includes off-street parking. The gourmet kitchen features granite countertops, new stainless steel appliances, gas cooking, a custom tile backsplash, and an island peninsula great for baking and meal prep. In addition, the house has all new flooring, freshly painted, recessed lighting and central air conditioning.","num_images":7,"lat":40.1267,"lng":-75.5272,"attrs":"['3BR \/ 1.5Ba', '1496ft2', 'available now', 'air conditioning', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T12:11:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-enjoy-the-college-life\/7512418660.html","post_id":7512418660,"result_date":"2022-07-23 12:37","title":"Enjoy the college life at The Glen at Lafayette Hill! We're near campus!","description":"RENT: $1671 - $2088\/Month | SIZE: 648 sq ft | BEDROOMS: 1 | BATHROOMS: 1LEASE TERMS: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nABOUT COMMUNITY: We offer the premier location for apartment homes in Lafayette Hill. With a great location and easy access to I-476 (Veteran's Memorial Hwy), you will love calling The Glen Apartments your home. Residents of our Lafayette Hill apartment rentals enjoy our one, two, and three bedroom floor plans that add a touch of style and sophistication to any lifestyle. We boast a number of lavish amenities, including 42-inch kitchen cabinetry, gas cooking, over-sized closets and in-unit washers and dryers. With its convenient location near the most prominent dining, shopping and entertainment venues in Lafayette Hill, The Glen is perfect for commuters all across the Pennsylvania area. Schedule a tour of our luxury Lafayette Hill apartments today and see why residents love coming home to our apartments.Pet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.UNIT FEATURES:   ❖ Air Conditioning & Heating❖ Cable Ready❖ Carpet❖ Ceiling Fans (Select Floor Plans)❖ Heating❖ Range, Oven, Disposal, Oven❖ Refrigerator, Freezer and Ice Maker❖ Tub\/Shower❖ Wi-Fi❖ Window Coverings❖ Crown Molding (Select Floor Plans)❖ Dishwasher❖ High Speed Internet Access❖ Linen Closet❖ Storage Units❖ Trash Compactor❖ Vaulted Ceiling (Select Floor Plans)❖ Walk-In Closets (Select Floor Plans)❖ Washer\/Dryer❖ Wheelchair Accessible (Rooms)COMMUNITY FEATURES: ❖ 24 Hour Availability❖ Barbecue\/Grill❖ Business Center❖ Elevator❖ Gated, Controlled Access❖ Pet Friendly❖ Pet Play Area❖ Planned Social Activities❖ Recycling❖ Renters Insurance Program❖ BBQ Picnic Garden❖ Billiards, Club Lounge, Cafe Area, Library and Community Room❖ Fitness Center w\/ Free Weights, Weight Machines❖ Message Therapist Practice On-site❖ Outdoor Cafe & Coffee Bar❖ Outdoor Patio Lounge❖ Sprinkler System❖ Storage Space❖ Wi-Fi at ClubhouseCONTACT US TODAY!The Glen at Lafayette Hill555 Andorra Glen Ct  Lafayette Hill, PA 19444Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMWebsite: https:\/\/www.the-glen-apartments.com Professionally managed by Paradise Management, LLC All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYF383D5FEDB994E05\n","num_images":16,"lat":40.0896,"lng":-75.2601,"attrs":"['1BR \/ 1Ba', '648ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-23T12:33:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-closets-fob\/7512413957.html","post_id":7512413957,"result_date":"2022-07-23 12:28","title":"Large Closets, FOB Controlled Access, On-Site Management","description":"Bedrooms: 0Bathrooms: 1Square Feet: 372Date Available: 2022-07-23Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Washer\/DryerFitness Center w\/ Peloton BikesParking Garage (Additional Fees)Electronic ThermostatSmart Home FeaturesPackage ReceivingFOB Controlled AccessDishwasherElevatorHardwood FloorsLarge ClosetsMicrowaveCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/c672kon5\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '372ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T12:24:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-hardwood-floors\/7512398817.html","post_id":7512398817,"result_date":"2022-07-23 12:28","title":"beautiful hardwood floors, updated kitchen","description":"Massive 1bedroom + den apartment right in the heart of all that Fishtown has to offer. Very large open living space with beautiful hardwood floors, updated kitchen with stainless stel appliances, tons of cabinets and counter space. Tenant responsible for $50 towards buiding water monthly with rent. Easy application process, par application, ID and income verification.\nPets Allowed\nParking available\nHardwoodfloors\nStainless Steel Appliances\n1309 Marlborough St","num_images":4,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:56:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7512396635.html","post_id":7512396635,"result_date":"2022-07-23 12:24","title":"Spacious 1 Bedroom apartment in a landmark building","description":"FREE MONTH SPECIAL FOR APPLICATIONS SUBMITTED BY 6\/30!!! $500 Security Deposit - Limited Time Move In Special!! Spacious 1 Bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block away from Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit in the building.\nCentral Air\nLaundry in Building\nPets Allowed\nParking available\nHardwoodfloors\nGym Available\n1411 Walnut St #1207,","num_images":4,"lat":39.971831,"lng":-75.185165,"attrs":"['1BR \/ 1Ba', '684ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:51:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-is-an-amazing-home\/7512392315.html","post_id":7512392315,"result_date":"2022-07-23 12:23","title":"This is an amazing home located on a quiet block","description":"This is an amazing home located on a quiet block in the heart of Northern Liberties, just around the corner from the Piazza and Liberties Walk, and steps away from dozens of neighborhood restaurants including Apricot Stone, El Camino Real, Hikari Sushi and Urban Village Brewing Company. Upon entering you will notice the open and inviting floor plan. The first floor has hardwood flooring, high ceilings , a bathroom, a gas fireplace, and a piano. Light pours through the kitchen from the backyard through a glass door that leads to an outdoor city oasis, including a patio AND grass! The basement has a custom bar and pool table for entertaining. Venturing upstairs to the 2nd floor, you will find a cozy back bedroom and large front bedroom with a renovated bathroom, a front-loading washer and dryer, and large walk-in closet. The 3rd floor features a large home office that could double as an extra bedroom. French doors open into the primary bedroom, which boasts large closet space, hardwood flooring, and a fully renovated bath with dual shower heads. The home is full of character, with custom built-ins and solid wood doors, and has been featured in Design Home, Nest, Apartment Therapy, and Philadelphia Magazine. The home has a nest thermostat and ADT security set up. There is permit parking on the block, neighborhood favorite One Shot Cafe on the corner, and both Heirloom Market and Acme only a block away!\nCentral Air\nLaundry in Building\nParking available\nPets Allowed\nHardwoodfloors\n213 W George St","num_images":1,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2.5Ba', '1963ft2', 'available aug 12', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:42:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-theater-room-quiet-community\/7512407514.html","post_id":7512407514,"result_date":"2022-07-23 12:16","title":"Theater Room, Quiet Community, Move In Now","description":"VIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nDiscover a brand-new community designed to take luxury to the next level while keeping you close to everything you need. Lease now at The Point at Exton!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, ensuite bathrooms, walk-in closets, and a washer\/dryer!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm","num_images":24,"lat":40.031462,"lng":-75.628976,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T12:12:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7512407393.html","post_id":7512407393,"result_date":"2022-07-23 12:16","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nFind yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nApartment Features\n* Garden Tub\n* Linen Closet\n* Walk-in Closet\n* Pre-wired for internet and cable\n* Stainless Steel Appliances\n* High Efficiency Lighting Fixtures\n* Full sized Washer and Dryer in unit\n* Pantry\n* Breakfast Bar\n* Ceiling Fan\n* Lofty Vaulted Ceilings\n* Central Heat and Air\n* Roommate Friendly Floor Plan\n* Private Patio or Private Balcony (on select apartments)\n* Window Coverings\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Granite Countertops\n* Disposal","num_images":22,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T12:12:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-community-has-pool-hot-tub\/7512396393.html","post_id":7512396393,"result_date":"2022-07-23 12:16","title":"$ Community has a pool, * hot tub, dog park,-  play ground,","description":"This would be a perfect starter home or investment property if your looking to start earning some equity but not spend an arm and a leg. Granite countertops throughout, large walk in closet, lots of cabinet space in kitchen, open concept for entertaining. Great location and close to freeway access. Community has a pool, hot tub, dog park, play ground, and club house.\nPlease call or text Stacy at [safiasalama538gmail.com] for a showing","num_images":6,"lat":39.9954,"lng":-75.1698,"attrs":"['1BR \/ 1Ba', '755ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-23T11:51:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-size-one-bedroom-one\/7512388217.html","post_id":7512388217,"result_date":"2022-07-23 12:15","title":"Nice size one bedroom one bath Unit flat","description":"Nice size one bedroom one bath Unit flat in the heart of Chinatown. With all the comforts of home at your fingertips. Newer dishwasher, washer and dryer in the unit. Basement storage convenient for bicycle storage and much more. Welcoming Lobby with a concierge makes this an awesome place to live. Walking distance to the Convention Center, Reading Terminal Market and other iconic Phila areas. Close to Rt 676that will take you to the airport and shore.\nCentral Air\nParking available\nMain Floor Laundry\n1010 Race St #2K","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '706ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:33:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-resort-style-pool-lease-today\/7512407132.html","post_id":7512407132,"result_date":"2022-07-23 12:15","title":"Resort Style Pool, Lease Today, Quiet Community","description":"VIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nThe Point at Exton is ideally located in the heart of Chester County within walking distance to popular restaurants and shops including Whole Foods, The Pour House and more. Set up your tour now!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, built-in desk, walk-in closet, and a washer\/dryer!\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nCommunity Features\n* TV Lounge\n* Package Acceptance\n* Community Kitchen\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access\n* Professionally Managed\n* Garage Parking\n* Bike Racks\n* Controlled Access Parking\n* Outdoor Grill Area\n* Fitness Studio\n* Sun Deck\n* Pet Salon\n* Swimming Pool\n* Extra Storage","num_images":24,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '865ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T12:11:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7512406068.html","post_id":7512406068,"result_date":"2022-07-23 12:13","title":"Private Balcony, Quiet Community, Move In Now","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nCommunity Features\n* Pet Salon\n* Community Lounge\n* Swimming Pool\n* Professionally Managed\n* Billiards\n* Outdoor Grill Area\n* Easy Freeway Access\n* Yoga Lounge\n* Bark Park\n* Sun Deck\n* TV Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Fitness Studio\n* Spa","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1363ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-23T12:09:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-splendidly-renovated\/7512395231.html","post_id":7512395231,"result_date":"2022-07-23 12:13","title":"This splendidly renovated warehouse in Franklin","description":"FREE MONTH SPECIAL FOR APPLICATIONS SUBMITTED BY 6\/30!!! Just 1st month's rent and $500 security deposit to move-in!!! This splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. The Warehouse is located in a highly walkable area with access to all forms of public transportation. Amenities include secured entry and controlled building access, on-site parking (additional $200\/month), full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit in the building!\nCentral Air\nMain Floor Laundry\nPets Allowed\nParking available\n9 N 9th St #518,","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '718ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:48:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-salt-water-pool-with\/7512405675.html","post_id":7512405675,"result_date":"2022-07-23 12:13","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"You will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T12:09:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-courtyard-level-at\/7512393641.html","post_id":7512393641,"result_date":"2022-07-23 12:09","title":"1 bedroom courtyard level at Chancery Lane","description":"$500 Security Deposit!!! 1 bedroom courtyard level at Chancery Lane offers loft-style apartment homes with elevator in a gated courtyard setting within historic Old City and boasts a community rooftop deck with panoramic views of the city. Beautiful large loft style 1 bedroom apartment. Pictures are of a similar unit.\nCentral Air\nMain Floor Laundry\nPets Allowed\n130 Arch St #108,","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T11:45:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-junior-one-bedroom-with\/7512402369.html","post_id":7512402369,"result_date":"2022-07-23 12:06","title":"Junior one bedroom with parquet wood floors","description":"Junior one bedroom with parquet wood floors throughout, magnificent city views from oversized windows in all rooms providing excellent natural light, as well as a balcony accessible from the living room. Residents of The Dorchester enjoy a 24-hour doorman, fitness center, all utilities, and basic cable for TV. There is a garage and rooftop pool available for additional fees.\nCentral Air\nGym Available\n224 W Rittenhouse Sq #1008","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '611ft2', 'available aug 17', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T12:02:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-steps-away-from\/7512397879.html","post_id":7512397879,"result_date":"2022-07-23 11:58","title":"just steps away from Fairmount Avenue","description":"Located in the heart of the desirable Francisville neighborhood, just steps away from Fairmount Avenue, Ridge Avenue, the Art Museum, Kelly Drive, and so much more. You will absolutely love this quiet and serene block. As you walk in you are greeted by a spacious living room with oak flooring area right off of the contemporary kitchen with stainless steel appliances and generous sized quartz countertops. Walk out of your kitchen to enjoy these warm summer months entertaining in your private rear yard with pressure treated fencing and a newly poured cement patio. Going up to the second floor you will find two large bedrooms with high hat lighting, large windows, and roomy closets. For convenience your washer and dryer is also located on this floor with a full bathroom. The top floor master suit is laid out perfectly with tons of closet space, a large master bedroom, and a gorgeous master bath with Delta shower fixtures, Fresca double vanity, and imported tile. The best is left for last. Private roof deck overlooking the city skyline.\nCentral Air\nLaundry in Building\nParking available\nStainless Steel Appliances\n1719 Erdman St,","num_images":1,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2.5Ba', '1366ft2', 'available sep 1', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:54:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-huge-bed-bath-apartment\/7512389704.html","post_id":7512389704,"result_date":"2022-07-23 11:55","title":"Huge 2 bed 1 bath apartment available","description":"Huge 2 bed 1 bath apartment available in the heart of Queen Village. Minutes from everything in the city. LED lighting throughout, washer dryer in unit, bay windows throughout. Schedule your showing today. Available September 1st, move in.\nCentral Air\nPets Allowed\nMain Floor Laundry\n761 S 3rd St #2,\n","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-23T11:36:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-right-in-the-heart-of\/7512383504.html","post_id":7512383504,"result_date":"2022-07-23 11:55","title":"Right in the heart of Center City Philadelphia","description":"Right in the heart of Center City Philadelphia, you will find this furnished GEM! This cozy, fresh and fly furnished apartment has everything you could possibly need - all you need is a suitcase and some groceries!!! On the first floor you'll find the cozy comforts of home with tastefully done artwork and touches all throughout. All the appliances are sized to be used and enjoyed (read: no dorm room sized refrigerator, for instance) and although a laundromat is a couple blocks away, you won't need to round up quarters because the dual washer\/dryer will handle that! The first floor also boosts a little outside nook for when you need to get air without sitting on a stoop and to grow your fresh herbs or whatever you prefer! A snazzy spiral staircase takes you up to the second floor where your queen sized bed, flat screen TV and nicely updated bathroom await you. Don't want to take the spiral route? For those long days when you just need to crash, you can bypass that and take the staircase in the foyer right to your second floor door. It could not be more convenient! As for the location? Groceries, restaurants, entertainment, transportation.... just EVERYTHING is right outside the door! Here you can have the best of both worlds; a beautiful, cozy, quiet furnished home on the inside and a city rich in culture and diversity with convenience galore on the outside. Win, win!\nCentral Air\nMain Floor Laundry\nParking available\nPets Allowed\n335 S 12th St #1B","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '448ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:24:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-constructed-apartment\/7512385164.html","post_id":7512385164,"result_date":"2022-07-23 11:52","title":"New constructed apartment building.","description":"New constructed apartment building. Unit 7 with 2B2B. One month FREE with 24 months lease, mini 12 months lease. Open kitchen with all new appliances, washer and dryer in unit. Balcony along the living room. Aurdal style closets with specious spaces bedroom. Water fee $60\/month. Ask for video if you need.\nCentral Air\nMain Floor Laundry\nParking available\nPets Allowed\n700 N Marshall St #7,","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:27:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautiful-2nd-and-3rd\/7512391322.html","post_id":7512391322,"result_date":"2022-07-23 11:44","title":"This beautiful 2nd and 3rd floor unit","description":"Welcome to 1932 Christian St. This beautiful 2nd and 3rd floor unit is in the perfect location for your new home! Through the main vestibule you'll enter your unit on the main floor where you'll have access to a fully unfinished basement offering a load of storage space and your washer\/dryer. Up on the main floor you have an open floor plan with your eat-in kitchen and living space. Large windows let in a ton of natural light and high ceilings make this space feel twice it's size. Off the hallway you have your first full bathroom as well as a large main floor bedroom with double closets. Venturing up to the second floor you have another large bedroom with access to the HUGE back deck where you can spend summer nights entertaining friends and grilling! On the other end of the hall you have another bedroom and full bathroom. This apartment is one of a kind in a great location in Graduate Hospital with 94 Walkscore and 92 bike score you'll have everything you need at your fingertips! This unit won't last so schedule your tour today!\nCentral Air\nLaundry in Building\nParking available\nPets Allowed\n1932 Christian St #B","num_images":4,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '2000ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:40:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-looking-for-luxury-corner\/7512386712.html","post_id":7512386712,"result_date":"2022-07-23 11:43","title":"Looking for a luxury corner condo with parking","description":"Looking for a luxury corner condo with parking - Look no further! Introducing 501 Vine, a spacious flat located in a boutique designer condo building in Old City. This 1bd + room converted to second bedroom\/office)\/1ba unit features a spaciously functional 942 SF open concept with urban chic charms such as exposed ductwork, plus modern conveniences like central air, recessed micro lighting, hardwood floors, tons of windows and natural light, and high ceilings throughout. The gourmet kitchen is the centerpiece of the unit, with matching stainless steel appliances, central island, pendant lighting, contemporary cabinetry, and quartz counters. Washer and Dryer, Wine bar, and plenty of storage! Have an electric car? There is a charging station for you to use free of charge. Access to I-95 and I-76 make this a commuter-friendly property. Easy access to downtown Philadelphia and fun surrounding neighborhoods like Northern Liberties, Delaware River Waterfront and Spring Arts, plus it's just a short walk to the many galleries, bars + restaurants, cafes and shops in Old City proper.\nCentral Air\nMain Floor Laundry\nParking available\nStainless Steel Appliances\nHardwoodfloors\n501-7 Vine St #3,","num_images":1,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '942ft2', 'available sep 1', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-23T11:30:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-townhome-bedrooms-35\/7512381108.html","post_id":7512381108,"result_date":"2022-07-23 11:42","title":"This townhome 3 bedrooms 3.5 baths","description":"Amazing NEW CONSTRUCTION rental with all the bells and whistles in the HOT HOT 19122 area. This townhome features: 3 bedrooms 3.5 baths plus an additional spacious finished basement which is fantastic for an office area. One car garage with storage, TWO decks: 1 on the main level \/kitchen area and the other a full roof deck. Luxurious amenities abound in this beautiful open floor plan which includes: hardwood floors throughout, iron railings, and huge windows with great City views from the upper floors and from the full roof deck. The kitchen has quartz countertops, built in shelving, stainless steel appliances and an abundance of designer cabinets. Half bath off the kitchen with a balcony perfect for grilling in the summer! Two bedrooms and two more baths on the next level, space and privacy for everyone in the house! Master bedroom comes with beautiful built-ins, incredible views and plenty of sunlight. Master bath with glass encased shower with slate tile and double vanity. Washer and dryer included on the upper level. Basement currently used as a gym or could be the perfect bonus space for your needs! Walking distance to amazing restaurants : Wm. Mulherin's Sons, Hiroki, NuNu, Suraya and Frankford Hall to name a few. One of the few rentals in Fishtown\/Kensington area with private parking and a 5 min. walk to Girard station and The EL . $500 non refundable pet deposit $75 flat fee for water APPLICATION PROCESS: 1. submit PAR application (we will send upon request) 2. Pending Approval of PAR; submit Rent Spree application w\/ pay stubs (see clickable link in lease details)\nCentral Air\nStainless Steel Appliances\nParking available\nHardwoodfloors\n1411 N Howard St,","num_images":4,"lat":40.000504,"lng":-75.178471,"attrs":"['3BR \/ 3.5Ba', '1609ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-23T11:19:40-0400"}]