[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-bedroom-bathroom\/7633815252.html","post_id":7633815252,"title":"Lovely 2 bedroom \/ 1 bathroom 2nd Floor apartment available Late June-","description":"Available Late June- Early July: Welcome to 109 W Wildey St #201! This is a lovely 2 bedroom \/ 1 bathroom 2nd Floor apartment located in the Schoolhouse Lofts. This beautiful, late gothic revival building offers modern-industrial artist lofts inside the historic Daniel Boone School in the Northern Liberties area of Philadelphia. Enter this unit to a hallway that opens into your main living area. There are high ceilings, large windows, and an open floor plan. The kitchenette boasts modern cabinetry, subway tile backsplash, and stainless steel appliances including overhead microwave, electric range, and refrigerator. Text your number","num_images":4.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T21:51:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-and-spacious\/7633807021.html","post_id":7633807021,"title":"Gorgeous and Spacious 1 Bedroom 1 Bathroom Apartment","description":"This is an open concept loft that plays as a two bedroom or one bedroom plus den. The first thing you notice as you step into this center city loft is the dramatic height of the two stories high ceiling. The second thing might be the expansive wall of windows spanning the entire south exposure of the living spaces. The third could be the beautiful, original form from the days this building was a factory, freshly re-varnished maple hardwood floors. A few steps further into the center of the unit and it is the slate tiled fireplace with oversized stone hearth that catches your eye. Imagine yourself sitting there cozying up next to a warm wood burning fire this winter. Turn yourself around and look to the other end of the condo and you’ll see the dining area with a gorgeous modern chandelier and rustic dining table capable of seating for ten people. A reclaimed wall hutch adds the charm of the dining nook. The kitchen is equipped with a soapstone countertop and a river rock backsplash. There are maple wood cabinets to compliment the floors and stainless steel appliances, including an under counter wine refrigerator. Turning around again and looking behind the fireplace are two large rooms, one stacked on top of the other and both with built-in bookshelves and impressively large walk-in closets. Use one as a bedroom and the other a den, or both bedrooms. The bathroom has been customized with an extra deep soaking tub, dual flushing toilet, vanity cabinet and warming towel rack. Being on the top floor of the building there is easy access to the brand new community rooftop deck. This space expands your enjoyment and entertaining space to the outdoors where you can enjoy panoramic views of Philadelphia’s skyline.","num_images":10.0,"lat":39.95919,"lng":-75.158921,"attrs":"['1BR \/ 1Ba', '1146ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T21:07:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/horsham-this-move-in-ready-bedroom\/7633781382.html","post_id":7633781382,"title":"This move in ready 1 bedroom.","description":"This move in ready 1 bedroom (ceiling fans in both rooms), 1 bathroom in the full bathroom there is a heat lamp for those Winter mornings. The home boast attic storage and has Attic-installed Radiant Barrier for Energy Conservation. There is a rear patio that has rear motion activated lights and EP Henry Pavers, has outside Utility Closet (storage shed) with electricity. Located in desirable Saw Mill Valley. Home located on small Cut-de-sac with only seven units. Has been freshly painted and updated. Located within the award winning school district of Hatboro-Horsham. It is in walking distance to the Power Line Trail and several playgrounds. Hassle free living at its best, the HOA takes care of trash, snow removal, and common area maintenance. Summer Swim club membership offered by adjoining Townhouse community This gives you time to enjoy your outdoor patio area. Will not last long.","num_images":24.0,"lat":40.183122,"lng":-75.152373,"attrs":"['1BR \/ 1Ba', '1098ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T19:19:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/welcome-to-this-amazing\/7633779884.html","post_id":7633779884,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/glenside-just-short-hop-away-from\/7633783366.html","post_id":7633783366,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-room-for-rent\/7633770766.html","post_id":7633770766,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-house-for-rent\/7633716809.html","post_id":7633716809,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-loft-in-fairmount\/7633739647.html","post_id":7633739647,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-the-house-is-located-on\/7633735907.html","post_id":7633735907,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-dont-miss-this-opportunity\/7633735135.html","post_id":7633735135,"title":"Don't miss this opportunity...","description":"Pretty Street with Low Traffic... Is Where You Will Find This....very well kept spacious ranch home with a large full basement and a massive back yard for all those summer barbecue's. Enter home through private side entrance into bright and open living Space. The living rm. is next to the dining area and spacious open beautiful kitchen offers plenty of counter\/cabinet space. The kitchen refrigerator, washer and dryer are included in the sale of the home. Kitchen offers tile flooring, New SS Refrigerator, Garbage Disposal, Exhaust Fan and Gas Cooking. Two generously-sized bedrooms with ample closet space and hall bath complete the main level. Down the stairs to the basement with galore to do as you wish offers power room, walkout onto huge backyard, laundry rm. 15x14 with interior access into 1.5 over-sized garage. Garage offers new insulated door and remote door opener.","num_images":4.0,"lat":40.0338,"lng":-75.1731,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T16:52:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-watch-the-planes-land\/7633718864.html","post_id":7633718864,"title":"WATCH THE PLANES LAND!","description":"FOR RENT AUGUST, 2023\nCENTER CITY ONE\n1326 SPUCE ST.\nLARGE 29TH FLOOR ONE BEDROOM\nBroad & Spruce\nCUSTOMIZED APARTMENT WITH\nSWEEPING EAST AND SOUTH VIEWS!\n29th floor views across the City as you watch the planes land.\nWatch fireworks from the stadiums at Center City’s very best location—Broad & Spruce close to everything Center City offers—Walk to Office District, Rittenhouse, Midtown Village\/Gayborhood, Society Hill, Passyunk and hundreds of restaurants + theater, fitness and shopping with instant access to all public transportation! 1 bedroom (approx. 800 square feet) with spacious living room PLUS dining area, custom kitchen and bath plus double pane bedroom windows for ultra-quiet and 2 balconies and built-out closets throughout.  Newly decorated hallways!\nTHIS IS A TOTALLY SMOKE-FREE BUILDING.\nAll contemporary amenities including D\/W, heavy-duty W\/D in your apartment, wall-to-wall carpet, ceramic tile in foyer, kitchen and bath; new central AC\/Heat (you control), generous closet space, specially sound-conditioned bedroom, PLUS an available and responsive landlord. INCLUDES 1-2 FULL PRIVILEGE GYM MEMBERSHIPS.\n(Rent includes cable, gas and heat.)\nPriced at only $2,150\/month to rent quickly to quality tenants.\n1-2 year lease (extended lease may be available).\nNo dogs and no smoking please; first, last and security deposit required. Ideal for a quiet, upscale professional or couple.\nAVAILABLE FOR AUGUST 15, 2023 OCCUPANCY.\nEmail or text\/call Rick (owner) at  show contact info\nfor immediate viewing.","num_images":14.0,"lat":39.946892,"lng":-75.164089,"attrs":"['1BR \/ 1Ba', '800ft2', 'available aug 15', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T16:09:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-dont-miss-this-opportunity\/7633718056.html","post_id":7633718056,"title":"Don't miss this opportunity...","description":"Pretty Street with Low Traffic... Is Where You Will Find This....very well kept spacious ranch home with a large full basement and a massive back yard for all those summer barbecue's. Enter home through private side entrance into bright and open living Space. The living rm. is next to the dining area and spacious open beautiful kitchen offers plenty of counter\/cabinet space. The kitchen refrigerator, washer and dryer are included in the sale of the home.  Kitchen offers tile flooring, New SS Refrigerator, Garbage Disposal, Exhaust Fan and Gas Cooking.  Two generously-sized bedrooms with ample closet space and hall bath complete the main level. Down the stairs to the  basement with galore to do as you wish offers power room,  walkout onto huge backyard, laundry rm. 15x14 with interior access into 1.5 over-sized garage. Garage offers new insulated door and remote door opener.","num_images":8.0,"lat":40.043683,"lng":-75.108178,"attrs":"['2BR \/ 2Ba', '1169ft2', 'available now', '\\nsaturday 2023-06-17\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T16:07:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-move-in-ready-fully\/7633706350.html","post_id":7633706350,"title":"Move-In READY! Fully Remodeled 1×1 w\/Parking\/Wi-Fi\/Security lockbox\/AC","description":"Move-In READY! Fully remodeled private suite and bathroom with utilities included, Wi-Fi, Security lockbox, and AC.\nWe are much more than a suite rental. This property has the potential to provide you with a variety of advantages, including comfort, a fantastic location, unique aesthetics, status, amenities, and privacy along with co-living spaces.\n2464 North Opal Street is located in an up-and-coming neighborhood. It is close to schools, childcare facilities, convenience stores, churches, and grocery stores.\nWe include all utilities, maintenance services, cleaning services, and an amazing in-house Property Management team so you don't have to worry about anything! No credit checks are needed, our leases are flexible starting at 6 months!\nCall:  show contact info\nWhat's included in rent:\n*utilities\n*maintenance services\n*in-house property management team\nNo Credit Checks Needed.\nFlexible Lease starting 6 months.\n","num_images":8.0,"lat":39.991498,"lng":-75.164314,"attrs":"['1BR \/ 1Ba', 'available now', '\\nmonday 2023-06-19\\n', '\\ntuesday 2023-06-20\\n', '\\nwednesday 2023-06-21\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T15:39:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-whoa-price-drop-bed-15\/7633707152.html","post_id":7633707152,"title":"WHOA! PRICE DROP! 2 BED 1.5 BATH GERMANTOWN APT! W\/PARKING & MORE!","description":"4908 Germantown Ave #11 – 2 bed 1.5 bath apt; gas stove, refrigerator & off street parking – AVAILABLE NOW - $1049\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co. or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nTerrific, recently renovated 2-bedroom, 1.5 bathroom apartment. Enter into a large living & dining space with newly installed cabinets, electric stove\/oven & refrigerator. Half bath with vanity conveniently located off dining and living area. Brand new shower\/tub tile in primary bathroom!\nBedroom #1 features a long closet for storage and plenty of morning sunlight, getting you up and out the door on time.\nBedroom #2 is a bit larger with more closet space. Also featuring brand new shower\/tub with full bathroom.\nOFF STREET PARKING INCLUDED!\nFeaturing:\n2 bedrooms\n1.5 bathrooms\nStove\nRefrigerator\nTile floor\nOff – Street parking\n& MORE!","num_images":10.0,"lat":40.028245,"lng":-75.162125,"attrs":"['2BR \/ 1.5Ba', 'available jul 1', 'application fee details: $50.00 per application', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T15:41:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/reading-bright-cozy-bed-bath-airmasters\/7633701624.html","post_id":7633701624,"title":"- Bright Cozy\/-1 bed+ 1 bath!! Airmasters HVAC\/R & Sheet Metal","description":"Bright and cozy 1 bed, 1 bath 2nd floor unit in a great  West Lawn location. Designated parking spot, and onsite laundry & locked storage locker in basement. Pet friendly. Walkable to restaurants, arts district, shops, parks, and many other local amenities. National Guard Association of Illinois NGAI, and minutes from the turnpike. Strong apartment connection offers endless reasons to fall in love with Springfield! Airmasters HVAC\/R & Sheet Metal.\n","num_images":4.0,"lat":40.328,"lng":-75.9908,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T15:27:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-free-parking-pet-friendly\/7633710130.html","post_id":7633710130,"title":"Free Parking, Pet Friendly, W\/D, Elevator Bldg, Pool, Fitness Center","description":"Apartment 524 is 2 Bedroom 2 bath with a breakfast bar, washer\/dryer in unit and a courtyard view. Plush carpeting throughout and gets great daylight too! Make this your new apartment home today!\n*Pricing subject to change daily*\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nElevator Building\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Giant, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-6pm | S, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!\n","num_images":10.0,"lat":39.96788,"lng":-75.603134,"attrs":"['2BR \/ 2Ba', '948ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T15:48:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/reading-large-24-48-shop-connected-to\/7633701856.html","post_id":7633701856,"title":"Large (24 x 48) Shop Connected To The home \/\/=208 Perkasie Ave","description":"Wonderful property in the country with great privacy. The current owner built the property back in the early 80's and has maintained the home very well. This home has a great open floor plan and offers great opportunity to expand in the basement. The home is heated with either wood or propane. This is a great home for a home hobbyist or someone that needs a lot of space to work from home. There is a large 24 x 48 shop connected to the home and a maple shack on the property. This house is a must see!\n","num_images":0.0,"lat":40.328,"lng":-75.9908,"attrs":"['1BR \/ 1Ba', '864ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T15:28:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-germantown-bed-15-bath-apt\/7633707208.html","post_id":7633707208,"title":"GERMANTOWN 3 BED 1.5 BATH APT! PRIVATE ENTRANCE, A\/C, BACKYARD & MORE!","description":"AVAILABLE NOW! 5046  Germantown Ave #1  – 3 bed 1.5 bath apartment w\/private entrance & in-unit laundry! $1199\/month - AVAILABLE NOW!\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co., or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nTerrific 3 bed 1.5 bath 1st floor apartment. Large open concept living space with. Three spacious bedrooms with closet storage. Full sized 3-piece bathroom with tub\/shower, vanity and toilet. Eat-in kitchen with stainless steel appliances including dishwasher, microwave & gas stove.\nLaundry is a breeze with convenient laundry room! CENTRAL AIR! keeping you cool in the summertime!\nFeaturing:\n3 bedrooms\n1.5 bathroom\nCentral Air\nGas stove\nMicrowave\nDishwasher\nEat – in kitchen\nFull sized refrigerator\nPrivate entrance\nIn-unit laundry\nPrivate yard\/patio space\nAND MORE!","num_images":14.0,"lat":40.029945,"lng":-75.164949,"attrs":"['3BR \/ 1.5Ba', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T15:41:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-pet-friendly-living-bark\/7633571017.html","post_id":7633571017,"title":"Pet-friendly living, Bark park, 2 bedroom","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardOnline Payments AvailableOn-site bike storageAlexa or Google Home Capable in all ApartmentsBocce ball fieldGame Room with Billiards Table, Shuffle Board, and moreUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densMarble master baths, some with deep linen storage48-hour Maintenance CommitmentBBQ and deck areaPet-friendly livingHuge walk-in closets with ample storageCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/bk75pcsh\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1156ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-06-17T10:23:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/fort-washington-lrge-bed-bath-off\/7633564481.html","post_id":7633564481,"title":"+*LrGe 2 bed + 1 bath, Off Street Parking \/apT!!","description":"2 bedroom 1 bathroom Condo Style Private unit with Appliances and Off Street Parking \/apartment. New Paint, Trim and Lights. Quiet Home. Garden Entrance with shared Laundry right across the hall.Off-street parking ache.","num_images":4.0,"lat":40.1813,"lng":-74.9104,"attrs":"['2BR \/ 1Ba', '\\nsunday 2023-06-25\\n', '\\ntuesday 2023-06-27\\n', '\\nfriday 2023-06-30\\n', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T10:05:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-luxury-bedroom-the-edge-at\/7633569721.html","post_id":7633569721,"title":"Luxury 2 Bedroom! The Edge at Yardley","description":"The edge at Yardley is a wonderful community located in Yardley PA. We offer many different kinds of units including one - , two -, and three-bedroom floor plans with bi-level living options. Our community features a rare combination of great location , generous space and wonderful amenities and features. To schedule a tour please call  show contact info\n#21201\nHours:\nMon-Fri: 9:00am-5:30pm\nSat: 9:00am-5:00pm\nSun: Closed\n","num_images":9.0,"lat":40.203849,"lng":-74.878794,"attrs":"['2BR \/ 2Ba', 'available aug 31', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T10:19:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/doylestown-magnificent-marble-floor\/7633568943.html","post_id":7633568943,"title":"Magnificent marble floor apartment for rent , historic Doylestown PA","description":"Magnificent modern new apartment for just 1,650 in the best location of Doylestown. Walk easily to all restaurants etc. this was a very historical carriage house but has been completely modernized and updated. New washer and dryer included, marble floors throughout,Personal Parking included,  a SO HO feel to it. Text or Call Scott at  show contact info\n.","num_images":7.0,"lat":40.30946,"lng":-75.129573,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T10:17:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-tour-the-edge-at-yardley\/7633568818.html","post_id":7633568818,"title":"Tour The Edge at Yardley! Luxury 1 br","description":"The edge at Yardley is a wonderful community located in Yardley PA. We offer many different kinds of units including one - , two -, and three-bedroom floor plans with bi-level living options. Our community features a rare combination of great location , generous space and wonderful amenities and features. To schedule a tour please call  show contact info\n#20305\nHours:\nMon-Fri: 9:00am-5:30pm\nSat: 9:00am-5:00pm\nSun: Closed\n","num_images":10.0,"lat":40.203849,"lng":-74.878794,"attrs":"['1BR \/ 1Ba', 'available jul 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T10:16:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southampton-huge-bedroom-apartment-in\/7633566407.html","post_id":7633566407,"title":"HUGE 4 Bedroom Apartment in Southampton, Centennial Schools","description":"Newly remodeled 4 Bedroom 2 Bathroom 2nd Floor apartment. Bi-level unit with 3rd floor as additional storage space or play area. Central Air condition and Gas Heat.\nFenced back yard area.\nOwner is a PA Licensed Real Estate Agent and Attorney.\nCall  show contact info\nwith any questions.\nSection 8 OK with 4 bedroom or larger voucher.\nProof of income and clean eviction history required.","num_images":13.0,"lat":40.1868,"lng":-75.0071,"attrs":"['4BR \/ 2Ba', '1600ft2', 'available now', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T10:10:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-1br-ft2-lovely-bedroom-bath\/7633553871.html","post_id":7633553871,"title":"1br - 2364ft2 - Lovely 1 Bedroom, 1 Bath Apartment with Small Rear Dec","description":"Lovely 1 Bedroom, 1 Bath Apartment with Small Rear Deck. Central A\/C, Unit includes, Washer & Dryer, Stainless steel appliances, Dish Washer, Microwave, freshly painted... Great location!\n648 South St #3FL\n","num_images":0.0,"lat":39.9375,"lng":-75.2637,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:33:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-icehouse-is-very-unique\/7633567359.html","post_id":7633567359,"title":"Icehouse is a very unique, cutting edge LEED Certified!","description":"The Icehouse is a very unique, cutting edge LEED Certified new construction \/ rehab condo complex. Common area green roof, koi pond, roof top dog park, bike room, and rooftop outdoor kitchen. Unit 1 is a studio unit with front entry, GE stainless appliances, high efficiency W\/D, large Caesarstone island, glass tile bath, and hardwood floors. Directly across the street from Hetzell's ball field. The Icehouse is located 1 block from Girard Avenue. Public transportation: The (15) Trolley stops approximately two blocks from The Icehouse at the intersection of Girard and Columbia. In addition, the Girard Avenue \"EL\" stop (with connection available directly from the (15) trolley), is a short walk of about 10 minutes from The Icehouse.\n1247 E Columbia Ave #1","num_images":9.0,"lat":39.9788,"lng":-75.1262,"attrs":"['0BR \/ 1Ba', '530ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T10:13:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-furnished-beautiful\/7633567289.html","post_id":7633567289,"title":"Fully Furnished Beautiful 1 bedroom\/1 bathroom unit!","description":"Fully Furnished Beautiful 1 bedroom\/1 bathroom unit on Delancey Street in Rittenhouse Square! This unit features beautiful granite counter tops, stainless steel appliances, many windows and original hardwood flooring throughout. Both washer and dryer are located inside of the unit. In walking distance from great restaurants and entertainment in Center City Philadelphia!\n1836 Delancey St #2","num_images":10.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '5928ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T10:12:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fantastic-bedroom-bathroom\/7633567238.html","post_id":7633567238,"title":"Fantastic 2 bedroom\/2 bathroom condominium home!","description":"Fantastic 2 bedroom\/2 bathroom condominium home available for rent at The Bridgeview in the heart of Old City! Featuring fabulous city views from the very tall windows! Step into this homey and sun-filled apartment that offers a renovated kitchen with granite counter tops & is open to the spacious living room with dramatic exposed brick walls. Two generously sized bedrooms with excellent closet space & exposed brick walls. The hallway bathroom houses the washer\/dryer. Sleek & stylish wood floors throughout. Central A\/C. Available for immediate move-in. First, last and one month's security deposit due at lease signing. $50 application fee per applicant.\n315 New St #617","num_images":17.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '865ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T10:12:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-second-floor-inside-quaint\/7633567185.html","post_id":7633567185,"title":"Second floor inside a quaint 4-story brownstone on the corner of St!","description":"429 Vine Unit #2 is on the second floor inside a quaint 4-story brownstone on the corner of Vine St. The unit was recently fully renovated and features all brand new appliances, washer and dryer, flooring, bathroom, and kitchen. Inside the bedroom there is a den with it's own door that makes perfect space for an at-home office. The property is dog friendly for an additional $50\/month per dog. Please no cats! Generally require first month rent, last month rent, and one month security deposit for move-in. Tenants responsible for all utilities: electricity, cable\/internet, and a $50\/month water fee.\n429 Vine St #2","num_images":11.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '5088ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T10:12:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enter-into-an-open-concept\/7633567135.html","post_id":7633567135,"title":"Enter into an open concept kitchen and living space!","description":"Welcome to this stunning one bedroom apartment located in Northern Liberties! Enter into an open concept kitchen and living space. The kitchen is complete with granite countertops, Whirlpool stainless steel appliances, and subway tile backsplash. Enjoy views of the shared courtyard and great natural sunlight. This property offers a spacious bi-level layout including a spiral staircase. Upstairs you’ll find a large bedroom and en-suite bathroom with ample closet space. Steps from Spring Garden street restaurants and shops. Within walking distance to Target, City Fitness, and CVS. Minutes to Northern Liberties Piazza restaurants, nightlife, and shops. Easy access to I-95 and the Benjamin Franklin Bridge. Quick commute to Community College of Philadelphia and Temple University.\n541 N Orianna St #1A","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '720ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T10:12:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedrooms-and-updated-full\/7633562269.html","post_id":7633562269,"title":"2 bedrooms and updated full bath!","description":"there are 2 bedrooms and updated full bath with CT floor and walls. From the kitchen there is a door that leads to the back balcony and very big and private back yard. Basement is finished with CT floors, Full Bathroom withstand up shower, separate storage and laundry area.","num_images":4.0,"lat":39.9502,"lng":-75.1636,"attrs":"['2BR \/ 1Ba', '947ft2', 'available now', 'application fee details: $1', 'broker fee details: Credit & Background', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d hookups', 'listed by: Coldwell Banker Hearthside Realtors', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T09:59:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-open-plan-with\/7633561909.html","post_id":7633561909,"title":"Spacious open plan with living and dining areas!","description":"HELLO Gorgeous. Please come to see for yourself this modern, four(4) bedroom house with good closet space, two(2) beautiful bathrooms and an upper floor laundry, PLUS a finished basement complete with storage area and PLUS a private outdoor space. This beautiful home offers a spacious atmosphere and is located within convenient walking distance to local restaurants and shopping along Fairmount Ave. Light colored, hardwood floors continue throughout the home. The first floor has a spacious open plan with living and dining areas and a beautiful modern kitchen, perfect for entertaining. Extend your entertaining to the your private back courtyard. The second floor features two(2) good sized bedrooms and a beautifully finished full bath. The third floor features two(2) more bedrooms with great closet space and a luxury full bath complete with soaker tub. Pets considered on a case by case basis and with deposit. Available 8\/1\/23\n1632 Francis St","num_images":11.0,"lat":39.9677,"lng":-75.1735,"attrs":"['4BR \/ 2Ba', '2200ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:58:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7633557976.html","post_id":7633557976,"title":"Spacious 2 Bedroom 2 Bath Apartment","description":"This 2 Bedroom 2 Bath Apartment - Apartment French doors, brand new kitchen and bathroom, newly polished Douglas wool hardwood floors, private balcony. Stainless steel washer Freshly painted throughout and has great space with lots of natural light. Stainless appliances, peaceful back deck, and full and private use of large grassed front yard. Stainless steel appliances, a washer\/dryer unit, and off-street parking****Please don't forget to insert your phone number. I will tell you more specific about this property!","num_images":3.0,"lat":40.0343,"lng":-75.1213,"attrs":"['2BR \/ 2Ba', '1300ft2', 'available now', 'broker fee details: Credit & Background', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'listed by: Equal Housing Opportunity', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:46:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sun-soaked-corner-property\/7633561290.html","post_id":7633561290,"title":"Sun-soaked corner property in Northern Liberties!","description":"Sun-soaked corner property in Northern Liberties! Within the walls of this gorgeous brick townhome, hardwood flooring, natural light, and generous living spaces await you! The inviting living space welcomes you with built-in shelving, warm wood flooring, crown molding, and amazing natural light. The powder room is located right beside this space for convenience. Down the stairs awaits your spacious eat-in kitchen featuring warm wood shaker cabinetry, stainless steel appliances, multiple windows and room for a dining table. The stackable washer\/dryer is also within this space. The 2nd floor is home to a large bedroom and 1 full bath. The bright and airy bedroom is complete with hardwood flooring, a large window, closet space and private access to the bath. The tiled bath includes a modern vanity and shower\/tub combo. The upper floor features the primary suite with a skylight, walk-in closet and ensuite bathroom. The natural light and warm wood flooring fill the space with ease. The tiled bathroom closely resembles the other with a stylish vanity and large stall shower. Now let's talk location. Perfectly situated in the desirable neighborhood of Northern Liberties, this home is truly by it all. Hot dining spots like Urban Village Brewing Co., Figo, Jery's Bar and SO many more. Every block has something for everyone. Not to mention, North Bowl, The Filmore, Barcade, and others are great date night\/weekend spots to indulge in. Easy access to other neighborhoods, suburbs, and NJ with highways and public transport. Do not wait! Schedule your showing before this beauty is off the market!\n114 W Wildey St","num_images":12.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2.5Ba', '1059ft2', 'available jul 1', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:56:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spaciousness-of-true-loft\/7633560638.html","post_id":7633560638,"title":"Spaciousness of true loft living! Welcome home!","description":"Welcome to Lofts 640 in the heart of Philadelphia, PA! Your monthly rent includes extended cable TV service, access to our fitness center, indoor\/heated pool and hot tub with an attached outdoor roof deck, yoga\/fitness studio, cyber lounge, 24\/7 front desk attendant and more! As you enter 640 North Broad, you'll step away from the busy street and into an urban space that artfully blends the old with the new. The original character of the building has been enhanced by modern accents and furnishings, creating a unique and sophisticated environment. Our community is vibrant and welcoming, with state-of-the-art amenities designed to nurture both body and spirit. You'll love relaxing in our glass-domed pool house, where the warm salt water pool and Jacuzzi spa offer the perfect respite from the stresses of daily life. Meet and socialize with fellow residents on our rooftop deck lounge, or take advantage of our cyber cafe and yoga studio to stay connected and centered. Our lobby is a work of art, featuring geometric ceiling lights that illuminate the mocha-colored floors. With stunning white and stainless steel accents, the lobby is the perfect introduction to the energy and excitement of Loft 640. Located just six blocks from City Hall on Broad Street, our community is centrally located to shops, restaurants, hospitals, and the thriving community of Fairmount. Reading Terminal Market and the Pennsylvania Convention Center are just minutes away. Living at Loft 640 is the perfect combination of the commuter convenience of center city living and the spaciousness of true loft living. Welcome home!\n640 N Broad Street N Broad Street #725","num_images":10.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '917ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:54:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-bedroom-bathroom\/7633560168.html","post_id":7633560168,"title":"Great 2 Bedroom, 1 Bathroom unit in the heart of Old City!","description":"Great 2 Bedroom, 1 Bathroom unit in the heart of Old City. Hardwood Flooring, Central Air and Washer & Dryer in Unit! Views of the Ben Franklin from your living room. Just steps away from all of the hot spots in Old City, including, Morgan's Pier, Tuna Bar, Forsythia, Royal Boucherie & More! First, Last, Security required at signing. No Pets, No Smoking. Tenant pays all utilities.\n321-23 N Front St #3","num_images":12.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:53:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-studio-cottage-in-marsh\/7633559892.html","post_id":7633559892,"title":"Studio Cottage in Marsh Creek Available 9\/1\/23","description":"Serious Inquiries Only! This is a private residence, so we require a phone interview first! Perfect for one Person. References and One Month Deposit 1200.00 Required. Reply to Email or contact my cell  show contact info\n. Text is also available. Thank you, looking forward to speaking with you.\nDescription:\nBeautiful Cottage on 2 acres, very Private! Newer Fridge, Stove(oven), Toilet, and Bathroom Fan. 5 minute walk to the fishing side of Marsh Creek. Perfect size for One Person. One bedroom. Enjoy the Fresh Air, and a Panoramic View of the Stars better than Hawaii. This is a very unique rental.\nWest Side Marsh Creek Lake (1)  Downingtown, PA  19335$1200.00 \/ Month---------------------------Interested in this property?Reply to this listing for more information.---------------------------Property Details:1 BEDROOMS | 1 BATHROOMSBeautiful Cottage on 2 acres, very Private! Non-vacation.\nNewer Fridge, Stove(oven), Toilet,  Bathroom Fan, Hot Water Heater, and Sliding Glass door w Screen and Lock.  Back Patio area perfect for a Chimnea!  Ask bout our canoe? 5 minute walk to the fishing side of Marsh Creek. Perfect size for just One Person, this is a studio cottage. Enjoy the Fresh Air, and a Panoramic View of the Stars better than Hawaii.  We Cover Water and Trash Bill.  Renter pays for Electric, and Internet\/TV on their own. There is an area of a storage shed available included. Clothing Rack and Microwave available for Renter!  Window AC Installed.  We May consider a pet depending on your situation(a non-refundable pet deposit is needed.) Cottage is perfect for one person, but we may consider a couple (max 2.)  Please read the Page carefully, this is a private residence, and we require a phone interview as the first step. Please leave your cell phone info and i will contact you(Phone or text), Thank U!***No Pets Allowed***Property Type: OtherLease Terms:$1200.00\/Month$1200.00 DepositLease Length: One YearAvailable:09\/01\/2023Unit Amenities:Freezer Microwave Oven RefrigeratorBuilding Amenities:Bicycle Parking Cable Ready Lawn Near Parks No Smoking Off Street Parking Washer Dryer Hookups Wired For Internet---------------------------Interested in this property?Reply to this listing for more information.\n","num_images":9.0,"lat":40.0161,"lng":-75.7183,"attrs":"['1BR \/ 1Ba', '550ft2', 'available sep 1', 'dogs are OK - wooof', 'cottage\/cabin', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:52:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-come-and-enjoy-center-city\/7633559519.html","post_id":7633559519,"title":"Come and enjoy center city living at this prime location!","description":"Welcome to 104 S. 13th Street in Washington Square! Come and enjoy center city living at this prime location!! Private electronic coded front door. This beautiful top floor contemporary 1 bedroom apartment has a large open floor plan, exposed brick walls, beautiful hardwood floors, and 3 skylights which give plenty of natural light in the living room and kitchen areas. This unit includes all stainless appliances: Refrigerator, Dishwasher, Stove, Microwave and has Washer and Dryer in the unit as well. Kitchen has very nice upgraded cabinets with granite counters. There is access to your own outside terrace. Steps away from all the action. Comes with use of fitness facility. Outside your door you will find El Vez, Tiki Bar, Opa, Bru, McGillin's and many other local area favorites. Add this one to your must see list if wanting to live in Center City!\n104-106 S 13th St #5","num_images":10.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '6000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T09:51:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-art-museum-area-2bed-2bath\/7633558935.html","post_id":7633558935,"title":"Art Museum area  2bed 2bath large deck","description":"Newly renovated two bedroom with-Two full baths- Washer Dryer-Central Air-Dishwasher-Hardwood floors-Large Deck-Great Museum area Location-Convenient to everything Center City-Available August 1st possibly sooner-Please call Dave  show contact info","num_images":0.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', 'available aug 1', 'application fee details: $40', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:49:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500-security-deposit-for\/7633558676.html","post_id":7633558676,"title":"$500 security deposit for a limited time!!!","description":"$500 security deposit for a limited time!!! Located in the great Antique Row neighborhood, this newly renovated apartment has hardwood floors throughout, granite counter-tops, stainless steel appliances, subway tiled bathroom and washer and dryer in-unit. It's a great location. Pennsylvania Hospital and Thomas Jefferson University and Healthcare Center, among many other great facilities located nearby. Pictures are the actual unit.\n922 Pine St #2R","num_images":14.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '700ft2', 'available jul 17', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T09:48:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-studio-with\/7633558126.html","post_id":7633558126,"title":"Spacious studio with a private terrace boasting magnificent city views","description":"Spacious studio with a private terrace boasting magnificent city views at The Dorchester on Rittenhouse Square! Enter Unit 1915A into a sun-drenched open living area with floor-to-ceiling sliding glass doors that open to a private balcony perfect for relaxing with a good book or your morning cup of coffee. The open kitchen features stainless steel appliances, granite countertops and wood cabinetry. A large dressing area\/walk-in closet leads to the full bathroom offering a shower\/tub and single vanity. Rent includes a twenty-four hour doorman and all utilities, including basic cable. Use of the building’s state-of-the-art fitness center, seasonal rooftop pool club, and parking in the building’s underground garage are available for an additional fee, subject to availability. No pets.\n224-30 W Rittenhouse Sq #1915A","num_images":9.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '528ft2', 'available jul 14', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T09:47:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500-security-deposit\/7633557412.html","post_id":7633557412,"title":"$500 Security Deposit - Limited Time Move In Special!!!!","description":"$500 Security Deposit - Limited Time Move In Special!!!! The Society Hill Building is a beautiful mid-rise community located in the Society Hill\/Washington Square neighborhood of Center City. This building features spacious 1 bedroom 1 bath apartments, overlooking scenic Washington Square Park. The Society Hill Building is within walking distance of historic Old City as well as close to all forms of public transportation. 10 foot high ceilings, controlled access keypad entry, hardwood floors in some units, abundant natural light, dishwasher, microwave, high-efficiency individually controlled A\/C and heat. Laundry on each floor and pet-friendly! Brand new windows in all apartments. Pictures are of a similar unit.\n701 Sansom St #402","num_images":10.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '660ft2', 'available jul 18', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T09:45:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500-security-deposit\/7633556653.html","post_id":7633556653,"title":"$500 security deposit! Available early July!","description":"$500 security deposit! Available early July. Welcome to 222 Rittenhouse, an architecturally historic high-rise tower on Rittenhouse Square. Beautifully situated on the west side of the Square, 222 offers revered park side living in Center City s most sought after neighborhood at a terrific value. This handsome 1920 s building welcomes residents with a stunning double height lobby. Choose from luxury studios, one, two and three-bedroom apartments as well as penthouses in a variety of distinctive floor plans. The apartments have been recently renovated to include new kitchen cabinets, countertops, appliances, fixtures and flooring and restored tile bathrooms. Units have central air, in-unit laundry, dishwashers and great closets! Many apartments enjoy views of beautiful Rittenhouse Square and the skyline of Philadelphia. Residents enjoy 24-hour desk services, fitness facility, business lounge and 24 - hour maintenance. The biggest amenity 222 provides is the unbeatable LOCATION. A short walk to UPENN, Drexel University, Chop, Jefferson Hospital, 30th Street Station, central business district, Kimmel Center, Schuylkill River Park, high-end retail and Philadelphia's best bars, cafes, and restaurants. Just $500 Security Deposit and 1st month's rent to move-in! Pets allowed. Extra storage available. Bike storage on site.\n222 W Rittenhouse Sq #1004","num_images":10.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '350ft2', 'available jul 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T09:42:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-receive-months-rent-free\/7633556172.html","post_id":7633556172,"title":"RECEIVE 1 MONTH'S RENT FREE ON A 13 MONTH LEASE!","description":"FOR A LIMITED TIME: RECEIVE 1 MONTH'S RENT FREE ON A 13 MONTH LEASE, OR 2 MONTH'S RENT FREE ON A 18 MONTH LEASE! What a Wow@ the APARTMENTS at 23RD & CHERRY ST! Logan Square's NEWEST luxury rental building! This off the charts one bedroom, apartment with its own PRIVATE BALCONY boasts all open living and dining area. Kitchen with granite countertops, stainless steel appliances, and an ENORMOUS BREAKFAST BAR. Perfectly proportioned bedroom, and gracious tile bath, make this residence a perfect 10! With the best amenities, at your fingertips: state of the art gym w\/ Pelaton Cycles, lounge, amazing roof top deck, plus the roof top \" Bark Park\" and underground parking available. You will just LOVE living at The APARTMENTS AT 23RD & CHERRY. With instant access to the Schuylkill River Trail and just minutes from Penn, Chop Drexel and 30TH ST station.\n139-59 N 23rd St #229","num_images":9.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '742ft2', 'available jul 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:41:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-el-magnet-at\/7633555601.html","post_id":7633555601,"title":"Welcome to el Magnet at 1141 N Front Street!","description":"Welcome to el Magnet at 1141 N Front Street! This building is designed with modern touches and warm finishes. It features great amenities including a shared common roof deck with center city views, a bike room, elevator, and parking. The apartment features vinyl flooring throughout the unit with large windows for natural lighting. The kitchen is complemented with a quartz countertop and a beautiful backsplash that blends in perfectly with the white cabinets and makes the kitchen look very modern and clean. There is plenty of cabinet space and all the appliances you can ask for inside a unit including a microwave and an in-unit washer and dryer. With an awareness of the vibrant, surrounding neighborhood, the builder took great care to provide high-quality sound reducing windows and walls to provide a relaxing home environment. The building offers limited parking spots at an additional cost. About Fishtown and Northern Liberties: Located in the heart of Fishtown, just a half block off of Girard Ave and two blocks from Frankford Ave. 1141 N Front is walking distance of the best dining and entertainment around: The Fillmore, Fette Sau, Frankford Hall, Johnny Brenda's, Mulherin's, Sugarhouse, the Piazza at Schmidt's, and much more. Steps to public transit options - the Market-Frankford Line, the Girard trolley, and SEPTA buses as well as quick access to I-95 and Columbus Ave.\n1141 N Front St #606","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '500ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:39:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-check-out-this-huge\/7633554637.html","post_id":7633554637,"title":"Check out this huge townhome available for rent!","description":"Check out this huge townhome available for rent July 1st at The Arches. This upper corner, sun-filled unit boasts panoramic views from a spacious deck and GARAGE PARKING INCLUDED! Features include recessed lighting, a large living room with marble surround gas fireplace, a spacious kitchen with wood cabinetry, granite countertops & stainless steel appliances, wood flooring in separate a dining room, 3 roomy bedrooms with great closet space, upper floor laundry, updated modern baths, and a lower level space perfect for storage Minutes to all shopping, eateries, a block to Trader Joe's and steps away from the Schuylkill River Trail & multiple museums. All set in a private, elegant, courtyard. You will fall in love with beautiful Logan Square!\n2201-09 Arch St #101","num_images":13.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 2.5Ba', '1765ft2', 'available jul 3', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T09:36:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-outstanding-bedroom\/7633548820.html","post_id":7633548820,"title":"@!~Outstanding 2 bedroom apartment in West Chester~!!","description":"Spacious 2 bedroom and 1 bathroom detached home main floor for rent. Includes a personal front loading washer\/dryer and a beautiful fully renovated open concept kitchen! A lot of natural light, pot lights, and central air heating & cooling. Includes use of double car driveway (half available for main floor tenant). This property is a fully legal rental registered with the city of Pickering following a fire and electrical inspection.\nGreat locations in Biddle St, West Chester- Everything within 5 minutes! Hwy, walking distance to Downtown(10 minutes Drive to Chester County Hospital), restaurants and shopping Mall.\nAvailable July 1st. $800 ($800 per month plus 50% utilities at $150) which includes heating, electricity, and water. Does not include internet\/cable. Basement is rented to another tenant. You can send me a Number to discuss more details.","num_images":5.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:15:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-residence-nestled\/7633553374.html","post_id":7633553374,"title":"Charming residence nestled in the heart of Philadelphia!","description":"524 Lombard Street is a charming residence nestled in the heart of Philadelphia, Pennsylvania. Located in the historic neighborhood of Society Hill, this beautiful property offers a blend of timeless elegance and modern comfort. This three-story townhouse showcases a classic brick facade, reflecting the architectural character of the area. Upstairs, you will find the private quarters of the home. The master suite is a serene retreat, featuring a generous bedroom, a walk-in closet, and an en-suite bathroom designed with relaxation in mind. The additional bedrooms offer comfort and versatility, providing ample space for family members or guests.\n524 Lombard St #E","num_images":8.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2.5Ba', '1539ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T09:32:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-rehabbed-row-with\/7633551903.html","post_id":7633551903,"title":"Recently rehabbed Row with two car parking in Fishtown!","description":"Recently rehabbed Row with two car parking in Fishtown. This 3 bed 2.5 bath town house was rehabbed just over a year ago with hardwood floors, new kitchen and bathrooms. Lower level includes an attached garage that open into a finished lower level family room\/den\/office\/playroom with a powder room and a sliding door that leads to a very large maintenance free back yard\/patio. Second floor has an open floor plan with living\/dining area large brand new kitchen with ceramic tiles, new cabinets, granite countertops and stainless steel appliances. Behind the kitchen is the third bedroom that could be used as an office. Third floor has two nice sized bedrooms with a full bath with tub\/shower ceramic tiles and vanity with granite countertop. This property is one block from the corner Girard and Frankford Ave. right in the heart of Fishtown and its restaurants and shops. Found the corner from the Girard Trolley, Market-Frankfort Line. Easy access to I95. Blocks away from Northern Liberties, The Piazza, and Acme.\n1215 Crease St","num_images":15.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 1.5Ba', '3527ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T09:27:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-studio\/7633532507.html","post_id":7633532507,"title":"One bedroom studio apartment","description":"Newly renovated one bedroom studio apartment for rent. Full bathroom with washer dryer hookup. second floor, off Street parking, appliances included. Asking $475 per month, plus security. Text Me:  show contact info","num_images":3.0,"lat":40.0343,"lng":-75.1213,"attrs":"['1BR \/ 1Ba', '836ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:04:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-space-value-and\/7633550653.html","post_id":7633550653,"title":"Great space value and light in this fantastic value priced 2 bedroom!","description":"Great space value and light in this fantastic value priced 2 bedroom apartment in the heart of it all. Just minutes from Avenue of the Arts, Jefferson Hospital, Pennsylvania Hospital, and the Reading Terminal Market. Walking Score 110!\n201 S 13th St #301","num_images":8.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', 'available jul 28', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T09:22:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-affordable-bed-apartment\/7633550615.html","post_id":7633550615,"title":"Affordable 1-bed apartment in the heart of Rittenhouse Square!","description":"Location Location Location! Available 08\/1\/2023. 20th & Walnut - only a 2 min walk to Rittenhouse Square, bars, restaurants, shops, historic places & more! This building is perfectly situated close to all the best spots in Philly, major universities, highways & whatever you can imagine. 2010 Walnut St was built in 1860 and was originally owned by the Wilkinson Sword Blade family. In recent decades, Eberhardt's Antiques operated out of the first floor. Now it is your chance to rent this amazing, affordable 1-bed apartment in the heart of Rittenhouse Square! When you walk into the building, you will be amazed by the preserved historic details and gorgeous mirrors throughout the hallway. The building has a big shared rooftop with sublime views of the city! The apartment is located on the basement level of the building and has a small outdoor space! The details of the building will make every day walking in that hallway feel like a special occasion! The apartment can fit easily all of your furniture and you can comfortably host all of your friends and family. The bedroom has a spacious closet with an organizer, and space for a full\/queen bed, desk, dresser, and more. It has stainless steel appliances, a dishwasher, central AC & Heating, a beautiful bathroom, and an in-unit washer & dryer! The only con is that there is not much natural light. It will be professionally cleaned before the new tenant's move-in date. Water is included in the rent. Pets are ok with a pet deposit and under 50 pounds. Inquire about the video tour! First, and last & security to move in. 700+ credit score & 3x the rent income required to move in. No Airbnb arbitrage. Inquire about other units that we have available in this beautiful building!\n2010 Walnut St #B01","num_images":12.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '550ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:22:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-check-out-this-bi-level\/7633550576.html","post_id":7633550576,"title":"Check out this bi-level 3 Bedroom, 2-bathroom apartment!","description":"Available August 1st! Check out this bi-level 3 Bedroom, 2-bathroom apartment one block from Rittenhouse Square. As soon as you walk in you will see a coat closet and a smaller bedroom on the first floor of the apartment which has a full bathroom. Continue walking down the hall into the large open living room that is right off the of the kitchen. Walk up the stairs to two nice size bedrooms and a nice size bathroom in between the bedrooms. Throughout the apartment, you will find gorgeous hardwood floors. Pets are welcomed at no additional fee! The owner pays for cold and hot water. The tenant pays gas which includes heat and cooking, and electricity. A coin-operated washer and dryer are in the basement. You can get this perfect apartment in one of the most desirable walkable locations with easy access to public transportation and major routes\n1807 Spruce St #3F","num_images":12.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 2Ba', '4545ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T09:22:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enjoy-the-convenience-of\/7633550545.html","post_id":7633550545,"title":"Enjoy the convenience of luxury of Center City living!","description":"Enjoy the convenience of luxury of Center City living in this 1-Bedroom 1-Bathroom on the 18th floor of The Ellington! This spacious home offers wonderful light and city views from the oversized windows, an abundance of storage throughout the home, and an in-unit washer and dryer. You enter the home through a foyer with a hanging closet that leads you to the generous living\/dining room. The kitchen is outfitted with granite counters, stainless steel appliances, and an abundance of cabinet and counter space. The large bedroom offers a deep double closet and even more incredible city views. The bathroom is off the bedroom and offers a linen closet, tile floors, and a combination shower\/tub. 1-year lease is required. Tenant is responsible for electricity and internet\/cable TV. Tenant can have cats. Fees include a $300 move-in fee and $200 lease fee to the Ellington. The Ellington is a high-rise on the 1500 block of Chestnut St. The building offers a 24-hour door person and fitness center. All homes are wired for either Comcast or Verizon FiOS High-Speed Internet and Cable. Residents can have up to 2 pets that are under 40 lbs. Located in the heart of Center City, you’re close to everything you need: fabulous dining options such as Butcher & Singer, Marathon Grill, The Oyster House, Harp & Crown, Guiseppe's and Sons, and Elixr Coffee Roasters, only one block away from the incredible shopping Walnut St has to offer. Getting around the city couldn’t be easier as you are steps from a plethora of bus lines, the Broad Street Line subway, and Suburban Station. Please note- these photos are from a previous listing, the window treatments have been replaced with wooden blinds.\n1500 Chestnut St #18I","num_images":12.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '671ft2', 'available jul 25', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T09:22:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gracious-spacious-bedroom\/7633550505.html","post_id":7633550505,"title":"GRACIOUS & SPACIOUS 1 bedroom apartment!","description":"THIS GRACIOUS & SPACIOUS 1 bedroom apartment boasts beautiful WOOD floors, all open kitchen with plenty of cabinet, & counter space, and super large BREAKFAST BAR. Incredible natural SUN LIGHT! 1900 ARCH is truly a lifestyle building! 3000 sq ft state of the art GYM, amazing COMMUNITY ROOM, plus INCREDIBLE ROOF TOP DECK with outrageous views. Just minutes from RITTENHOUSE SQUARE, Penn & Drexel Universities, and some of the city's best restaurants, cafe's, and now just across the street from the new COMCAST Tower. PARKING available for additional cost. Photo's are of model unit.\n1900-20 Arch St #522","num_images":11.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '672ft2', 'available aug 18', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:22:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7633550150.html","post_id":7633550150,"title":"Pets Welcome, Lease Today, Quiet Community","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '789ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T09:21:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-one-and-two-bedroom\/7633545241.html","post_id":7633545241,"title":"Luxury one and two bedroom apartments in a fabulous location!","description":"Broad Street's finest! Luxury one and two bedroom apartments in a fabulous location! This courtyard level one bedroom features an open floor plan with oak hardwood flooring, an upgraded kitchen with stainless steel GE appliances, granite counter-tops, and beautiful cabinetry, Bosch washer and dryer in each unit, wall to wall windows with custom sun shades, 2 zone energy efficient heating and cooling systems. The building features a front desk attendant and will feature a brand new Fitness Center!! Located just steps away from Marc Vetri's Alla Spina and newly opened South Kitchen and Jazz Bar! Just 2 blocks from the Broad Street subway. SUPER pet friendly!! On site parking is available at 160 dollars per month. **Photos pictured are from the model unit with a similar floor plan.\n600 N Broad St #CY3","num_images":14.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '760ft2', 'available jul 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:03:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-receive-months-rent-free\/7633546559.html","post_id":7633546559,"title":"RECEIVE 1 MONTH'S RENT FREE ON A 13 MONTH LEASE!","description":"FOR A LIMITED TIME: RECEIVE 1 MONTH'S RENT FREE ON A 13 MONTH LEASE, OR 2 MONTH'S RENT FREE ON AN 18 MONTH LEASE! What a Wow@ the APARTMENTS at 23RD & CHERRY ST! Logan Square's NEWEST luxury rental building! This off the charts one bedroom, apartment with its own PRIVATE BALCONY boasts all open living and dining area. Kitchen with granite countertops, stainless steel appliances, and an ENORMOUS BREAKFAST BAR. Perfectly proportioned bedroom, and gracious tile bath, make this residence a perfect 10! With the best amenities, at your fingertips: state of the art gym w\/ Pelaton Cycles, lounge, amazing roof top deck, plus the roof top \" Bark Park\" and underground parking available. You will just LOVE living at The APARTMENTS AT 23RD & CHERRY. With instant access to the Schuylkill River Trail and just minutes from Penn, Chop Drexel and 30TH ST station.\n139-59 N 23rd St #428","num_images":15.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '500ft2', 'available sep 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:07:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-youll-never-want-to-leave\/7633545864.html","post_id":7633545864,"title":"You’ll never want to leave your neighborhood!","description":"This unit features an extra room which can be used as an office or an additional bedroom Welcome to your new home, 735 Spruce Street, located in the heart of Philadelphia’s charming and historic Washington Square West neighborhood. This apartment features tall ceilings, a spacious floor plan, plenty of storage space, and oversized windows. Washington Square houses a large collection of historic 18th and 19th-century residential architecture that offers you a glimpse into Philadelphia’s past. A charming district filled with cobblestone streets and brick structures, you will never tire of the wide array of dining, shopping, sightseeing, and museums. Local attractions include Washington Square Park (5-min walk) and Penn’s Landing (along the waterfront), while historic attractions include the Liberty Bell and Independence Hall. Whole Foods Market, ACME, and one of the most well-known restaurants in Philadelphia, Zahav, are all within walking distance of the Properties. With so many local amenities you’ll never want to leave your neighborhood! 735 Spruce is also immediately catty-corner to Pennsylvania Hospital, offering nurses, residents, doctors, and employees of the nearby institution immediate access to housing.\n735 Spruce St #4F","num_images":8.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:05:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-upscale\/7633544610.html","post_id":7633544610,"title":"Newly renovated upscale apartments!","description":"Available June 1st be the first to live at 623-625 Pine St, newly renovated upscale apartments in the highly sought-after Society Hill region of Philadelphia. One and Two Bedroom Floorplans are available now! Enjoy the classic factory-style windows, updated finishing, and modern island kitchens with a brand new stainless steel appliance suite. Your new apartment's oversized windows allow beams of light to flow through the space. Enjoy an open living space that also has large bedrooms. Additional Amenities Include: • In-Unit Stacked Washer-Dryer • Brand New Appliances (refrigerator, oven, microwave) • Brand New Custom Quartz Kitchen Countertop • Brand New Bathroom (Vanities, tiling, shower fixtures) • Completely transformed common areas • Oversized Windows It does not get better than this location, enjoy the historical sites of Philadelphia, and the renowned South St, and the surrounding area, with its eclectic restaurants, shops, and bars. $35 water fee ** Pictures of a similar unit\n623-25 Pine St #25-2R","num_images":10.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '600ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T09:01:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-bedroom-apartment\/7633544026.html","post_id":7633544026,"title":"Great 2 bedroom apartment available for rent!","description":"AKA 2302 Perot Street- Great 2 bedroom apartment available for rent in the heart of The Art Museum Area! Features include Central Air, Hardwood Floors, Eat-In Kitchen w\/Dishwasher, Common Area Deck, Coin Operated Washer\/Dryer In The Building. No Pets Allowed! There is a $50 application fee per applicant. First month's rent, last month's rent and one month's security deposit are due at lease signing. Owner is a licensed PA Realtor.\n706-8 N 23rd St #2","num_images":11.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', '3768ft2', 'available aug 1', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:59:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500-security-deposit\/7633543589.html","post_id":7633543589,"title":"$500 Security Deposit - Limited Time Move In Special!!!!","description":"$500 Security Deposit - Limited Time Move In Special!!!! The Society Hill Building is a beautiful mid-rise community located in the Society Hill\/Washington Square neighborhood of Center City. This property features spacious 1-bedroom units starting at $1350 and 2-bedroom apartments starting at $1895, many of which overlook scenic Washington Square Park. In addition, it is in close walking distance of historic Old City and all forms of public transportation. 10 foot high ceilings, controlled access keypad entry, hardwood floors in some units, abundant natural light, dishwasher, microwave, high-efficiency individually controlled A\/C and heat. Laundry on each floor and pet-friendly! Brand new windows in all apartments. Pictures are of a similar unit.\n701 Sansom St #606","num_images":12.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '1170ft2', 'available jul 18', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T08:57:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-bi-level-bedroom\/7633543183.html","post_id":7633543183,"title":"Charming bi-level 1-bedroom!","description":"Charming bi-level 1-bedroom featuring exposed brick walls and in-unit washer\/dryer.\n21 N 3rd St #4C","num_images":9.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '765ft2', 'available jul 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:55:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enormous-bedroom-bath\/7633542669.html","post_id":7633542669,"title":"Enormous 1 bedroom, 1 bath residence in The Victory Building!","description":"Enormous 1 bedroom, 1 bath residence, available in The Victory Building! ALL OPEN living and dining area! Kitchen with BREAKFAST BAR, plus additional room for a dining room table. Gracious bedroom with enormous walk-in closet, plus well-proportioned, all tile bathroom. Enjoy living in this beautiful second empire style building located at 10th and chestnut, DIRECTLY ACROSS FROM THOMAS JEFFERSON HOSPITAL! 24\/7 doorman building with a terrific gym.\n1001-13 Chestnut St #306W","num_images":7.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '713ft2', 'available aug 29', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:53:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500-security-deposit-and\/7633542170.html","post_id":7633542170,"title":"$500 Security Deposit and First-month rent to move in!!!","description":"$500 Security Deposit and First-month rent to move in!!! Antique Row Apartments are newly renovated buildings that feature Brand New Kitchens and Bathrooms, Granite Countertops, Hardwood Floors, and Stainless Steel Appliances. All apartments have Washer\/Dryer in-unit. Pictures are of a similar unit in the building.\n1114 Pine St #3R","num_images":8.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '600ft2', 'available aug 18', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T08:51:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-live-in-the-heart-of-old\/7633541689.html","post_id":7633541689,"title":"Live in the heart of Old City on Leafy Arch Street!","description":"Live in the heart of Old City on Leafy Arch Street! This lovely building boosts secure key entry, intercom, professional management, package storage, and an elevator. This sun-splashed 4th-floor unit is in the back of the building with westerly views of the City! The kitchen and living room are open with a breakfast bar, storage, dishwasher, refrigerator, microwave, large windows, and hardwood floors. The bedroom sits off the hallway with a bathroom ensuite. There is a floor trash shoot and paid washer\/dryer on the floor for your convenience. Rent includes water. Available now!\n315 Arch St #407","num_images":10.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '574ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T08:49:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bathrooms\/7633541294.html","post_id":7633541294,"title":"Newly renovated bathrooms with modern tile!","description":"This beautiful building is steps from Rittenhouse Square. No details has been spared in restoring this grand brownstone!! Enter into the grand foyer and feel the original old world charm of this breathtaking building. The restored unit is one of eight. The 1 bedroom, 1 bathroom apartment contains all the amenities and quality finishes usually reserved for new condominium restorations; but these are available for rent!! White Granite Counter tops, Solid Wood cabinetry, Stainless Steel Appliance, Newly renovated bathrooms with modern tile, original refinished hardwood floors throughout, central air ! Laundry Room in the building.\n2033 Spruce St #3","num_images":10.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '4243ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T08:47:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-come-see-what-all-the-buzz\/7633540838.html","post_id":7633540838,"title":"Come see what all the buzz is about at The Parkway House!","description":"Start the summer in this Philadelphia Chapter Landmark Property originally designed in 1951! Enter through the spacious remodeled lobby where you are greeted by a 24 hour front desk attendant. The property features a fitness center on the lower level along with common areas where you can relax and watch TV or catch up with friends with a game of pool. There's also a place to store your bike in the designated bike room. Looking for outdoor space? There's a roof deck that offers panoramic views of the city! The views are simply breathtaking! This large one bedroom has beautiful hardwood parquet floors and a view you will LOVE! The living area and bedrooms are spacious and have tons of closet space. SUPER Pet Friendly!! Come see what all the buzz is about at The Parkway House and everything that living in the Art Museum area has to offer!! ***Pictures featured are of the new model unit.***\n2201 Pennsylvania Ave #1016","num_images":15.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '650ft2', 'available aug 28', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T08:45:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-well-maintained-two\/7633536437.html","post_id":7633536437,"title":"Well maintained two bedroom one bath apartment!","description":"Well maintained two bedroom one bath apartment for rent in the blooming Fairmount\/Francisville neighborhood. Walking distance to restaurants, gym, supermarket and public transportation. The apartment features central air and heat, tile floor in the kitchen and bathroom and hardwood floor for the bedrooms. Coin operated washer and dryer in the common area. Schedule your showing today!\n1811 Fairmount Ave #2F","num_images":9.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', '4595ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:24:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-super-cute-and-filled-with\/7633536410.html","post_id":7633536410,"title":"Super cute and filled with charm studio apartment in the heart of MIDT","description":"Super cute and filled with charm studio apartment in the heart of MIDTOWN. This awesome space boasts all open living and dining area, and separate tile bath. Enjoy living in this ELEVATOR, DOORMAN building with NEW GYM. Just minutes from Avenue of the Arts, Jefferson Hospital, Pennsylvania Hospital, and the Reading Terminal Market. Walking Score 110!\n1229 Chestnut St #1006","num_images":10.0,"lat":39.9487,"lng":-75.1593,"attrs":"['0BR \/ 1Ba', '250ft2', 'available jul 3', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T08:24:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-for-sleek\/7633536382.html","post_id":7633536382,"title":"Newly renovated for a sleek modern look in an amazing neighborhood!","description":"Newly renovated for a sleek modern look in an amazing neighborhood. Hardwood floors and tiling throughout. Stainless steel appliances and a fenced in backyard. This property offers 3 large bedrooms 2 full baths and is bi-level with plenty of room. Close to Bar Hygge Fairmount Ave and all the great bars and restaurants in the area. This property won't last long! Come check it out today. . .one of the owners is a licensed Realtor...\n802 N 16th St #1","num_images":11.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2Ba', '2637ft2', 'available aug 4', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:24:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-plus-den\/7633536353.html","post_id":7633536353,"title":"One bedroom plus den\/office in the Reef Building at Waterfront Square!","description":"One bedroom plus den\/office in the Reef Building at Waterfront Square with a private balcony and storage unit. This unit boasts an updated kitchen and bathrooms, large closets, washer and dryer, and one parking space! Waterfront Square features a 24-hour concierge and a convenient shuttle service to Center City. The 25-meter indoor lap pool is an absolute dream come true with beautiful views of the bridge and river. There is also a spa, steam room, and sauna, and fitness center. HUGE 8' by 8\" Storage ROOM included! COMES WITH 1-car PARKING!\n901 N Penn St #F202","num_images":15.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 2Ba', '1052ft2', 'available jul 1', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:24:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-junior-one-bedroom-with\/7633536336.html","post_id":7633536336,"title":"Junior one bedroom with excellent closet space!","description":"Junior one bedroom with excellent closet space, sunset western views. Upgraded kitchen and bathroom. Academy House has a 24 hr desk person, 24 hr maintenance - Rent includes all utilities. Tenant to pay $69.05 per month for internet and cable. Gym and Association Pool included. Parking available at an extra charge. Photos are from previous tenancy.\n1420 Locust St #15H","num_images":12.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '624ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T08:24:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apartments-near\/7633531381.html","post_id":7633531381,"title":"Apartments near Rittenhouse Square Be a part of history!","description":"Offering Studio, 1 & 2 bedroom apartments. Center City Philadelphia Apartments near Rittenhouse Square Be a part of history! ICON mixes the beauty of the past with the modern amenities of today. Included on the National Register of Historic Places this incredible rental building soars to new heights, just like its iconic, ziggurat-topped peak. Looking for a downtown Philadelphia apartment near Rittenhouse Square? You've found it! ICON is the most exciting rental property to ever grace Rittenhouse Square. A quintessential example of the Art Deco exuberance that defined the 1920s and 30s, ICON's design is inspired by Art Deco's geometric shapes and today's streamlined lifestyle. With this historic luxury building, you can be within steps of all the fine dining, high-end retail and cultural offerings that Philadelphia has to offer. The most fashionable edifice of its day, ICON is as rich in history as it is in beauty. Opened in 1930, at the beginning of the Great Depression, the building's ground floor tenants included both Cunard's White Star Line and the United States Lines, and the esteemed Pew family maintained a pied-a-terre on the 25th Floor. Today, this history echoes throughout ICON, a building that is a rare architectural experience. The lobby is so stunning it will make you stop in your tracks, with its Art Deco-styled elevators, glazed black brick and grey porcelain flooring and a cast-bronze portal. And the residences feature the kind of classic fixtures, state-of-the-art appliances and iconic details that can only be found in a landmark building. Apartment amenities: Kitchen features include sleek high gloss white cabinets with soft close drawers and doors. Stainless steel appliances, including a glass top electric range and microwave. Glass-tile, kitchen backsplash. Quartz top kitchen island. Engineered hardwood flooring. Baths with sleek, high gloss cabinets and quartz countertops, glazed 12x12 porcelain tile. Air conditioning. Carpeting in bedrooms. Washer and dryer. Amazing views of Philadelphia. Enhanced Penthouse level finish on 23\/24 floors. Venetian medicine cabinet. Wheelchair Accessible Apartments Available. 2 inch wood window blinds. Community amenities: Sky Deck with 360 View, Includes Grilling Station and Outdoor Living Area with Fireplace. Wellness Floor Featuring a Yoga Studio, Cardio, Weights, TRX & Boxing . Private Dining Room with Fireplace and Serving Kitchen. Club Level with Kitchen, Billiards, Flat-Screen TVs and Large Screen. Media Room for Private Parties. Business Center with Computers, Printers, Conference Rooms with A\/V Capabilities. Media Room . Full Service Concierge. Parking Garage w\/ Valet Parking Option. Package Receiving. Pet Grooming Station. On Site Property Management. Elevator. Charging Stations for Electric Cars. Cold Storage for Grocery Delivery. 24 Hour Emergency Maintenance. Pets Welcome: $500 one-time fee. Max 2 pets per home. $35 \/ month pet rent. On-Site Green Drop Donation Box. ** Pricing and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n1616 Walnut St #1B-1011","num_images":15.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '633ft2', 'available aug 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T07:59:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-standard-of-apartment\/7633533874.html","post_id":7633533874,"title":"New standard of apartment living!","description":"\"The Residences at 1 Brown set a new standard of apartment living, seamlessly combining modern design, convenient amenities and an elevated level of service. Our light-filled, studio, one-, two and three-bedroom apartments offer waterfront views in the Northern Liberties neighborhood. You’ll love our brand-new rooftop deck, resort-style pool and on-site fitness center. With 1 Brown central to both Old City & City Center, you won't have to go far to reward yourself with top-tier shopping and entertainment. Schedule a tour to discover everything that life has to offer.\"\n1-33 Brown St #1221","num_images":12.0,"lat":39.966,"lng":-75.151,"attrs":"['0BR \/ 1Ba', '623ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:12:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-bedroom-bath\/7633533539.html","post_id":7633533539,"title":"Lovely 1 Bedroom, 1 Bath Apartment with Small Rear Deck!","description":"Lovely 1 Bedroom, 1 Bath Apartment with Small Rear Deck. Central A\/C, Unit includes, Washer & Dryer, Stainless steel appliances, Dish Washer, Microwave, freshly painted... Great location!\n648 South St #3FL","num_images":13.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '2364ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:10:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-on\/7633533241.html","post_id":7633533241,"title":"1 bedroom apartment on a lovely block of Green Street!","description":"1 bedroom apartment on a lovely block of Green Street. This spacious, sunny apartment has central A\/C, original random-width hardwood floors, beautiful moldings, huge south-facing windows with original shutters, high ceilings, plenty of storage and a great layout. Quiet building with a common courtyard in the back and secured storage lockers in the basement. Available August 8th. First month's, last month's and security deposit due prior to move-in.\n1713 Green St #2","num_images":9.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '620ft2', 'available aug 8', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:08:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-the-heart-of\/7633532923.html","post_id":7633532923,"title":"Welcome to the heart of Rittenhouse Square!","description":"Welcome to the heart of Rittenhouse Square! This beautiful 3 bedroom, 2 bathroom apartment is conveniently located in the heart of Center City, Philadelphia. Enter the historic bi-level apartment into the living and dining area which are both full of character. The living area features three large windows with beautiful molding, hardwood floors throughout, and a stunning tiled fireplace. The kitchen area includes a small island, stainless steel refrigerator, granite countertops, and lovely cabinetry. This first floor also features a large bedroom with natural light, closet space, hardwood floors, and a spacious full bathroom. The second floor offers two additional bedrooms and another full bath.\n1524 Pine St #4","num_images":14.0,"lat":39.9489,"lng":-75.1661,"attrs":"['3BR \/ 2Ba', '1400ft2', 'available aug 1', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:06:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gracious-sized-bedrooms\/7633532678.html","post_id":7633532678,"title":"Gracious sized bedrooms, big closets, and huge tile bath!","description":"THIS AMAZING 2 bedroom apartment, @ 33 S. LETITIA STREET, is a MUST SEE. THIS OLD CITY BOUTIQUE apartment building with a FANTASTIC NEW GYM and PRIVATE RESIDENT COURT YARD HAS IT ALL. Residence 201, boasts, an all open living and dining area. AWESOME CUSTOM kitchen w breakfast bar waterfall edge!!!! Gracious sized bedrooms, big closets, and huge tile bath w\/ glass shower door. Live in the heart of it ALL, and just minutes from Jefferson and Pennsylvania Hospital.\n33 Letitia St #403","num_images":10.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '621ft2', 'available jul 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T08:05:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-of-the-most-unique\/7633532184.html","post_id":7633532184,"title":"One of the most unique rental properties in all of Queen Village!","description":"Welcome to 608 S 3rd St - Unit #2, one of the most unique rental properties in all of Queen Village! This beautiful second floor unit is ready for rent immediately. This home has it all... plenty of space and closets, in unit washer\/dryer and Central A\/C! Enter the unit to be greeted by a large and bright open living room. Just off the living room is the front bedroom, with a large closet and two massive windows allowing natural light to pour in. The galley style kitchen has been updated with wood cabinets, newer stainless steel appliances, full size pantry closet, dishwasher & garbage disposal. Head past the kitchen to a stackable washer and dryer positioned just across from the full bathroom. The second bedroom at the back is complete with two large size closets, perfect for a guest room or home office. Convenient and exciting city living with Ox Coffee, Philly Bagels, Neighborhood Ramen, and Cry Baby Pasta just steps from your front door. Located upstairs from neighborhood staple Rockerhead Salon, with easy access to shopping, nightlife, and public transportation.\n608 South 3rd St #2","num_images":17.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T08:02:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-let-the-sunsets-be-your\/7633531797.html","post_id":7633531797,"title":"LET the SUNSETS be your permanent back drop!!!!!!!!!","description":"LET the SUNSETS be your permanent back drop!!!!!!!!! This ONE BEDROOM residence, at FRANKLIN TOWER, located at 16TH and RACE STREET is a must see!!! All open and spacious living and dining area, kitchen with STAINLESS steel appliances, breakfast bar, and CUSTOM cabinetry. The Bedroom is VERY spacious, with an all tile EUROPEAN style bathroom. There is nothing like FRANKLIN TOWER apartments, in all of Philadelphia!!! With amenities on EVERY FLOOR, Peloton Rooms, Yoga studios, Screening Rooms, Game Rooms, Lounges, and Gyms, as well as the ROOF TOP LOUNGE , with flat screen, grills, and fire place. A BASKETBALL COURT, and GARAGE PARKING. Parking available for additional cost. Photo's are of model unit.\n200 N 16th St #509","num_images":12.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '500ft2', 'available aug 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T08:01:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-bedroom-residence\/7633531105.html","post_id":7633531105,"title":"Charming 1-Bedroom Residence with a Spacious Rear Deck!","description":"Charming 1-Bedroom Residence with a Spacious Rear Deck in Philadelphia's Graduate Hospital Neighborhood. Welcome to your new home nestled in the vibrant and sought-after Graduate Hospital neighborhood of Philadelphia. This delightful 1-bedroom, 1-bathroom residence offers a comfortable and stylish living space, complete with modern amenities and convenient features. With its prime location, hardwood floors, central air conditioning, in-unit washer\/dryer, and ample storage space in the basement, this rental property presents an excellent opportunity for a comfortable and enjoyable urban lifestyle. Upon entering, you'll be greeted by the warm ambiance of the hardwood floors that run throughout the entire residence, lending an elegant touch to the space. The residence boasts a generous sized bedroom, each offering a peaceful sanctuary for rest and rejuvenation. The bedroom is thoughtfully designed with ample closet space, allowing you to keep your belongings neatly organized and easily accessible. The bathroom is tastefully designed and equipped with modern fixtures, ensuring comfort and convenience for all residents. One of the highlights of this remarkable property is the rear deck, providing the perfect outdoor oasis for relaxation and entertainment. Whether you're sipping your morning coffee, enjoying an al fresco meal, or soaking up the sun, this private deck is an ideal space to unwind and appreciate the beautiful weather. It offers ample room for outdoor furniture and potted plants, allowing you to personalize the space according to your preferences. Additional features of this residence include central air conditioning to keep you comfortable during hot summer days, laundry facilities conveniently located in the basement, and extra storage space for your seasonal items and belongings. Located in the highly desirable Graduate Hospital neighborhood, this residence offers the best of urban living. You'll be within close proximity to an array of restaurants, cafes, boutiques, and grocery stores. Enjoy a leisurely stroll or bike ride to the nearby Schuylkill River Trail, Rittenhouse Square, or the eclectic South Street district. The neighborhood also provides easy access to public transportation, making commuting to other parts of the city a breeze. Don't miss out on the opportunity to call this stunning Graduate Hospital residence your new home. Contact us today to schedule a showing and experience the charm and convenience of this wonderful rental property firsthand. Monthly Utility fees: Water $35\/mth 1 person, $50\/mth 2 people. Common area electric $15\/mth\n627 S 19th St #3","num_images":8.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '780ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T07:57:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this-beautiful\/7633530859.html","post_id":7633530859,"title":"Welcome to this beautiful home for rent in Fitlers Square!","description":"Welcome to this beautiful home for rent in Fitlers Square! Located near the Schuylkill River walking & bike path, Rittenhouse Square and University City, you will find no shortage of activities. This property is listed as a 3 bedroom 2.5 bathroom. The home is bright and spacious with a large living room area, separate dining room and an updated kitchen with stainless steel appliances with breakfast bar. The property features on-site garage gated parking, two exterior decks, central air and plenty of storage. Make an appointment today!\n212-24 S 24th St #P82","num_images":14.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 2.5Ba', '190ft2', 'available aug 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T07:55:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fantastic-large-two-bed\/7633530583.html","post_id":7633530583,"title":"Fantastic large two bed two bathroom bi level unit!","description":"Fantastic large two bed two bathroom bi level unit in boutique building. Location excellent, convenient to all Center City attractions, transportation, local restaurants and shopping. Roof top with soaring skyline views.\n400 Green Street #2","num_images":12.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '900ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T07:54:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500-security-deposit\/7633530226.html","post_id":7633530226,"title":"$500 SECURITY DEPOSIT - Limited Time Move In Special!!","description":"$500 SECURITY DEPOSIT - Limited Time Move In Special!! Welcome home! Spacious 2 bedroom\/1 bath. Washer and dryer in unit! Whether CHOP, HUP, Penn, or Drexel, Liberty View is the ideal location. Spectacular city views! Within blocks of prestigious Rittenhouse Square and Philadelphia public transportation, Liberty View is situated along vibrant, tree-lined South Street. Spacious apartment homes available in bi-level, patio, and balcony unit formats offer Center City living with comfortable outdoor space! Pictures are of the actual unit!\n2031 South St #121","num_images":13.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available jul 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T07:51:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charm-and-modern-two\/7633529594.html","post_id":7633529594,"title":"Charm and modern two bedroom apartments in Philadelphia!","description":"Looking for a luxury apartment in the heart of Philadelphia? A blend of vintage charm and modern comfort, The Franklin Residences offers one and two bedroom apartments in Philadelphia, PA, with an unparalleled lifestyle. Live in a historic building with contemporary amenities, centrally located in Washington Square West, offering the best of Philly footsteps from your front door. The Franklin Residences is an iconic high-rise in Philadelphia with a rich history that has been transformed into a luxury apartment community with unparalleled conveniences. Have the best of both worlds – historic charm and modern living in Center City, Philadelphia, apartments today! Formerly known as the Benjamin Franklin Hotel, the Franklin Residences transports you to a different time once you step inside. A grand lobby with soaring ceilings, dazzling chandeliers, and golden accents welcomes you home. This timeless design boasts contemporary comforts including a state-of-the-art fitness center and a brand new business lounge with flexible workspaces and private conference and meeting rooms. Our friendly, attentive team is at your service, providing concierge service 24 hours a day. Our luxury apartments in Philadelphia feature one and two-bedroom, spacious layouts. They boast expansive windows, 10-foot ceilings, and soundproof walls, large dining areas, washers and dryers, and come in a variety of finishes to fit your needs. Our community is also pet-friendly, and your furry companions will feel right at home with nearby green space and pet-themed resident events like Yappy Hours. The best of Philadelphia begins at our front door! Theaters, cultural landmarks, and endless sightseeing opportunities in the Historic District, world-class restaurants in Midtown Village, and the green spaces of Washington Square are only minutes away. Contact us for more details or schedule a tour today! ** Pricing & Availability subject to change on daily basis ** Photos are of model units **\n834 Chestnut St #1B-0730","num_images":10.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '621ft2', 'available jun 21', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T07:48:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-modern-apartment\/7633529285.html","post_id":7633529285,"title":"Bright Modern apartment ready for move in!","description":"Bright Modern apartment ready for move in! Washer \/ Dryer in unit! Welcome home to this amazing, clean and ultra-modern apartment. Hardwood floors throughout. Clean, sleek newer kitchen and bath. Steps to Rittenhouse Square and award winning restaurants. Easy access to everything you would need!\n261 S 17th St #4F","num_images":8.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '605ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T07:46:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath-unit\/7633528970.html","post_id":7633528970,"title":"Spacious 1 bedroom\/1 bath unit!","description":"$500 SECURITY DEPOSIT - Limited Time Move In Special!!! Spacious 1 bedroom\/1 bath unit! Freshly painted and cleaned, ready to move in. Hardwood floors and washer and dryer in unit! Located on the vibrant South Street and steps away from the South Street Bridge. Whether CHOP, HUP, Penn, or Drexel, Liberty View is the ideal location. Spectacular city views! Welcome home! Pictures are of the actual unit!\n2031 South St #118","num_images":13.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '775ft2', 'available aug 8', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T07:44:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bedroom-apartment\/7633528719.html","post_id":7633528719,"title":"Gorgeous 1 bedroom apartment!","description":"Gorgeous 1 bedroom apartment in the highly sought after Queen Village neighborhood with a private courtyard entrance! This apartment features a nicely appointed kitchen with stainless steel appliances, granite counter tops and white shaker cabinets. Additional features include in unit laundry, central HVAC and a ton of storage! Minutes to Famous 4th Street Deli, Jims Steaks, Whole Foods \/ ACME Market, coffee shops and more! Schedule you’re showing before this gem is gone!\n616 S 4th St #GROUNDREAR","num_images":8.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '650ft2', 'available aug 1', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T07:42:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-location-with\/7633528399.html","post_id":7633528399,"title":"Amazing location with unparalleled convenience!","description":"Amazing location with unparalleled convenience. 2 to 3 bedrooms, two full baths and roof deck.\n601 S 10th St","num_images":13.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '1185ft2', 'available aug 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T07:40:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-experience-all-of-center\/7633527985.html","post_id":7633527985,"title":"Experience all of Center City's Comforts at Riverloft Apartments!","description":"Experience all of Center City's Comforts at Riverloft Apartments. Let our 24-hour front desk attendant receive your guests, your deliveries, dry cleaning, or anything else you may need. Our high-rise apartment building also offers an on-site ATM and controlled access guest parking and garage parking for an additional fee. Relax in your loft-style apartment with 16-foot ceilings, 12-foot windows and stainless steel kitchen appliances. There are high-tech touches throughout Riverloft - tech bars with data and charging ports provide convenient pit stops, plus there is a tech lounge with pod seating, a gas fireplace and a Smart TV. Riverloft has free Wi-Fi in all common areas, and iPads are available for check-out at the tech bar. Work out in our 24-hour Resort-Style Fitness with state-of-the-art equipment featuring personal TVs and iPod jacks. There are also weight machines and free weights for a lower-impact workout. Located steps from Rittenhouse Square surrounded by world class dinning and shopping. Monthly rent amount varies based on move-in date and lease term, and prices subject to change on daily basis. Chestnut. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n2300 Walnut St #0B-622","num_images":10.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '658ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T07:38:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bedroom-apartment\/7633527208.html","post_id":7633527208,"title":"Gorgeous 1 bedroom apartment in Queen Village neighborhood!","description":"Gorgeous 1 bedroom apartment in the highly sought after Queen Village neighborhood! This apartment features a nicely appointed kitchen with stainless steel appliances, granite counter tops and white shaker cabinets. Additional features include in unit laundry, central HVAC and a ton of storage! Minutes to Famous 4th Street Deli, Jims Steaks, ACME Market, Hungry Pigeon, coffee shops and more! Video tour available!!\n616 S 4th St #2F","num_images":11.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '650ft2', 'available aug 1', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T07:33:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/audubon-newly-totally-renovated\/7633525474.html","post_id":7633525474,"title":"Newly totally renovated beautiful 3BD\/1.5BTH House for rent","description":"Newly totally renovated beautiful townhome with central air \/ gas heat & gas cooking. 2 Off-Street Parking spaces in rear Freshly painted -Open concept layout. Newly floored living & dining room. NEW Large kitchen with porcelain tile flooring, new range, dishwasher & microwave. Rear exit from kitchen. On the main level is a NEW powder room. Upstairs is a spacious master bedroom, which has double closets. 2 additional bedrooms. Hall bathroom was just renovated. Kitchen & Bathroom Pictures to come.","num_images":9.0,"lat":40.117328,"lng":-75.329885,"attrs":"['3BR \/ 1.5Ba', 'available now', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T07:21:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/hatboro-move-in-ready-3bd-3bth-house\/7633518292.html","post_id":7633518292,"title":"Move in Ready 3BD\/3BTH House for rent","description":"Move in Ready! This Toll Brothers end unit townhome is 5 years young. The Main level has an upgraded kitchen with large island, granite countertops and tile backsplash, 42\" cabinets and stainless steel appliances. The luxurious pre-engineered hardwood can be found through the main level and lower level. The spacious family room, dining area and powder room complete the main level. The third level comes with an owner's retreat that includes a spacious bedroom, walk-in closet and large bathroom. The other two bedrooms are generous sized and there's also a full bath as well as a second floor laundry room. The second floor carpet is brand new. The lower-level provides extra space for a living room, den or home office. This townhome is walking distance to local breweries, restaurants, and the SEPTA train station, which is a direct line to CC. This maintenance-free townhouse is close to the PA Turnpike, Route 611 and the Blue Route. Hatboro Station has a dog park and walking trails. Close to Pennypack Park with walking and hiking trails. Owner pay HOA fee.","num_images":23.0,"lat":40.1785,"lng":-75.1072,"attrs":"['3BR \/ 3Ba', 'available now', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T06:14:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/oreland-nice-well-maintained-2bd-1bth\/7633513371.html","post_id":7633513371,"title":"Nice & Well Maintained 2BD\/1BTH House for rent","description":"2 Bedroom\/1 Bathroom Apartment - Nice & Well Maintained! $1200 per month plus utilities This 1 bedroom, 1 bath, xxx square foot apartment is a well-maintained second-floor unit on a residential block in Glenside, PA, Upper Dublin Township. LOCATED NEAR: - 0.5 miles from North Hills train station on the Lansdale\/Doylestown line - 0.9 miles from Oreland train station on the Lansdale\/Doylestown line - 0.3 miles from Septa bus stop (Pennsylvania Avenue & Twining Road) - Located within close to gas station, convenience store (7-Eleven), Target, Abington Hospital, Willow Grove Mall, Wawa, grocery stores, etc. - Parks, fields, and playgrounds close by - Centrally located - 30 minutes from Center City Philadelphia; 25 minutes from King of Prussia - Located in award-winning Upper Dublin School District HIGHLIGHTS: - Quiet street provides ample on-street parking - Spacious, well-maintained, and clean - Lots of closet space - Laundry located in first floor utility room through exterior entrance - Dedicated storage area in the back utility room included in rent - Gas boiler baseboard heat - Electric water heater - Front deck (~7' x ~9') - Back deck (~8' x ~5')","num_images":21.0,"lat":40.114804,"lng":-75.173926,"attrs":"['2BR \/ 1Ba', 'available now', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T04:50:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-watch-the-planes-land\/7633513022.html","post_id":7633513022,"title":"WATCH THE PLANES LAND!","description":"FOR RENT AUGUST, 2023\nCENTER CITY ONE\n1326 SPUCE ST.\nLARGE 29TH FLOOR ONE BEDROOM\nBroad & Spruce\nCUSTOMIZED APARTMENT WITH\nSWEEPING EAST AND SOUTH VIEWS!\n29th floor views across the City as you watch the planes land.\nWatch fireworks from the stadiums at Center City’s very best location—Broad & Spruce close to everything Center City offers—Walk to Office District, Rittenhouse, Midtown Village\/Gayborhood, Society Hill, Passyunk and hundreds of restaurants + theater, fitness and shopping with instant access to all public transportation! 1 bedroom (approx. 800 square feet) with spacious living room PLUS dining area, custom kitchen and bath plus double pane bedroom windows for ultra-quiet and 2 balconies and built-out closets throughout.  Newly decorated hallways!\nTHIS IS A TOTALLY SMOKE-FREE BUILDING.\nAll contemporary amenities including D\/W, heavy-duty W\/D in your apartment, wall-to-wall carpet, ceramic tile in foyer, kitchen and bath; new central AC\/Heat (you control), generous closet space, specially sound-conditioned bedroom, PLUS an available and responsive landlord. INCLUDES 1-2 FULL PRIVILEGE GYM MEMBERSHIPS.\n(Rent includes cable, gas and heat.)\nPriced at only $2,150\/month to rent quickly to quality tenants.\n1-2 year lease (extended lease may be available).\nNo dogs and no smoking please; first, last and security deposit required. Ideal for a quiet, upscale professional or couple.\nAVAILABLE FOR AUGUST 15, 2023 OCCUPANCY.\nEmail or text\/call Rick (owner) at  show contact info\nfor immediate viewing.","num_images":14.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '800ft2', 'available aug 15', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T04:43:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/horsham-this-well-maintained-3bd-15bth\/7633510320.html","post_id":7633510320,"title":"This well maintained 3BD\/1.5BTH House for rent","description":"Nestled in a child friendly, quiet cul-de-sac is this well maintained 3 bedroom, 1.5 bath end unit townhome with a large fenced in yard, deck and 2 car private parking in the desirable Wynmere Hunt neighborhood of Horsham. The lower level has a large living room with a large box window extending into a formal dining room facing the side yard. The eat-in kitchen opens up to the rear yard with the large deck perfect for entertainment. Kitchen includes stainless steel dish drying rack, stainless steel cabinet racks, stainless steel microwave and natural gas range, dishwasher, and refrigerator. The utility room with laundry and a small pantry\/storage area, and a powder room completes the first floor. Upper level boasts of three bedrooms, and a full bathroom. The master bedroom has a walk-in closet, a vanity\/dressing area with private entrance to the bathroom. Closets include custom made closet-made organizers. A large custom made detached shed, an attached shed, and a full attic offers plenty of in-home storage opportunities. Located in the award-winning Hatboro Horsham School District (Simmons Elementary School), the home has easy access to major highways (309, 152, 611, and Turnpike) and shopping malls. It sits with-in a block of the famous Horsham Power Line trail with walking access to the Horsham Public Library and park system. Plenty of additional off street car parking is available. Tenant is responsible for rent and utilities (water, trash, electricity and gas).","num_images":19.0,"lat":40.190016,"lng":-75.170932,"attrs":"['3BR \/ 1.5Ba', 'available now', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T03:49:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/dresher-just-refinished-3bd-1bth-house\/7633507176.html","post_id":7633507176,"title":"Just refinished 3BD\/1BTH House for rent","description":"Live the farm life. Available August 1st for move in is a 2 to 3 bedroom 1 bath apartment in a Historic Mansion on a Beautiful Farm. The apartment is on the third floor with kitchen windows overlook the pastures with horses, sheep, lambs and camels! Lots of fun animals to play with. There is a cute outdoor patio and enclosed front porch. First month, Last month and one month security required. Back ground and credit check required. Hardwood floors just refinished!","num_images":16.0,"lat":40.1431,"lng":-75.1624,"attrs":"['3BR \/ 1Ba', 'available now', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T02:56:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-sunny-bed-bath\/7633504551.html","post_id":7633504551,"title":"BRIGHT & SUNNY 2 BED 1 BATH APARTMENT +NEAR TUFTS UNIVERSITY","description":"Bright & Sunny 2nd Floor Apartment located near public transportation, Commuter Rail and Tufts University. Apartment amenities: 2 Large Bedrooms, 1 Full Bathroom, eat in Kitchen w walk in pantry, gas stove, dishwasher, disposal and electric dryer hookup. Dining room is open to the Living Room great for entertaining. Dining room w built in China cabinet, the gleaming hardwood floors throughout add warmth as well as a feeling of home.","num_images":3.0,"lat":39.950633,"lng":-75.144592,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T02:17:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fairly-new-bed-bath\/7633483782.html","post_id":7633483782,"title":"FAIRLY NEW 3-BED, 3-BATH APARTMENT, $2100, NEAR DREXEL AND UPENN, AVAI","description":"Our properties in University City Philadelphia are conveniently located within walking distance to University of Pennsylvania, Drexel University; public transportations, including Drexel-Penn Bus transport; restaurants, coffee shops, grocery stores, shopping, entertainment, parks, and more. Downtown Philadelphia, Museums, and King of Prussia are minutes away by public transport or private car. The properties are newly constructed, affordable, and located in a safe and secure neighborhood. They are within the University City District patrol area, and our tenants can take advantage of walking escorts and other services such as vehicle lock-outs and jumpstarts. The buildings have security cameras and the units have smoke detectors, security alarm, fire alarms, indoor sprinklers, doorbell with camera with intercom, hardwood floors, in-unit washer and dryer, and central AC. We understand our tenants’ needs and so we provide the convenience of the tenant portal system, e-leasing, and subletting\/lease transfer for those who cannot stay due to Drexel co-op. Our staff make frequent rounds and we respond to tenant requests within 24-72 hours.\nLocations:\n3716 Haverford Ave (2 units left, both units are identical)\nVideo tour:\nHaverford apartments: https:\/\/youtu.be\/dXJSY_vDm84\nBelow are some of the features:\n– keyless entry\n– central AC\n– energy-efficient appliances\n– in-unit washer and dryer\n– doorbell with camera and intercom\n– fire alarms\n– indoor sprinklers (in case of fire)\n– recessed lighting\n– security alarm\n– security cameras\n– shared courtyard\n– landlord pays for private trash collection\n– tenant portal\n– e-leasing\n– easy online application, $50 per applicant\n– free tours\n– no move-in fees\nRent:\nRent is $2100\nPets:\nCats (max 2) or small dog (max 1, 25-lb limit) are allowed.\n","num_images":8.0,"lat":39.963547,"lng":-75.196194,"attrs":"['3BR \/ 3Ba', '820ft2', 'flat', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-16T23:21:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-updateded-2br-15\/7633483384.html","post_id":7633483384,"title":"⭐ Newly Updateded 2BR\/1.5 BATH in the NORTHEAST near Franklin Mills -","description":"Property Address\n3333 Comly Rd – Unit 42 | Philadelphia, Pa 19154\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT! ⭐⭐⭐⭐⭐\n✔️Newly Updated 2 Bedroom & 1 1\/2 bath Condominium\n✔️Bi-level apartment\n✔️Spacious bedrooms\n✔️Large Living room\n✔️Generously sized dining area\n✔️Updated kitchen\n✔️Updated Microwave, new fridge, and Washer\/Dryer hook up\n✔️Newer water-resistant laminate (living room\/dining area\/kitchen)\n✔️Ceiling Fans throughout\n✔️Laminate flooring\n✔️Lots of closet space\n✔️Central heat\n✔️Designer paint throughout\n✔️Spacious patio for entertainment\n✔️Easy access to and from the city\n✔️Easy access to public transportation\n✔️Conveniently located close to major routes\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for all utilities and water fee\nBuild your credit! We report rent payments to Experian!\nAmenities\ncable ready\nall-electric\nopen layout\nconveniently located\nSize\nBeds\/Baths: 2 BD\/1 BA\nSquare Feet: Apx. 900\nRental Terms\nRent: $1800.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3600.00\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** Do not give anyone cash, we do not collect deposits, rents, or application fees at properties\n*** The property is under video\/audio surveillance. All footage stored off-site and may be made public. By entering the property you agree to be filmed.\n","num_images":12.0,"lat":40.08825,"lng":-74.982121,"attrs":"['2BR \/ 1.5Ba', '900ft2', 'cottage\/cabin', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-16T23:19:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7633480794.html","post_id":7633480794,"title":"SPACIOUS 1 BEDROOM & 1 BATH LOCATED IN WEST OAK LANE!","description":"Property Address\n1526 W Grange Ave – 1F | Philadelphia, Pa 19141\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ UPDATED, 1 BEDROOM & 1 BATH APARTMENT LOCATED IN GARDEN COURT OF WEST OAK LANE\n✔️ OPEN LAYOUT\n✔️ SPACIOUS KITCHEN\n✔️ SPACIOUS BEDROOM\n✔️ LAMINATE FLOORING\n✔️ LARGE CLOSETS\n✔️ LOTS OF NATURAL LIGHT\n✔️ ALL-ELECTRIC\n✔️ CUSTOM BATHROOM TILES\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!!\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\nAmenities\ncable ready\nall-electric\nopen layout\nconveniently located\nSize\nBeds\/Baths: 1 BD\/1 BA\nSquare Feet: Apx. 675\nRental Terms\nRent: $900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,800.00\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** Do not give anyone cash, we do not collect deposits, rents, or application fees at properties\n*** The property is under video\/audio surveillance. All footage stored off-site and may be made public. By entering the property you agree to be filmed.\n","num_images":6.0,"lat":40.041456,"lng":-75.146421,"attrs":"['1BR \/ 1Ba', '675ft2', 'flat', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-06-16T23:05:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-8831-danbury\/7633471757.html","post_id":7633471757,"title":"Welcome to 8831 Danbury Street!","description":"Welcome to 8831 Danbury Street! This well-maintained, twin house is a great find, boasting a range of desirable features and a great location. Situated on a spacious lot, this property offers a large yard, a garage, and a finished basement, providing ample space for all your needs.  As you enter the home, you will be greeted by a spacious living room that leads into the updated kitchen and dining area. The kitchen features cherry wood cabinets that exude elegance and provide plenty of storage space, while the mosaic back splash adds a touch of sophistication. The granite counter tops offer a sleek and durable surface, perfect for meal preparation or entertaining guests. The stainless-steel appliances complete the modern look and ensure a seamless cooking experience.  The updated bathroom features floor-to-ceiling tile, updated vanity, sink, and lighting. Whether you're getting ready for the day or unwinding in the evening, this space provides a tranquil retreat.  Throughout the home, you'll find Pergo flooring that not only adds a touch of warmth but also offers durability and easy maintenance. The recessed lighting illuminates the rooms, creating a bright and inviting atmosphere.  Location-wise, you can’t miss. Situated in close proximity to Pennypack Park, you'll have nature at your doorstep, perfect for outdoor enthusiasts or those seeking a peaceful escape. Additionally, you'll enjoy the convenience of being near a shopping mall, a variety of restaurants, major roads, and public transportation, making commuting and running errands a breeze.  Don't miss out on the opportunity to make this great property your new home. Schedule a showing today and experience the perfect combination of comfort, style, and convenience at 8831 Danbury Street.","num_images":10.0,"lat":40.065033,"lng":-75.03191,"attrs":"['2BR \/ 2Ba', '940ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-16T22:17:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-mt-airy-bed-15-bath-house\/7633707194.html","post_id":7633707194,"title":"MT. AIRY 3 BED 1.5 BATH HOUSE, CENTRAL AIR, OFF STREET PARKING & MORE","description":"6766 Germantown Ave – 3 bed 1.5 bath house  - H\/W floors, Central Air, in unit W\/D & off-street parking! $1995\/month -  AVAILABLE AUGUST 1\nCome see why so many people are calling Mt. Airy home! Located on Germantown Ave. within walking distance from Lovett Park and all points Mt. Airy. Head down the street for dinner at McMenamin’s or Earth & Bready Brewery, or hop into town for a night.\nLovingly maintained 3-bedroom 1.5 bath house with off street parking and more! Open floor plan in your living and dining area with hardwood flooring. Excellent light pours into the updated kitchen with new tile flooring, stainless steel microwave, dishwasher and oven.\nConvenient half bath off the living space with newly installed vanity. Second floor features three spacious bedrooms with generous closet space, and a full three-piece bathroom.\nDon’t forget your very own WASHER & DRYER! Laundry is a breeze!! CENTRAL AIR! Keeping you cool during those hot HUMID summer days!\nFeaturing:\n3 bedrooms\n1.5 bath\nStove\nDishwasher\nFull sized refrigerator\nMicrowave\nWasher & dryer\nCentral Air\nOff-street parking\nFull basement storage\nAND MORE!","num_images":12.0,"lat":40.053966,"lng":-75.186516,"attrs":"['3BR \/ 1.5Ba', 'available aug 1', 'air conditioning', 'application fee details: $50.00 per application', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T15:41:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-listed-bed-bath\/7633707176.html","post_id":7633707176,"title":"JUST LISTED! 1 BED 1 BATH GERMANTOWN APT, NEW KITCHEN, PARKING & MORE!","description":"4908 Germantown Ave #12: 1 bed 1 bath apt; gas stove, refrigerator & off street parking AVAILABLE NOW - $795\/MONTH\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co. or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nStep down into an awesome, recently updated, spacious 1 bedroom 1 bathroom apartment. Brand new kitchen appliances including: gas stove\/oven, refrigerator & backsplash. Brand new flooring throughout and a recently updated bathroom tub, tile & vanity. Bedroom features storage and closet space. Large living are with additional closet storage.\nOFF STREET PARKING INLCUDED!\nFeaturing:\n1 bedroom\n1 bathroom\nGas stove\nRefrigerator\nTile floor\nOff Street parking\n& MORE!","num_images":8.0,"lat":40.028245,"lng":-75.162125,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'application fee details: $50.00 per application', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T15:41:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-listed-charming-3rd\/7633707165.html","post_id":7633707165,"title":"JUST LISTED! CHARMING  3RD FLOOR 1 BED 1 BATH APT. H\/W FLOORS","description":"AVAILABLE NOW! 4908 Germantown Ave #9 – Charming 3rd floor 1 bed 1 bath apt with h\/w floors and MORE!   AVAILABLE NOW! $1025\/MONTH\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co. or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nWell maintained, third floor walk up, 1 bedroom 1 bathroom third floor walk up apt. Nicely maintained hardwood floors in living and bedroom space. Decommissioned fireplaces giving you a ton of character and charm. Bright 3 – piece bathroom featuring tub, vanity & toilet.\nBOOK YOUR APPOINTMENT NOW!\nOFF STREET PARKING INCLUDED!\nFEATURING:\n-1 bedroom\n-1 bathroom\n-hardwood floors\n-stove\n-refrigerator\n-and MORE!","num_images":14.0,"lat":40.028245,"lng":-75.162125,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'application fee details: $50.00 per application', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T15:41:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-excellence-in-living\/7633707027.html","post_id":7633707027,"title":"Excellence in Living","description":"Apt. 5114 — Ascott floor plan — 1,230 sq. ft. — $3,000\nThis 1st floor corner-unit apartment has so much to offer! Our brand-new construction includes white quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This Ascott also features spacious walk-in closets with custom shelving and ample living\/dining room space. This beautiful apartment home is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":24.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1230ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T15:40:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-excellence-in-living\/7633706074.html","post_id":7633706074,"title":"Excellence in Living","description":"Apt. 5114 — Ascott floor plan — 1,230 sq. ft. — $3,000\nThis 1st floor corner-unit apartment has so much to offer! Our brand-new construction includes white quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This Ascott also features spacious walk-in closets with custom shelving and ample living\/dining room space. This beautiful apartment home is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":23.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1230ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T15:38:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedroom-886-23rd-st\/7633696022.html","post_id":7633696022,"title":"Two bedroom ( 886 n 23rd st)","description":"Lovely two bedroom apartment located in one of the best neighborhoods in Philadelphia that is walking distance or has public transportation to Philadelphia's great attractions like Center city, Museums, University's, Restaurant's, Whole foods, CVS, Pizza shop, the famous Rocky steps Fairmount park and Kelly drive that great for biking, running and walking. This is a 1st floor apartment that is newly renovated kitchen with stainless steel appliances including dishwasher, microwave, granite countertops, hardwood floors throughout the whole apartment.","num_images":0.0,"lat":39.9675,"lng":-75.1731,"attrs":"['2BR \/ 1Ba', '1100ft2', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T15:14:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-picnic-area-west-chester\/7633701873.html","post_id":7633701873,"title":"Picnic Area, West Chester PA, 3\/BD","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Gas FireplacesPicnic AreaCable ReadyNewly Renovated InteriorsState-of-the-Art Fitness CenterOnline Payments AvailableSerene Wooded ViewAir ConditioningWireless & High Speed Internet Access9' Ceilings w\/ Crown MoldingExclusive & Newly Renovated ClubhouseDog ParkCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/jmftrcmb\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['3BR \/ 2Ba', '1394ft2', 'available now', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T15:28:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-bd-ba-situated-in-west\/7633699778.html","post_id":7633699778,"title":"2\/bd 2\/ba, Situated in West Chester!, High Speed Internet Access","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Gas FireplacesOversized ClosetsDishwasherExclusive & Newly Renovated ClubhouseIndividual Intrusion AlarmsOnline Payments AvailableCeiling FansDisability AccessPicnic AreaFull Size Washer and Dryer in All UnitsCable\/Satellite TV9' Ceilings w\/ Crown MoldingCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/7u5smn26\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1271ft2', 'available now', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T15:23:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-extra-storage-bd-ba\/7633694939.html","post_id":7633694939,"title":"Extra Storage, 2\/bd 2\/ba, Situated in West Chester!","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:PlaygroundCable\/Satellite TVCar Wash AreaExclusive & Newly Renovated ClubhousePicnic AreaFull Size Washer and Dryer in All UnitsIndividual Intrusion AlarmsSerene Wooded ViewBuilt-in Microwave OvensOversized ClosetsExtra StorageCable ReadyCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/abajufq6\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1124ft2', 'available now', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T15:12:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-serene-wooded-view-car\/7633692674.html","post_id":7633692674,"title":"Serene Wooded View, Car Wash Area, Air Conditioning","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Cable\/Satellite TV9' Ceilings w\/ Crown MoldingDog ParkPicnic AreaBuilt-in Microwave OvensCable ReadyAir ConditioningWireless & High Speed Internet AccessState-of-the-Art Fitness CenterCeiling FansOnline Payments AvailableOversized ClosetsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/ivnnsxwf\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1124ft2', 'available now', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T15:07:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-cable-ready-car-wash-area\/7633690928.html","post_id":7633690928,"title":"Cable Ready, Car Wash Area, Newly Renovated Interiors","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Dog ParkCable\/Satellite TVNewly Renovated InteriorsSpeakeasy Wine RoomCeiling FansOversized ClosetsPlaygroundWireless & High Speed Internet AccessExecutive Business Center9' Ceilings w\/ Crown MoldingIndividual Intrusion AlarmsDisability AccessCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/6vioe22m\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 1Ba', '926ft2', 'available jul 6', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T15:03:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-cable-ready-bd-ba-in-west\/7633687609.html","post_id":7633687609,"title":"Cable Ready, 2\/BD 1\/BA, in West Chester PA","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Private Patio or BalconyResort-Style Swimming PoolHigh Speed Internet AccessSpeakeasy Wine RoomDishwasherSerene Wooded View9' Ceilings w\/ Crown MoldingCable\/Satellite TVCable ReadyOversized ClosetsAir ConditioningIndividual Intrusion AlarmsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/nscac3tx\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 1Ba', '926ft2', 'available now', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T14:55:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-pool-free-parking-d-pet\/7633679568.html","post_id":7633679568,"title":"Pool, Free Parking, W\/D, Pet Friendly, Elevator BLDG","description":"Apartment 937 is a Brand New Luxury 1 Bedroom with stainless steel appliances, breakfast bar, washer\/dryer in unit. Plush carpeting throughout and gets great daylight too! Make this your new apartment home today!\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nElevator Building\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Gian, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\n*Pricing and availability subject to change*\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-6pm | S, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!\n","num_images":6.0,"lat":39.966575,"lng":-75.604026,"attrs":"['1BR \/ 1Ba', '731ft2', 'available now', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T14:36:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-bd-ba-situated-in-west\/7633684870.html","post_id":7633684870,"title":"1\/BD 1\/BA, Situated in West Chester!, Garages","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Executive Business CenterOversized ClosetsResort-Style Swimming PoolAir ConditioningCeiling FansNewly Renovated InteriorsIndividual Intrusion AlarmsExclusive & Newly Renovated ClubhouseSerene Wooded ViewBuilt-in Microwave OvensCar Wash AreaDishwasherCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/k6kgx5f4\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['1BR \/ 1Ba', '836ft2', 'available now', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T14:48:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-dishwasher-cable-satellite\/7633682951.html","post_id":7633682951,"title":"Dishwasher, Cable\/Satellite TV, Dog Park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Built-in Microwave OvensSpeakeasy Wine RoomResort-Style Swimming PoolDog ParkCable ReadyCable\/Satellite TVFull Size Washer and Dryer in All UnitsPicnic AreaNewly Renovated InteriorsState-of-the-Art Fitness CenterExclusive & Newly Renovated ClubhouseGas FireplacesCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/f3pplvi6\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['1BR \/ 1Ba', '836ft2', 'available now', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T14:44:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/move-in-now-onsite-bike-storage-pet\/7633681588.html","post_id":7633681588,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-bed-cable-ready-speakeasy\/7633680267.html","post_id":7633680267,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-air-conditioning-private\/7633678401.html","post_id":7633678401,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-bd-dishwasher-full-size\/7633677689.html","post_id":7633677689,"title":"2\/BD, Dishwasher, Full Size Washer and Dryer in All Units","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Oversized ClosetsGas FireplacesSpeakeasy Wine RoomDishwasherCable\/Satellite TVFull Size Washer and Dryer in All UnitsWireless & High Speed Internet AccessCar Wash AreaPicnic AreaDisability AccessExclusive & Newly Renovated Clubhouse9' Ceilings w\/ Crown MoldingCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/og6rotkv\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1271ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T14:32:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-in-west-chester-pa-picnic\/7633677289.html","post_id":7633677289,"title":"in West Chester PA, Picnic Area, 1 Bed","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Dog ParkPrivate Patio or BalconyFull Size Washer and Dryer in All UnitsGas FireplacesIndividual Intrusion AlarmsSpeakeasy Wine RoomSerene Wooded ViewGaragesHigh Speed Internet AccessWireless & High Speed Internet AccessExtra StorageNewly Renovated InteriorsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/ycr6ll4x\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['1BR \/ 1Ba', '836ft2', 'available now', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T14:31:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-bd-extra-storage-private\/7633676895.html","post_id":7633676895,"title":"1\/BD, Extra Storage, Private Patio or Balcony","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:9' Ceilings w\/ Crown MoldingCar Wash AreaExtra StorageResort-Style Swimming PoolPrivate Patio or BalconyCable\/Satellite TVGas FireplacesGaragesIndividual Intrusion AlarmsDisability AccessSpeakeasy Wine RoomOnline Payments AvailableCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/nptswspx\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['1BR \/ 1Ba', '836ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T14:30:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-animal-lover-this-is-the\/7633673123.html","post_id":7633673123,"title":"Animal lover? This is the purrfect place for you! We are pet friendly!","description":"Millview ApartmentsVisit Our Community Today!100 Cobblestone Dr Coatesville, PA 19320  show contact info\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.\nComplete with a resort-style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Bedrooms: 2 |  Bathrooms:  2  Square Footage: 1088 sq ft Rental Pricing: $1746 - $2322\/Month  Our Residents Enjoy:  ❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral Bonuses This Unit Comes With: ❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In ClosetsWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ Phone-Number:  show contact info\nPet-Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Lease-Length: VariableCall for Directions  EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":11.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'available jul 15', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T14:21:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-spacious-bedroom-floorplans\/7633672085.html","post_id":7633672085,"title":"Spacious 2 Bedroom floorplans! Come see our great community!","description":"Welcome to Millview Apartments Rental Information  Pricing: $1742 - $2363\/Month | 2 Bedroom 2 Bath | 1178 sq ftLease Term: Variable show contact info\nApartment Amenities   − Built-In Microwave− Central Heat & Air Conditioning− Disability Access In Select Units− Dishwasher− Full-Size Washer & Dryer In Every Apartment− Mini Blinds On All Windows− Refrigerator\/Freezer With Ice Maker− Walk-In ClosetsCommunity Features  − Business Center− On-Site Leasing Office− Pet-Friendly− Private Garages In Select Units− 24-Hour Emergency Maintenance− Coffee Bar Clubhouse Kitchen− Resident Referral BonusesAbout CommunityDescription: Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.  Location: 100 Cobblestone Dr  Coatesville, PA 19320  show contact info\nOffice Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMAdditional InformationPet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. Website: https:\/\/www.apartmentsincoatesvillepa.com\/EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available jun 24', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T14:19:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-junior-newer-kitchen\/7633671925.html","post_id":7633671925,"title":"Junior\/ Newer Kitchen\/ Stainless Appl\/ Near Parking\/Close To Courtyard","description":"RENT PERIOD: YEARLY\nAsk about apartment home 117 on the first floor, available soon!! This is a junior 1 bedroom. Short term leases not available.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday 9:00 am-6:00 pm and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":11.0,"lat":40.053166,"lng":-75.236179,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T14:19:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-this-771-sq-ft-bed-bath-is\/7633671407.html","post_id":7633671407,"title":"This 771 sq ft 1 bed, 1 bath is impressive!","description":"Millview ApartmentsLocated at: 100 Cobblestone Dr Coatesville, PA 19320Featured unit: 1 bed | 1 bath | 771 sq ft Prices start at: $1352 - $1812\/month Call Today!  show contact info\nNestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!Wonderful Amenities!✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral BonusesApartment Features!✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In Closets  show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.EQUAL HOUSING OPPORTUNITY27A7057C58A14CE\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '771ft2', 'available jul 29', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T14:18:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7633667159.html","post_id":7633667159,"title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nApartment Features\n* Stainless Steel Appliances\n* Walk-in Closet\n* Washer and Dryer in unit\n* Linen Closet\n* Kitchen Island\n* Private Patio or Private Balcony (on select apartments)\n* Garden Tub","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T14:08:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-1000sqft\/7633661787.html","post_id":7633661787,"title":"\"Newly Renovated 1000sqft. Apartment\"","description":"Brownstone \"1000sqft.\" Newly Renovated Apartment\n1\/Bedroom, Living\/rm., Huge Kitchen, Large Bath\/rm,\nNew Appliances, A\/C., Washer\/Dryer, Closet Spaces,\nHigh Ceilings, Storage space, N\/pets.,  show contact info\nPlease leave message return all calls within 15\/min.,\nShowing 7\/days a wk. [Open House] all day Sat\/Sun.\nBella Vista\/Wash Sq.\/Queen Village area.\n","num_images":0.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '1000ft2', 'available now', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T13:57:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-ss-appl-pool-free\/7633666604.html","post_id":7633666604,"title":"SS APPL, Pool, Free Parking,Elevator BLDG,Pet Friendly","description":"Apartment Home 330 is an updated 1 Bedroom with stainless steel appliances, breakfast bar, washer\/dryer in unit. Plush carpeting throughout and gets great daylight too! Make this your new apartment home today!\n**Pricing subject to change daily**\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nElevator Building\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Giant, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-6pm | S, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!\n","num_images":10.0,"lat":39.966575,"lng":-75.604026,"attrs":"['1BR \/ 1Ba', '731ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T14:07:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-pets-allow-bedroom\/7633666591.html","post_id":7633666591,"title":"^^Pets Allow* 2 Bedroom 2 Bathroom in Philadelphia","description":"Terrific Townhome right off of North College Drive! 2 Bedroom 2 Bathroom, pet friendly that backs to open space near Fort Lewis College! All utilities included in the dog friendly home! Call Renee at Harmony Real Estate for a showing today!\n~~If you are interested please, Send NUMBER & EMAIL~~\n","num_images":6.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T14:07:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-renovated-kitchen-pool\/7633662095.html","post_id":7633662095,"title":"Renovated Kitchen, Pool, Free Parking, W\/D, Pet Friendly","description":"Apartment 822 is a Brand New Luxury 1 Bedroom with stainless steel appliances, breakfast bar, washer\/dryer in unit. Plush carpeting throughout and gets great daylight too! Make this your new apartment home today!\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nElevator Building\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Gian, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\n*Pricing and availability subject to change*\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-6pm | S, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!\n","num_images":7.0,"lat":39.966575,"lng":-75.604026,"attrs":"['1BR \/ 1Ba', '731ft2', 'available now', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T13:58:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stainless-appl-large\/7633661113.html","post_id":7633661113,"title":"Stainless Appl\/ Large Windows\/ Great Closet Space\/ Pool\/Gym\/BBQ Grills","description":"RENT PERIOD: YEARLY\nAsk about apartment home 258 on the second floor, available now!! Short term leases not available.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday 9:00 am-6:00 pm and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":12.0,"lat":40.053166,"lng":-75.236179,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T13:56:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7633660624.html","post_id":7633660624,"title":"Private Balcony, Quiet Community, Move In Now","description":"Discover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Garden Tub\n* Linen Closet\n* Private Patio or Private Balcony (on select apartments)\n* Kitchen Island\n* Washer and Dryer in unit\n* Walk-in Closet\n* Stainless Steel Appliances","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1323ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T13:54:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studio-apartment-available\/7633657797.html","post_id":7633657797,"title":"Studio Apartment Available in Mid-September! Most Utilities Included!!","description":"Studio apartment becoming available in mid-September for $1,075! Apartment features kitchen and bath, walk-closet, large windows, great view and 9 ft. ceilings. Ask about our NO SECURITY DEPOSIT program!! Cats are welcome (add'l fee)! All apartments are rented unfurnished.\nChancellor Apartments is a convenient high rise apartment community in an amazing location in Center City. We are close to most major schools and universities, public transportation, historical attractions, shopping, restaurants and theaters. Center City at its best!!\nRent includes: heat, hot\/cold water, 24-hour front desk attendant, free bike storage room, package acceptance service, 24-hour emergency maintenance service, on-site smart card laundry plus card access system and BuildingLink resident services portal access for all residents.\nThe Chancellor boasts several different studio and one bedroom floor plans. Apartments feature high ceilings, large bright windows, ceiling fans in most units, hardwood floors and breathtaking views of the Philadelphia skyline and Delaware River. Many apartments have large walk-in closets, too!\nWe have partnered with Optimal Sport Health Club to offer a generous discounted gym membership (we pay your initiation fee!). There are several off street parking lots and garages in the area, too!\nCHANCELLOR APARTMENTS\n206 S. 13th Street\nPhiladelphia, PA 19107\nshow contact info\nFranceina Thorne, REALTOR\nHours:\nMon. - Fri. 8:30 to 5:00\nSaturday - 10:00 to 3:00\nAppointments are highly recommended\nProfessionally Managed by: Chancellor Properties, Inc.\nwww.cpihome.com\n\"CONSUMER NOTICE\"\nChancellor Properties, Inc. hereby states that with respect to this property, they are acting in the following capacity: an agent of the owner\/landlord pursuant to a property management or exclusive leasing agreement.\nEQUAL HOUSING OPPORTUNITY\n","num_images":15.0,"lat":39.948681,"lng":-75.162197,"attrs":"['0BR \/ 1Ba', 'available sep 15', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T13:48:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-renovated-2br-family-home\/7633631728.html","post_id":7633631728,"title":"Renovated 2BR Family Home","description":"Totally renovated and ready for you to move right in! This cozy ranch home is in a quiet neighborhood with tree lined streets and plenty of sidewalks. As you enter the home you are greeted by a large, open, and bright living room which adjoins the kitchen. The kitchen is the perfect size to fit a small table, has new stainless-steel appliances, and plenty of cabinet and counter space. Moving through the kitchen next up is the spacious family room addition with a bow window overlooking the backyard. The laundry room, with brand new washer and dryer and another refrigerator, is located off the family room and has an exit to the rear yard. Completing the home are the two brand new bathrooms, two bedrooms with ceiling fans a home office and hardwood floors throughout. There is also a full unfinished basement for all your storage needs and a shed in the backyard perfect for storing bikes and gardening tools. Great location, close to shopping, schools, farmers market, YMCA, Valley Forge Park and King of Prussia Mall.","num_images":16.0,"lat":40.1267,"lng":-75.5272,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-06-17T12:52:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom\/7633655718.html","post_id":7633655718,"title":"Beautiful 1 bedroom apartment, great location, available from July 1st","description":"Available July 1st .\n1 bedroom\/1 bath 3rd floor unit. Apartment features 1 bedroom, 1 bathroom, a big living room (can be used as a bedroom), kitchen and dining area, hardwood floors, ceiling fans, window A\/C units, bathroom with a bathtub. Washer and dryer in unit.\nGreat location: Walking distance from UPENN, UPENN Vet , HUP, CHOP, USP. Around the corner from Clark Park. Trolley stop on the corner for easy access to Center City. Close to shopping and various coffee and restaurants.\nWithin Penn Alexander School catchment.\nTenant pays electricity and gas bill. Yearly lease. $30 application fee. Three months' rent required to move in. Please call or text to schedule a showing.","num_images":8.0,"lat":39.950434,"lng":-75.209282,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T13:44:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedrooms-dwell-2nd\/7633654868.html","post_id":7633654868,"title":"Two Bedrooms! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N American St Suite 101\nPhiladelphia Pa 19122\nBedrooms:2\nBathrooms:2\nSquare Footage:1088-1261 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 2BR floor-plans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.971179,"lng":-75.140092,"attrs":"['2BR \/ 2Ba', '1135ft2', 'available now', '\\nsaturday 2023-06-17\\n', '\\nsunday 2023-06-18\\n', '\\nmonday 2023-06-19\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T13:42:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-house\/7633618813.html","post_id":7633618813,"title":"Beautiful 3 -Bedroom House for Rent","description":"Welcome To 6439 Morris Park Road, A Home Where A Family Grew For A Generation. Walk Through The Beautiful Arched Doorway And Find An Open Living And Dining Room, Ideal For Entertaining And Family Dinners. The Large Kitchen Offers Plenty Of Space For Cooking And Preparing Meals With Space For A Breakfast Table And Leads To Another Covered Back Patio, Perfect For Relaxing On A Nice Day.\nContact Us  show contact info","num_images":4.0,"lat":39.9772,"lng":-75.2545,"attrs":"['3BR \/ 2Ba', '1408ft2', 'available now', 'EV charging', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T12:23:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bdrm-partially-furnished\/7633650423.html","post_id":7633650423,"title":"1-bdrm partially-furnished apartment on quaint historic street","description":"Beautiful apartment located on Maplewood Mall in Germantown- a quiet and narrow pedestrian-oriented street with shops, a bakery, salon, new restaurant and cafe opening.\nRight behind Coleman Library, one block from Germantown Ave\/ the 23 bus, and multiple buses running along Chelten Ave. New Weavers Way grocery store (opening Fall 2023) about 6 blocks away, dollar store, other grocers in walking distance. Near Chelten train station\/ 15-min ride to Center City. Wissahickon nearby.\nApartment was previously owner-occupied so has been thoughtfully designed.\nFirst floor\nWasher and dryer in basement (private)\nPrivate patio in the rear- brick with landscaping\nPartially furnished (everything seen here)\nMurphy bed folds up if you want to open up the bedroom\n$1000\/mo plus all utilities\nReady to move into now\nOne year lease. Possible discount for a multi-year lease. Would consider a shorter term rental at a higher rate.\nFirst, last, and security required\nOne-year lease\nMinimum credit score 680\nNo pets\nNo smoking\nIf interested please send a message introducing yourself.\n","num_images":8.0,"lat":40.035012,"lng":-75.173724,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T13:32:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-1513-arch-stlight-filled\/7633629070.html","post_id":7633629070,"title":"1513 Arch St**Light-Filled Bliss: 😊✨@Norristown's Charming Haven!","description":"Get ready to be amazed by this spacious and light-filled 1-bedroom apartment located at 1513 Arch St in Norristown, PA .\nAs you step inside, you'll be greeted by beautiful hardwood floors and high ceilings that give the place an airy and open feel. The layout is perfect for easy living, and there's even exposed brick for that extra touch of character.\nThe kitchen has been recently renovated and features a breakfast bar, making it a great spot for morning coffee or casual meals. And don't worry about storage because there's ample closet space to keep your belongings organized.\nThe bathroom is truly stunning with its beautiful tiles, bathtub, and vanity. It's the perfect place to unwind and relax after a long day. If this casual description has caught your eye, don't wait! Reach out to us and let's make this beautiful apartment your new home sweet home. **Please TEXT your phone number, For More Information.**\n","num_images":3.0,"lat":40.1245,"lng":-75.3304,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T12:46:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500-security-deposit\/7633626711.html","post_id":7633626711,"title":"$500 Security Deposit - Limited Time Move In Special!!!!","description":"$500 Security Deposit - Limited Time Move In Special!!!! Chancery Lane offers loft-style apartment homes in a gated courtyard setting within historic Old City and boasts a community rooftop deck with panoramic views of the city. Beautiful 2 bedroom apartment (1 bedroom is lofted) with Balcony, Hardwood Floors\/carpeted bedrooms. The unit also features central air\/heat and own washer\/dryer & dishwasher. Chancery Lane is a pet-friendly community. Pictures are of a similar unit in the same building!\n130 Arch St #302","num_images":12.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T12:41:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-beautiful-bedroom-bath\/7633625997.html","post_id":7633625997,"title":"Beautiful 3 Bedroom 2 1\/2 Bath Townhouse For Rent!","description":"This newly updated townhome in Stonegate boasts a two story foyer , maintenance free laminate flooring throughout, a newly updated kitchen with granite countertops and all new appliances , new , energy efficient windows throughout , a second floor laundry , a finished basement and a one car attached garage . Located conveniently close to shopping , major arteries such as Rt 309 and the Pa turnpike , and Merck , this fine home is tucked away in a great location in this sought after community, and award winning North Penn School District.","num_images":15.0,"lat":40.2378,"lng":-75.2955,"attrs":"['3BR \/ 2.5Ba', '1528ft2', 'available jun 19', 'air conditioning', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T12:39:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-live-at-park-towne-place\/7633621877.html","post_id":7633621877,"title":"Live at Park Towne Place Apartment Homes!","description":"Live at Park Towne Place Apartment Homes in Center City Philadelphia, and you'll be blocks from the center of nightlife in Logan Square and Rittenhouse Square. Unit features modern kitchens, quartz countertops, stainless steel appliances, in-unit washers and dryers, breakfast bars, pendant lighting, tile backsplashes, wood plank flooring throughout, walk-in closets. Stunning city and museum views are offered in a variety of floor plans! Mainstreet Market and Caf , featuring gourmet coffee and tea and much more! Fitness center with Technogym equipment, Queenax boxing gym, yoga\/spin studio with indoor\/outdoor workout space. It boasts Philadelphia's largest pools, an art studio, fitness center with boxing gym, yoga\/spin studio, social lounge with demonstration kitchen, gourmet market and cafe, outdoor lounge with fire pit, 24-hour concierge, 24\/7 package acceptance, resident shuttle service to Center City and University City and more. Make Whole Foods as your second kitchen conveniently located just 1 block away. Our apartments are within one mile of several institutions of higher education: Drexel University, Temple University, University of Penn, CHOP, Moore college of Arts, Community College of Philadelphia. You won't find a better building to live with amenities in the Fairmount Area. Park Towne Place includes 948 apartment and penthouse homes within four high-rise towers. The community is nestled between green acres on the Benjamin Franklin Parkway in the heart of Center City Philadelphia's Museum District. Park Town. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n2200 Benjamin Franklin Pkwy #0B-S0005","num_images":14.0,"lat":39.9677,"lng":-75.1735,"attrs":"['0BR \/ 1Ba', '484ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T12:30:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-renovated-bi\/7633625020.html","post_id":7633625020,"title":"Beautifully renovated bi-level apartment!","description":"Beautifully renovated bi-level apartment features: - Private Garden - Central air - In-Unit Washer\/Dryer - Gourmet Kitchen Boasting Granite Counter-Tops - Stainless Steel Appliances including a Dishwasher, Microwave, and Garbage Disposal - Pristine hardwood flooring - 2 sub-level and 1 above level bedroom - Walk-in closet - 3 full bathrooms It is located in the heart of Fitler Sq just a block away from the breathtaking Ftiler Sq Park. Approximate square footage is posted.\n2225 Spruce St #1","num_images":12.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 3Ba', '1500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T12:37:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/oneonta-three-bedroom-one-bathroom-with\/7633613629.html","post_id":7633613629,"title":"~Three bedroom, one bathroom with a cozy kitchen and open living~~**","description":"Charming Colonial available in the City of Oneonta. Three bedroom, one bathroom with a cozy kitchen and open living space. Primary bedroom is double sized with plenty of closet space. Save space in the secondary bedrooms with original built-in cabinetry. Private backyard and deck with a detached garage. Convenient to schools and colleges, Main St Oneonta and I-88.","num_images":4.0,"lat":42.4625,"lng":-75.0491,"attrs":"['3BR \/ 1Ba', '1344ft2', 'available jun 30', '\\nsaturday 2023-06-17\\n', '\\nsunday 2023-06-18\\n', '\\ntuesday 2023-06-20\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'detached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-17T12:13:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-rehab-in-old\/7633624006.html","post_id":7633624006,"title":"Beautiful Rehab in Old Kensington neighborhood!","description":"Beautiful Rehab in Old Kensington neighborhood. Property is located 1 block from Fishtown and 1 block from Northern Libs. First Floor: Open floor Plan, Hard wood Floors, Neutral Decor and plenty of Natural Lighting. Kitchen boast Granite Counters, Shaker Cabinets, Stainless Steel Appliances and Ceramic floors. Full Bathroom located behind Kitchen that makes things convenient when Entertaining! Second floor Features 2 Large bedrooms w\/ample closet space and Hall Bathroom. Bathroom boast stand up Shower along with separate tub\/shower combination. Faucet are State of the Art Thermostatic stainless steel Panel and Jet spray!Third floor 3 additional bedroom for your out of town guest or for the larger family. You are walking distance to all the great restaurants and Night life on Girard Ave and Frankford Ave Corridor!\n1210 N Howard St","num_images":13.0,"lat":39.978,"lng":-75.1459,"attrs":"['5BR \/ 2Ba', '1359ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T12:35:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500-security-deposit-bed\/7633623043.html","post_id":7633623043,"title":"$500 Security Deposit - 2 Bed 1 bath spacious unit!","description":"$500 Security Deposit - Limited Time Move In Special!!! 2 Bed 1 bath spacious unit, Converted brownstone featuring 12 apartment homes within close walking distance of scenic Washington Square Park. Property features intimate residential setting with w\/d in the basement and updated spaces including usually central air, exposed brick, and H\/W. Most units feature original hardwood flooring. Utilities are additional. PARKING OPTIONS AVAILABLE $250\/month. Pictures are of the actual unit.\n901 Clinton St #9","num_images":12.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', '900ft2', 'available jul 18', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T12:33:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-picturesque-family-3br\/7633576762.html","post_id":7633576762,"title":"Picturesque family 3br townhouse","description":"Welcome to 4317 Pechin Street, located in the charming neighborhood of Manayunk in Philadelphia. This meticulously kept twin home is an absolute delight and is ready for you to move in and make it your own. As you approach the home, you'll be greeted by a picturesque front porch, perfect for enjoying a cup of coffee or relaxing with a book. Step inside, and you'll be welcomed into a spacious living room adorned with beautiful hardwood floors that flow throughout the main level, creating an elegant and inviting ambiance. Make your way to the sun filled living room which leads you to your own private dining area. The newly updated kitchen is features stunning granite countertops, sleek stainless steel appliances, and ample cabinet space. This modern kitchen is both functional and stylish, making meal preparation an absolute joy. Conveniently located off the dining room, you'll find a half bathroom, adding to the overall ease and functionality of the home. The backyard space is a true oasis, offering a private and serene setting for outdoor entertaining or simply enjoying warm summer nights. Upstairs, you'll discover three generously sized bedrooms, each offering comfort and tranquility. The full bathroom on this level is complete with a bathtub and a stand-up shower stall. This home is in high demand and is expected to rent quickly, so don't miss out on the opportunity to make it yours.","num_images":16.0,"lat":40.0402,"lng":-75.2231,"attrs":"['3BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-06-17T10:39:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bi-level\/7633620550.html","post_id":7633620550,"title":"Spacious bi-level apartment is located in Society Hill!","description":"This spacious bi-level apartment is located in Society Hill, has been renovated and offers an open floor plan. The unit is flooded with natural daylight and Central Heat and Air Conditioning. As you walk into the living and kitchen space, you will notice high ceilings, new vinyl plank flooring, and a kitchen equipped with Corian counter and backsplash, dishwasher, oven and microwave. Proceed to the second floor with a skylight filling the area with daylight. There is one larger bedroom equipped with a washer and dryer, a second bedroom and bathroom. Furniture available for purchase. Enjoy the locally owned shops, pubs, restaurants and organic shopping. Take a stroll in the nearby parks. Centrally located to enjoy the eclectic activity and electric vibe of the City. Schedule your appointment today. Owner on site. Tenant pays electric, gas and cable. Owner pays water and sewer.\n532 S 4th St #2F","num_images":10.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '1100ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T12:27:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-northern-liberties-bedroom\/7633620450.html","post_id":7633620450,"title":"Northern Liberties 3 Bedroom Sunny bi level","description":"QUIET bilevel @ 6th and Girard\n3 bedrooms 1 1\/2 bath all hardwoods\nAvailable August 1 2023\n","num_images":0.0,"lat":39.970313,"lng":-75.145968,"attrs":"['3BR \/ 1.5Ba', 'available aug 1', 'application fee details: $75.00', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T12:27:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/brookhaven-four-bedroom-home-for-rent\/7633620246.html","post_id":7633620246,"title":"Four Bedroom Home for Rent","description":"4 bedroom, 2 bath home in the excellent Rose Tree Media School district:  on a quiet cul de sac, fenced rear yard.   Separate 24' deep garage, drywalled and insulated with loft storage' plus 2 220 outlets that could be suitable for charging of an electric vehicle.\nHouse kitchen has custom cabinetry and a new GE Cafe refrigerator; two full baths; house is carpeted; 2\/3 finished basement and separate rooms for W\/D  (included) and mechanicals.  Large deck off the rear of the house, beautifully landscaped property, fenced back yard.   Lawn care included in the rent.\nTenant responsible for electric , heating, water and trash.   Recycling included in the rent.\nNO PETS.   Best to call for information and to schedule a visit.\nMore photos forthcoming.\n","num_images":1.0,"lat":39.886511,"lng":-75.396037,"attrs":"['4BR \/ 2Ba', '1800ft2', 'available jul 1', 'house', 'laundry in bldg', 'detached garage', 'rent period: monthly']","posted_date":"2023-06-17T12:27:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enjoy-living-in-this\/7633619741.html","post_id":7633619741,"title":"Enjoy living in this fantastic and well-designed TWO BEDROOM!","description":"Enjoy living in this fantastic and well-designed TWO BEDROOM residence boasts all hardwood floors, separate kitchen with white cabinets, gracious living and dining area, large bedroom, and all tile bath. Enjoy living in the fantastic, elevator doorman building, in the HEART OF CENTER CITY, and just minutes from some of the best dining and night life, in Philadelphia!!!!Walking score a 110!!! Photos are of model unit.\n235 S 15th St #801","num_images":11.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T12:26:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enjoy-living-in-this\/7633618845.html","post_id":7633618845,"title":"Enjoy living in this elevator\/doorman building!","description":"Great SPACE and VALUE, in this fantastic Studio apartment just off RITTENHOUSE SQUARE. Enjoy living in this elevator\/doorman building with AMAZING GYM, minutes from PENN, DREXEL, 30th St TRAIN STATION and in the heart of ALL!!!!!!!Philadelphia has to offer walking score is 110!!!!! Photos are of model unit.\n2100-2 Walnut St #13E","num_images":8.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '250ft2', 'available jul 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-06-17T12:24:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedroom-loft-unit-on\/7633617792.html","post_id":7633617792,"title":"Two bedroom loft unit on a quiet street in the heart of Old City!","description":"Coming soon at Cuthbert Lofts, A two bedroom loft unit on a quiet street in the heart of Old City! This amazing unit features huge skylight in the living room, high ceilings, large windows, exposed beams and bricks, central air and hardwood floors. Designer kitchen features streamline European cabinets, Siltstone countertops, and stainless steel appliances. Modern bathroom with Kohler fixtures and Italian tile floors and surround. Full sized Bosch Washer & Dryer included. Large common area roof deck with panoramic views of the city and the river. Storage locker in the basement. Street Parking Just steps from art galleries, restaurants and cafes! Truly a walker's paradise with no shortage of places to visit. Transportation at your fingertips. Just one block from the 2nd Street subway stop on the Market\/Frankford Line, SEPTA buses and close access to major highways and bridges for an easy commute in and out of the city. Tenants responsible for Utilities and Tenant Insurance No Smokers.\n205-15 Cuthbert St #104","num_images":12.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '983ft2', 'available jul 1', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T12:21:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedrooms-dwell-2nd\/7633616751.html","post_id":7633616751,"title":"One Bedrooms! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:760-800 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '767ft2', 'available now', '\\nsaturday 2023-06-17\\n', '\\nsunday 2023-06-18\\n', '\\nmonday 2023-06-19\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T12:19:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/leasing-now-chef-kitchen-open-concept\/7633616197.html","post_id":7633616197,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedroom-apartment-with\/7633616185.html","post_id":7633616185,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-single-family-home-bedroom\/7633609808.html","post_id":7633609808,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-happiness-awaits-you-at-silk\/7633605826.html","post_id":7633605826,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-948-sqft-bd-ba-ready-to-lease\/7633604404.html","post_id":7633604404,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedrooms-bath-apartment\/7633602159.html","post_id":7633602159,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-8348-lynnewood-road-is\/7633561791.html","post_id":7633561791,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bensalem-heart-of-bensalem2-bedroom\/7633559689.html","post_id":7633559689,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studios-dwell-2nd-street\/7633597014.html","post_id":7633597014,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-huge-all-new-apartment\/7633592403.html","post_id":7633592403,"title":"\"Huge All New Apartment 2500sqft.\"","description":"Brownstone Newly Renovated \"2500sqft.\" Apartment\n2\/Huge Bedrooms, Huge Living-room. 2.5\/Bathrooms,\nStainless Steel App., Washer\/Dryer, Garbage Disposal,\nDishwasher, Central air\/heat., 6\/Multi-Closet Spaces,\nHigh Ceilings Hardwood\/floors, Ceiling fans, N\/pets.,\nShowing 7\/days a wk. [Open House] all day Sat\/Sun.\nLeave message return calls in 15\/min., show contact info\nBella Vista\/Wash Sq.\/Passyunk Square Area.\n","num_images":0.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2.5Ba', '2500ft2', 'available now', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T11:21:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bensalem-bedroom-bath-apt-features\/7633560708.html","post_id":7633560708,"title":"2 BEDROOM -1 BATH *** APT FEATURES**","description":"2 BEDROOM -1 BATH *** APT FEATURES***Modern Kitchen *Trendy Bathroom *Hardwood Flooring *Naturally Well-Lit *Friendly Neighborhood Freshly Renovated Apartment with a Oversized, Energy-Efficient, Naturally Well-Lit, Spacious living space ready to be moved and relaxed in. Perfect for  commuters! Near by amenities such as great schools, public transportation, freeway access, dining and shopping opportunities","num_images":0.0,"lat":40.1109,"lng":-74.9378,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-17T09:54:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/stop-by-today-pet-friendly-chef-kitchen\/7633580726.html","post_id":7633580726,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wonderfully-updated\/7633574768.html","post_id":7633574768,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bensalem-bensalem-pa2-bedroom-full\/7633560190.html","post_id":7633560190,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-bedroom-bath-single\/7633574228.html","post_id":7633574228,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-outstanding-bedroom\/7633568207.html","post_id":7633568207,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/fort-washington-sweet-bedroom-duplex\/7633564085.html","post_id":7633564085,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bensalem-bensalem-pa-charming-bedroom\/7633561232.html","post_id":7633561232,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null}]