[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/conshohocken-bedroom-apartment-for-rent\/7595877807.html","post_id":7595877807,"title":"1 Bedroom Apartment for Rent","description":"Gulph Mills, PA area - Homestyle Apartment Rental\n$1450\/Month 1 Bedroom Apartment\nA nice, well- maintained Apartment for Rent in Gulph Mills PA.\nSeeking a Responsible Person to Rent 1 Bedroom with attached Bathroom.\n1 Bedroom apartment for Rent includes: Living room, Dining room, Kitchen, Bathroom, Bedroom, Laundry- Washer\\Dryer, Central Air Conditioning, and Ceiling Fans. Includes: Microwave, Oven Range, and New Refrigerator. It's Cable Ready for Comcast Xfinity and Verizon Fios. Includes Water, Trash Disposal, Sewer,  and Lawn Cutting. Convenient Parking available.\nThe apartment is Located nearby many area Companies: Amerisource Bergen, Fedex, Lockheed Martin, GSK, VWR, Airgas, Labcorp, Universal Health Services etc.\nThe Apartment is located in a Quiet and peaceful area. Gulph Mills is in close proximity to: King of Prussia, Conshohocken, Radnor, Plymouth Meeting and the Bryn Mawr area.\nThe Apartment is located nearby a broad transportation corridor with access to: Route 202, Route 30, Route 76, Route 476 and the PA Turnpike\nMove in Ready-Availability April 1, 2023. Please Contact with any Questions and Interest\n","num_images":8.0,"lat":40.0825,"lng":-75.3044,"attrs":"['1BR \/ 1Ba', '900ft2', 'available apr 1', 'air conditioning', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T21:42:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sunday-5-showing-1pm-837\/7595871275.html","post_id":7595871275,"title":"Sunday 3\/5 Showing @ 1PM.  837 Winton Street","description":"Spacious Studio located near 8th and Snyder\nHardwoods, full kitchen and washer and dryer\nTile bath with custom shower\nStainless steel appliances\n$900\/ month. *Includes water.\n","num_images":4.0,"lat":39.922359,"lng":-75.160479,"attrs":"['1BR \/ 1Ba', '350ft2', 'available mar 6', '\\nsunday 2023-03-05\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T21:06:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bathroom\/7595848371.html","post_id":7595848371,"title":"beautiful 2-bedroom, 1-bathroom, newly renovated apartment.","description":"Welcome to this beautiful 2-bedroom, 1-bathroom, newly renovated apartment. This twin triplex in Philadelphia has a unit on the second floor. Schools, restaurants, shops, and public transportation near the property. You will be warmly welcomed by the newly renovated apartment, which has been attractively painted. You'll find lovely laminate flooring and new paint throughout. The kitchen boasts granite countertops and new cabinets. Enjoy all of the brand-new amenities in this house firsthand. Schedule your visit right away.","num_images":4.0,"lat":40.05066,"lng":-75.176299,"attrs":"['2BR \/ 1Ba', 'available now', 'EV charging', 'air conditioning', 'application fee details: Application fee just $30', 'broker fee details: Free', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'listed by: Rental LLC', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T19:28:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-historic-townhome\/7595852694.html","post_id":7595852694,"title":"Charming Historic Townhome Available In Washington Square West!","description":"Reply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nProperty Details:\n- 223 S Sartain St\n- 2 Br\n- 1.5 Ba\n- 975 Sqr ft\n- $3,245\/mo\n______________________________________\nIncredible, one of a kind historic townhome available in Washington Square West, one of Philadelphia’s most sought after neighborhoods!\nCharming details include exposed brick throughout, original wood flooring and banisters, three decorative fireplaces, a cathedral ceiling with wood ceiling beams in the primary bedroom, a claw foot bathtub, a skylight window, and the location on a quaint no parking street lined with cherry blossom trees that bloom beautifully in the spring.\nUpon entering, you’re greeted with a spacious living room with sconce lighting that leads to a reading nook and powder room. From here, access the whimsical shared brick patio with mosaic tiling and flower beds. Downstairs, you will find the completely modernized kitchen fit with a gas range, dishwasher, garbage disposal, and stainless steel refrigerator. There is plenty of pantry space for storage and an abundance of natural light thanks to multiple windows. The second floor of the home features a large bedroom with dual closets as well as the adjacent full bath. The third level boasts the primary bedroom with breathtaking original details, lots of shelving and closet space, as well as access to the private deck where you can sip on your morning coffee. If the property does not already entice you enough, the immediate neighborhood is home to some of the city’s best restaurants, cafes, and shops, and is walkable to numerous iconic parks and landmarks.\nDon’t miss this amazing rental before it’s too late! 1 dog under 20 lbs permitted. $500 refundable pet deposit required.\n______________________________________\nReply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nListed by Compass\nDRE #B069094","num_images":24.0,"lat":39.95,"lng":-75.16,"attrs":"['2BR \/ 1.5Ba', '975ft2', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T19:46:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/willow-grove-497-lincoln-ave\/7595856790.html","post_id":7595856790,"title":"497 lincoln ave","description":"2 bedroom , 2nd floor older building arc ways , glass door knobs , new carpet , new kitchen floor , new stove , off street parking no dogs , cats maybe,  no smoking building  laundry on site , close to train station and turnpike  call Dave\n#  show contact info","num_images":0.0,"lat":40.14998,"lng":-75.115135,"attrs":"['2BR \/ 1Ba', '800ft2', 'application fee details: $15', 'cats are OK - purrr', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T20:02:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-three-bedroom-home-looking\/7595827451.html","post_id":7595827451,"title":"Three$ Bedroom home looking for the right family","description":"Three Bedroom$ home looking for the right family. For more properties like this visit Affordable Housing. For more info, please submit an inquiry for this home. Applications are subject to our qualification requirements conditions apply. CONSENT TO TEXT MESSAGING OR CALL: (917) 231-967 8. You can still apply contact us.\nLocation:\n6318 Saybrook Ave, Philadelphia, PA\n","num_images":8.0,"lat":39.9223,"lng":-75.2338,"attrs":"['3BR \/ 1Ba', 'house', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T18:13:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/monessen-bedroom-house\/7595835008.html","post_id":7595835008,"title":"3 bedroom house","description":"Located in the town of Charleroi, this spacious 3 bed 2 and half bath wont disappoint. The property has an open concept floor plan when you walk in to include living room, dining room kitchen. You also have a nice deck off the dinning room as well as a nice back yard. Upstairs you have 3 spacious bedrooms one of which is master suite with a full bathroom that has a jacuzzi tub and nice walk in closet. The basement has a finished game room \/ family room and a laundry area.\nSecurity deposit is $1100\nApplication fee $55\nWe are willing to entertain a rent to own or Owner finance on this home. Please reach out for more details","num_images":7.0,"lat":40.14067,"lng":-79.902522,"attrs":"['3BR \/ 2.5Ba', 'available mar 6', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T18:40:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-phila-studio\/7595832870.html","post_id":7595832870,"title":"n phila studio","description":"studio all utilities included address is 2222 W Huntingdon St clean, private","num_images":0.0,"lat":39.994025,"lng":-75.167925,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T18:32:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bd-and-ba-newly-renovated\/7595814417.html","post_id":7595814417,"title":"$1800 - 3 BD and 1 BA NEWLY RENOVATED","description":"Head home to this bright, well-maintained 3-bedroom, 1-bathroom row home on quiet street in Brewerytown, Philly. Truly exceptional, this historic home has a new roof, a remodeled bathroom, new floors, and new kitchen cabinets.\nBeautiful floors and a traditional floor plan with a kitchen\/dining room\/and living space make the first floor ideal for entertaining friends and family.","num_images":6.0,"lat":39.984716,"lng":-75.18455,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T17:33:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bedroom-15\/7595816349.html","post_id":7595816349,"title":"Newly renovated 3 bedroom, 1.5 bathroom house located near Frankford A","description":"This is a newly renovated 3 bedroom, 1.5 bathroom house located near Frankford Ave in the Kensington\/Port Richmond neighborhood of Philadelphia.\nUpon entering, you have an open-concept floor plan, including the living room and dining area when you walk in on the 1st floor. It features new floors, black steel bannisters, and recessed lighting. The kitchen has a stainless steel refrigerator, stove, dishwasher, microwave, and granite countertops. There is a finished basement with tiled floors and recessed lighting. The three bedrooms are located on the second floor and are bright and sunny. The full bathroom is newly tiled with a tub\/shower and under the sink storage. CALL OR TEXT  show contact info","num_images":11.0,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 1.5Ba', 'available now', 'application fee details: application fee details: $20 PER APPLICANT 18+', 'broker fee details: broker fee details: Real Estate broker fee $5', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'listed by: listed by: RE\/MAX Venture Realtors', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T17:39:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-happy-life-begins-with\/7595821058.html","post_id":7595821058,"title":"A HAPPY LIFE BEGINS WITH A HAPPY HOME","description":"A HAPPY LIFE BEGINS WITH A HAPPY HOME - You really do not want to miss this one bedroom, 2nd floor, modern, spacious duplex apartment with plenty of closet space, additional storage in basement, w\/d hook-up, front & back yard, close to shopping and public transportation, with off street parking - Rent $775 plus ALL utilities - Please call for an appointment  show contact info\n- you won't be sorry.","num_images":0.0,"lat":40.034574,"lng":-75.221491,"attrs":"['1BR \/ 1Ba', 'available mar 25', 'duplex', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T17:54:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-freshly-painted\/7595809611.html","post_id":7595809611,"title":"Renovated freshly painted house for rent","description":"Renovated freshly painted house for rent next to Temple Hospital & School of Medicine. Enter the house into a roomy family room with hard wood floor and walk to the back to a kitchen with all new appliances including fridge, stove, and microwave. The second floor has a large bathroom and 2 large bedrooms. The Basement is finished and has a powder room as well and a new washer and dryer. The property is located in a friendly neighborhood and views the Mary McLeod Bethune School across 11th Street. . 3351 Goodman St, Philadelphia, PA 19140","num_images":0.0,"lat":40.0118,"lng":-75.1456,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T17:19:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-speakeasy-wine-room-extra\/7595678440.html","post_id":7595678440,"title":"Speakeasy Wine Room, Extra Storage, Private Patio or Balcony","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Ceiling FansSerene Wooded ViewCable ReadyNewly Renovated InteriorsSpeakeasy Wine RoomResort-Style Swimming PoolPrivate Patio or BalconyDishwasherCable\/Satellite TVBuilt-in Microwave Ovens9' Ceilings w\/ Crown MoldingExtra StorageCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/hpomrlrm\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 1Ba', '926ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T12:06:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-bedroom-apartments-available\/7595668276.html","post_id":7595668276,"title":"2 Bedroom Apartments Available","description":"Apt. 2410 — Oxford floor plan — 1,203 sq. ft. — $3,460\nThis 4th floor 2-bedroom\/2-bathroom apartment home has much to offer! It comes upgraded with hardwood LVT flooring, central heat and air, upgraded stainless steel appliances, and a lovely tile backsplash! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive living area is perfect for hosting! This gorgeous apartment has a beautiful view of the Philadelphia skyline. It is also within close proximity to our Clubhouse — featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":24.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T11:43:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-the-absolute-best\/7595667659.html","post_id":7595667659,"title":"The Absolute Best Amenities, Appliances and Floorplans. Tour Today.","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card!  Residences at One Brown 1 Brown Street, Philadelphia, PA, 19123Call Now -  show contact info\nx 11OR Text 11 to  show contact info\nto contact our leasing team.More unit details at:https:\/\/archcompanies.aptglance.com\/i4416L Stunning Apartments in Northern LibertiesThis is a 1 Bedroom, 1 Bath, Approximately 687 Sq. Ft. 1 Brown will check off everything on your list of must-haves with stunning luxury apartments in the neighborhood of Northern Liberties. Take a look at the variety of floor plans and choose the perfect spot for your lifestyle. No matter which residence you choose, your home will boast a spacious layout with classic, sophisticated interior finishes.A variety of relaxing amenities await you, including a rooftop with scenic waterfront views and, a fitness center, and a heated resort style pool. Conveniently located in the heart of the Northern Liberties neighborhood of Philadelphia, you’ll be surrounded by historical sites as well as a wealth of restaurants, entertainment options, and shopping.Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMPhotos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! DReRqw0k\n","num_images":15.0,"lat":39.962145,"lng":-75.137734,"attrs":"['1BR \/ 1Ba', '687ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T11:42:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-kitchen-stainless\/7595662925.html","post_id":7595662925,"title":"New Kitchen\/ Stainless Steel Appli.\/ New Bathroom Tile\/ Courtyard View","description":"RENT PERIOD: YEARLY\nAsk about apartment home 206 on the second floor, available now!! This unit has a new carpet, newer kitchen with nice dark brown cabinets and stainless steel appliances. The bathroom has new tile and a new vanity. The unit also has nice 6-panel doors and it overlooks the courtyard, which has a grill, a few tables, and benches. There are also two laundry rooms a few feet down the hall.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday 9:00 am-6:00 pm, Fridays 9:00 am-5:00 pm, and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":13.0,"lat":40.053166,"lng":-75.236179,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T11:31:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-furnished-option-luxury\/7595633789.html","post_id":7595633789,"title":"Furnished Option! Luxury Living At Its Finest! For Rent And Sale!","description":"Reply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nProperty Details:\n- 1414 S Penn Square\n- 2 Br\n- 2.5 Ba\n- 1,467 Sqr ft\n- $5,775\/mo\n- Sale Price: $779,000 (Pre Approval Req)\n______________________________________\nFantastic opportunity to experience luxury living in the heart of Center City!\nThe unit is available immediately and can be furnished or unfurnished, depending on your preference. This floorplan is a spacious 2 bedroom, 2.5 bathroom \"H\" unit with designer finishes, hardwood floors, and floor-to-ceiling windows that provide plenty of natural light. Creating a bright and inviting atmosphere. Not only does this feature add to the overall aesthetic of the unit, but it also provides residents with a sense of connection to the surrounding cityscape. With such large windows, you can enjoy beautiful views of the city from the comfort of your own home. The kitchen is modern and equipped with high-end Sub-Zero, Viking, Miele, and U-Line Appliances that are sure to make any home cook's dreams come true. These appliances are known for their quality and durability, as well as their advanced features and innovative design. The bedrooms are well-appointed with marble en-suite bathrooms, custom window treatments, and closets.\nAs a resident, you'll have access to a range of luxurious amenities. The fitness center is equipped with an indoor pool and yoga room, providing a convenient and relaxing way to stay active and healthy. The meditation garden is a peaceful oasis, with a calming waterfall feature that makes it the perfect place to unwind and recharge. The residents' lounge is a great space to socialize and connect with other residents, while the media room is equipped with state-of-the-art technology and comfortable seating, making it the perfect place to watch movies or catch up on your favorite TV shows. The outdoor terrace is a beautiful space where you can relax and take in the city views, and it's perfect for hosting gatherings or entertaining guests. The building is also pet-friendly and has an on-site dog run.\nThe Ritz Residences provides easy access to the arts, culture, museums, and world-class restaurants that Center City has to offer. Whether you're looking for a night out on the town or a quiet evening at home, this property has everything you need to live your best life in Philadelphia. The Ritz Residences is a truly exceptional building, and this unit won't be available for long!\n______________________________________\nReply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nListed by KW Philly\nDRE #B069094","num_images":22.0,"lat":39.951,"lng":-75.164,"attrs":"['2BR \/ 2.5Ba', '1467ft2', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T10:15:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-beautiful-two\/7595657840.html","post_id":7595657840,"title":"🏠🏠COZY & BEAUTIFUL Two Bedrooms!! Great Location!","description":"COZY & BEAUTIFUL Two Bedrooms!!! Great Location in Philadelphia .. Come explore our spacious apartment homes at our conveniently located community, Choose from any of our one- and two-bedroom apartment homes or our two- and three-bedroom townhomes that includes plenty of closet space, full-size black and stainless appliances, in unit washer\/\/\/\/dryers and onsite laundry facilities, along with high-speed internet ready options. As a valued resident, you will have access to a 24-hour fitness center, resort style pool, and business center with free wi-fi. Since we are dedicated to everyone benefiting from calling our community their home, we house a playground to ensure lots of fun and two dog parks. Credit check application fee 24.95, Please contact ** TEXT: jessicaneff08gmailcom","num_images":3.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T11:18:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedrooms\/7595655345.html","post_id":7595655345,"title":"@@@BEAUTIFUL 2 Bedrooms!!@@@","description":"BEAUTIFUL 2 Bedrooms!!! Great Location in Philadelphia.. Come explore our spacious apartments homes at our conveniently located community, Choose from any of our one- and Three-bedroom homes or our three-bedroom townhomes that includes plenty of closet space, full-size black and stainless appliances, in unit washer, dryers and onsite laundry facilities, along with high-speed internet ready options. As a valued resident, you will have access to a 24-hour fitness center, resort style pool, and business center with free wi-fi. Since we are dedicated to everyone benefiting from calling our community their home, we house a playground to ensure lots of fun and two dog parks. Call for more details! Text me  show contact info","num_images":5.0,"lat":39.9523,"lng":-75.1638,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T11:12:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-offering-reduced\/7595650678.html","post_id":7595650678,"title":"OFFERING REDUCED SPECIAL!!Cat & Dog Friendly, Extra Storage, Pool, Gym","description":"RENT PERIOD: YEARLY\nAsk about apartment home 165 on the first floor, available now!! This unit has a reduced special!! The market rent is $1,420 but has been reduced to $1,320 for a year.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday 9:00 am-6:00 pm, Fridays 9:00 am-5:00 pm, and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":8.0,"lat":40.053166,"lng":-75.236179,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T11:01:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fresh-rehab-located-on\/7595624799.html","post_id":7595624799,"title":"-Fresh Rehab located on a great block.  941 Church Ln","description":"-Fresh Rehab located on a great block\n-3 spacious bedrooms\n-1 upgraded bathroom\n-New flooring, paint, updates throughout\n-Stainless steel appliances\n-Washer and dryer are inside the home\n-Garage area for storage\n-Parking spot in back of house\n-Sunny front porch\n-Steps from Lasalle's campus\n-Steps from Shops at Lasalle shopping center\n-Move in Ready\n","num_images":1.0,"lat":40.044959,"lng":-75.159063,"attrs":"['3BR \/ 1Ba', '1200ft2', 'air conditioning', 'application fee details: $50 per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T09:52:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-functional-studio-with-in\/7595641507.html","post_id":7595641507,"title":"Functional Studio with In-Unit Laundry at 321 S. 16th St! June\/July","description":"Available June\/July 2023!\nCall or text Annie at  show contact info\nwith any questions or to set up a showing!\nCredit must be in good standing. FICO score and credit history will be reviewed. Monthly income must exceed 3x the rent. No evictions or serious crimes. We only require the security deposit and first month's rent to move in (no last month's rent upfront!) In the event you don't meet the credit or income requirements, cosigners can be considered.\nAddress: 321 S 16t Street #2R\nThis property is professionally managed by AMC Delancey Group.\nAll of our listings have the option to come furnished at an additional monthly rate.\nThis studio apartment is located on the 2nd floor of a walkup. Features include hardwood floors throughout, central air, in-unit laundry, and an updated kitchen with dishwasher, garbage disposal, and butcher block countertops! Apartment is in a prime location in a beautiful neighborhood in Center City West\/Graduate Hospital area of Philadelphia and is situated conveniently by a wealth of restaurants, shops, supermarkets\/grocers, and is in close proximity to Rittenhouse Square park, Broad Street \"Avenue of the Arts\" venues, and public transit routes; SEPTA Broad Street Line subway and bus lines.\nWe are pet friendly! No breed or weight restrictions - just a one-time fee of $250\/pet. Water is included in the rent. Only security deposit and first month's rent needed to move in! Credit requirements apply.\nContact Annie to schedule a showing!\nAnnie Oliver\nAMC Delancey\nshow contact info\n- text me!\n","num_images":4.0,"lat":39.946686,"lng":-75.168182,"attrs":"['0BR \/ 1Ba', 'available jun 7', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-04T10:36:49-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-free-parking-ss-appliances\/7595639794.html","post_id":7595639794,"title":"Free Parking, SS Appliances, Pet Friendly, W\/D, Elevator Bldg, Pool","description":"Apartment 818 is 1 Bedroom with a stainless steel appliances, breakfast bar and washer\/dryer in unit. Plush carpeting throughout and gets great daylight too! Make this your new apartment home today!\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nElevator Building\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Gian, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-5pm | S, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!\n","num_images":14.0,"lat":39.966575,"lng":-75.604026,"attrs":"['1BR \/ 1Ba', '731ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T10:32:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7595638009.html","post_id":7595638009,"title":"Lease Today, Playground, Luxurious Bathrooms","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nSchedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '786ft2', 'available mar 10', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T10:27:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-for-peace-and-quiet-in\/7595636738.html","post_id":7595636738,"title":"For peace and quiet in West Chester, you've found the place!","description":"Welcome to The Gateway Apartments!1515 Manley Rd West Chester, PA 19380Rental Size: 1 BR - 1 BA - 779 sq ft | Per Month: $2058 - $2717 | Lease Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month show contact info\nExclusive features, including a resort-style pool with a sun deck and a 24-hour fitness center, are what make us the best apartment homes in the West Chester, PA area. Whether you want to spend a tranquil afternoon enjoying our beautiful landscapes or invite people over for a social function in our clubhouse, our community has something to offer everyone. Secure gated entrances and 24-hour maintenance provide the residents of our pet-friendly apartments with peace of mind. If you are searching for luxury West Chester apartment homes or are simply looking to relocate to the East Goshen Township area, come tour our wonderful apartments. Offering the best apartments in the area, we will help you feel right at home. Whatever you desire in life, find it at The Gateway Apartments.Please take our virtual tour\nhttps:\/\/my.matterport.com\/show\/?m=4RkQ1PobBkE&brand=0  Our community features:   − Business Center− Clubhouse− Fitness Center− Onsite Maintenance− Onsite Management− Package Service− Picnic and Grilling Area− Pool and Sundeck− Storage Space− Walking\/Biking Trails− Across From Wawa & Goshen Crossing Shopping Center− Beautifully Landscaped Grounds− Garages For Lease− Gated Entrances− Onsite Leasing Office− Relaxing Fire Pit− Resort-Style Pool With Sun Deck− Storage Units For Lease− Three BBQ\/Picnic Areas− Wi-Fi Access in Clubhouse and at Pool  Our unit features: − Air Conditioning & Heating− Alarm− Cable Ready− Carpet− Dishwasher− High Speed Internet Access− Trash Compactor− Tub\/Shower− Walk-In Closets− Window Coverings− Built-In Computer Nook (select homes)− Built-In Microwave Oven− Disability Access (select homes)− Frost-Free Refrigerator\/Ice Maker− Large Windows− Private Entrance To Each Unit− Vaulted Ceiling (select homes)− Washer And Dryer In Each Apartment Home− Wired For High-Speed Internet− Wooded View\/Pool View (select homes)   Contact us for more information! --  show contact info\n--Our Pet-Policy: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonWebsite: https:\/\/www.thegatewayapartments.com\/Property Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY970F506CB0054A\n","num_images":12.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '779ft2', 'available apr 7', 'air conditioning', 'application fee details: 60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T10:24:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-on-site-bike-storage-bark\/7595633478.html","post_id":7595633478,"title":"On-site bike storage, Bark park, Pet-friendly living","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities.Amenities Include:48-hour Maintenance CommitmentOn-site bike storageUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsPet-friendly livingJogging trail right outside your doorHuge walk-in closets with ample storageOnline Payments AvailableBocce ball fieldFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingState-of-the-art fitness center overlooking the Manayunk canalMarble master baths, some with deep linen storageBark parkCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/c24mzv7n\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '2115ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2023-03-04T10:15:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-affordable-3br-home-modern\/7595630664.html","post_id":7595630664,"title":"Affordable 3BR Home: Modern Finishes, Spacious Rooms! -  330 Roland Dr","description":"Check out this cozy Norristown home for just $975\/month! With modern finishes and plenty of living space, you'll feel right at home. Whip up a meal in the fully-equipped kitchen with granite counters and all-white cabinetry. Spend your downtime in the spacious bedrooms with plenty of natural light. Come make it yours today!","num_images":5.0,"lat":40.152523,"lng":-75.321899,"attrs":"['3BR \/ 2Ba', '1410ft2', 'available jul 7', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d hookups', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T10:07:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-beds-bath-ranch-home\/7595618858.html","post_id":7595618858,"title":"*** Nice 1 beds 1 bath Ranch Home For rent ***","description":"Clean, cute one bedroom apartment on the 3rd floor with a nice deck. Hardwood floors. Central air. Washer\/Dryer on premises. Great neighborhood within easy walk to University City, Rittenhouse Square and Downtown Philly, Schuylkill River Trail & Septa station, amazing restaurants & bars all around the area. Near supermarket, pharmacy, restaurants, nightlife, fitness center and cafes.Text Me---  show contact info\n)","num_images":3.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '2144ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2023-03-04T09:33:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-we-welcome-dogs-and-cats\/7595629404.html","post_id":7595629404,"title":"We Welcome Dogs and Cats at 1 Brown! Tour Today to get Great Specials!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Stunning Apartments in Northern Liberties Residences at 1 Brown offers stunning and spacious studios, one, two, and three bedroom apartments with premium features designed to help you live your best life every day. Each unit has oversized bedrooms and enough living space for both a media center and kitchen table. You will thoroughly enjoy the soaking up the ample space to relax or host guests! Upscale kitchens with cherry wood cupboards are brimming with the latest appliances complemented by granite countertops and ample storage space. Nearby, you can enjoy a spa shower and Jacuzzi tub in your bathroom, take advantage of your personal washer and dryer, and set up a special place for your pets. As you come home to your 1 Brown apartment each day, you're stepping into a place of comfort, convenience and class. Call Today!  Call Now:  show contact info\nx 140OR Text 140 to  show contact info\nto text us.Need more information? Copy this link:https:\/\/archcompanies.aptglance.com\/zq4zyqThis is a 2 Bedroom, 2 Bath, Approximately 1286 Sq. Ft.Features - Gourmet Eat-In Kitchens with Cherry Wood Cupboards  - Generous Closet Space  - 9 Ft Ceilings  - Stainless Steel Appliances  - Floor to Ceiling Windows  - Large Bathrooms  - Spa Shower System & Jacuzzi Tub  - Quartz Counter Tops  - Full Size Washer\/Dryer in unit  - Largest Apartments in the Area  - Nest Thermostats Community Amenities - Rooftop Walking Track & Dining Areas  - Amazing Views and Rooftop Lounge  - 24-Hour Concierge Service  - Spectacular Resort Style Pool Area  - Spacious Highrise Living  - Fully Outfitted Fitness Center  - Dry Cleaning Service Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMResidences at One Brown 1 Brown Street, Philadelphia, PA, 19123 Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! ve45xMph3fT\n","num_images":15.0,"lat":39.962145,"lng":-75.137734,"attrs":"['2BR \/ 2Ba', '1286ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T10:04:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-charming-bedroom\/7595619765.html","post_id":7595619765,"title":"This Charming 3-bedroom, 1-bathroom Home rent","description":"This Charming 3-bedroom, 2-bathroom Home .With Over 1,659 Square Feet Of Living Space, This Property Has A Great Chance To Be An Amazing Rental Opportunity. In Addition To The Large Living Quarters, Check Out The Spacious Attic! Head To The Spacious Yard To See The Added Bonus Of A 1-car Garage, Which Is A Rare Find In This Area! This Property Is In Fantastic Shape! With A Newer Roof And Beautiful Hardwood Floors, This Property Is Ready For Its New Owner! Don't Wait, Schedule Your Tour Today.\nPlease Call For More Information at: (941)-2144-910","num_images":3.0,"lat":40.1166,"lng":-75.0198,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T09:36:49-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-three-bedrooms\/7595626580.html","post_id":7595626580,"title":"BEAUTIFUL Three Bedrooms!!! Great Location in Philadelphia .","description":"BEAUTIFUL Two Bedrooms!!! Great Location in Philadelphia .. Come explore our spacious apartment homes at our conveniently located community, Choose from any of our one- and two-bedroom apartment homes or our two- and three-bedroom townhomes that includes plenty of closet space, full-size black and stainless appliances, in unit washer\/\/\/\/dryers and onsite laundry facilities, along with high-speed internet ready options. As a valued resident, you will have access to a 24-hour fitness center, resort style pool, and business center with free wi-fi. Since we are dedicated to everyone benefiting from calling our community their home, we house a playground to ensure lots of fun and two dog parks. Credit check application fee 24.95, Please contact ** TEXT:  show contact info","num_images":6.0,"lat":40.0018,"lng":-75.1179,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T09:57:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-rehabbed-bedroom-in\/7595626042.html","post_id":7595626042,"title":"Newly rehabbed 3 bedroom in Port Richmond","description":"Huge 3 bedroom in the heart of port Richmond.\nFew blocks from Gaul and comp, riverwards coffee etc.\nhardwood floors throughout, granite counter tops, dishwasher\/ garbage disposal 1\/2 bath on 1st floor, big yard, recessed lighting throughout, washer\/ dryer in basement, central air. Skylight in bathroom\nPlace has it all!\n1 Year lease\nCredit and backround check\n3 Months due at lease signing\n","num_images":24.0,"lat":39.983753,"lng":-75.107147,"attrs":"['3BR \/ 1.5Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T09:56:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/morrisville-tour-today-the-edge-at\/7595625516.html","post_id":7595625516,"title":"Tour Today! The Edge at Yardley!","description":"The edge at Yardley is a wonderful community located in Yardley PA. We offer many different kinds of units including one - , two -, and three-bedroom floorplans with bi-level living options. Our community features a rare combination of great location , generous space and wonderful amenities and features. To schedule a tour please call  show contact info\n#23108\nHours:\nMon-Fri: 9:00am-5:30pm\nSat: 9:00am-5:00pm\nSun: Closed\n","num_images":11.0,"lat":40.2084,"lng":-74.8291,"attrs":"['3BR \/ 2Ba', 'available mar 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T09:54:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-20-no-credit-check-fee\/7595621567.html","post_id":7595621567,"title":"$20, No Credit Check Fee ';';'; BEAUTIFUL Two Bedrooms!","description":"BEAUTIFUL Two Bedrooms!!! Great Location in Green Street Dog Park.. Come explore our spacious apartment homes at our conveniently located community, Choose from any of our one- and two-bedroom apartment homes or our two- and three-bedroom townhomes that includes plenty of closet space, full-size black and stainless appliances, in unit washer\/\/\/\/dryers and onsite laundry facilities, along with high-speed internet ready options. As a valued resident, you will have access to a 24-hour fitness center, resort style pool, and business center with free wi-fi. Since we are dedicated to everyone benefiting from calling our community their home, we house a playground to ensure lots of fun and two dog parks.\n","num_images":9.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'application fee details: $20, No Credit Check Fee', 'broker fee details: Zero $10 Broker Fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'listed by: Royal Management Group, Inc.', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T09:42:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-luxury-bedroom-the-edge-at\/7595623545.html","post_id":7595623545,"title":"Luxury 2 bedroom! The Edge at Yardley","description":"The edge at Yardley is a wonderful community located in Yardley PA. We offer many different kinds of units including one - , two -, and three-bedroom floorplans with bi-level living options. Our community features a rare combination of great location , generous space and wonderful amenities and features. To schedule a tour please call  show contact info\n#17102\nHours:\nMon-Fri: 9:00am-5:30pm\nSat: 9:00am-5:00pm\nSun: Closed\n","num_images":8.0,"lat":40.203849,"lng":-74.878794,"attrs":"['2BR \/ 2Ba', 'available apr 24', '\\nsaturday 2023-03-04\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T09:48:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-the-edge-at-yardley-tour-today\/7595620679.html","post_id":7595620679,"title":"The Edge at Yardley! Tour Today!","description":"The edge at Yardley is a wonderful community located in Yardley PA. We offer many different kinds of units including one - , two -, and three-bedroom floorplans with bi-level living options. Our community features a rare combination of great location , generous space and wonderful amenities and features. To schedule a tour please call  show contact info\n#17204\nHours:\nMon-Fri: 9:00am-5:30pm\nSat: 9:00am-5:00pm\nSun: Closed\n","num_images":9.0,"lat":40.203849,"lng":-74.878794,"attrs":"['1BR \/ 1Ba', 'available mar 24', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T09:39:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7595617044.html","post_id":7595617044,"title":"Pets Welcome, Lease Today, Quiet Community","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Easy Freeway Access\n* TV Lounge\n* Spa\n* Billiards\n* Fitness Studio\n* Minutes from Restaurants, Shopping, and Much More\n* Swimming Pool\n* Bark Park\n* Sun Deck\n* Professionally Managed\n* Pet Salon\n* Yoga Lounge\n* Community Lounge\n* Outdoor Grill Area","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '758ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T09:27:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-bed-2bath-luxury-living\/7595615219.html","post_id":7595615219,"title":"2 bed\/2bath - Luxury Living","description":"Apt. 2411 — Royal floor plan —1,293 sq. ft. — $3,609\nThis 4th floor Royal boasts 2 bedrooms and 2 bathrooms, on either side of the fully upgraded apartment. It has a spacious living room that can fit ample furniture, a dining set and bar stool seating. The master suite comes with an enormous walk-in closet and double sinks with a luminous walk-in shower. The guest bedroom is spacious as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment home is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":21.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1293ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T09:20:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/media-media-bed-bath-1st-floor-showing\/7595603300.html","post_id":7595603300,"title":"Media - 2 bed \/1 bath - 1st Floor - Showing TODAY 3\/4","description":"MEDIA - 2 BED\/1 BATH - Walking distance to downtown Media, Great location. Move in Ready Now. Available 4\/1Call Chris @  show contact info\nfor showingNewly remodeled in Media with hardwood floors and updated kitchen. Walking distance to trains to downtown Philadelphia, shopping, etc.Available Immediately!*RENTAL REQUIREMENTS* - MONTHLY NET INCOME: $3,900 Rates:$1350 per month. Tenant responsible for all utilities. Experience Everyone's Hometown of Media, PA:  A charming walk able town with shops, diverse restaurants and nearby parks.  Whether business in the County seat brings you to Media or visiting the Philadelphia area for pleasure, experience small town living with convenient public transportation to Philadelphia.Highlights of the Property Include:1. Washer and dryer available2. Tenant is responsible for all utilities. 3. Walking distance to Media SEPTA Train Station that will take you all the way to downtown Philadelphia, Penn University, Temple University, University City. 4. Near Penn State University Brandy Wine5. Walking distances to Delaware County Courthouse6. Walking distance to the restaurant and local shop, etc7. Near Movie Theater8. Near Riddle Hospital\/Media 9. Walking to distance to downtown Media and close to the post office, bank, Wawa store.Off street parking! Walk to train station or walk into town and enjoy the many fine restaurants. North on Route One, turn right at Hill's Seafood, go to stop sign. Property located across from stop sign.No Smoking or Indoor Candles!Call Chris @  show contact info\nfor showing\n2 bed\/1 bath. $1350 rent, 2+ Year lease preferred, longer term tenant\nAmenities:\n- Unfurnished\n- Smoke Free\nAppliances:\n- Air Conditioning\n- Microwave\n- Range\n- Refrigerator\n- Oven\n- Washer & Dryer - Basement\nLeaseLengths:\n- 12 Months lease - Prefer long term tenant\n- 24 Months lease - Prefer long term tenant\nUtilities:\n- Resident Pays Electricity\n- Resident Pays Gas\n- Resident Pays Heat\n- Resident Pays Water\n- Resident Pays Trash Pick-up\n- High-Speed Internet Available\nContact M&C at  show contact info\nfor more information\n","num_images":24.0,"lat":39.915968,"lng":-75.394898,"attrs":"['2BR \/ 1Ba', '800ft2', 'available apr 1', '\\nsaturday 2023-03-04\\n', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T08:31:36-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-short\/7595606313.html","post_id":7595606313,"title":"Beautiful 3-bedroom short-term rental available now!","description":"Beautiful open floor concept, partly furnished home in Port Richmond available for immediate move-in! Three bedrooms, two bathrooms, central air, new dishwasher, oven, microwave, and washer and dryer, with finished basement. Right off 95 and around the corner from all major bus routes. Walking distance to parks, River Wards Cafe, the Lunar Inn and just over a mile away from all that Fishtown has to offer.\nRental period is now through May 15th, with a possibility to sign on for a 12 month lease agreement. $1,550\/ mo, with security deposit.\nPlease contact us with details about yourself and we can move forward with scheduling a viewing then. Come visit this gorgeous mid-century modern Scandinavian home before it's gone!\n","num_images":18.0,"lat":39.986041,"lng":-75.111723,"attrs":"['3BR \/ 2Ba', '954ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T08:45:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-first-floor\/7595589885.html","post_id":7595589885,"title":"Lovely first-floor apartment(low price)with great city view","description":"Lovely first-floor apartment(low price)with great city view. The light and bright open floor plan now with brand new sliding glass doors and windows. As you enter, you will notice gorgeous hardwood floors, tons of picture windows showcasing the beautiful backyard and an abundance of natural light flowing in. There is a full bedroom and bathroom on one side of the house for guest quarters or a place for the in-laws to stay. The primary bedroom with en suite, office and additional bedroom with hall bathroom on the other side of the home complete the great floor plan. The kitchen includes a nook table and benches, which overlooks the picturesque front deck. The sellers also recently upgraded the cook-top with a new Bosch burner stove with griddle. There is also a separate dining area that opens up to the living room and has a custom wood and metal bar railing in-between, making this an excellent space for entertaining. The sunken family room with wood burning stove offers space to cozy up in front of the second set of slider doors to the park like setting outside. The pool is practically brand new, along with all of the landscaping! The sellers have done a ton of work in this private and peaceful backyard including new retaining walls to create a 3-tiered backyard with the upper level perfect for a bocce ball court or horseshoe pits, tons of new plants, new fencing, grass, a lighted pergola and all on drip and automatic sprinklers. You will not want to get out of this beautiful, custom-built pebble tech pool with a waterfall feature. Located in a quiet building in a quiet, friendly neighborhood, you will be only one block from Broad St near Snyder Ave. Public transportation is close and convenient and there are plenty of restaurants and shopping plazas nearby.\nCommunity Amenities\nPool\nFitness Center\nLaundry Facilities\nFurnished Units Available\nElevator\nClubhouse\nControlled Access\nRecycling\n","num_images":1.0,"lat":39.923199,"lng":-75.171679,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T07:06:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-photos-are-of-similar-unit\/7595604249.html","post_id":7595604249,"title":"***Photos are of a similar unit, every unit is unique.***","description":"***Photos are of a similar unit, every unit is unique.*** Welcome to 1217 Spring Garden! This five-story building, the first reinforced concrete structure in the city, began life towards the end of the 19th century as the home of the Bilgram Machine Works and was later converted into this uniquely designed loft-style building featuring 40 units in its entirety. Each unit with its own DNA and original structure! As you enter the building using it’s smart building access controls, you’ll find a lobby designed to both pay homage to the building’s 19th-century industrial past and add some 21st-century gloss. You’ll also take notice of its wheel chair accessibility and new elevator in the former freight elevator shaft. Mail room is also located in the main lobby for convenience. Take a ride up to the 3rd floor where you’ll find unit 304. Walk right into the original industrial DNA design including its original hard wood flooring, loft, and brick exposed walls. You’ll surely take notice of it’s high ceiling and solid structure! As you move along you’ll find a large kitchen with plenty of cabinet storage and all of your essential appliances and your two nicely sized bedrooms. Your master bedroom includes a large closet and master bath! Make sure you stop by the fitness center and bicycle + skateboard storage room located on level B. Enjoy the tour!\n1217-35 Spring Garden St #304","num_images":9.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '917ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T08:35:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-one-bedroom\/7595587926.html","post_id":7595587926,"title":"Beautiful one bedroom apartment off amazing Fitler Square. Beautiful,","description":"Beautiful one bedroom apartment off amazing Fitler Square. Beautiful, quiet, family filled neighborhood within easy walking to University City, Rittenhouse Square, Downtown, tennis and basketball courts, a great dog park, public gardens and the Schuylkill River walk\/bike way. Three blocks from City Fitness Gym, a supermarket, pharmacy, and great take-out! Dry cleaners on one corner, an Italian restaurant on the other. The apartment is in excellent condition with hardwood floors, central air, washer\/dryer on premises, and a very nice kitchen and a large deck, perfect for entertaining.\n","num_images":3.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '1659ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T06:49:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-everything-that-living-in\/7595588630.html","post_id":7595588630,"title":"Everything that living in the Art Museum area has to offer!!","description":"Start this winter in a Philadelphia Chapter Landmark Property originally designed in 1951! Enter through the spacious remodeled lobby where you are greeted by a 24-hour front desk attendant. The property features a fitness center on the lower level along with common areas where you can relax and watch TV or catch up with friends with a game of pool. There's also a place to store your bike in the designated bike room. Looking for outdoor space? There's a roof deck that offers panoramic views of the city! The views are simply breathtaking! This large north facing one bedroom has beautiful hardwood parquet floors and a view you will LOVE! The living area and bedrooms are spacious and have tons of closet space. Monthly rent includes gas. SUPER Pet Friendly!! Come see what all the buzz is about at The Parkway House and everything that living in the Art Museum area has to offer!! ***Pictures featured are of the new model unit.***\n2201 Pennsylvania Ave #817","num_images":12.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-03-04T06:56:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bed-bath-apt-on\/7595588106.html","post_id":7595588106,"title":"Spacious 4 bed\/3 bath apt on a beautiful block lined with trees!","description":"Available March 1, 2023 Either can be rented out as a 3 bed\/3 bath or a 4 bed\/3 bath Start the new year at the new, modern, and spacious apartment on a beautiful block lined with trees and close to bars, restaurants, public transportation, Art and many other museums, the center of the city, and more! Truly an amazing location for your professionals that want to live in luxury close to major points of interest for a reasonable rent. The building was constructed in 2018 and it has all the modern stainless steel appliances, beautiful bathrooms, central A\/C and heating, hardwood floors throughout; a very spacious living area with 11 ft ceilings, large bedrooms with enough space to comfortably fit a queen-size bed, desk, dresser and whatever else you have got! The closets are deep and have installed clothes organizers. An in-unit washer and dryer, a security system, and cameras throughout the building! An amazing property management company, a convenient tenant portal to pay rent. First, last, and a security deposit is required to move in.\n1516 Green St #A","num_images":10.0,"lat":39.9677,"lng":-75.1735,"attrs":"['4BR \/ 3Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:51:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-spacious\/7595588041.html","post_id":7595588041,"title":"Newly Renovated, Spacious and sunny 2 bedroom, 2 bath apartment","description":"Available Feb 18. Spacious and sunny 2 bedroom, 2 bath apartment with convenient off-street PARKING spot, available now. Unit is bi-level and has been newly renovated. Main area includes a full kitchen, dining area, large coat closet, living room with wood burning fireplace. Two bedrooms and two full baths upstairs. Abundant natural light. Stacked washer & dryer, High ceilings. Great storage. Off street parking included with rent. Excellent Green St location. Walk to The Barnes, Whole Foods, and more. Close to SEPTA subway and bus lines.\n1617 Green St #4","num_images":10.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:50:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-furnished-bi-level\/7595588612.html","post_id":7595588612,"title":"Fully Furnished Bi-level 1BR apt with Private outdoor space in Fishtow","description":"Fully Furnished Bi-level 1BR apartment with Private outdoor space in Fishtown available NOW! The unit features the gleaming hardwood flooring, kitchen with stainless-steel appliances, including a gas stove, microwave and garbage disposal. Split wall AC\/heat unit in each room. A nice open living room with an L-shape couch, TV and a dining table with chairs. The lower level features a good size bedroom, a full bathroom with a standing shower, full size washer and dryer, and a private outdoor space. In addition to the features of the unit itself, you'll love the location. A quiet, residential block just steps away from local dinning and shops such as Baltic Bakery, Kraftwork, Lloyd & Fishtown's Frankford Ave corridor. There are also a few Stephen Starr restaurants very close by as Suraya, Fetta Sau & William Mulherin's Sons are all within close proximity. Within 10 min walking to Girard Train Station. Easy access to I-95. You won't want to miss an opportunity to call this your own! **Off the street parking is available for an additional $100 per month. Please note: only a small car or motorcycle would be suitable for this parking spot.** VIDEO TOUR IS AVAILABLE! Call or TEXT Now to schedule your appointment at (267) 884-5 zero 45 (I usually reply on text messages within 10 min, ask for Kateryna).\n620 E Flora St #1","num_images":7.0,"lat":39.9788,"lng":-75.1262,"attrs":"['1BR \/ 1Ba', '650ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:56:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apartments-offer-modern\/7595588583.html","post_id":7595588583,"title":"Apartments offer modern living in a historic district","description":"Welcome to 1705 Spruce St! Nestled in the desirable Rittenhouse Square neighborhood, these new 2021 full gut-rehabbed apartments offer modern living in a historic district. With construction finalized in 2021, these brand-new units offer high-end appliances, plenty of closet space, and lovely views. With seven (7) available units, there are a variety of floorplans available for those seeking either a studio or 1-bedroom. You won’t have to worry about laundry, as each apartment has access to laundry on the first floor and some select floor-plans offer an in-unit washer\/dryer! With so many attractions nearby, this location is the epitome of ideal: steps away from Rittenhouse Park, Starbucks, restaurants, shopping, and so much more. Transportation is a breeze, with countless bus routes around the corner and just a quick stroll to the BSL. We have three featured units at the moment, but you can find the floor-plans for all units throughout this website. For questions or to request a tour, please contact the Philly Home Advisors! Unit 1R is approximately 300 sq ft offering a kitchen with brand new stainless-steel appliances, dishwasher, and quartz countertops. With lots of cabinetry, there is plenty of storage! The bathroom includes a shower\/tub combo, new vanity, and gorgeous modern tiling. The bedroom offers a comfortable space, lots of natural lighting, and a nicely sized closet. This 1-bed, 1-bath is offered at $1,395 a month, plus the cost of utilities. Located right outside the unit is the communal laundry, where two (2) sets of free washers and dryers are found for the tenant’s convenience.\n1705 Spruce St #2","num_images":9.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '4187ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-04T06:56:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-move-in-ready-this-sun\/7595587426.html","post_id":7595587426,"title":"Move in ready! This sun splashed home on the 35th floor","description":"Move in ready! This sun splashed home on the 35th floor, offers panoramic sunset views on one side and gorgeous views of Liberty Place on the other. What a great, meticulously maintained home which features Pergo type flooring throughout, a completely renovated and tiled bathroom, an open renovated kitchen with a tumbled marble backsplash and an additional island with extra drawers for storage underneath a butcher block breakfast bar offering seating for four. Academy House is a 37 story condominium tower with recently renovated hallways, recently replaced exterior doors and windows, and is now undergoing a state of the art transformation in the lobby and arcade area. There is monthly valet parking available in the building, as well as a fitness room and deck for sunbathing that is included. Rent includes all utilities . If interested listing agent will prepare lease- see instructions in agent private. Internet \/cable is an additional $69.05 per mo.\n1420 Locust St #35H","num_images":7.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '624ft2', 'available apr 7', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-03-04T06:43:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-unit-in\/7595585855.html","post_id":7595585855,"title":"1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Sq!!","description":"Just 1st month's rent and $500 security deposit to move-in!!! 1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. Hardwood floors in the living area and the bedroom is carpeted. The Warehouse Property is located in a highly walkable area with access to all forms of public transportation. Secured entry, gated property, gym\/fitness center, on-site parking (additional $250 month) with full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit.\n9 N 9th St #701","num_images":9.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '737ft2', 'available mar 6', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:23:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bi-level-bedroom\/7595586064.html","post_id":7595586064,"title":"Spacious bi-level 1 bedroom unit at the pet-friendly Metro Club","description":"Spacious bi-level 1 bedroom unit at the pet-friendly Metro Club with a washer\/dryer in unit and 1 secured gated parking spot included. The unit has a great deck. Great natural lighting, expansive windows, open layout, modern stainless steel appliances, beautiful hardwood floors, pendant lights above the breakfast bar. Closet galore, double bathroom sinks! Metro Club in an elevator high-rise with a heated outdoor pool, Boutique hotel-style lobby, fireplace, and lounge seating. Secured entry and controlled building access with a full gym. Easy access to Market East SEPTA station and SEPTA bus routes and many area local attractions including Reading Terminal Market, Maggiano's Italy, The Melting Pot etc. Pictures are of a similar unit!\n201 N 8th St #PH909","num_images":10.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '1180ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:26:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stunning-bi-level-bed-bath\/7595586138.html","post_id":7595586138,"title":"stunning bi-level 2 bed, 1 bath apt in the sought-after Society Hill","description":"Experience the ultimate in urban luxury with this stunning bi-level 2 bedroom, 1 bathroom apartment in the sought-after Society Hill neighborhood of Philadelphia. Boasting 1000 sq ft of living space, this home offers ample room to entertain and relax. The open floor plan and bi-level design create a warm and inviting atmosphere, while the private deck provides a peaceful outdoor escape. The apartment's state-of-the-art finishes, including high-end appliances and premium fixtures, make it truly one-of-a-kind. Don't miss this incredible opportunity to live in style in one of the city's most desirable neighborhoods!\n327 Pine St #3R","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:27:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-here-is-your-chance-to\/7595587365.html","post_id":7595587365,"title":"Here is your chance to rent a unit","description":"Here is your chance to rent a unit in the highly sought after Beaux Arts Lofts building in Center City! Sporting hardwood flooring throughout, this 740 sq. ft. unit offers a spacious layout along with modern finishes. Upon entry, you are greeted with a spacious living\/dining area. The kitchen offers plenty of counterspace and is equipped with an electric range, stainless steel refrigerator, and a dishwasher. Just past the kitchen, you will find an elevated sleeping quarter. On top of the unit itself, tenants also have access to a beautiful roof deck, offering a gorgeous view of the city skyline. This building also offers a fully functional elevator for tenants to travel floor to floor. Schedule your tour today!\n1238 Callowhill St #501","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['0BR \/ 1Ba', '740ft2', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:42:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-530-2nd-st\/7595586905.html","post_id":7595586905,"title":"Welcome to 530 S 2nd St Fully Furnished Condo in Beautiful Condition!","description":"Welcome to 530 South 2nd Street, Unit 819 a fully furnished condo in beautiful condition! Walk into a newly renovated open concept kitchen, finished with new hardware and cabinetry designed for maximum storage. The kitchen is also equipped with granite countertops, stainless steel appliances and a spacious peninsula, perfect for dining and entertaining. Continue into the airy living room where you will find ample space for lounging on the couch or working at the newly custom built-in desk. The couch easily turns into a queen-size sleeper sofa, ideal for hosting friends or family overnight! Off the living room you will find the bedroom, recently fitted with new windows and stylish, yet practical, plantation shutters. The master closet was recently transformed into the ultimate dream closet! Designed by California Closets, no expense was spared to ensure that you will have more than enough space for your wardrobe. Also, off the living room you will find the bathroom with beautiful stone tile throughout, generous storage space, and a shower\/tub completed with bath jets. Here you will also find your very own washer and dryer. Not only is the inside of this unit amazing, but the private covered balcony offering picturesque views of the city provides the perfect combination of indoor-outdoor living. This unit comes fully furnished, with all the furniture being in excellent condition. Also included is complete access to the gym in the building, an outdoor garden with seating, 24\/7 security, and access to a covered parking garage with the option to rent a parking space. Located in the historic area of Society Hill, this unit is surrounded by charm and beauty. You also can't beat the convenience of being only steps away from award-winning restaurants, bars, coffee shops, bakeries, and more. Don't miss out on the opportunity to make this penthouse unit in Abbotts Square your next home. Owner is related to the listing agent.\n530-10 S 2nd St #819","num_images":7.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '468ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:36:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-two-bedroom-house\/7595586690.html","post_id":7595586690,"title":"This Two Bedroom House Sits on a Quiet Block and is Available for Rent","description":"Located in Graduate Hospital this two bedroom house sits on a quiet block and is available for rent! This property features hardwood flooring throughout, a fenced in yard, and a washer and dryer located in the partially finished basement. Just blocks from Rittenhouse Square, and University City\/CHOP and some of Graduate Hospitals best amenities. First, Last, and Security Deposit due a signing.\n2041 Pemberton St","num_images":9.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '750ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:33:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bed-apt-in\/7595585405.html","post_id":7595585405,"title":"Spacious 2 bed apt in a landmark building with a newly renovated lobby","description":"$500 Security Deposit and 1st Month's Rent to move-in!! Spacious 2 bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block off the Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of the actual unit! Video can be provided upon request!\n1411-1 Walnut St #808","num_images":10.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '970ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:16:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-bed-furnished-apt\/7595586481.html","post_id":7595586481,"title":"Lovely 1 bed furnished apt in wonderful Washington Square West","description":"Lovely 1 bedroom furnished apartment in wonderful Washington Square West. Located on a quaint, tree-lined street just steps from popular restaurants and coffee shops, the Theatre District, Jefferson and Pennsylvania Hospitals, the University of the Arts as well as Kahn, Rittenhouse Square, and Washington Square parks. Apartment includes a 50\" TV with Netflix, Disney+ and Wifi included. The unit has hardwood floors, a washer & dryer, and a queen sized bed. Pets permitted with owner's approval.l.\n302 S Juniper St S #2","num_images":6.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '1554ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:31:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautifully-renovated\/7595586305.html","post_id":7595586305,"title":"This Beautifully Renovated Bi-level Apartment Features","description":"This beautifully renovated bi-level apartment features original detailing with tastefully updated finishes in the kitchen and bathroom. This 1 bedroom, 1 bathroom unit is nestled in the Graduate Hospital neighborhood, just blocks from the amenity of Center City.\n2303 Christian St","num_images":10.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '1400ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-03-04T06:29:13-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-we-wish-you-the-best-of\/7595585747.html","post_id":7595585747,"title":"We wish you the best of luck in your home search!","description":"It is my distinguished honor to present to you 436 E. Thompson St. available for immediate occupancy. Located in the Heart of Fishtown, along the Delaware River, anchored by Commercial Mixed Use Corridors, including South St, and surrounded by residential properties, this property is situated at the intersection of a quaint & quiet neighborhood. This 3 story new construction townhouse features high end finishes and rooftop space. There is currently an occupant in the building and we are searching for 2 additional roommates. There is a 1 bedroom with a shared bathroom on the 2nd floor renting for $1050\/month and a 3rd story bedroom loft with private en suite bathroom renting for $1475\/month. All occupants will have access to the rooftop and backyard space and common living area (kitchen, living room, and dining room) The main floor features hardwood floors with high end finishes and lacquer cabinetry & open space that leads into a private backyard space. The property is filled with radiant natural light and illumination from large windows. Walk upstairs to the 2nd floor with 2 bedrooms and a shared bathroom. Continue up the winding staircase to the 3rd story bedroom loft with intricate dimensions and angles allowing for extra ceiling height. The 3rd floor has a loft bedroom and private en suite bathroom. The property is close to bus stops and close to multi-modal public transportation, commercial mixed used corridors with many retail businesses, food establishment, and other entertainment and amenities. To apply, we are running credit reports, criminal backgrounds, eviction history, and reviewing all income & financial documentation. If you are selected as a tenant, we will collect first, last & security deposit(one month). There are no minimum score requirements. The entire financial and credit profile will be reviewed in its entirety to determine application viability. We look forward to doing business with you and we will ensure a smooth, efficient, and professional process for all parties. Thank you for the opportunity to showcase this home and we wish you the best of luck in your home search.\n436 E Thompson St #1","num_images":12.0,"lat":39.9788,"lng":-75.1262,"attrs":"['1BR \/ 1Ba', '2037ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-03-04T06:21:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-splendidly-renovated\/7595585950.html","post_id":7595585950,"title":"Splendidly renovated warehouse in Franklin Square offers unique apt!!","description":"Just 1st month's rent and $500 security deposit to move-in!!! This splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. The Warehouse is located in a highly walkable area with access to all forms of public transportation. Amenities include secured entry and controlled building access, on-site parking (additional $250\/month), full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit in the building!\n9 N 9th St #509","num_images":9.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', '893ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:24:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-loft-style-one-bedroom-in\/7595585649.html","post_id":7595585649,"title":"Loft-style One Bedroom in a Boutique Rittenhouse Building!","description":"Rare, HUGE (1300 SQFT!), loft-style one bedroom in a boutique Rittenhouse building. Plenty of room for a work from home scenario if need be. Elegant with tall ceilings through-out, hardwood floors, great windows for natural light, dining room and open kitchen with granite countertops and stainless steel appliances. The spacious bedroom has lovely french doors and two sizable closets. Additionally, there is extra storage and private brand new laundry in the basement (directly accessible from the unit). Perfectly located in the desirable Rittenhouse Square Area, this home is in the heart of Center City with fine dining, one-of-a-kind shopping, exciting nightlife, and world-renowned cultural destinations. The campuses of Penn and Drexel, 30th Street Station and major hospitals are all minutes away. No pets. Tenant pays electric, water and gas included. Available asap! Landlord prefers at least 15 month lease. First, last and 1 month security due at signing.\n253 S 21st St #1","num_images":7.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '1360ft2', 'available mar 10', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T06:20:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-unit-has-oversized-windows\/7595585436.html","post_id":7595585436,"title":"Unit has oversized windows which provide wonderful natural lighting","description":"The beautiful tree line street sets the setting for this bright and spacious first floor condo with gated parking (#4). This unit has oversized windows which provide wonderful natural lighting. The Living room has gorgeous hardwood floors, high ceilings. The kitchen features include dishwasher, microwave, electric stove and ceramic tile floor. There is a bonus room which could be dining area or work area or a possible bedroom with a powder room. The upper level features the main bedroom with. bathroom and an attached balcony. The shared open courtyard is great for entertaining, grilling or relaxing. Enjoy all of the conveniences of city living and walking distance to the Art Museum, The Barnes, Kelly Drive, Whole Foods, Target and public transportation\n1705-11 Green St #1707B","num_images":9.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 2Ba', '870ft2', 'available now', 'apartment', 'laundry in bldg', 'detached garage', 'rent period: monthly']","posted_date":"2023-03-04T06:16:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-a2-storyeasy-lifestyle\/7595583097.html","post_id":7595583097,"title":"A(2-story)Easy-lifestyle modern apartment*Fitness Center","description":"A(2-story)Easy-lifestyle modern apartment. Located within walking distance to Broad St for the subway, Fairmount Ave which offers bars, restaurants, and convenience stores as well as Kelly Drive for your daily exercising routine.\nBrand new hardwood throughout\nSpacious porcelain and tile full bath\nNew kitchen with all stainless steel appliances\nLarge double closet in the bedroom\nOriginal built-in vanity in the bedroom\nCentral air\nCoin-op laundry facilities in building\nTenant pays gas, electric and hot water in addition to rent\nPet-friendly\nApartment Features-\nAir Conditioning\nHeating\nCable Ready\nTub\/Shower\nKitchen\nMicrowave\nRange\nHardwood Floors\nDining Room\nWalk-In Closets\nWindow Coverings\n","num_images":5.0,"lat":39.968861,"lng":-75.166611,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T05:38:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bedroom-15\/7595571071.html","post_id":7595571071,"title":"newly renovated 3 bedroom, 1.5 bathroom house","description":"This is a newly renovated 3 bedroom, 1.5 bathroom house located near Frankford Ave in the Kensington\/Port Richmond neighborhood of Philadelphia.\nUpon entering, you have an open-concept floor plan, including the living room and dining area when you walk in on the 1st floor. It features new floors, black steel bannisters, and recessed lighting. The kitchen has a stainless steel refrigerator, stove, dishwasher, microwave, and granite countertops. There is a finished basement with tiled floors and recessed lighting. The three bedrooms are located on the second floor and are bright and sunny. The full bathroom is newly tiled with a tub\/shower and under the sink storage.\nThere is huge backyard located in the rear of the home.\nThere is spacious porch located in the front of the home.\nThere is a washer\/dryer hookup and the powder room is located in the finished basement.\nThis unit has radiant heat.\nThis property is located very close to Frankford Ave, stores on Aramingo Ave, and Interstate 95.\nTenants are responsible for all utilities - gas, electric, and water. Tenants are responsible to obtain Renters Insurance.\nPet Policy: Cats OK with $300 Deposit, Dogs not allowed.\nAvailable for move-in on April 1st!\nPlease Note: The property will stay on the market until we received a security deposit (equal to one month's rent). Once we receive your security deposit, we will take the property off the market. We collect first month's rent, last month's rent, and a security deposit for all our properties.\n","num_images":11.0,"lat":39.995714,"lng":-75.103238,"attrs":"['3BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T01:56:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bedroom-colonial\/7595557916.html","post_id":7595557916,"title":"This 2 bedroom Colonial-style condo is located in the highly sought","description":"Welcome to Liberties West! This 2 bedroom Colonial-style condo is located in the highly sought after neighborhood of Northern Liberties. This gated community offers unique architectural elements, nestled within a gorgeous, well-manicured, courtyard setting, with charming walking paths bordered by pretty flowers and shaded by mature trees. Unit is tenant occupied (lease ends on 2\/28). Tenant is up to date on all rental payments. Reach out to seller agent for more info.","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '631ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-03T23:47:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-bed-bathroom\/7595556175.html","post_id":7595556175,"title":"AvAiLabLe 2 Bed, 1 Bathroom REnT In Philadelphia","description":"Nestled in East Kensington, 2628 Jasper Street offers a cozy abode with timeless charm. Built in 1875, this two-bedroom, one-bath home has been lovingly updated by the current owner. Living room, dining room, working kitchen with electric stove, laundry room and utility closet. The house has been freshly painted and the hardwood floors have been refinished. There is new flooring in the kitchen and laundry & bath; replacement windows. Central a\/c, gas heat, electric cooking and electric hot water heater. **showings will be set up upon application approval and prior to security deposit being paid**Pets Allowed. Ready to view now. Credit issues or Apply for rent-to-own!\nCheck Your Credit Before You Lower Your Mortgage Payment. Text me for details, (419) 740-03-82 I will contact you soon.","num_images":4.0,"lat":39.984741,"lng":-75.132208,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2023-03-03T23:35:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-duplex-apartment-society\/7595558308.html","post_id":7595558308,"title":"Duplex Apartment - Society Hill - 2 Br\/2 Ba","description":"$2753.00 per month, available April 1.\nA 2-bedroom, 2-bath apartment.\nIt could also be a great home office, with the second bedroom as an office and the common garden to enjoy work breaks.\nThe apartment is located on a manicured, family oriented, tree lined street in Society Hill in a red brick building. It is only 50 yards (1\/2 block) from supermarket, dry cleaner, drug store and liquor store. Also in walking distance to fitness centers, historic districts, places of worship, and public transportation (SEPTA and NJ Transit). There is easy access to major auto routes including PA Expressways, 95 N and S, and NJ bridges if you are a commuter.\nThe listed amenities\/conveniences are...\nbalcony off larger bedroom\n50 yards (1\/2 block) from supermarket, dry cleaner, drugstore\nCalifornia Closets walk-in closet\nclothes washer\/dryer in unit\ndishwasher\ngarbage disposal\ngarden access\/shared\nhardwood floor\npersonal storage\nrefrigerator\/freezer with icemaker\nsecurity cameras\nstove\/oven\/microwave\nMitsubishi split system, heating\/cooling system\nYearly lease. Water included. Permit street parking. Local parking garage options. Owner operated, well maintained. Shared garden. A non-smoking building.\nThank you.\n","num_images":15.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1000ft2', 'available apr 1', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-03T23:50:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rarely-offered-modern-unit\/7595550324.html","post_id":7595550324,"title":"Rarely Offered! Modern Unit With Big Windows Tons Of Natural Light!","description":"Reply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nProperty Details:\n- 1034 Spruce St\n- 2 Br\n- 2 Ba\n- 1,000 Sqr ft\n- $3,200\/mo\n______________________________________\nA rarely offered – Spacious and Modern 2 Bedroom, 2 Bath Apartment with Windows Galore, Hardwood Floors, Beautiful Kitchen, Spacious Bedrooms, Fabulous Closet and Storage Space and one of the best layouts around (Both Bedrooms on opposite sides). Enter this beautiful unit into an expansive Foyer area with Coat Closet and leading to a Large Living Room\/Dining Room with Floor to Ceiling Windows Surround, Wide Plank Maple Flooring, Functional Kitchen with lots of Cabinet Space, Black Absolute Granite Counter Tops, Stainless Steel Appliances, Plus an Expansive Granite Breakfast Bar with Designer lighting above. Master Bedroom Suite with a Wall of Windows, Huge Walk in Closet and a Full oversized Bath tastefully done with Crema Marfil Imported Marble plus a Walk in Frameless Glass Shower and a front-loading Washer\/Dryer. The Guest Bedroom\/Office has lots of Windows and Large Closet. Just off of this Guest Bedroom is the 2nd Full Tile Bath.\nThis is a fabulous and well-maintained Boutique Building approximately 15 years young and located in the heart of Washington Square West. The Main Lobby area features a very comfortable lounge like sitting area. The building has a 24\/7 Security System and elevator. Centrally located to all the city has to offer and within walking distance to many Restaurants, Café’s, Parks, Playgrounds, Shopping and Public Transportation.\n______________________________________\nReply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nListed by Compass\nDRE #B069094","num_images":18.0,"lat":39.95,"lng":-75.16,"attrs":"['2BR \/ 2Ba', '1000ft2', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-03T22:56:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-fully-furnished\/7595539798.html","post_id":7595539798,"title":"Available Fully Furnished! Spacious Condo With Great Views!","description":"Reply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nProperty Details:\n- 2101 Market St\n- 1 Br\n- 1 Ba\n- 743 Sqr ft\n- $2,650\/mo\n______________________________________\nCan be rented fully furnished for $2800\/mo A spacious and luxurious condominium with great North\/West facing views. This 1-bedroom, 1-bath residence features modern and luxurious finishes including granite countertops, wood floors, stainless steel appliances, 9 -foot ceilings with floor to ceiling windows.\nThe price includes a reserved parking space in the attached covered garage, and a storage locker. The building features a 24HR Concierge, fitness center, a heated 60FT lap pool, renovated sundeck\/community room and much, much more!\nThe building is situated conveniently next door to Trader Joes and Wine & Spirits - and is just walking distance from Philadelphia's top-rated restaurants. Spend the day shopping in Rittenhouse, or enjoying the sights at Boathouse Row, you can't beat the location and attractions nearby!\n______________________________________\nReply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nListed by Compass\nDRE #B069094","num_images":16.0,"lat":39.954,"lng":-75.176,"attrs":"['1BR \/ 1Ba', '743ft2', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-03T21:57:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-penthouse-unit-featuring\/7595537150.html","post_id":7595537150,"title":"Penthouse Unit Featuring Large Private Deck In Prime Location!","description":"Reply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nProperty Details:\n- 1701 South Street\n- 2 Br\n- 2 Ba\n- 900 Sqr ft\n- $2,995\/mo\n______________________________________\nPENTHOUSE 2 bed 2 bath featuring private large deck. Hardwood Flooring, Open living space, Recessed Lighting, Stainless Steel Appliances & Backsplash, Stone Countertop, Washer\/Dryer in Unit. Easy access to Penn, Graduate Hospital, and a few short Blocks to Rittenhouse! Within One Block in Either Direction Restaurants: Acclaimed Pumpkin Restaurant, Founding Father's Sports Bar & Grill; South Street Bistro and so many more;\nPublic Transportation. Pets welcome with one time $250 deposit and $25\/month. Monthly garage parking across the street. Please note this is a non-smoking building. Available April 10th. ONLY 1st month's rent and 1\/2 month security deposit needed at lease signing!\n______________________________________\nReply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nListed by Compass\nDRE #B069094\n","num_images":12.0,"lat":39.9507,"lng":-75.1626,"attrs":"['2BR \/ 2Ba', '900ft2', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-03T21:44:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-must-see-very-large\/7595810420.html","post_id":7595810420,"title":"Must see Very large 2 Bedroom 1 Bathroom For Rent!!!","description":"Visit your new apartment home by taking a tour with Jenna today! Fully equipped kitchen, a dining area, cabinet and counter space, Stainless steel appliance. Appliance:-(Dishwasher, Refrigerator, Garbage disposal, Microwave, Range\/Oven). Hardwood stylish flooring throughout, Vaulted ceilings. Spacious bedrooms, An extra large master bedroom with over sized walk-in closet, Large bathroom and a large private balcony\/patio. In-unit washer and dryer. Attached garage parking. No smoking. Pets Allowed.  Please contact me if you are interested in viewing :-  show contact info","num_images":6.0,"lat":39.9845,"lng":-75.2282,"attrs":"['2BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T17:21:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2br-house\/7595814609.html","post_id":7595814609,"title":"2BR House","description":"Very nice two bedroom home 2800 block of Agate Street 19134, $1200 a month, first last and security + utilities.  Available now, proof of income must be employed for over a year and able to show proof of income. For more information call  show contact info\nM-F 10:AM-5PM Sat:10AM-2PM","num_images":0.0,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 1Ba', 'house', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T17:34:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-is-newly-renovated\/7595799158.html","post_id":7595799158,"title":"This is a newly renovated 3 bedroom, 1.5 bathroom house for rent.","description":"This is a newly renovated 3 bedroom, 1.5 bathroom house located near Frankford Ave in the Kensington\/Port Richmond neighborhood of Philadelphia.\nUpon entering, you have an open-concept floor plan, including the living room and dining area when you walk in on the 1st floor. It features new floors, black steel bannisters, and recessed lighting. The kitchen has a stainless steel refrigerator, stove, dishwasher, microwave, and granite countertops. There is a finished basement with tiled floors and recessed lighting. The three bedrooms are located on the second floor and are bright and sunny. The full bathroom is newly tiled with a tub\/shower and under the sink storage.\nThere is huge backyard located in the rear of the home.\nThere is spacious porch located in the front of the home.\nThere is a washer\/dryer hookup and the powder room is located in the finished basement.\nThis unit has radiant heat.\nThis property is located very close to Frankford Ave, stores on Aramingo Ave, and Interstate 95.\nTenants are responsible for all utilities - gas, electric, and water. Tenants are responsible to obtain Renters Insurance.\nPet Policy: Cats and Dogs allowed OK with $300 Deposit.\nAvailable for move-in on April 1st!\nPlease Note: The property will stay on the market until we received a security deposit (equal to one month's rent). Once we receive your security deposit, we will take the property off the market. We collect first month's rent, last month's rent, and a security deposit for all our properties. These balances MUST be paid in certified funds (cash, money order, or cashier's check - NO personal checks).\nFor more info, please submit an inquiry for this home. Applications are subject to our qualification requirements,\nconditions apply. CONSENT TO TEXT MESSAGING OR CALL: (917) 231-967 8  This Invitation Home is being enjoyed\nby another resident, but it will be available 01\/03\/2023. You can still apply contact us for\nmore details or apply now.\nListed by management company: New Age Realty Group, Inc.\nLocation: 3474 Amber St, Philadelphia, PA\n","num_images":16.0,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 1.5Ba', 'house', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T16:49:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-specials-floor-to\/7595802017.html","post_id":7595802017,"title":"Amazing Specials, Floor to Ceiling Windows with Stunning Views!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Stunning Apartments in Northern Liberties 1 Brown will check off everything on your list of must-haves with stunning luxury apartments in the neighborhood of Northern Liberties. Take a look at the variety of floor plans and choose the perfect spot for your lifestyle. No matter which residence you choose, your home will boast a spacious layout with classic, sophisticated interior finishes.A variety of relaxing amenities await you, including a rooftop with scenic waterfront views and, a fitness center, and a heated resort style pool. Conveniently located in the heart of the Northern Liberties neighborhood of Philadelphia, you’ll be surrounded by historical sites as well as a wealth of restaurants, entertainment options, and shopping. Call Now:  show contact info\nx 141OR Text 141 to  show contact info\nto text our leasing team.More unit details at:https:\/\/archcompanies.aptglance.com\/i26113This is a 2 Bedroom, 2 Bath, Approximately 1286 Sq. Ft.Features - Floor to Ceiling Windows  - Stainless Steel Appliances  - Quartz Counter Tops  - Spa Shower System & Jacuzzi Tub  - Largest Apartments in the Area  - 9 Ft Ceilings  - Large Bathrooms  - Generous Closet Space  - Full Size Washer\/Dryer in unit  - Nest Thermostats  - Gourmet Eat-In Kitchens with Cherry Wood Cupboards Community Amenities - Dry Cleaning Service  - Fully Outfitted Fitness Center  - Amazing Views and Rooftop Lounge  - Spacious Highrise Living  - Spectacular Resort Style Pool Area  - Rooftop Walking Track & Dining Areas  - 24-Hour Concierge Service Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMResidences at One Brown 1 Brown Street, Philadelphia, PA, 19123 Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! HczbmcZZ70v3\n","num_images":15.0,"lat":39.962145,"lng":-75.137734,"attrs":"['2BR \/ 2Ba', '1286ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T16:58:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-865-1br-personal-viewing\/7595799849.html","post_id":7595799849,"title":"$865 \/ 1br - Personal Viewing: 6^6  23 - 24 YEAR","description":"BEAUTIFUL One Bedrooms!!! Great Location in Fashion District Philadelphia .. Come explore our spacious apartment homes at our conveniently located community, Choose from any of our one- and two-bedroom apartment homes or our two- and three-bedroom townhomes that includes plenty of closet space, full-size black and stainless appliances, in unit washer\/\/\/\/dryers and onsite laundry facilities, along with high-speed internet ready options. As a valued resident, you will have access to a 24-hour fitness center, resort style pool, and business center with free wi-fi. Since we are dedicated to everyone benefiting from calling our community their home, we house a playground to ensure lots of fun and two dog parks.!!! Great Location in Providence .. Come explore our spacious apartment homes at our conveniently located community, Choose from any of our one- and two-bedroom apartment homes or our two- and three-bedroom townhomes that includes plenty of closet space, full-size black and stainless appliances, in unit washer\/\/\/\/dryers and onsite laundry facilities, along with high-speed internet ready options. As a valued resident, you will have access to a 24-hour fitness center, resort style pool, and business center with free wi-fi. Since we are dedicated to everyone benefiting from calling our community their home, we house a playground to ensure lots of fun and two dog parks.","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T16:51:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-kohler-tub-shower-and\/7595790566.html","post_id":7595790566,"title":"Kohler tub \/ shower and fixtures =(1BD+1BA)=efficient house~!!","description":"Completely renovated in 2021, 1 bedroom, 1 bath efficient house that is located on a nice lot. Showings scheduled in advance only. Prime location just outside of 716 Buttonwood St, Norristown, PA !.\nComplete renovation to include; roof with energy efficient spray foam insulation, new kitchen, cabinets, granite countertops stainless steel Frigidaire appliances and gas stove. Bathroom has tile floors, Kohler tub \/ shower and fixtures, blue tooth speaker, and vanity. Tongue and groove vaulted ceiling with LED track lights and remote control ceiling fan. Built in shelving and wood trim. @@CONTACT: For serious Inquires please text your phone number.","num_images":3.0,"lat":40.1245,"lng":-75.3304,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly']","posted_date":"2023-03-04T16:24:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/north-wales-theres-no-place-like-home\/7595794079.html","post_id":7595794079,"title":"There's No Place Like Home At The Hunt Club!","description":"Come home to a great community - Hunt Club Apartments!Address: 10 Hunt Club Trl North Wales, PA 19454Beds: 1  \/ Baths: 1 \/ Size: 680 sq ft   Monthly Rent: $1799Exceptional Apartment Living!  Hunt Club Apartments offers unique one bedroom, two bedroom, and three bedroom apartment homes in a beautiful setting that combines the comfort of home with exceptional resident services and outstanding community amenities. Options like fireplaces and storage spaces help you choose one of the apartment homes and create a style that is perfect for you. You will enjoy the convenience of living just minutes from major highways (Routes 63, 309, 202, & the PA Turnpike) and having easy access to transportation, employers, fine dining, parks and recreational areas, cultural events, historic attractions and shopping! By living luxuriously with a maintenance free lifestyle, you will find the serenity and convenience of Hunt Club Apartments to be your refreshing paradise. Schedule a tour of our beautiful North Wales apartments today and see why residents love coming home to Hunt Club.Security Deposit: CallLength of Lease: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nProperty Features: ✓ Clubhouse & Lounge✓ Coffee Bar✓ Free Weights, Weight & Cardio Machines✓ Furnished Units Available✓ Onsite Maintenance✓ Onsite Management✓ Planned Social Activities✓ Playground✓ Swimming Pool & Sundeck✓ Walking\/Biking Trails✓ Abundant Parking✓ Corporate Suites✓ Less than 1 Mile to Route 309 and 202✓ Located on Route 63✓ Online Payment Options✓ Pet Play Area✓ Recycling✓ Renters Insurance Program✓ Wi-Fi at Pool and Clubhouse✓ Within 10 Miles of the Northeast Extension of the PA TurnpikeApartment Amenities:✓ High Speed Internet Access✓ Kitchen✓ Refrigerator\/Freezer✓ Satellite TV✓ Storage Units✓ Tub\/Shower✓ Views✓ Washer\/Dryer✓ Wheelchair Accessible (Rooms)✓ Window Coverings✓ Cable-Ready✓ Central Air Conditioning✓ Full-size Washer And Dryer✓ Individual Patio or Balcony✓ Private Entrance✓ Storage Spaces (select homes)✓ Upgraded Kitchens (select homes)✓ Walk-In Closets (select homes)✓ Wood Burning Fireplaces (select homes)Pets: Breed Restriction The Hunt Club is a pet-friendly apartment community. We welcome cats and dogs (breed restrictions apply). Exotic pets are approved on a case by case basis. You may have two pets per apartment. There is a monthly pet rent of $35 for 1 pet and $50 for 2 pets. There is also a one-time, non-refundable fee of $350 for 1 pet and $500 for 2 pets. Business Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMReady to Lease? Call our office at  show contact info\nWebsite: https:\/\/www.huntclubnorthwales.com\/Proudly managed by Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY2330B7E3D6F94EC\n","num_images":15.0,"lat":40.211229,"lng":-75.235922,"attrs":"['1BR \/ 1Ba', '680ft2', 'available now', 'application fee details: $60 application fee per applicant', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T16:34:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-spacious-and-beautiful\/7595789382.html","post_id":7595789382,"title":"Spacious and beautiful. Consider your new 1 bed \/ 1 bath found!","description":"The Gateway Apartments, located at 1515 Manley Rd West Chester, PA 19380. Description........ Residents of our West Chester, PA apartments enjoy a spacious one or two bedroom floor plan which adds warmth and comfort to any lifestyle. The Gateway provides a number of lavish amenities, including a full kitchen, 9-foot ceilings, walk-in closets, and large windows. Our premier location is close to public transportation and the most prominent dining, shopping, and recreational venues in the area, making our community perfect for commuters all across Chester County. Schedule a tour of our West Chester community today and see why residents love coming home.Upgraded Apartment Bedrooms........... 1  Bathrooms......... 1  Sq Footage......... 842 sq ftUnit Price........... $2074 - $2722\/Month Lease Term........ 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthAmenity List...... ✓ Business Center✓ Clubhouse✓ Fitness Center✓ Onsite Maintenance✓ Onsite Management✓ Package Service✓ Picnic and Grilling Area✓ Pool and Sundeck✓ Storage Space✓ Walking\/Biking Trails✓ Beautifully Landscaped Grounds✓ Gated Entrances✓ Maintenance Free Lifestyle✓ Onsite Leasing Office✓ Pet-Friendly✓ Relaxing Fire Pit✓ Resort-Style Pool With Sun Deck✓ Storage Units For Lease✓ Three BBQ\/Picnic Areas✓ Wi-Fi Access in Clubhouse and at PoolUnit Features.....✓ Cable Ready✓ Den✓ Dining Room✓ Dishwasher✓ Garbage Disposal✓ High Speed Internet Access✓ Refrigerator, Freezer, Ice Maker✓ Tub\/Shower✓ Walk-In Closets✓ Window Coverings✓ Disability Access (select homes)✓ Garden\/Spa Tub (select homes)✓ Gas Fire Place (select homes)✓ Kitchen Pantry✓ Large Windows✓ Mini Blinds On All Windows✓ Private Entrance To Each Unit✓ Vaulted Ceiling (select homes)✓ Wired For High-Speed Internet✓ Wooded View\/Pool View (select homes) Our Pet Policy... Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Mon Leasing Hours...  Mon - Fri: 9:00 AM - 6:00 PMSat - Sun: 10:00 AM - 5:00 PM Call our Office... at  show contact info\nto schedule a private tour today. Our Location.....1515 Manley Rd West Chester, PA 19380Facebook: https:\/\/www.facebook.com\/TheGatewayApartmentsAParadiseManagementCommunity\/ Website: https:\/\/www.thegatewayapartments.com\/  Professionally managed by Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY66333F8967D246\n","num_images":21.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '842ft2', 'available mar 31', 'air conditioning', 'application fee details: 60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T16:20:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-three-beds-and-two\/7595778121.html","post_id":7595778121,"title":"HOUSE || THREE BEDS AND TWO BATHROOMS,...!","description":"HOUSE AVAILABLE FOR RENT. IT HAS THREE BEDS WITH TWO ATTACH BATHROOMS. VERY QUITE COMUNITY NEAT AND CLEAN. ASKING RENT IS $1200 BUT CAN BE NEGOTIABLE..! PLEASE ONLY CALL I REPEAT ONLY CALL...! 925-500-0 5 8 5\nshow contact info\nshow contact info\n925-500-0585925-500-0585  show contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\n925-500-0585925-500-0585  show contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info\nshow contact info","num_images":4.0,"lat":39.9612,"lng":-75.2303,"attrs":"['3BR \/ 2Ba', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-03-04T15:53:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-lofts-light-and-luxury-come\/7595785589.html","post_id":7595785589,"title":"Lofts, light, and luxury! Come check out Silk Factory Lofts","description":"Silk Factory Lofts  Address:  200 S Line St Lansdale, PA 19446 Bedrooms: 1 | Baths: 1 | Sq. Footage:  815 sq ft | Pricing: $1894\/Month Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-Month show contact info\n+ + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + +Features in this apartment home: − Cable & Hi-Speed Internet Ready− Central Air Conditioning− Courtyard View in select apartments− Dishwasher− Full Size Washer & Dryer− Large Windows− Range \/ Oven− Refrigerator\/Freezer− Secured Building Access− Upgraded Kitchens in Select Apartments− Cable & Hi-Speed Internet Ready− Central Air Conditioning− Courtyard View (select apartments)− Dishwasher− Full-Size Washer & Dryer− Large Windows− Range \/ Oven− Refrigerator\/Freezer− Secured Building Access− Upgraded Kitchens (select apartments) + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + +Amenities at our property: − 18' Long Shuffle Board− 2 Weber Propane Grills− Business Center− Elevator− Laundry Facilities− Monthly Community Events− Package Service− Pet-Friendly Community− Pool Table− Vintage Building− Beautifully Landscaped Grounds with Access to Local Businesses− Close to Montgomeryville Mall and Routes 202 & 309− Community Lounge featuring free Verizon Fios TV\/Wi-Fi− Courtyard featuring tasteful Outdoor Seating and Fire Pits− Fitness Center with Free Weights, Verizon TV and Free Wi-Fi− Free Parking - 2 Spaces per Apartment Home + Guest Parking− Lobby Area with Complimentary Coffee− Maintenance-Free Lifestyle− Professional On-Site Management Team− Within Walking Distance to Trains+ + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + +About the community: SEE WHAT YOU'VE BEEN MISSING  Silk Factory Lofts Apartments offers unique one bedroom, two bedroom, and three bedroom apartment homes in a beautiful setting that combines the comfort of home with exceptional resident services and outstanding community amenities. Options like large windows and storage spaces help you choose one of the apartment homes and create a style that is perfect for you. You will enjoy the convenience of living just minutes from major highways (1-476) and having easy access to transportation, employers, fine dining, parks and recreational areas, cultural events, historic attractions and shopping! By living luxuriously with a maintenance free lifestyle, you will find the serenity and convenience of Silk Factory Lofts Apartments to be your refreshing paradise. Schedule a tour of our beautiful Lansdale apartments today and see why residents love coming home to Silk Factory Lofts.Pets: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephPhone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/Twitter: https:\/\/twitter.com\/SilkFactoryLPWebsite: https:\/\/www.silkfactoryapts.com\/ Management: Paradise Management, LLC*Prices are subject to change without noticeIncome requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY2A6F1CAF76CF407\n","num_images":24.0,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '815ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T16:11:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-rent-an-amazing-797-sq-foot\/7595784134.html","post_id":7595784134,"title":"Rent an amazing 797 Sq Foot 1 bed \/ 1 bath near transit!","description":"Silk Factory LoftsVisit Our Community Today!200 S Line St Lansdale, PA 19446  show contact info\nSEE WHAT YOU'VE BEEN MISSING  Live the luxurious lifestyle you're looking for in a building rich with history enhanced with modern amenities at Silk Factory Lofts. Our Lansdale, PA apartments feature open-concept loft-style layouts with high ceilings, chic kitchens, and oversized windows that make each home bright and welcoming. Communal spaces are designed with residents' comfort and convenience in mind at our Lansdale apartments. Residents can hang out in our upscale lounge, maintain work out goals at the on-site fitness center, and so much more at our apartments in Lansdale, PA.Bedrooms: 1 |  Bathrooms:  1  Square Footage: 797 sq ft Rental Pricing: $1732\/Month  Our Residents Enjoy:  ◾ 2 Weber Propane Grills◾ Business Center◾ Dog Wash Room◾ Elevator◾ Game Room & Free Wi-Fi◾ Laundry Facilities◾ Package Service◾ Pool Table◾ Smoke-Free◾ Vintage Building◾ Close to Montgomeryville Mall and Routes 202 & 309◾ Community Lounge featuring free Verizon Fios TV\/Wi-Fi◾ Courtyard featuring tasteful Outdoor Seating and Fire Pits◾ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting◾ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi◾ Free Parking - 2 Spaces per Apartment Home + Guest Parking◾ Lobby Area with Complimentary Coffee◾ Professional On-Site Management Team◾ Storage units - $50\/$75 per month◾ Within Walking Distance to Trains This Unit Comes With: ◾ Cable & Hi-Speed Internet Ready◾ Central Air Conditioning◾ Courtyard View in select apartments◾ Dishwasher◾ Full Size Washer & Dryer◾ Range \/ Oven◾ Refrigerator\/Freezer◾ Secured Building Access◾ Storage Spaces◾ Upgraded Kitchens in Select ApartmentsWebsite: https:\/\/www.silkfactoryapts.com\/ Phone-Number:  show contact info\nPet-Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephLease-Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthCall for Directions  Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY5B53DF9B2A4041\n","num_images":24.0,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '797ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T16:08:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-fitness-center-professionally\/7595781440.html","post_id":7595781440,"title":"Fitness Center, Professionally Managed, Lease Today","description":"VIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nWhen you call The Point at Exton home you will enjoy an amazing line up of amenities including a resort style pool, fashionable outdoor space, and a controlled access parking garage. Call now for a tour!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, walk-in closet, and a washer\/dryer!\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nCommunity Features\n* Controlled Access Parking\n* Professionally Managed\n* Outdoor Grill Area\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access\n* Fitness Studio\n* Sun Deck\n* Bike Racks\n* Community Kitchen\n* Pet Salon\n* Swimming Pool\n* TV Lounge\n* Extra Storage\n* Package Acceptance\n* Garage Parking","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '668ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T16:02:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-fully-renovated\/7595759580.html","post_id":7595759580,"title":"$1,742.00- 1 Bed 1 Bath, Fully- Renovated Apartment","description":"Fully Renovated Apartment for rent at the Presidential City Apartments.  The unit is located on the 3rd floor.  Features include:\n-Spa Shower and Tub\n-Tile Floor\n-Plenty of Storage Space\n-Wood Floors\n-Stainless Steel Appliances\n-Washer and Dryer\n-Gym on premises\n-Minutes away from restaurants and shopping\n- Access to the express way\n-Utilities: Water is included with monthly rent\n- Month to month rent option\n-Date Available: March 4th 2023\n-Deposit: $ 3,484 - this includes first and last month rent","num_images":8.0,"lat":39.97683,"lng":-75.252399,"attrs":"['1BR \/ 1Ba', 'available now', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T15:05:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-reduced-rent-special-pets-d\/7595769112.html","post_id":7595769112,"title":"Reduced Rent Special - PETS, W\/D, Storage, 24\/7 Fitness Center, D\/W","description":"🏠LOVE Your New HOME- Apply Now- Reduced Rent Special🏠\nApt #C-11 First floor apartment home with beautiful courtyard view. Newly renovated and close to the train!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 8:30 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":23.0,"lat":40.0,"lng":-75.276,"attrs":"['1BR \/ 1Ba', '663ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T15:29:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stunning-apts-in-northern\/7595756562.html","post_id":7595756562,"title":"Stunning Apts in Northern Liberties - Get 1 Month Free! Call Today!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card!  Welcome to Residences at One BrownCall Now -  show contact info\nx 13OR Text 13 to  show contact info\nto text our team.This is a 1 Bedroom, 1 Bath, Approximately 687 Sq. Ft. Residences at 1 Brown offers stunning and spacious studios, one, two, and three bedroom apartments with premium features designed to help you live your best life every day. Each unit has oversized bedrooms and enough living space for both a media center and kitchen table. You will thoroughly enjoy the soaking up the ample space to relax or host guests! Upscale kitchens with cherry wood cupboards are brimming with the latest appliances complemented by granite countertops and ample storage space. Nearby, you can enjoy a spa shower and Jacuzzi tub in your bathroom, take advantage of your personal washer and dryer, and set up a special place for your pets. As you come home to your 1 Brown apartment each day, you're stepping into a place of comfort, convenience and class. Call Today!  Features: Largest Apartments in the Area, Gourmet Eat-In Kitchens with Cherry Wood Cupboards, Stainless Steel Appliances, Nest Thermostats, Spa Shower System & Jacuzzi Tub, Generous Closet Space, Large Bathrooms, Quartz Counter Tops, 9 Ft Ceilings, Full Size Washer\/Dryer in unit, Floor to Ceiling Windows  Community Amenities: Fully Outfitted Fitness Center, 24-Hour Concierge Service, Spectacular Resort Style Pool Area, Dry Cleaning Service, Amazing Views and Rooftop Lounge, Spacious Highrise Living, Rooftop Walking Track & Dining Areas Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Want more information on this unit? See link (below):https:\/\/archcompanies.aptglance.com\/5v1zm6 Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! BFQkGvXk5QG\n","num_images":15.0,"lat":39.962145,"lng":-75.137734,"attrs":"['1BR \/ 1Ba', '687ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T14:59:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-amazing-bedroom-bathroom-in\/7595760381.html","post_id":7595760381,"title":"Amazing 2 bedroom, 2 bathroom in Coatesville. 1178 SqFt!","description":"Millview ApartmentsLocated at: 100 Cobblestone Dr Coatesville, PA 19320Featured unit: 2 bed | 2 bath | 1178 sq ft Prices start at: $1599 - $2146\/month Call Today!  show contact info\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Wonderful Amenities!● Business Center● On-Site Leasing Office● Pet-Friendly● Private Garages In Select Units● 24-Hour Emergency Maintenance● Coffee Bar Clubhouse Kitchen● Resident Referral BonusesApartment Features!● Built-In Microwave● Central Heat & Air Conditioning● Disability Access In Select Units● Dishwasher● Full-Size Washer & Dryer In Every Apartment● Mini Blinds On All Windows● Refrigerator\/Freezer With Ice Maker● Walk-In Closets  show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available mar 31', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T15:07:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-spacious-bedroom\/7595717362.html","post_id":7595717362,"title":"@@Lovely &spacious 2-bedroom, 1 bath apartment in Philadelphia","description":"Lovely &spacious 2-bedroom, 1 bath apartment in Philadelphia a quiet neighborhood. With this open concept lay out you and your private patio you will feel right at home. This unit is close to numerous attractions on the eastside including the east town mall and Target. Washer and Dryer in the building, Pets considered. Electric. Contact Me:- show contact info","num_images":5.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T13:29:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-we-welcome-your-furry\/7595758732.html","post_id":7595758732,"title":"We welcome your furry friends! Pet Friendly! 1 Bd \/ 1 Ba \/ 845 SqFt","description":"Welcome to Millview Apartments!100 Cobblestone Dr Coatesville, PA 19320Rental Size: 1 BR - 1 BA - 845 sq ft | Per Month: $1380 - $1868 | Lease Length: Variable show contact info\nMillview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.  Our community features:   ❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral Bonuses  Our unit features: ❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In Closets   Contact us for more information! --  show contact info\n--Our Pet-Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Website: https:\/\/www.apartmentsincoatesvillepa.com\/Property Management: Paradise Management, LLCEQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'available apr 26', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T15:03:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-great-bed-bath-and-your-own\/7595757466.html","post_id":7595757466,"title":"Great 2 bed, 2 bath and your own private washer\/dryer! Visit today!","description":"Millview ApartmentsLocated at: 100 Cobblestone Dr Coatesville, PA 19320Featured unit: 2 bed | 2 bath | 1088 sq ft Prices start at: $1561 - $2173\/month Call Today!  show contact info\nTHE BEST APARTMENTS IN COATESVILLE, PA\nIf you're looking for the best apartments in Chester County, look no further than Millview Apartment Homes. Our world-class amenities, including a resort-worthy swimming pool, sauna, and clubhouse are better than any in the Coatesville area. Our professional leasing staff is eager to welcome you home to a carefree lifestyle. Please schedule a tour and come home to the best Coatesville, PA apartments.Wonderful Amenities!− Business Center− On-Site Leasing Office− Pet-Friendly− Private Garages In Select Units− 24-Hour Emergency Maintenance− Coffee Bar Clubhouse Kitchen− Resident Referral BonusesApartment Features!− Built-In Microwave− Central Heat & Air Conditioning− Disability Access In Select Units− Dishwasher− Full-Size Washer & Dryer In Every Apartment− Mini Blinds On All Windows− Refrigerator\/Freezer With Ice Maker− Walk-In Closets  show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'available mar 17', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T15:01:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-easy-digital-application\/7595755924.html","post_id":7595755924,"title":"📲 Easy Digital Application Process - Brand New 2BR Home 🏡","description":"Brand New town home in the center of it all. This gorgeous home offers a spacious eat in kitchen and premium stainless steel appliance package. The space offers premium wide plank flooring through out and thoughtful storage. This home offers central heating and AC and brand new windows throughout. It also has fantastic natural lighting.\nThe 2nd level offers spacious bedrooms with ceiling fans, and a spa inspired bathroom with a walk in shower. There is also a laundry room with brand new front loading washer\/dryer.\nThis home is pet friendly and we are waiving all pet fees for applications received through 3\/31\/2023\n","num_images":5.0,"lat":39.944398,"lng":-75.168853,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T14:57:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-on-site-bike-storage\/7595743794.html","post_id":7595743794,"title":"ON-SITE BIKE STORAGE! PARKING ON-SITE!","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Online Payments Available9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densPet-friendly livingAlexa or Google Home Capable in all ApartmentsUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsState-of-the-art fitness center overlooking the Manayunk canalMarble master baths, some with deep linen storageHuge walk-in closets with ample storageBocce ball field48-hour Maintenance CommitmentJogging trail right outside your doorCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/nwopm6zr\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '2115ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2023-03-04T14:29:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7595743923.html","post_id":7595743923,"title":"Schedule a Tour, Granite Countertops, Playground","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1075ft2', 'available mar 10', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T14:30:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lots-of-natural-light\/7595738294.html","post_id":7595738294,"title":"Lots Of Natural Light\/ Stainless Steel Appliances\/ Great Closet Space","description":"RENT PERIOD: YEARLY\nAsk about apartment home 205 on the second floor, available now!! We are offering first month free for this unit!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday 9:00 am-6:00 pm, Fridays 9:00 am-5:00 pm, and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":12.0,"lat":40.0402,"lng":-75.2231,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T14:17:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-elegant-home-offering-with\/7595705403.html","post_id":7595705403,"title":"Elegant Home Offering With Working Fireplace In Rittenhouse Square!","description":"Reply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nProperty Details:\n- 105 S 18th St\n- 2 Br\n- 2 Ba\n- 1,700 Sqr ft\n- $3,500\/mo\n______________________________________\nElegant, refined, and offering all of the amenities of a modern Center City dwelling\nElevator Building, newly remodeled kitchen, bathrooms features a lower level social room and gym. This is a superbly maintained and professionally managed 16-unit building just off Rittenhouse Square. Enjoy rich hardwood floors, a gorgeous chefs Kitchen with Island and distinguished finishes throughout this 2BR\/2BA unit, 1700 SF,\nFeaturing a working fireplace and a sensational open Living Dining space with a balcony. These are just a few of the reasons why this apartment is as coveted is they come. Surrounded by famous gourmet restaurants, Cafes, shopping, galleries and more. Ready for Move in. With a 13 month lease, Last Month is Free\n______________________________________\nReply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nListed by Compass\nDRE #B069094","num_images":18.0,"lat":39.954,"lng":-75.176,"attrs":"['2BR \/ 2Ba', '1700ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T13:04:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/leasing-now-surface-parking-lot-cat\/7595738986.html","post_id":7595738986,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-three-beds-and-two\/7595730711.html","post_id":7595730711,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bbq-and-deck-area-bark-park\/7595731373.html","post_id":7595731373,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7595736032.html","post_id":7595736032,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bbq-and-deck-area-48-hour\/7595727416.html","post_id":7595727416,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-welcome-to-43-rose-lane\/7595706887.html","post_id":7595706887,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-is-newly-renovated\/7595698516.html","post_id":7595698516,"title":"This is a newly renovated 3 bedroom, 1.5 bathroom house","description":"This is a newly renovated 3 bedroom, 1.5 bathroom house located near Frankford Ave in the Kensington\/Port Richmond neighborhood of Philadelphia. Please Call At (844) 399 00 13\nUpon entering, you have an open-concept floor plan, including the living room and dining area when you walk in on the 1st floor. It features new floors, black steel bannisters, and recessed lighting. The kitchen has a stainless steel refrigerator, stove, dishwasher, microwave, and granite countertops. There is a finished basement with tiled floors and recessed lighting. The three bedrooms are located on the second floor and are bright and sunny. The full bathroom is newly tiled with a tub\/shower and under the sink storage.\nThere is huge backyard located in the rear of the home.\nThere is spacious porch located in the front of the home.\nThere is a washer\/dryer hookup and the powder room is located in the finished basement.\nThis unit has radiant heat.\nThis property is located very close to Frankford Ave, stores on Aramingo Ave, and Interstate 95.\nTenants are responsible for all utilities - gas, electric, and water. Tenants are responsible to obtain Renters Insurance.\nPet Policy: Cats OK with $300 Deposit, Dogs not allowed.\nAvailable for move-in on April 1st!\nPlease Note: The property will stay on the market until we received a security deposit (equal to one month's rent). Once we receive your security deposit, we will take the property off the market. We collect first month's rent, last month's rent, and a security deposit for all our properties.\n","num_images":1.0,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 1.5Ba', '1710ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T12:49:15-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-welcome-to-43-rose-lane\/7595706878.html","post_id":7595706878,"title":"Welcome to 43 Rose Lane a lovely, split level home nestled in a quaint","description":"Welcome to 43 Rose Lane a lovely, split level home nestled in a quaint neighborhood of Lansdowne. This home will be your home sweet home for sure. As you enter the living room, you are greeted by well maintained hardwood floors which flow into the formal dining room. Ample light is provided via the bay window. Off of the dining room is an enclosed porch\/playroom. The kitchen is well equipped. Descend to the lower lever and there is a family room\/possible bedroom and a half bath and also the laundry room with a washer and dyer. The upper level has 3 well sized bedrooms with hardwood floors and a full bath with a walk in tub\/shower. The yard is partially fenced and has a patio. There is central air (2018), gas heat (2022) and solar panels (2018). The roof was installed (2011) the Hot water heater (2015). This home is conveniently located near shopping, schools.","num_images":1.0,"lat":39.9375,"lng":-75.2637,"attrs":"['3BR \/ 1.5Ba', '1840ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T13:07:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-online-payments-available\/7595723146.html","post_id":7595723146,"title":"Online Payments Available, Huge walk-in closets with ample storage","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities.Amenities Include:Upgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingBBQ and deck areaOn-site bike storagePet-friendly livingAlexa or Google Home Capable in all ApartmentsJogging trail right outside your doorUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsState-of-the-art fitness center overlooking the Manayunk canalFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingMarble master baths, some with deep linen storageBark park48-hour Maintenance CommitmentCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/zyc52jpl\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1180ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2023-03-04T13:43:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-welcome-to-43-rose-lane\/7595706882.html","post_id":7595706882,"title":"Welcome to 43 Rose Lane a lovely, split level home nestled in a quaint","description":"Welcome to 43 Rose Lane a lovely, split level home nestled in a quaint neighborhood of Lansdowne. This home will be your home sweet home for sure. As you enter the living room, you are greeted by well maintained hardwood floors which flow into the formal dining room. Ample light is provided via the bay window. Off of the dining room is an enclosed porch\/playroom. The kitchen is well equipped. Descend to the lower lever and there is a family room\/possible bedroom and a half bath and also the laundry room with a washer and dyer. The upper level has 3 well sized bedrooms with hardwood floors and a full bath with a walk in tub\/shower. The yard is partially fenced and has a patio. There is central air (2018), gas heat (2022) and solar panels (2018). The roof was installed (2011) the Hot water heater (2015). This home is conveniently located near shopping, schools.","num_images":1.0,"lat":39.9375,"lng":-75.2637,"attrs":"['3BR \/ 1.5Ba', '1840ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T13:07:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-immediate-move-in\/7595726952.html","post_id":7595726952,"title":"Immediate Move in Available! 2Bed\/2Bath with Upgraded Features!","description":"The Gateway Apartments 1515 Manley Rd West Chester, PA 19380  show contact info\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Rental Size:  2 BR - 2 BA - 1199 sq ft  Per Month: $2271 - $2987  Lease Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  Conveniently located in prestigious Chester County, The Gateway offers unique one and two bedroom apartments with den options in a beautiful setting. Commbine the comforts of home with superior resident services and amenities such as our resort style pool, business center, fitness center, and walking trail.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Features and Amenities: ● Business Center● Clubhouse● Fitness Center● Onsite Maintenance● Onsite Management● Package Service● Picnic and Grilling Area● Pool and Sundeck● Storage Space● Walking\/Biking Trails● Across From Wawa & Goshen Crossing Shopping Center● Beautifully Landscaped Grounds● Garages For Lease● Maintenance Free Lifestyle● Onsite Leasing Office● Pet-Friendly● Relaxing Fire Pit● Resort-Style Pool With Sun Deck● Storage Units For Lease● Three BBQ\/Picnic Areas. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . This Unit Comes With: ● Air Conditioning & Heating● Alarm● Cable Ready● Den● Dining Room● Garbage Disposal● High Speed Internet Access● Refrigerator, Freezer, Ice Maker● Trash Compactor● Tub\/Shower● Built-In Computer Nook (select homes)● Built-In Microwave Oven● Disability Access (select homes)● Garden\/Spa Tub (select homes)● Gas Fire Place (select homes)● Large Windows● Mini Blinds On All Windows● Upgrade● Vaulted Ceiling (select homes)● Washer And Dryer In Each Apartment Home. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Call us for more information! --  show contact info\n-- Website: https:\/\/www.thegatewayapartments.com\/Pets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Mon. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYFC0F0603CBEC49\n","num_images":15.0,"lat":39.967056,"lng":-75.529129,"attrs":"['2BR \/ 2Ba', '1199ft2', 'available now', 'air conditioning', 'application fee details: 60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T13:51:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-pet-friendly-d-free\/7595726941.html","post_id":7595726941,"title":"Pet Friendly, W\/D, Free Parking, Gym, Pool, Elevator BLDG, Balcony","description":"Apartment 927 is a 2 Bedroom with a stainless steel appliances, quartz countertops, washer\/dryer and a balcony! Make this your new apartment home today!\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes! Staying at home during all of this? No worries! Just ask your leasing agent about a personalized virtual tour instead to view all the great things we have to offer!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nElevator Building\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Gian, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-5pm | S, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!\n","num_images":13.0,"lat":39.966575,"lng":-75.604026,"attrs":"['2BR \/ 2Ba', '935ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T13:51:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-reside-in-this-luxury\/7595709863.html","post_id":7595709863,"title":"Reside In This Luxury Condo With Breathtaking Views In Center City!","description":"Reply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nProperty Details:\n- 1401 Walnut St\n- 1 Br\n- 1 Ba\n- 975 Sqr ft\n- $2,925\/mo\n______________________________________\nThe residences feature 36 spacious units ranging from 1,700 to 2,450 square feet in size. Reside in the luxury apartments at the base of Philadelphia’s Walnut Street Row, home to the world’s finest retailers and award winning restaurants. The Avenue of the Arts, Philadelphia’s epicenter for arts, culture and entertainment, is your cross street.\nWith everything you want just steps away from your apartment, this is clearly the new choice for luxurious, rental living in a vibrant world-class city. Was designed to offer an impressive living experience. The residences’ unique combination of location, breath-taking city views and sophisticated design amenities are unlike any other. If you are looking for convenient, luxury-filled rental living in the heart of Center City, Philadelphia, you need look no further!\n______________________________________\nReply to this listing for more information.\n- This property not quite what you’re looking for ? Still reply to this listing! I am a licensed real estate agent in the Philadelphia area and I am here to help YOU!\nListed by Compass\nDRE #B069094\n","num_images":8.0,"lat":39.951,"lng":-75.164,"attrs":"['1BR \/ 1Ba', '975ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-04T13:13:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2123-spencer-st-2nd-floor\/7595719517.html","post_id":7595719517,"title":"2123 W Spencer St - 2nd Floor","description":"Nicely renovated 2bedroom\/1bath apartment located in the Logan\/Ogontz\/Fern Rock section of Philadelphia and near East Germantown. Apartment is located on the second floor and features a private entrance, new floors, nice size bedrooms with new carpeting, apartment new newly painted, new gas range, upgraded countertops, subway backsplash, and modern cabinets in spacious kitchen, garbage disposal and ceiling fan ands. some track lighting. Lots of natural light. Located conveniently near transportation, Lonnie Young Recreation Center, Mastery Charter School, Supermarkets, La Salle University, and lots of small specialty businesses. Background check required for all interested applicants. Available now, schedule a tour today!\nTenant Background Search is the background check platform I use. It's a full comprehensive search including eviction, employment, finances and credit check. If you have an interested client, please send me their full name(s) and email address(s) and I will email them an invitation to fill it out. Client pays for search - $39.95 per person and is non-refundable.\n","num_images":14.0,"lat":40.0568,"lng":-75.1569,"attrs":"['2BR \/ 1Ba', 'available mar 6', 'apartment', 'no laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2023-03-04T13:34:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/north-wales-hunt-club-apartments\/7595713216.html","post_id":7595713216,"title":"Hunt Club Apartments! Beautiful Community! Convenient Location!","description":"2 Bedroom  2 Bathroom | 932 sq ft | $2021\/Month Hunt Club Apartments10 Hunt Club Trl North Wales, PA 19454 show contact info\nDescription: Exceptional Apartment Living!  Hunt Club Apartments offers unique one bedroom, two bedroom, and three bedroom apartment homes in a beautiful setting that combines the comfort of home with exceptional resident services and outstanding community amenities. Options like fireplaces and storage spaces help you choose one of the apartment homes and create a style that is perfect for you. You will enjoy the convenience of living just minutes from major highways (Routes 63, 309, 202, & the PA Turnpike) and having easy access to transportation, employers, fine dining, parks and recreational areas, cultural events, historic attractions and shopping! By living luxuriously with a maintenance free lifestyle, you will find the serenity and convenience of Hunt Club Apartments to be your refreshing paradise. Schedule a tour of our beautiful North Wales apartments today and see why residents love coming home to Hunt Club. Apartment Amenities:✓ Carpet✓ Dishwasher✓ High Speed Internet Access✓ Kitchen✓ Range\/Oven✓ Refrigerator\/Freezer✓ Tub\/Shower✓ Views✓ Wheelchair Accessible (Rooms)✓ Window Coverings✓ Cable-Ready✓ Central Air Conditioning✓ Full-size Washer And Dryer✓ Individual Patio or Balcony✓ Private Entrance✓ Storage Spaces (select homes)✓ Upgraded Kitchens (select homes)✓ Walk-In Closets (select homes)✓ Wood Burning Fireplaces (select homes)Our Residents Enjoy:✓ Business Center✓ Car Wash Area✓ Courtyard✓ Fitness Center✓ Free Weights, Weight & Cardio Machines✓ Furnished Units Available✓ Onsite Maintenance✓ Onsite Management✓ Swimming Pool & Sundeck✓ Walking\/Biking Trails✓ 24 Hour Availability✓ Abundant Parking✓ Corporate Suites✓ Less than 1 Mile to Route 309 and 202✓ Located on Route 63✓ Online Payment Options✓ Pet Play Area✓ Recycling✓ Wi-Fi at Pool and Clubhouse✓ Within 10 Miles of the Northeast Extension of the PA TurnpikeAdditional Details:Deposit: $500Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthPets: Breed Restriction The Hunt Club is a pet-friendly apartment community. We welcome cats and dogs (breed restrictions apply). Exotic pets are approved on a case by case basis. You may have two pets per apartment. There is a monthly pet rent of $35 for 1 pet and $50 for 2 pets. There is also a one-time, non-refundable fee of $350 for 1 pet and $500 for 2 pets. show contact info\nWebsite: https:\/\/www.huntclubnorthwales.com\/All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYC824461F1FAF4C1\n","num_images":19.0,"lat":40.211229,"lng":-75.235922,"attrs":"['2BR \/ 2Ba', '932ft2', 'available now', 'air conditioning', 'application fee details: $60 application fee per applicant', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T13:20:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-must-see-riverfront-living\/7595708522.html","post_id":7595708522,"title":"Must See Riverfront Living, Views Galore and the Amenities to Match!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Residences at One Brown 1 Brown Street, Philadelphia, PA, 19123Use this link for more information:https:\/\/archcompanies.aptglance.com\/rLh398 Call Now:  show contact info\nx 12OR Text 12 to  show contact info\nfor more information.Stunning Apartments in Northern LibertiesThis is a 2 Bedroom, 2 Bath, Approximately 1286 Sq. Ft. Residences at 1 Brown offers stunning and spacious studios, one, two, and three bedroom apartments with premium features designed to help you live your best life every day. Each unit has oversized bedrooms and enough living space for both a media center and kitchen table. You will thoroughly enjoy the soaking up the ample space to relax or host guests! Upscale kitchens with cherry wood cupboards are brimming with the latest appliances complemented by granite countertops and ample storage space. Nearby, you can enjoy a spa shower and Jacuzzi tub in your bathroom, take advantage of your personal washer and dryer, and set up a special place for your pets. As you come home to your 1 Brown apartment each day, you're stepping into a place of comfort, convenience and class. Call Today! Features - Gourmet Eat-In Kitchens with Cherry Wood Cupboards  - Generous Closet Space  - Quartz Counter Tops  - Floor to Ceiling Windows  - 9 Ft Ceilings  - Full Size Washer\/Dryer in unit  - Spa Shower System & Jacuzzi Tub  - Stainless Steel Appliances  - Nest Thermostats  - Largest Apartments in the Area  - Large Bathrooms Community Amenities - Fully Outfitted Fitness Center  - Amazing Views and Rooftop Lounge  - Dry Cleaning Service  - Spectacular Resort Style Pool Area  - Spacious Highrise Living  - 24-Hour Concierge Service  - Rooftop Walking Track & Dining Areas Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMPet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today!  Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! yM0xgsCyYHEc\n","num_images":15.0,"lat":39.962145,"lng":-75.137734,"attrs":"['2BR \/ 2Ba', '1286ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-04T13:10:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1b-apartments-becoming\/7595697961.html","post_id":7595697961,"title":"1B Apartments Becoming Available in Mid-May! Most Utilities Included!","description":"Spacious one bedroom apartment for $1,340! Apartment features upgraded kitchen and bath, 9 ft. ceilings, and ample windows shower this unit with plenty of sunlight! Ask about our NO SECURITY DEPOSIT program!! Cats are welcome (add'l fee)! All apartments are rented unfurnished.\nChancellor Apartments is a convenient high rise apartment community in an amazing location in Center City. We are close to most major schools and universities, public transportation, historical attractions, shopping, restaurants and theaters. Center City at its best!!\nRent includes: heat, hot\/cold water, 24-hour front desk attendant, free bike storage room, package acceptance service, 24-hour emergency maintenance service, on-site smart card laundry plus card access system and BuildingLink resident services portal access for all residents.\nThe Chancellor boasts several different studio and one bedroom floor plans. Apartments feature high ceilings, large bright windows, ceiling fans in most units, hardwood floors and breathtaking views of the Philadelphia skyline and Delaware River. Many apartments have large walk-in closets, too!\nWe have partnered with Optimal Sport Health Club to offer a generous discounted gym membership (we pay your initiation fee!). There are several off street parking lots and garages in the area, too!\nCHANCELLOR APARTMENTS\n206 S. 13th Street\nPhiladelphia, PA 19107\nshow contact info\nFranceina Thorne, REALTOR\nHours:\nMon. - Fri. 8:30 to 5:00\nSaturday - 10:00 to 3:00\nAppointments are highly recommended\nProfessionally Managed by: Chancellor Properties, Inc.\nwww.cpihome.com\n\"CONSUMER NOTICE\"\nChancellor Properties, Inc. hereby states that with respect to this property, they are acting in the following capacity: an agent of the owner\/landlord pursuant to a property management or exclusive leasing agreement.","num_images":15.0,"lat":39.948681,"lng":-75.162197,"attrs":"['1BR \/ 1Ba', 'available may 15', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-04T12:48:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7595698529.html","post_id":7595698529,"title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nFind yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two story two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, two patio\/balconies, and a loft with a closet upstairs!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1217ft2', 'available mar 10', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-04T12:49:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/leasing-now-green-roof-quartz\/7595698467.html","post_id":7595698467,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-furnished\/7595696356.html","post_id":7595696356,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-theater-room-quiet-community\/7595689529.html","post_id":7595689529,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-fully-renovated\/7595637286.html","post_id":7595637286,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7595687506.html","post_id":7595687506,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-free-rent\/7595668100.html","post_id":7595668100,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null}]