[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/blue-bell-georgetown-condo-for-rent\/7506949147.html","post_id":7506949147,"result_date":"2022-07-09 23:26","title":"Georgetown Condo for rent","description":"Gracious living at its best in beautiful Lower Gwynedd. First floor includes a large living room, dining room with a sliding glass door leads to private fenced courtyard, open kitchen with island cook top and counter top seating, full laundry facilities, and half bath. Second floor contains, two spacious two bedroom and full bath. Amenities include pool, tennis courts, and club house. Walking distance to Doylestown Line and convenient to RTS 309, 202, 73, and PA Trnpk.","num_images":11.0,"lat":40.1576,"lng":-75.2799,"attrs":"['2BR \/ 1.5Ba', '960ft2', 'available sep 1', 'air conditioning', 'condo', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T23:22:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bi-level-two-bedroom-with\/7506897563.html","post_id":7506897563,"result_date":"2022-07-09 19:39","title":"Bi-level Two Bedroom with Sleek Design","description":"This unit boasts hardwood floors, granite counter tops, high ceilings, tiled bathrooms, stainless steel appliances and a sleek design with a wet bar at the entrance to the roof deck.\nThis unit has HVAC, Washer and Dryer, dishwasher, and plenty of kitchen cabinets.\nApplication is completed the Transunion Smart Move portal, the cost is $41.99.\nThe utilities are inexpensive, please call PECO and PGW to verify this, as it’s new construction. Ask for the yearly average bill.\nThis apartment is available as early as the 15th of July.","num_images":4.0,"lat":39.964854,"lng":-75.158674,"attrs":"['2BR \/ 1.5Ba', '1100ft2', 'air conditioning', 'application fee details: See Ad, Transunion Smart Move application', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T19:35:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-studio-apt\/7506893460.html","post_id":7506893460,"result_date":"2022-07-09 19:26","title":"Newly Renovated Studio Apt.   700","description":"Quiet block studio with privacy free laundry room looking for tenant who likes comfortable 2nd floor open floor plan   no pets   show contact info","num_images":7.0,"lat":40.0178,"lng":-75.0895,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T19:22:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-center-city-bedroom\/7506853592.html","post_id":7506853592,"result_date":"2022-07-09 18:37","title":"Center city 2 bedroom apartment","description":"Beautiful south-facing 7th-floor apartment in the heart of Center City! Tons of light and huge living spaces. Discounted furniture available. Please reach out if you have any questions.","num_images":7.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', '835ft2', 'available aug 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T17:28:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-listedsee-it-430\/7506811032.html","post_id":7506811032,"result_date":"2022-07-09 17:41","title":"JUST LISTED!*See it 430 SUNDAY 7\/10*2-Br So Philly HOUSE!","description":"** There's a showing scheduled at this house on:\n- SUNDAY JULY 10 at 4:30 PM.\nInterested in stopping by? Please do!\nTo confirm for this showing, please text  show contact info\n. **\n** Would you like to see this house at your convenience? Questions? Email, text, or call us! **\nThis is a RENOVATED 2 1\/2-bedroom house in South Philadelphia. Originally prepared for sale, it has a Stainless & granite kitchen and new hardwood floors throughout! Walk to great neighborhood restaurants, bakeries & delis. The location is one block south of Snyder Avenue at 12th Street. Less than a five minute walk to the heart of E Passyunk Avenue!\n1141 Cantrell Street\nEast Passyunk Crossing \/ Center City South \/ South Philadelphia \/ South Broad Street\nPhiladelphia 19148\nMonthly Rent: $1695\nUtilities: Gas, Electric & Water on your own meters\nInitial Payment: 1st, Last & Security\nPets: Cat or small dog OK w\/pet addendum and deposit\nLease Agreement: 1 year lease, then month-to-month with Winter term\nThe area: You're in a great, classic South Philly neighborhood. Walk 1 1\/2 blocks to 10th Street and a vintage, still-operating Italian bakery. Don't miss the Zagat-rated Italian red sauce joint Bomb Bomb Bar-B-Q Grill at 1026 Wolf St. Walk just 2 blocks west to South Broad Street for the Broad St\/Snyder Ave subway station. Also, right here is the beginning of the hip E Passyunk Avenue dining and shopping district. For more details about the immediate and adjacent neighborhood and ALL the great restaurants and other amenities within 5-10 minutes of the house, just search at Yelp with the location \"1141 Cantrell Street, Philadelphia, PA 19148\"\nBuilding Exterior: The original brick front and top cornice have been renewed to highlight original detail. 6-lite glass \/ solid wood front door accentuates the original vestibule. Four lined metal-wire window boxes complement the exterior character.\nLiving\/Dining Room: Open the front door into a marble-floored vestibule with tiled walls. A modern mini-chandelier provides comfortable lighting. Enter the main living\/dining room through a glass inner vestibule door. The floor is solid bamboo. Window treatments in the living room (and throughout the house) are white mini blinds. There's a ceiling fan and light in the dining room area. Patterned custom carpeting covers the stairs leading to the second floor.\nKitchen: Stainless and granite. There are 3 separate granite countertops, a gas stainless range (with microwave\/range hood mounted overhead) + a Maytag refrigerator & dishwasher. Ceramic Italian tile on the floor. Ikea cabinets including wall-mounted cabinet with aluminum frames & glass doors.\nFront Bedroom: Large bedroom features hardwood floors and ceiling fan. Two south-facing windows let in lots of light + big full-wall closet for clothes & storage.\nMiddle Bedroom: This room has solid wood flooring and a ceiling fan. An opaque glass door opens into a small half-bedroom that can be used for a small home office or walk-in closet.\nBathroom: The bathroom includes replacement fixtures, tile floor and tile walls. The bathtub, medicine cabinet, vanity and modern wall sconce are recent upgrades too. Behind the bathtub, the original linen closet was refurbished.\nBasement: Includes a full-sized washer & dryer + mechanicals. This is a full basement running from the front of the property to the back under the kitchen.\nBackyard\/Patio: Fence paneling provides privacy. The back of the house is painted.\nQuestions? Please contact us from this listing.","num_images":23.0,"lat":39.923462,"lng":-75.165625,"attrs":"['2BR \/ 1Ba', '1100ft2', 'available jul 29', '\\nsunday 2022-07-10\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:46:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7506841880.html","post_id":7506841880,"result_date":"2022-07-09 17:04","title":"4 Bedroom Apartment Available in August","description":"Greetings to all! We will have a 4 Bedroom\/2 bathroom available by August 1st, 2022! This wonderful apartment has all the room that you need! It has a very large dining room\/kitchen area; and it's located 10 minutes away from Temple University! The move-in fee is $1250 + $1250 last month+$1250 Security Deposit = $3750 (may negotiate security deposit for serious inquiries). A $55 application fee (non-refundable) is required; 625 + credit score is acceptable. To schedule a viewing of this lovely 4 Bedroom Apartment, you can contact \"Geno\" @  show contact info\n.","num_images":7.0,"lat":39.9888,"lng":-75.160628,"attrs":"['4BR \/ 2Ba', '1158ft2', 'available aug 1', '\\nsaturday 2022-07-30\\n', '\\nsunday 2022-07-31\\n', '\\nmonday 2022-08-01\\n', 'application fee details: $55 application fee', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T17:00:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-on-site-management-24\/7506839972.html","post_id":7506839972,"result_date":"2022-07-09 16:59","title":"On-Site Management, 24\/7 Front Desk Attendant, Hardwood Floors","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1006Date Available: 2022-07-09Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Large ClosetsSmart Home FeaturesRecyclingOn-Site ManagementMicrowaveWasher\/DryerBike StorageElevatorRefrigeratorPackage ReceivingDishwasherRooftop DeckCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/fgrewqp2\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['2BR \/ 2Ba', '1006ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T16:55:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedroom-duplex-in\/7506838270.html","post_id":7506838270,"result_date":"2022-07-09 16:55","title":"two bedroom duplex in Mayfair, full basement as well","description":"Offering a two bedroom duplex in a secluded area of Mayfair.\nComes with your own Area of basement\nHard wood floors\nNew Roof\nplease contact with your name, number, job, how long you've been at job, how much you make a month\nWe will do a full background check so please no previous evictions or repos\nAll applications must pay an application fee to be considered\nwe have appliances in property (as is condition) but if you would like to bring in your own washer\/dryer we would allow it","num_images":7.0,"lat":40.0422,"lng":-75.0244,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available jul 24', 'application fee details: We require a 25 application fee for background checks', 'duplex', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T16:51:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-48-hour-maintenance\/7506835008.html","post_id":7506835008,"result_date":"2022-07-09 16:54","title":"48-hour Maintenance Commitment, Online Payments Available, Bark park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:BBQ and deck areaBark parkBocce ball fieldGame Room with Billiards Table, Shuffle Board, and moreAlexa or Google Home Capable in all ApartmentsOn-site bike storageState-of-the-art fitness center overlooking the Manayunk canalUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densOnline Payments AvailableFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingHuge walk-in closets with ample storageUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/ws7sqt54\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1156ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-07-09T16:43:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-jr-1br-amazing-location\/7506832902.html","post_id":7506832902,"result_date":"2022-07-09 16:46","title":"Jr. 1BR AMAZING LOCATION","description":"Jr. 1BR in AMAZING LOCATION\n--Walk anywhere: Italian market, Chinatown, Gayborhood, Rittenhouse, Independence Park, City Hall\n--Best bars and restaurants, entertainment, numerous parks and playgrounds all around you\n--Target, Acme, Whole Foods, CVS, delis, beer and wine stores all in walking distance\n--Universities: easy walk and transport to Temple, UArts; Jefferson, Penn, and Pennsylvania Hospital\n--Transportation: Broad Street Line, Market-Frankford, City Hall trolleys, main bus lines Suburban Station regional rail\n--Windows and natural light galore\n--3rd floor of a town house with exterior stairs that are wide and easy to move furniture up\n--Separate kitchen with gas stove\n--Washer and Dryer in kitchen\n--Full bathroom with clawfoot tub and slate tiles, modern plumbing\n--Updated electric with many accessible grounded 3-prong outlets\n--Front room is bright open space with built in closet and wide enough to have bedroom on one side and living room on the other.","num_images":10.0,"lat":39.946836,"lng":-75.163648,"attrs":"['1BR \/ 1Ba', 'available jul 17', '\\nsaturday 2022-07-16\\n', '\\nsunday 2022-07-17\\n', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T16:37:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/north-wales-charming-garden-style-br-ba\/7506830237.html","post_id":7506830237,"result_date":"2022-07-09 16:35","title":"Charming garden-style 1 BR \/ 1 BA in North Wales! Now renting!","description":"Come home to a great community - Hunt Club Apartments!Address: 10 Hunt Club Trl North Wales, PA 19454Beds: 1  \/ Baths: 1 \/ Size: 680 sq ft   Monthly Rent: $1768Exceptional Apartment Living!  Located just off Route 63 and a half mile from English Village Shopping Center, The Hunt Club offers spacious apartment homes in North Wales, PA. Residents love the beautiful setting and the convenient amenities that can only be found at our community. With our combination of great floor plans and lavish features, The Hunt Club offers the best North Wales apartment rentals. Choose from a great selection of one, two or three bedroom homes that delight any lifestyle. Our apartments in North Wales, PA offer private entrances to provide you with a more unique setting. Convenience can be found with a washer & dryer in each unit making your day-to-day routine a breeze. All of our rentals also come with a private patio or balcony for you to take in the scenic country views right from the comfort of your North Wales, PA home. Routes 309 and 202 are just a mile away making your travel needs quick and easy. The Hunt Club is near the Northeast Extension of the PA Turnpike so you will never be far from great dining, shopping and entertainment venues. Our North Wales apartment homes offer a wealth of community features that include a fitness center, business center, basketball & tennis courts and a playground. You can also enjoy a peaceful afternoon stroll around the beautiful nature trail. Schedule a tour with our on-site management team and let us show you why The Hunt Club offers the best apartments in North Wales, PA.Security Deposit: CallLength of Lease: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nProperty Features: ➢ Barbecue & Picnic Area➢ Business Center➢ Coffee Bar➢ Fitness Center➢ Furnished Units Available➢ Onsite Maintenance➢ Onsite Management➢ Planned Social Activities➢ Playground➢ Walking\/Biking Trails➢ 1\/2 Mile from English Village Shopping Center➢ 24 Hour Availability➢ Corporate Suites➢ Located on Route 63➢ Online Payment Options➢ Pet Play Area➢ Recycling➢ Renters Insurance Program➢ Wi-Fi at Pool and Clubhouse➢ Within 10 Miles of the Northeast Extension of the PA TurnpikeApartment Amenities:➢ Accent Walls➢ Dishwasher➢ Kitchen➢ Range\/Oven➢ Satellite TV➢ Storage Units➢ Tub\/Shower➢ Views➢ Washer\/Dryer➢ Window Coverings➢ Cable-Ready➢ Central Air Conditioning➢ Full-size Washer And Dryer➢ Individual Patio or Balcony➢ Private Entrance➢ Storage Spaces (select homes)➢ Upgraded Kitchens (select homes)➢ Walk-In Closets (select homes)➢ Wood Burning Fireplaces (select homes)Pets: Breed Restriction The Hunt Club is a pet-friendly apartment community. We welcome cats and dogs (breed restrictions apply). Exotic pets are approved on a case by case basis. You may have two pets per apartment. There is a monthly pet rent of $35 for 1 pet and $50 for 2 pets. There is also a one-time, non-refundable fee of $350 for 1 pet and $500 for 2 pets. Business Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMReady to Lease? Call our office at  show contact info\nWebsite: https:\/\/www.huntclubnorthwales.com\/Proudly managed by Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY2330B7E3D6F94EC\n","num_images":17.0,"lat":40.211229,"lng":-75.235922,"attrs":"['1BR \/ 1Ba', '680ft2', 'available sep 20', 'application fee details: $60 application fee per applicant', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T16:31:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/conshohocken-bedrooms-upstairs-and\/7506812375.html","post_id":7506812375,"result_date":"2022-07-09 16:14","title":"**3 bedrooms upstairs and 1 bedroom\/office downstairs. Attached pictur","description":"Recently redone kitchen and bathroom. Hardwood floors throughout with central air. New heater installed end of 2021. W\/D in the basement with. Large deck and offstreet parking large enough to fit 6 cars. 3 bedrooms upstairs and 1 bedroom\/office downstairs. Attached pictures are from prior tenants\nText \/call  __559__201__8 9 5 5   or more information to schedule move in date.","num_images":7.0,"lat":40.0825,"lng":-75.3044,"attrs":"['4BR \/ 1Ba', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T15:49:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-ready-to-lease-bed-bath\/7506815110.html","post_id":7506815110,"result_date":"2022-07-09 16:00","title":"Ready to lease! 1 bed 1 bath home. Check us out!","description":"Welcome to Millview Apartments Rental Information  Pricing: $1671 - $2201\/Month | 1 Bedroom 1 Bath | 845 sq ftLease Term: Variable show contact info\nApartment Amenities   ❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In ClosetsCommunity Features  ❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral BonusesAbout CommunityDescription: Nestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!  Location: 100 Cobblestone Dr  Coatesville, PA 19320  show contact info\nOffice Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMAdditional InformationPet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. Website: https:\/\/www.apartmentsincoatesvillepa.com\/Our Management Company: Paradise Management, LLC EQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":11.0,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'available aug 27', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:56:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-classic-spacious-two-bedroom\/7506810426.html","post_id":7506810426,"result_date":"2022-07-09 15:59","title":"Classic Spacious Two Bedroom Townhome","description":"Classic Ardmore townhouse with private garden. This 2-bedroom, 1.5 bathroom corner unit townhome offers comfort, space and privacy. Inside you will find tons of natural light, plank wood flooring throughout, and two large bedrooms, as well as in-unit laundry! Master bedroom features incredible walk in closet. Personal HVAC system with your very own thermostat.\nPrivate, assigned parking is available just outside of your door. Property is smoke free and pet friendly! Located within the Lower Merion School District, in one of the most convenient neighborhoods along the Main Line. You have transportation, shopping, and dining just steps away! Only a short walk from the AMTRAK\/SEPTA station, Ardmore Farmers Market, Trader Joe's and downtown Ardmore. Minutes from Wynnewood, Narberth, Haverford College, Bryn Mawr College and Villanova.\nSecurity deposit is equal to one month's rent and application fee ($65 per adult applicant) is required to begin application process. Tenant is responsible for all utilities and will establish an account with PECO, tenant will also be billed by landlord for pro-rata share of common utilities. Property is smoke free and pet friendly!\n","num_images":22.0,"lat":40.00877,"lng":-75.28323,"attrs":"['2BR \/ 1.5Ba', '1150ft2', 'available sep 1', '\\nsunday 2022-07-17\\n', '\\nsunday 2022-07-24\\n', '\\nsunday 2022-08-21\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:45:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-beautiful-bed-bath-layout\/7506814382.html","post_id":7506814382,"result_date":"2022-07-09 15:58","title":"Beautiful 2 Bed \/ 2 Bath Layout, Tons of Light.","description":"Welcome to Millview Apartments!100 Cobblestone Dr Coatesville, PA 19320Rental Size: 2 BR - 2 BA - 1178 sq ft | Per Month: $1751 - $2346 | Lease Length: Variable show contact info\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort-style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.  Our community features:   ◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral Bonuses  Our unit features: ◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In Closets   Contact us for more information! --  show contact info\n--Our Pet-Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Website: https:\/\/www.apartmentsincoatesvillepa.com\/Property Management: Paradise Management, LLCEQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available aug 27', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:54:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-you-and-your-pets-will\/7506813603.html","post_id":7506813603,"result_date":"2022-07-09 15:56","title":"You and your pets will enjoy life at Millview Apartments! Pet friendly!","description":"Millview Apartments Featured Floorplan: 2-bed \/ 2-bath \/ 1018 sq ftMonthly Rent: $1705 - $2289Deposit: Call  show contact info\nDescription: Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.Lease Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Apartment Amenities:❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In Closets Community Features:❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral Bonuses Call us:  show contact info\n100 Cobblestone Dr Coatesville, PA 19320Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ EQUAL HOUSING OPPORTUNITY7252BEBBC7094AC\n","num_images":11.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1018ft2', 'available aug 27', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:52:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-are-you-ready-for\/7506735517.html","post_id":7506735517,"result_date":"2022-07-09 13:13","title":"Are you ready for a different renting experience?","description":"Attention all renters! Are you ready for a different renting experience? Where you will receive a hands-on approach and personal attention from your landlord? If so, you have come to the right place! Welcome to 445 fairmount ave. #a! A quiet, single building with only 2 units, where your landlord owns and manages the property. Days of your maintenance requests sitting untouched are over. Here, your needs and requests will be met in a timely manner. Now let's take a deeper dive into the unit. 445a is a large recently updated 2 bedroom\/ 1 bath, 2nd floor apartment with bamboo flooring, new paint, washer\/dryer and plenty of closet space! The full kitchen with breakfast counter, opens to a large living area with ceiling fan, tons of windows and lots of natural light. The two bedrooms are separated by the full bathroom. The northern liberties neighborhood has a plethora of dining options, nightlife, gyms, local shopping and parks! With its close proximity to the delaware river trail, public transportation and the highways, commuting and exercise options are convenient! So, what are you waiting for? Come see this great unit today!\n445 fairmount ave #a\n","num_images":4.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '3813ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:09:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-24-front-desk-attendant\/7506733463.html","post_id":7506733463,"result_date":"2022-07-09 13:09","title":"24\/7 Front Desk Attendant, Refrigerator, FOB Controlled Access","description":"Bedrooms: 1Bathrooms: 1Square Feet: 798Date Available: 2022-07-09Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Large ClosetsHardwood Floors24\/7 Front Desk AttendantPackage ReceivingBike StorageElevatorFOB Controlled AccessHigh Speed InternetRefrigeratorSmart Home FeaturesWasher\/DryerWindow CoveringsCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/xjepdr3f\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '798ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:05:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bedroom-bath-over\/7506731220.html","post_id":7506731220,"result_date":"2022-07-09 13:04","title":"This 2 bedroom 2 bath, over 1100 sq ft condo","description":"Wait no longer - the condo of your dreams is here! This 2 bedroom 2 bath, over 1100 sq ft condo in a two year old 5 unit boutique condominium building in the ultra-prime bella vista location with private rear entrance.! This impressive building has been meticulously planned and executed with finishes that will rival any condominium in philadelphia. This building features include luxury finishes, stainless steel appliances, wide plank hardwood floors throughout, natural stone counters, recessed lighting, high ceilings, washer\/dryer in unit, sprinklers and so much more. You'll love your new address -- straddling washington square west and bella vista. Visit hawthorne's cafe for a bite and beers, sam's morning glory for brunch, mama's wellness joint for some self love and dirty frank's for happy hour. Plus whole foods and the italian market are blocks away.! Live your best life within walking distance to center city and all it has to offer. There are plenty of convenient transit options, too! There is lots to love about this home and a rare find for the area!!\n728 s 10th st #2,\n","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '1166ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:00:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fitler-sq-bi-level\/7506729899.html","post_id":7506729899,"result_date":"2022-07-09 13:02","title":"Fitler sq bi-level apartment","description":"Don't miss this stunning, just renovated bi-level apartment. Entrance to schuylkill river trail is literally around the corner for outdoor recreation right outside your door. Fitler sq bi-level apartment -- just renovated and ready to move right in! This is an absolutely unbeatable location; a beautiful, walkable neighborhood with quick and easy access to university city and center city. Highly desirable greenfield school catchment. Step inside to gleaming hardwood floor, abundant natural light, recessed lighting overhead, and plentiful storage throughout. Everything is new -- 2 updated bathrooms, beautiful kitchen with granite countertops and a pass-through seating area allowing tons of light from the front-facing living room windows. Both bedrooms are large and bright with plenty of closet space. Central air conditioning, in-unit washer\/dryer. And too many local favorites and locations within walking distance to list -- schuylkill river trail, fitler square,rival bros coffee, amazon hub locker, to name a few.\n2612 south st #2\n","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '787ft2', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T12:58:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-its-very-conveniently\/7506720592.html","post_id":7506720592,"result_date":"2022-07-09 13:00","title":"it's very conveniently located","description":"This large 2-bedroom condo in the fairmount\/art museum neighborhood boasts 1,140 square feet of living space, and it's very conveniently located for commuting to west philly\/university city and\/or center city! Walk into the main floor to find your spacious living area with recessed lighting, hardwood floors and an original fireplace with a beautiful mantle. Make your way back to the master bedroom with lots of windows and an en-suite bathroom. One floor down, the kitchen features marble flooring, wooden cabinets, granite countertops, stainless steel appliances and a breakfast bar. There is also hidden storage space under the island! This floor also includes a laundry closet and a second bedroom with en-suite bath. Additionally, enjoy having access to outdoor space with an enclosed patio area. You’re less than a block away from the roberto clemente park, and just a short stroll away from the abundance of awesome restaurants, bars, coffee shops and stores along fairmount avenue. Whole foods and target are conveniently nearby as well. This location is also a commuter’s dream - with the broad street line just three blocks away, and i-676 less than a 5 minute drive away, getting around and in\/out of the city is a breeze. The #2 bus stops right at the corner and goes straight into center city. Plus, it's only 3 blocks to the 49 bus route into west philadelphia\/university city. Schedule your showing today!\n1708 wallace st #102\n","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '1140ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T12:39:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-value-in-queen\/7506727812.html","post_id":7506727812,"result_date":"2022-07-09 12:57","title":"Great value in queen village","description":"Newly updated and beautiful bi-level rental in queen village. New hardwood floors throughout. 2 all-new full bathrooms. New washer and dryer. Painted throughout and looks great! This very spacious and bright 3-bedroom plus 2-baths apartment is fully equipped. The large kitchen includes all the major stainless steel appliances. Private, gated entrance. Stairs leading to the second floor which includes the kitchen, living space, a very spacious bedroom, and a full bathroom. On the third floor, you will find the 2nd and 3rd bedrooms. One is very large. Also on this floor is the 2nd full bathroom and another sitting area. Again, this unit includes all the appliances in the kitchen, washer and dryer, central air and heat, and wired for cable plus high-speed internet. Situated on 5th street near christian street, this true queen village address offers the best amenities available in one of center city's most desired neighborhoods. Residential-feel with great proximity to local markets and parks, eclectic eateries and cafes, and a short ride away from major highway exits and the downtown. 12-24 months lease term. The owner prefers no pets. Small pets will be considered with pet rent. The tenant pays most utilities. Locally owned and managed. Great value in queen village for a beautiful 3br\/2ba private rental. Tour in-person or virtually (video walkthrough available)\n930 s 5th st #b\n","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', '1400ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T12:53:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-in-the-heart-of\/7506725772.html","post_id":7506725772,"result_date":"2022-07-09 12:53","title":"Located in the heart of center city,","description":"Located in the heart of center city, this 1-bedroom lofted residence is a quick walk to 30th street station, university city, fitler square, the fitler club, and rittenhouse square. Brand new hvac and recently replaced electric water heater. Viking appliances and the convenience of living in a boutique condominium building within walking distance from the schuylkill trail, 30th street station, rittenhouse square, university city, and fitler square. A quick walk to shops, bars, and restaurants. This unit is filled with natural light, high ceilings, and floor-to-ceiling windows. Tile backsplash, granite countertops, and two-basin sink highlight this meticulously designed space. The unit features a laundry area that fits a stacked washer and dryer. 23 s 23rd street offers residents a rooftop sun deck for relaxation and al fresco dining, as well as a well-landscaped courtyard for residents. An excellent choice for the buyer looking for a turnkey condominium in a luxe building with low monthly condominium fees and indoor attached parking permit for 1 car is available for $100\/mo. The unit also includes a storage locker.\n23 s 23rd st #2d,\n","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '791ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T12:49:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-salt-water-pool-with\/7506725411.html","post_id":7506725411,"result_date":"2022-07-09 12:52","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nYou will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T12:48:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-in-washington\/7506724522.html","post_id":7506724522,"result_date":"2022-07-09 12:51","title":"Located in washington square","description":"Located in washington square west - huge four bedroom three bathroom property available for an 8\/1 move in! This home is three floors - hardwood floors throughout, central air, washer\/dryer in unit, private back patio, renovated kitchen with stainless steel appliances! All four bedrooms are large and there is a ton of closet\/storage space throughout. Super walkable location - and located in the mccall catchment! Tenant(s) responsible for electric, gas, water. Pets allowed on a case by case basis.\n528 s 13th st #1\n","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['4BR \/ 3Ba', '2000ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T12:47:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-great-living-alief\/7506705933.html","post_id":7506705933,"result_date":"2022-07-09 12:50","title":"LUXURY- GREAT LIVING ALIEF\/ GREAT PRICES\/ CALL FOR DETAILS!","description":"TWO bedroom $799-849 \/mo 622-776 sf\nTHREE bedroom $899-949 \/mo 790-1,113 sf\nFOUR bedroom $1,299-1,349 \/mo 1,125-1,142 sf\nDeposit: 500+ Pet Policy: Cats:Yes Dogs:Yes\nBuilt: 1982 Location: Alief\nPrices & Specials change daily, contact me for availability\nCommunity Amenities: Bus stop, School bus stop, Pool, Play ground, Perimeter fence, Picnic area, Laundry room, Fitness center\nUnit Amenities: Fire places, Frost free refrigerators, Cable ready, Private patios\/balconies, High ceilings, Ceiling fans, Walk-in closets, Crown molding, Hi-speed internet, Storage closet outside, Ice makers, W\/D connections, Premium Appliances, Miniblinds, Garbage disposals, Dishwashers, Premium Countertops\nFor more information about this community contact:\nRaymond Duren (Agent)\nFindit Apartment Locators\nshow contact info","num_images":5.0,"lat":39.9925,"lng":-75.1415,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T12:09:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-in-the-heart-of-center\/7506718951.html","post_id":7506718951,"result_date":"2022-07-09 12:39","title":"in the heart of center city one","description":"Beautiful bi-level apt in the heart of center city one block of brad street. Located on prime location close to everything -penn and jeff hospitals, university of the arts, public trans, restaurants, shops. Modern kitchen with pantry, 1.5 baths, three large bedrooms and huge living room! Hardwood floors throughout, central air, washer\/ dryer in the apt! Must see!! For more information and to schedule a showing call or email.\n350 s 15th st #3, philadelphia\n","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['3BR \/ 1.5Ba', '1200ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T12:35:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bark-park-bocce-ball-field\/7506711812.html","post_id":7506711812,"result_date":"2022-07-09 12:37","title":"Bark park, Bocce ball field, Huge walk-in closets with ample storage","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Bocce ball fieldUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsHuge walk-in closets with ample storageUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with dens48-hour Maintenance CommitmentGame Room with Billiards Table, Shuffle Board, and more9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardAlexa or Google Home Capable in all ApartmentsJogging trail right outside your doorBark parkUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingOn-site bike storageCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/qgkjl6h6\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['1BR \/ 1Ba', '768ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-07-09T12:21:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-25\/7506706582.html","post_id":7506706582,"result_date":"2022-07-09 12:31","title":"beautiful 2 bedroom, 2.5 bathroom home","description":"Rittenhouse square location and private gated parking! This beautiful 2 bedroom, 2.5 bathroom home is defined by style, elegance and charm. Located in a classic brownstone on pine st., the building was meticulously renovated in 2015 to ensure all of its former character was maintained, while making room for four (4) fully renovated contemporary units. Unit a, which comes with its own private parking, is the largest of the four units and is perfectly situated at the front of this historic building featuring beautiful large windows that infuse the first floor and large master bedroom with light year-round and offer an an idyllic, classic philadelphia view of the lovely tree-lined block. Plus, it is in a hard-to-beat location just a few minutes away from the theatre district & rittenhouse square, yet still on a quiet and peaceful residential street, across the street from the best place in the city to get a cappuccino! 1508 pine st. Boasts ample living & dining spaces for all of your family & friends to enjoy. Enter through the main level, which has a spacious living area and dining room, a beautiful brick fireplace and a lovely powder room. Upstairs there are two generous bedrooms, each on their own level for optimal privacy and both equipped with their own private, luxurious tiled bathrooms with luxurious tile tub surrounds, tile floor and custom vanity. Down on the lower level, you will find a large family room and designer kitchen with travertine floors throughout. The kitchen features sleek, modern cabinetry, quartz countertops, and new premium appliances including a viking microwave, viking gas range, whirlpool refrigerator, and bosch dishwasher. High ceilings and plenty of windows flood this home with light and give it a bright, open and airy atmosphere, while classic architectural features like the brick fireplace, natural wood accents, and beautiful intricate moldings give it a warm and inviting feel. Not to mention the private gated parking located in the back of the property, laundry in-unit (+ brand new samsung washer & dryer) and an additional storage locker in the basement make this home as convenient as it is luxurious. Don't miss out on this incredible space close to rittenhouse square park, broad street, jefferson, upenn, and the cityã¢â€â™s finest restaurants, boutiques, and more! Recent updates by the current owners include new paint throughout the home, refinished hardwood floors throughout, resurfaced fireplace, new bathroom cabinetry, new washer & dryer, new quartz countertops and brand new state of the art kitchen appliances!\n1508 pine st #a,\n","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2.5Ba', '1773ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T12:11:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3400-block-emerald-street\/7506712541.html","post_id":7506712541,"result_date":"2022-07-09 12:27","title":"3400 block Emerald street","description":"Well maintained 3 bedroom, 1.5 bath row home available august 1st but the date is flexible.  Close to public transportation and Hope park as well as the seaming o shopping district.  New roof, furnace, water heater, washer, dryer, chest freezer.  Huge 40 foot deep back yard.  Public record lists the property at just under 1000 square feet but an addition was built to provide an extra 350 square feet downstairs.  New bamboo floors throughout the downstairs and newer carpet upstairs was put in a couple years ago.  Security system included but unmonitored.  Ceiling fans throughout.  Air conditioning via window units.  80 % of the house was just painted this month.  1st last and security require.  No pets or smoking.  Credit check required.  Looking for 1 year lease","num_images":13.0,"lat":39.996682,"lng":-75.10662,"attrs":"['3BR \/ 1.5Ba', 'available aug 1', 'air conditioning', 'house', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T12:23:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-come-visit-this-larger\/7506711083.html","post_id":7506711083,"result_date":"2022-07-09 12:24","title":"Come visit this larger than norm","description":"Come visit this larger than norm one bedroom facing south overlooking a lovely courtyard, sundeck and association swimming pool. Brazilian cherry hardwood floors in the living room which accommodates a separate dining area. Galley kitchen with granite counter tops , white cabinetry, tile floors and stainless appliances, combination washer-dryer . Private main bedroom features fully wall of custom organized closed and an additional walk in closet. Floor plan has a great flow for entertaining. Building has 24 hour deskperson, clubroom, board room, lounge room , seasonal swimming pool and gym at no additional charge. Electric, internet is extra . Basic cable is included. Building has $250.00 move in fee. Floor plan is attached\n219-29 s 18th st #1620,\n","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '649ft2', 'available aug 5', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T12:20:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-microwave-package\/7506707382.html","post_id":7506707382,"result_date":"2022-07-09 12:16","title":"Microwave, Package Receiving, Large Closets","description":"Bedrooms: 1Bathrooms: 1Square Feet: 643Date Available: 2022-07-09Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:High Speed InternetLarge ClosetsFitness Center w\/ Peloton BikesOn-Site Management24\/7 Front Desk AttendantWindow CoveringsElevatorRefrigeratorBike StorageFOB Controlled AccessMicrowaveDishwasherCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/qawujqta\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '643ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T12:12:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7506706379.html","post_id":7506706379,"result_date":"2022-07-09 12:14","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nFind yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closet, and a patio\/balcony!","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available jul 21', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T12:10:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this-gorgeous\/7506704590.html","post_id":7506704590,"result_date":"2022-07-09 12:11","title":"Welcome to this gorgeous, ultra modern","description":"Welcome to this gorgeous, ultra modern, sun dappled, 2 bed, 2 full bath corner unit, offering beautiful city views at penn treaty residences at 1405 frankford avenue. This amazing condominium is located at the very heart of prime fishtown, philadelphia's most dynamic, vibrant and sought-after neighborhood! Situated directly behind fishtown's historic, and newly remodeled, rose garden, enter this barely 3 year old, secure, 30 unit building and enjoy your urban oasis to the fullest. Entering #409 you will find rich mocha colored flooring throughout, a convenient coat closet, then your first, oversized, full bathroom. Each spacious bedroom offers great light and the primary boasts and en suite full bathroom as well. Your ultra-modern designed bathrooms both feautre italian tile flooring and beautiful tiling andporcelain vanities. Down the hallway find an ideally located laundry closet on the way to your open concept kitchen\/living room offering wonderful views. Note the double thick quartz countertops , high end ge stainless steel appliances including a double wall oven, cooktop stove and french door refrigerator, complete with an electric fireplace. Need parking? No worries add a deeded garage parking space for an additional $250 a month!This beautifully maintained building's amenities include a spacious common roof deck with spectacular 360 views including center city and the ben franklin bridge, storage bins for each unit, bike room in the basement, secure key fob entry and of course an elevator. Mere steps from la columbe, suraya, wm mulherin's & sons, kensington quarters, ramona susan's bake shop, heffe tacos, city fitness gym and a myriad of other bars, restaurants, bakeries, souperies, specialty shops, nail salons, boutique clothiers and so much more. This is why forbes magazine called fishtown america's hottest \"new\" neighborhood in 2018 and it's only gotten better since. A 5 minute walk to the el or multiple bus lines, easy access to i-76 & i-95, walk & bike scores of 94 (\"paradise\") so what are you waiting for? Make it yours today!\n1405-21 frankford ave #409,\n","num_images":4.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 2Ba', '846ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T12:07:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-lawrence-st\/7506696724.html","post_id":7506696724,"result_date":"2022-07-09 12:10","title":"Welcome to lawrence st!","description":"Welcome to lawrence st! Be the first to live in this brand new, luxury bi-level apartment on a quiet block in northern liberties! This spacious 2 bed, 1.5 bath offers plenty of living space and has a perfect garden space for outdoor entertaining. Enter the unit from your private access alley into the main living space which features a large kitchen with eat-in bar, convenient half bath, 10+ foot ceilings, and large floor-to-ceiling windows that let in tons of natural light. The kitchen has tons of storage, high-end quartz countertops and modern subway tile backsplash with plenty of counter space for all your cooking and entertaining. The living room is a great size and looks out into the private garden space, offering an indoor-outdoor flow also excellent for entertaining. The garden is not pictured due to the ongoing work, but is large enough to fit your bbq and seating easily, plus room for all your flowers and plants! Head downstairs to find two generously sized bedrooms with large closets, a large full bath with great storage, and a full sized washer\/dryer. A polished concrete floor, stylish\/classic tile choices, and custom pella windows complete the modern vibe. No details were overlooked in this building! It has in-unit washer\/dryer, full kitchen appliance package including dishwasher and garbage disposal, hvac, solid hardwood floors, high ceilings over 10ft, gigantic windows to let in tons of natural light, as well as thoughtful layouts to minimize sound between units. Building is outfitted with fire alarm system, sprinklers, intercom and camera system to ensure safety and security. Conveniently located near i-95. Walking distance to great bars and restaurants including: yards brewing, cafe la maude, north third, and even target!\n555 n lawrence st #1r,\n","num_images":4.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1.5Ba', '1000ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T11:51:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7506703707.html","post_id":7506703707,"result_date":"2022-07-09 12:09","title":"Private Balcony, Quiet Community, Move In Now","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nApartment Features\n* Washer and Dryer in unit\n* Garden Tub\n* Linen Closet\n* Walk-in Closet\n* Stainless Steel Appliances\n* Private Patio or Private Balcony (on select apartments)\n* Kitchen Island","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1363ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T12:05:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-bed-bath-spacious-modern\/7506703192.html","post_id":7506703192,"result_date":"2022-07-09 12:08","title":"2 Bed 2 bath - Spacious Modern Living!","description":"Apt. 1101 — Manchester floor plan — 1,149 sq. ft. — $3,188\nLocated on the 1st floor, this 2-bedroom\/2-bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full sized front-loading washer and dryer, and stainless steel appliances. The large master bedroom is equipped with a private patio, a walk-in closet and a spacious bathroom with double sink vanity and walk in shower. The second bedroom and bathroom are spacious as well!  This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-09T12:04:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/fort-washington-one-bedroom\/7506702843.html","post_id":7506702843,"result_date":"2022-07-09 12:08","title":"One Bedroom","description":"This is a beautiful one-bedroom, one-bath apartment in Upper Dublin. It is conveniently located within walking distance of the Fort Washington Train station, close to the Turnpike and 309 . Text  show contact info","num_images":0.0,"lat":40.138402,"lng":-75.195524,"attrs":"['1BR \/ 1Ba', '400ft2', 'available jul 15', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T12:04:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-12th-street-in-queen\/7506699538.html","post_id":7506699538,"result_date":"2022-07-09 12:01","title":"12th Street in Queen Village.","description":"Welcome to Unit 3 of 626 S. 12th Street in Queen Village. This large two bedroom, 1 bathroom gem is located in a prime location, between Washington Square and Bella Vista. You’ll be blocks from Washington Square, Seger Dog Park, and Palumbo Park. Plus you’re walking distance from Acme, Sprouts, Whole Foods, and great restaurants\/bars. The apartment features a spacious living room with lots of natural sunlight and a kitchen with stainless steel appliances. Best of all, there is a large shared roof deck, lounge, and bar where you’ll be able to enjoy wonderful views. Laundromat no longer! There is a washer\/dryer in-unit. Tenant Pays Utilities (.Water, electric, heat, internet\/cable) Subject to credit and income requirements, small dogs ok with landlord approval and additional fee.\n626 S 12th St #3,\n","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '1170ft2', 'available jul 31', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T11:57:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-gem-in-narberth-deluxe-studio\/7506687761.html","post_id":7506687761,"result_date":"2022-07-09 12:00","title":"Gem in Narberth-Deluxe Studio-New Kit-W\/D-AC-Dressing Rm-Gym-Storage","description":"Year Lease - SPECIAL-Security Deposit $500\nHUGE Dressing Room\/Closet and Washer and Dryer Under Large Breakfast Bar!\nFirst Floor: Secluded, Renovated Kitchen and Bath, Spacious Floor Plan, the perfect studio does exist...perfect for YOU!\nThis elegant apartment home features a gourmet kitchen, quartz counters, huge breakfast bar and has designer wall and trim color. Visit to see our high-end appliances including a washer\/dryer, stainless-steel appliances, AC and dishwasher. Additional stylish features are lovely Moroccan archways, rich wood floors and a spacious floor plan!\nAMENITIES\nGourmet Kitchenwith Quartz Counter\nWasher and Dryer in Apartment\nDishwasher\/ Microwave\nRefrigerator with Ice Maker\nAir Conditioning\nWindow Treatments\nUpgraded Bathroom\nWood Floors\nMoroccan Archways\nPet Friendly\nOnline Service Requests & Resident Portal\nProfessional On-Site Management\nProfessional On-Site Maintenance\n24 Hour Emergency Service\nStorage\nFitness Center\nPet Friendly! 🐶 🐱\nCall: show contact info\nfor a live, video or FaceTime tour!\nNEIGHBORHOOD\nTrain-\nShopping & Restaurants\nWalk to Playground, Basket Ball & Tennis Courts\nWalk to Narberth Library\nNarberth is the best of the Main Line! Living in your new apartment home offers a lifestyle unlike anywhere else. A quintessential town with peaceful-beautiful roads, parks, trails and play grounds. An array of international-specialty eateries, French bakery, boutiques, gift shops, book stores, vintage movie theatre, and super market with the best butcher in the Philly area. Either before or after your tour, plan an adventure to enjoy and exsperience the local delights, all unique to Narberth.\nLook and Lease Special is valid for new residence only and can be withdrawn at any time without prior written notice, restrictions apply.\nQualified applicants only.\nEqual Housing Opportunity\nLeasing Office Hours: M-F: 9 am-5 pm. Weekends available by appointment.\nCall: show contact info","num_images":22.0,"lat":40.008667,"lng":-75.263922,"attrs":"['0BR \/ 1Ba', 'available nov 11', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T11:32:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bocce-ball-field-online\/7506689207.html","post_id":7506689207,"result_date":"2022-07-09 11:54","title":"Bocce ball field, Online Payments Available, BBQ and deck area","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Marble master baths, some with deep linen storageOnline Payments AvailableState-of-the-art fitness center overlooking the Manayunk canalUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsAlexa or Google Home Capable in all ApartmentsUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar Seating9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardFront Desk attendant during mornings and evenings to greet you and assist you with anything and everything48-hour Maintenance CommitmentBark parkGame Room with Billiards Table, Shuffle Board, and moreCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/w54gmssf\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['1BR \/ 1Ba', '768ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-07-09T11:35:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2000-sq-ft-2bed-2bath-huge\/7506694901.html","post_id":7506694901,"result_date":"2022-07-09 11:51","title":"2000 sq ft 2bed 2bath huge bathrooms","description":"2000 sq ft 2bed 2bath huge bathrooms. Lots of storage. South facing light filled home. Available aug 1.\n314-22 n 12th st #505,\n","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '2000ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T11:47:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bi-level-bed-bath\/7506693653.html","post_id":7506693653,"result_date":"2022-07-09 11:49","title":"Gorgeous bi-level 3 bed, 3 bath unit","description":"Gorgeous bi-level 3 bed, 3 bath unit in graduate hospital with tons of natural sunlight and a stunning kitchen complete with quartz countertops and stainless steel appliances. Huge living room with open floor plan and a large rear yard with enough room for entertaining. The first floor is complete with your 1st bedroom including full hallway bathroom. On the lower level you will find your generously sized 2nd and 3rd bedrooms one with an ensuite bathroom and the other is a hallway bathroom. Just a few blocks from rittenhouse square, one block off south street, and walking distance to entertainment, shopping and transportation. Don't miss this one!\n762 s 15th st #a\n","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 3Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T11:45:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-youll-fall-in-love-with\/7506692531.html","post_id":7506692531,"result_date":"2022-07-09 11:46","title":"You'll Fall In Love With All The Charming Details In This 4B Unit!!","description":"Spacious 4B\/2B apartment becoming available in mid-August!!! This spacious apartments features a private entrance, central air\/heating, quaint living\/dining room. Generous sized bedrooms, including bonus space in some rooms, perfect for a home office. High ornate ceilings, modern kitchen featuring beautiful granite countertops, stainless steel appliances and timeless white kitchen cabinets. Newer gray tile flooring in common areas and plush carpet in all bedrooms. Spacious closets in all bedrooms with built-in shelves. Apartment includes stackable w\/d for your convenience. Ask about our NO SECURITY DEPOSIT program!! Cats are welcome (add'l fee)! Apartment is rented unfurnished.\nChancellor Apartments is a convenient high rise apartment community in an amazing location in Center City. We are close to most major schools and universities, public transportation, historical attractions, shopping, restaurants and theaters. Center City at its best!!\nRent for this unit includes: Water, 24-hour front desk attendant, free bike storage room, package acceptance service, 24-hour emergency maintenance service, on-site smart card laundry plus card access system and BuildingLink resident services portal access for all residents.\nWe have partnered with Optimal Sport Health Club to offer a generous discounted gym membership (we pay your initiation fee!). There are several off street parking lots and garages in the area, too!\nCHANCELLOR APARTMENTS\n206 S. 13th Street\nPhiladelphia, PA 19107\nshow contact info\nFranceina Thorne, REALTOR\nHours:\nMon. - Fri. 9:00 to 5:00\nSaturday - 10:00 to 3:00\nAppointments are required","num_images":17.0,"lat":39.948681,"lng":-75.162197,"attrs":"['4BR \/ 2Ba', 'available aug 15', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T11:42:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-home-to-this\/7506692358.html","post_id":7506692358,"result_date":"2022-07-09 11:46","title":"Welcome home to this charming","description":"Welcome home to this charming three bedroom two bath home with stunning roof deck and finish basement. Foyer entrance leads you to a quaint living room with marble fireplace, the space is open to the dining room and beautiful gourmet kitchen. Rear patio offers additional outdoor dining space and grilling. Wonderful storage space\/office is located in the lower level basement along with the laundry area. Schedule a visit to see the beautiful skyline views from the private rooftop deck.\n792 n croskey st,\n","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2Ba', '1572ft2', 'available aug 1', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T11:42:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bath-first-floor\/7506692278.html","post_id":7506692278,"result_date":"2022-07-09 11:46","title":"2 bedroom 1 bath first floor apartment","description":"Property description\nLearn more\nEdit\nThis property is located between 20th and 22nd and Diamond (near Temple University). It has been renovated from the ceiling to the floor. -- New laminate flooring -- New paint -- All new appliance -- New central air\/heat HVAC system -- New cabinets --Washer\/Dryer in Apt -- Water included. -- Storage available in the basement -- small back deck ...too much to list. It is pet friendly (with a pet deposit). If you have specific questions email us We do not run credit, but there is an application fee of $35.00 per person. There will be a viewing on July 12, 2022, from 5:00 pm to 6:30 pm It will be available to rent immediately. We require first\/last\/security. (Will not last long).\nPets\nLearn more\nEdit\nSmall dogs allowed, Cats allowed\nLease description\nEdit\nOwner pays water Tenant pays electric\/gas\/internet\nLease duration\nEdit\n1 year\n","num_images":14.0,"lat":39.987129,"lng":-75.168592,"attrs":"['2BR \/ 1Ba', '900ft2', 'available jul 12', '\\ntuesday 2022-07-12\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T11:42:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-3bd-15ba-house-for\/7506672458.html","post_id":7506672458,"result_date":"2022-07-09 11:44","title":"Cozy 3bd 1.5ba house for rent..","description":"Rarely offered single home for rent in Rockledge Borough. This 3 bedroom 1.5 bath Cape Cod with central air conditioning is located within award winning Abington School District. You will immediately fall in love with the covered front porch before stepping through the front door into the spacious living room and formal dining room both with beautifully maintained hardwood floors and newer windows.. The updated kitchen offers newer appliances, adequate cabinet space as well as two additional pantries\/storage. This floor also offers two bedrooms with ceiling fans and an updated hall bathroom. The second floor offers a very large bedroom with walk in closet and an additional bonus room with another walk in closet. Head downstairs to the huge finished basement with plenty of space for everyone. This level also has a half bath, laundry and storage\/utility room. All of this plus a fully fenced in rear yard and detached garage. Close to multiple playgrounds, public transportation, shopping and dining. Call Right Now For More Details in this house:- show contact info\n.","num_images":6.0,"lat":40.075278,"lng":-75.090178,"attrs":"['3BR \/ 1.5Ba', '1037ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T11:00:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/studio-apts-becoming-available-heat\/7506689536.html","post_id":7506689536,"result_date":"2022-07-09 11:40","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-7708-henry-avenue-house\/7506672681.html","post_id":7506672681,"result_date":"2022-07-09 11:33","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-level-4br-15ba-1800-sq\/7506683016.html","post_id":7506683016,"result_date":"2022-07-09 11:27","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bed-bath-house-has\/7506678418.html","post_id":7506678418,"result_date":"2022-07-09 11:25","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3br-25bath-single-family\/7506680227.html","post_id":7506680227,"result_date":"2022-07-09 11:20","title":"3BR 2.5BATH Single Family House - 1 Year Lease","description":"AVAILABLE SEPT 2022\nBelmont Hills\/Bala Cynwyd single family home with yard. 3 bedrooms, 2.5 baths. Approx. 1,800 square feet. Central air, washer\/dryer, basement, family room, dining room\/living room combo. Hall bedrooms are approx 9x10. Master bedroom w\/ ensuite bath and deck approx 10x22. Deck with view. Easy access to 76, Belmont Hills Library and Pool.\n$3,000 + utilities. (Util are approx $300-350 a month for gas, electric, landscaping, trash removal, water depending on occupants usage)\nGood credit required, stable employment and references. One year lease. First month, last month and security - $9000 to move in plus background & credit check\/fees.\nNo pets, no smoking, no subletting. Landlord would like to keep some areas of basement\/garage for storage. Discount for a situation where landlord could have access to house with tenant still having exclusive use 90% of the time. Please inquire.\nContact me with any questions. Please leave phone number, brief intro about you and who would be living there and time you can be reached. Happy to share photos and more details once we speak but want to maintain privacy.\n","num_images":0.0,"lat":40.027851,"lng":-75.236263,"attrs":"['3BR \/ 2.5Ba', '1800ft2', 'available sep 1', 'house', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T11:16:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bed-bath-house-in\/7506676442.html","post_id":7506676442,"result_date":"2022-07-09 11:13","title":"Gorgeous 3 bed 1 bath house in Cedar Park! Avail 9\/1!","description":"1051 S. 50th Street Available Sept 1st\nSouthwest Cedar Park location.  Easy access to Baltimore Ave, I76, UPENN, Drexel U and MORE.\nFantastic well maintained 3 bedroom 1 bathroom 2 story house available for rent.\nEnter the home through a wide vestibule \/ coat room to find a wide open living room with beautiful hardwood floors and tall ceilings. The kitchen boasts beautiful granite counter tops, tile floor and a massive breakfast bar perfect for entertaining.  Through the kitchen you will find a small rear patio perfect for the BBQ.\n2nd floor offers 3 spacious bedrooms and a 3 piece tiled bathroom with newer sink, toilet and tile.\nWindow Ac units will remain in the home.\nBasement offers plenty of storage space and your very own washer and dryer.\nTruly a must see home boasting:\n-hardwood floors\n-spacious eat in kitchen with granite and breakfast bar.\n-ceiling fans\n-Plenty of storage\n-outdoor space\n-Great location\n","num_images":24.0,"lat":39.944283,"lng":-75.219002,"attrs":"['3BR \/ 1Ba', 'available sep 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T11:09:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-designed-for-modern-living\/7506661570.html","post_id":7506661570,"result_date":"2022-07-09 11:10","title":"designed for modern living","description":"Bridge on race is philadelphia's only amenity-packed, leed gold boutique high-rise and offers thoughtfully-appointed apartments in a rental building designed for modern living in old city. The architecture bridges the charm of old city with modern design and amenities, tying classic aesthetics with considered, contemporary architecture. Bridge offers its residents a unique lifestyle with a plethora of services and amenities, such as an expansive 8,000 sf outdoor garden terraces with private grilling areas, a rooftop deck with the best views in philadelphia, state of the art fitness center, resident lounge, and much more. ** photos are of model units ** pricing and availability subject to change on daily basis ** parking may be available for additional fee **\n205 race st #1b-1004h,\n","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '614ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T10:36:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recycling-elevator-package\/7506673760.html","post_id":7506673760,"result_date":"2022-07-09 11:07","title":"Recycling, Elevator, Package Receiving","description":"Bedrooms: 0Bathrooms: 1Square Feet: 397Date Available: 2022-07-09Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Parking Garage (Additional Fees)Electronic ThermostatFOB Controlled AccessRefrigeratorOn-Site ManagementWindow CoveringsPackage ReceivingFitness Center w\/ Peloton BikesElevatorHigh Speed InternetRecyclingBike StorageCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/pjzd6yoj\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '397ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T11:03:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-center-city-apt-for-ppl\/7506663751.html","post_id":7506663751,"result_date":"2022-07-09 11:02","title":"Center City Apt for 2 ppl","description":"Bright and sunny corner apartment with unobstructed view for 2 occupants.\nFabulous location! Located in the heart of everything. Next to Temple University School of Podiatry.\nShort walk to Convention Center, Kimmel Center, Avenue of the Arts, Independence Hall, Penn’s Landing, Franklin Square, Old City, Society Hill, Jefferson Hospital University and Pennsylvania Hospital.\nClose to shopping: Macy’s, Fashion district, Reading terminal market, Trader’s Joes, Giant Heirloom, and Chinatown.\nEasy access to public transportation: SEPTA Regional rails, Subway, PATCO train, Greyhound bus, Flix Bus, as well as to Highways I-76, I-95, I-676, and Ben Franklin Bridge.\nFeatures:\n- large living room\n- 2 bedrooms\n- 1 Full bathroom\n- hardwood floor\n- kitchen w granite counter-top\n- gas stove\/oven\n- dishwasher\n- garbage disposal\n- large refrigerator\n- washer and dryer in apartment\n- central air conditioning\n- warm and comfortable gas heat\n- water included\n- cable TV ready\n- NO SMOKING\n- NO PETS\nNote: Place is unfurnished","num_images":6.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', 'available aug 1', 'air conditioning', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T10:41:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-board-south-short-term\/7506670989.html","post_id":7506670989,"result_date":"2022-07-09 11:01","title":"Board & South  Short-Term Rentals Only\/Vacation","description":"Broad & South \/ Where you can discover the City!\n************We Offer Short-Term Rentals or Vacation Rentals-charged on a daily rate.\nThis cozy and comfortable apartment is located on the 3rd floor of a beautiful townhome. Flooded with natural light, live plants, and welcoming decor, this space will be sure to put a smile on your face. The living and dining room includes a sleeper sofa with pillows and heated blanket, accent chairs, a smart tv, dining room table with 4 chairs, and a glass coffee table. The kitchen includes all the essential cookware and bakeware, full sized fridge, electric stove with oven, drip coffee maker, hot water maker, stepping stool, and microwave. There are 2 Bedrooms with queen sized beds, a standing mirror, iron and ironing board, and plenty of storage. Utilities and WIFI are included with this space!","num_images":14.0,"lat":39.943664,"lng":-75.165575,"attrs":"['2BR \/ 1Ba', '800ft2', 'available now', 'air conditioning', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T10:57:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-graduate-hospital-gem-bed\/7506670875.html","post_id":7506670875,"result_date":"2022-07-09 11:01","title":"Graduate Hospital gem! 2 bed 2.5 bath apt w\/ garage for storage!","description":"521 S 24th St – 1+2R – Graduate Hospital – Fitler Square Apartment\nPerfectly situated a few blocks away from the Schuylkill (Taney) Park and the foot of the South Street bridge leading to UPenn, CHOP, and Drexel. There is not a better location to enjoy all the benefits of Center City, with the accessibility to University City. Convenient to Rittenhouse Square, Fitler Square Park, Graduate Hospital, Philadelphia Airport, and of course all of the restaurants, coffee shops, bars and overall neighborhood feel which makes Fitler Square one of the City’s most desirable neighborhoods.\nThis bi-level apartment is very cool offering not only a garage, but outdoor space, and 2.5 bathrooms!! A MUST see for anyone looking to live in the Fitler Square area.\nApartment boasts:\n2.5 bathrooms\n2 Bedrooms\nFinished Basement\nBi-Level Layout\nWorking Fireplace\nRefrigerator\nCabinet Space\nGarbage Disposal\nWasher\/Dryer\nAnd MORE!\nContact Bryan today to schedule your showing.\nwww.rentals215.com\n","num_images":14.0,"lat":39.945545,"lng":-75.180746,"attrs":"['2BR \/ 2.5Ba', 'available sep 1', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T10:57:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-townhouse-for-rent\/7506669479.html","post_id":7506669479,"result_date":"2022-07-09 10:58","title":"townhouse for rent","description":"Corner property for rent in the Andorra Wood. 4 beds, 2 1\/2 bath, office, open floor, house fully upgraded with stainless appliances, under counter microwave, Corian countertop,  finished basement (additional sqft), patio, upper deck facing playground. This property is rented fully furnished. 12 month lease minimum. Landlord is a licensed agent. Applicants must present a rental application prior to viewing the property.","num_images":0.0,"lat":40.0896,"lng":-75.2601,"attrs":"['4BR \/ 2.5Ba', '1780ft2', 'available sep 1', 'application fee details: $ 35', 'furnished', 'townhouse', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T10:54:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-private-comfy-cool-short\/7506664981.html","post_id":7506664981,"result_date":"2022-07-09 10:57","title":"Private! Comfy! Cool! Short-Term Rentals\/Vacation","description":"This Super Clean Great place to Escape! Close to all attractions Philadelphia has to offer.\nGreetings! We are a fun, loving & open minded group. We pride ourselves in creating great relationships and being great resources to like minded individuals. We believe that everyday is a new experience to be positively embraced!\n***********We offer Short-Term Rental or Vacation Stays at a Daily Rate\nPrivate,Cool,Comfy!\nInteraction With Guests-We have a 1hr. response window for all contact needed during your stay.\nAccess to your unit is completely contactless via the latest smart lock technology.\n1 Bedroom Newly Remodeled Space that has a contemporary disposition with a touch of nature.\nHigh speed internet for business at home.\nUrban Residential location with all the privacy you need!. Most of the daily essentials are at walking distance.\nEasy Access to Public Transportation \/ For schedules search www.Septa.org","num_images":6.0,"lat":40.009447,"lng":-75.152878,"attrs":"['1BR \/ 1Ba', '400ft2', 'available aug 7', 'air conditioning', 'dogs are OK - wooof', 'furnished', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T10:44:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-live-in-landmark-at-the\/7506654772.html","post_id":7506654772,"result_date":"2022-07-09 10:51","title":"Live in a landmark at the beautiful boutique","description":"Live in a landmark at the beautiful boutique \"1737 chestnut\" located in historic rittenhouse square. This beautiful condo for lease is in the middle of fine dining, lively sidewalk cafes, one-of-a-kind shopping, and nightlife. The unit is +\/- 900 square feet, 2 spacious bedrooms and a wonderfully updated bathroom with floor to ceiling marble tile. Featuring an open floor plan with natural light throughout, multiple windows overlooking the hustle and bustle of chestnut street. The engineered floors, marble bathrooms and impeccable finishes are incredible. The sleek open kitchen has stainless steel appliances, granite countertops, and a breakfast bar. The large bedrooms have plenty of closet space and offers a separate utility room for additional storage. Live the boutique building lifestyle that includes a 24-hour virtual desk and security. The campuses of the university of pennsylvania and drexel university, major hospitals, 30th street station, and highways are all minutes away. Schedule your tour today.\n1737-39 chestnut st #401\n","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: daily']","posted_date":"2022-07-09T10:19:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-laundry-in-unit-lease\/7506666366.html","post_id":7506666366,"result_date":"2022-07-09 10:51","title":"Laundry in Unit, Lease Today, Convenient Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nLooking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Pet Salon\n* Sun Deck\n* Easy Freeway Access\n* Yoga Lounge\n* TV Lounge\n* Professionally Managed\n* Community Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Putting Green\n* Outdoor Grill Area\n* Fitness Studio\n* Bocce Ball\n* Bark Park\n* Swimming Pool\n[#9307482]","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T10:47:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-on-the-penthouse\/7506656415.html","post_id":7506656415,"result_date":"2022-07-09 10:46","title":"Located on the penthouse level","description":"Located on the penthouse level, this two-level condo has spectacular views both north and west. The heart of center city philadelphia is at your feet. As you walk into your well-appointed foyer, you are greeted by the kindest front door staff in center city. Your new home is located in the northwest corner of the highest floor. With 10 foot ceilings, brazilian cherry floors, dark granite in the kitchen and brookhaven cherry cabinets - the setting is simply beautiful. The open floor plan first floor is expansive and elegant. Go up the carpeted stairs to your spacious bedroom complete with its private bathroom. The view never ends in this exceptional condominium. Modern appliances, marble baths and spa showers. The ellington is the winner of five william penn awards of excellence from the building association of america. Additionally, there is a fitness center and residence lounge available 24\/7. 24 hour notice for all showings. Very convenient to shopping, restaurants, museums and entertainment in walking distance. Right next to mass transit and regional rails, including the airport line; a short transit ride to 30th street station for trains to new york, washington and beyond. This is complete with fine, comfortable furnishings and elegant light fixtures. The box spring is furnished; please bring your own mattress. Ready to move in and make this your home. No pets allowed. Note - there is a $300 move-in fee payable by the tenant to the building management. Exclusions - coffee maker, mattress (box spring is provided)\n1500 chestnut st #20j\n","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1.5Ba', '1217ft2', 'available jul 15', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T10:23:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-highly-desirable-art\/7506657767.html","post_id":7506657767,"result_date":"2022-07-09 10:38","title":"highly desirable art museum area","description":"For rent- a meticulously maintained and exquisitely rehabbed victorian townhome sitting on a quite fairmount block in highly desirable art museum area. Boasting a bright, open floor plan with high-ceilings, hardwood floors, bright and cheerful this is an ideal layout -an entertainer's dream. 1st floor: foyer entrance with lovely custom mosaic tile. Dining room with beautiful gas fireplace flows into a spacious living room featuring high-ceilings and recessed lighting that opens up to a fantastic kitchen via french doors. Spacious kitchen with tile floors and backsplash, granite counters, custom cabinetry, and stainless-steel ge appliances. Conveniently located laundry area with half bath leads to a superb patio with a raised wood deck, full landscaping and an outdoor speaker system. 2nd floor features three bedrooms with plenty of closet space and built-in storage space. Elegantly updated bathroom with tile floors, tiled bath and additional built-in storage. Gorgeous hardwood floors throughout. Three spacious bedrooms. Full and clean basement with plenty of storage space. Owner looking for good credit and good income- this is a spectacular home in a knock out location! Don't let this one pass by!\n2625 parrish st\n","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 1.5Ba', '1300ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T10:27:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-meets-luxury-in\/7506659392.html","post_id":7506659392,"result_date":"2022-07-09 10:35","title":"Modern meets luxury in this beautiful 2 bed 2.5 bath apt!","description":"1639 N. Phillip Street unit B – Available Sept 1st\n2 Bedroom 2.5 Bathroom apartment\nLuxury construction available for rent in the highly sought after Northern Liberties\/Fishtown area.  Close to everything you need including public transit, convenience stores, grocery stores, bars, restaurants, shopping, pharmacy, The Piazza, the highways, parks, and more. Truly a very convenient location with easy access to everything the city offers.\nHigh end construction sets this home apart from all others. Built from the ground up this home offers everything that you are looking in a home plus more.  Enter through the front door to find a large sitting area with hardwood floors, recessed lighting, tall ceilings, and great of natural light.  This first floor is a wide open layout leading back to the gourmet chef’s kitchen with granite counters, lots of cabinets and full size stainless steel appliances including dishwasher.\nA must see home boasting the following:\nHardwood floors throughout\nGreat natural light in every room\nGourmet kitchen with granite counters, breakfast bar and stainless steel appliances\nTall ceilings\nRecessed lighting\nWasher and dryer\n2 bedrooms\n2.5 bathrooms\nCentral air and heat\nGreat location\nContact Bryan for a showing immediately.\n","num_images":5.0,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 2.5Ba', 'available sep 1', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T10:31:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-307-is-bi-level-unit\/7506658793.html","post_id":7506658793,"result_date":"2022-07-09 10:33","title":"307 is a bi-level unit","description":"307 is a bi-level unit with high ceilings and great natural light. Located near groceries, shopping, dining and public transit this building has everything you're looking for! Building amenities include a bi-level roof, 24- hour gym, free hot beverages and atm conveniently located in the lobby. Many floorplans available. Parking availability changes daily and requires additional fee- please inquire if interested in parking. $45 flat fee for sewer and water. Tenants also pay gas and electric. *photos are of model unit in the building. See virtual tour. * any lease term less than 12 months will be subject to premium pricing.\n1151-61 n 3rd #307\n","num_images":4.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1020ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T10:29:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-furnished-luxury-bedroom\/7506651847.html","post_id":7506651847,"result_date":"2022-07-09 10:24","title":"Furnished Luxury 1 Bedroom Apartment, Wood Floors, Near Restaurants","description":"Stay in a furnished luxury one bedroom one bathroom apartment home on the 11th floor in a building located on Rittenhouse Square! The renovated kitchen is fully-equipped with a gas stove, microwave, disposal, and dishwasher. Savor a cup of coffee, tea, or cocoa at the breakfast bar every morning. There is abundant closet space for plenty of storage. A must see, this home is beautiful with its wood floors and high-end furniture!\nThe Rittenhouse Claridge offers you the opportunity to stay in Philadelphia’s most vibrant, walkable neighborhood. So close to stores, restaurants, coffee shops, and bakeries! Target, Trader Joe's, Giant, Sue's Produce Market, Rittenhouse Market, Spruce Food Market, and Di Bruno Bros. are grocery stores within walking distance! Retail stores on Rittenhouse Row include Anthropologie, Barnes & Noble, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, Madewell, Shakespeare & Co., L'Occitane, Boyds, and Sephora. Nearby dining options include: Rouge, Devon Seafood Grill, Parc, Pietro's Coal Oven Pizzeria, Alice Pizza, and Marathon Grill. Sip a coffee at Ultimo, La Colombe, Elixr, and Gran Caffe L'Aquila. Pick up a French dessert at Miel Patisserie. Grab a scone at Metropolitan Bakery.\nCommunity Features:\n* 24\/7 8,000 square foot resident lounge with wifi\n* 24\/7 Top-of-the-line fitness center\n* Fitness\/Yoga studio\n* Sauna\n* Package room\n* Bike storage\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Elevator building with 24\/7 front door attendant and concierge desk staff\n* Amazing roof deck with fantastic views\n* Laundry room on every floor\n* Large laundry room on 3rd floor\n* Attached parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\n* Online resident portal for rent payments, maintenance requests, and more!\nApartment Home Features:\n* Oversized floor plan\n* Large closets\n* Wood floors\n* Breakfast bar\n* Renovated kitchen\n* White kitchen cabinets\n* Granite kitchen counters\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* All utilities included\nInterested in this home? Then, your next step is to schedule an appointment to tour with Michelle or Jocelyn using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com. You may take a guided tour in person. Live virtual tours in Zoom are also available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24.0,"lat":39.949753,"lng":-75.170603,"attrs":"['1BR \/ 1Ba', '875ft2', 'available jul 11', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T10:11:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-renovated-corner-one\/7506653116.html","post_id":7506653116,"result_date":"2022-07-09 10:19","title":"fully renovated corner one bedroom","description":"Stunning, fully renovated corner one bedroom unit at society hill towers! Enjoy magnificent views of the delaware river, ben franklin bridge, and society hill from floor to ceiling windows! Beautiful oak hardwood floors run throughout the unit. The kitchen boasts frigidaire stainless steel appliances, natural stone and porcelain backsplash, granite counters, and wood cabinets. The bathroom features a large sink and vanity, glass mosaic tiled shower walls, and white natural stone floors. The unit has newer hvac. The rent includes all utilities, 24\/7 concierge plus security guard, and verizon fios tv. Verizon internet is available for $30.99 monthly. Laundry room with newer machines are in the finished basement accessible by the elevators. No dogs allowed in building. The towers is uniquely located on five acres of suburban-like grounds yet is close to the delaware river, parks, and restaurants and shops of olde city, center city, rittenhouse, northern liberties and fishtown. The shopping plaza features zahav restaurant (previously named best u.S. Restaurant), sue's produce food market and a cleaners. There is an underground garage accessible by the elevators, with locked bicycle storage rooms. Enjoy the large, secluded outdoor in-ground swimming pool, its grounds, grills and locker rooms. The towers has an upgraded fitness center, hospitality suites for guests, community room, and storage lockers pending availability. The aforementioned are available for reasonable additional fees. Nearby is street parking, major highways and public transit. Your new home awaits! As per owner’s wishes, by july 31 all applications will be reviewed.\n210 locust st #16gw,\n","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '803ft2', 'available sep 1', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T10:15:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-bark-park-leasing-now-stop\/7506652292.html","post_id":7506652292,"result_date":"2022-07-09 10:17","title":"Bark Park, Leasing Now, Stop by Today","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nSchedule a tour today at The Point at Downingtown. We'd love to help you explore our floorplans and let us help you find a new home that perfectly fits your style. Call now!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nCommunity Features\n* Bark Park\n* Minutes from Restaurants, Shopping, and Much More\n* Yoga Lounge\n* Swimming Pool\n* Billiards\n* Fitness Studio\n* Community Lounge\n* Outdoor Grill Area\n* Sun Deck\n* Professionally Managed\n* Spa\n* Pet Salon\n* Easy Freeway Access\n* TV Lounge\n[#9305783]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '779ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T10:13:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-clean-and-spacious-1157\/7506652261.html","post_id":7506652261,"result_date":"2022-07-09 10:16","title":"Clean and spacious 1157 Sq Ft, 2 BR \/ 2 BA with gorgeous views","description":"The Glen at Lafayette Hill Visit our community today! 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nUnit Rates:  $2370 - $2960\/month Unit Type: 2-BR 2-BA Unit Size: 1157 sq ftLease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.What you’ll find in our community: ◾ 24 Hour Availability◾ Cardio Machines◾ Conference Room◾ Gated, Controlled Access◾ Multi-Use Room◾ Online Services◾ Package Service◾ Pet Play Area◾ Planned Social Activities◾ Recycling◾ BBQ Picnic Garden◾ Billiards, Club Lounge, Cafe Area, Library and Community Room◾ Fitness Center w\/ Free Weights, Weight Machines◾ Message Therapist Practice On-site◾ Outdoor Cafe & Coffee Bar◾ Outdoor Patio Lounge◾ Sprinkler System◾ Storage Space◾ Wi-Fi at ClubhouseDescription: Our residents enjoy luxurious amenities including an amazing outdoor cafe area, a clubhouse with flat screen TVs, and a full kitchen and fitness center. Open-concept floor plans accompanied by a variety of upscale features define the one-of-a-kind luxury lifestyle only found at our Lafayette Hill apartments.This unit comes with: ◾ Air Conditioning & Heating◾ Cable Ready◾ Carpet◾ Dining Room◾ Heating◾ Range, Oven, Disposal, Oven◾ Refrigerator, Freezer and Ice Maker◾ Tub\/Shower◾ Wi-Fi◾ Window Coverings◾ Crown Molding (Select Floor Plans)◾ High Speed Internet Access◾ Linen Closet◾ Microwave◾ Storage Units◾ Tile Floors◾ Trash Compactor◾ Walk-In Closets (Select Floor Plans)◾ Washer\/Dryer◾ Wheelchair Accessible (Rooms)Call or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.comProperty Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":17.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-09T10:12:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-high-speed-internet-bike\/7506649265.html","post_id":7506649265,"result_date":"2022-07-09 10:08","title":"High Speed Internet, Bike Storage, 24\/7 Front Desk Attendant","description":"Bedrooms: 0Bathrooms: 1Square Feet: 390Date Available: 2022-07-09Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:ElevatorOn-Site ManagementRefrigeratorElectronic ThermostatDishwasherFitness Center w\/ Peloton BikesFOB Controlled AccessRecyclingHigh Speed InternetPackage ReceivingLarge ClosetsMicrowaveCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/hvvmscfn\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '390ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T10:04:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-bedroom-apartments-luxury\/7506644348.html","post_id":7506644348,"result_date":"2022-07-09 09:55","title":"2 Bedroom Apartments - Luxury Living","description":"Apt. 2205 — Royal floor plan — 1,293 sq. ft. — $3,359\nThis 2nd floor royal boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture, a dining set and bar stools. The master suite comes with an enormous walk-in closet and double sinks with a luminous shower. The guest bedroom is room as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '3359ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-09T09:51:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/morrisville-price-drop-bed-bath\/7506641968.html","post_id":7506641968,"result_date":"2022-07-09 09:49","title":"Price Drop! 1 Bed 1 Bath Apartment The Edge at Yardley","description":"The Edge at Yardley is a great place to be if you are looking for apartments in Yardley, PA. We offer spacious one-, two-, and three-bedroom floor plans with bi-level living options. The Edge at Yardley features a rare combination of great location, open generous space, and fantastic amenities and features.\nTo schedule a tour of our amazing Yardley, PA apartments, call us at  show contact info\n!\nLeasing Office Hours:\nMon – Fri: 9:00 am – 5:30pm\nSaturday: 9:00 am – 5:00pm","num_images":1.0,"lat":40.2084,"lng":-74.8291,"attrs":"['1BR \/ 1Ba', 'available sep 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T09:45:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/morrisville-affordable-bed-bath\/7506636065.html","post_id":7506636065,"result_date":"2022-07-09 09:32","title":"Affordable 2 Bed 1 Bath Apartment The Edge at Yardley","description":"The Edge at Yardley is a great place to be if you are looking for apartments in Yardley, PA. We offer spacious one-, two-, and three-bedroom floor plans with bi-level living options. The Edge at Yardley features a rare combination of great location, open generous space, and fantastic amenities and features.\nTo schedule a tour of our amazing Yardley, PA apartments, call us at  show contact info\n!\nLeasing Office Hours:\nMon – Fri: 9:00 am – 5:30pm\nSaturday: 9:00 am – 5:00pm","num_images":1.0,"lat":40.2084,"lng":-74.8291,"attrs":"['2BR \/ 1Ba', 'available sep 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T09:28:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-updated-bedroom\/7506634364.html","post_id":7506634364,"result_date":"2022-07-09 09:26","title":"RECENTLY UPDATED, 2 BEDROOM AND 1 BATH APT LOCATED IN CARROLL PARK!!","description":"⭐⭐⭐ RECENTLY UPDATED, 2 BEDROOM AND 1 BATH APARTMENT LOCATED IN CARROLL PARK!!! ⭐⭐⭐\nProperty Address\n639 N 52nd Street - 2F | Philadelphia, PA 19131\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ LOCATED IN CARROLL PARK!\n✔️ RECENTLY RENOVATED!\n✔️ STUNNING 2 BEDROOM AND 1 BATH APARTMENT!\n✔️ NEW FLOORING THROUGHOUT\n✔️ BRAND NEW KITCHEN EQUIPPED W\/ STOVE, REFRIGERATOR, MICROWAVE\n✔️ COMPLETELY RENOVATED BATH WITH DESIGNER TILES\n✔️ NICE SIZED BEDROOMS\n✔️ NICE SIZED LIVINGROOM\n✔️ RECESSED LIGHTING THROUGHOUT\n✔️ CITY LIVING WITH A SUBURBAN FEEL\n✔️ MINUTES AWAY FROM CENTER CITY\n✔️ LOTS OF SHOPPING AROUND\n✔️ CLOSE TO MAJOR ROADS\n✔️ EASY ACCESS TO PUBLIC TRANSPORTATION\n✔️ WILL NOT LAST LONG, INQUIRE TODAY!!! ****\nGo to https:\/\/my.matterport.com\/show\/?m=aguHvWUSM2A for a virtual tour.\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant pays for electricity, gas, and water.\n*** Build your credit! We report rent payments to Experian! ***\n***Please apply online at https:\/\/redblock.com\/apartment\/\nDO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 700\nRental Terms\nRent: $1,250.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,500.00\n\n#nata\n","num_images":11.0,"lat":39.970279,"lng":-75.225565,"attrs":"['2BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T09:22:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated-bd-ba\/7506632592.html","post_id":7506632592,"result_date":"2022-07-09 09:20","title":"Completely Renovated 3 Bd \/ 2 Ba Home, Central Air, Private Rear Deck","description":"Completely Renovated 3 Bedroom 2 Bath Home, Central Air, Private Rear Deck, brand new rehab in Elmwood Park\/Kingsessing\nProperty Address\n6345 Kingsessing Ave | Philadelphia, PA 19142\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Stunning renovation in Elmwood Park\/Kingsessing! ⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 2 Bath\n✔️Updated Kitchen w\/ custom designer backsplash\n✔️Master Bedroom has a Private brand new full bath\n✔️Located just minutes to schools, parks, and University City\n✔️All New Appliances\n✔️Hardwood flooring throughout\n✔️Recessed Lighting\n✔️Spacious bedrooms\n✔️Open layout, plenty of closet space.\n✔️Large basement perfect for storage\n✔️Central Air\n✔️Private Rear Deck\n✔️Washer\/Dryer Hookup\n✔️Located just minutes to schools, parks, and University City\n✔️Easy commute to and from the city\n✔️This property won't last long, inquire now!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1330\nRental Terms\nRent: $1700\nApplication Fee: $35\nSecurity Deposit: $3400\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nVirtual Tour: https:\/\/my.matterport.com\/show\/?m=xG8QmjAkkCh\nStunning renovation in Elmwood Park\/Kingsessing! This immaculate home has been completely renovated from top to bottom! Located just minutes to schools, parks, and University City. Brand new renovation! Steps to UPENN, Drexel, USciences, Center City CHOP, and Hospital of the University of Pennsylvania. Home features 3 bedrooms, 2 baths! Central air! Private Rear Deck! Washer\/dryer hookup! Absolutely everything here is brand new! #nata\nFor security purposes, all of our properties are under live video and audio surveillance. All access and showings are recorded and monitored remotely\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,332\nRental Terms\nRent: $1,700.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,400.00\n\nPet Policy\nCats allowed\nDogs not allowed","num_images":24.0,"lat":39.928403,"lng":-75.236155,"attrs":"['3BR \/ 2Ba', '1332ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T09:16:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7506630866.html","post_id":7506630866,"result_date":"2022-07-09 09:15","title":"Lease Today, Playground, Luxurious Bathrooms","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nSchedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '833ft2', 'available jul 12', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T09:11:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7506630070.html","post_id":7506630070,"result_date":"2022-07-09 09:12","title":"Pets Welcome, Lease Today, Quiet Community","description":"The Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '789ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T09:08:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated\/7506628919.html","post_id":7506628919,"result_date":"2022-07-09 09:08","title":"Completely Renovated 3 bedrooms and 2.5 bath home in East Germantown","description":"Completely Renovated 3 bedrooms and 2.5 bath home in East Germantown\nProperty Address\n6128 Lensen Street | Philadelphia, PA 19144\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE HOUSE! ⭐⭐⭐⭐⭐\n✔️Completely Renovated 3 bedrooms and 2.5 bath home\n✔️Spacious living room\n✔️Large dining area\n✔️Updated eat-in kitchen\n✔️Open Concept 1st Floor\n✔️Large Master Suite with private Master Bath\n✔️Contemporary Designs\n✔️Plenty of Natural Light\n✔️Washer\/Dryer Hook Up\n✔️Brand New Central Air\n✔️Large backyard\n✔️Spacious front yard\n✔️Plenty of closet space\n✔️Unfinished basement for storage\n✔️Custom color paint\n✔️Easy access to and from the city\n✔️Easy access to public transportation\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2.5 BA\nSquare Feet: 1528\nRental Terms\nRent: $2000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n\nDetails\nBeds\/Baths: 3BD\/2.5BA\nSquare Feet: 1,528\nRental Terms\nRent: $1,900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,800.00\n\n#nata\n","num_images":19.0,"lat":40.047156,"lng":-75.172877,"attrs":"['3BR \/ 2.5Ba', '1528ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T09:04:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-modern-3br\/7506626332.html","post_id":7506626332,"result_date":"2022-07-09 08:59","title":"Newly Renovated MODERN 3BR in booming Brewerytown","description":"Newly Renovated MODERN 3BR in booming Brewerytown\nProperty Address\n2312 W Thompson Street | Philadelphia, PA 19121\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ NEW! BEST VALUE APARTMENT! ⭐⭐⭐\n✔️ NEW! SPACIOUS 3 BEDROOMS AND 2 BATHS HOME IN BREWERYTOWN\n✔️ NEW! GRANITE COUNTERTOP KITCHEN\n✔️ NEW! CUSTOM BACKSPLASH AND FLOOR TILES\n✔️ NEW! MODERN PARQUET FLOORING\n✔️ NEW! DESIGNER PAINTER COLORS\n✔️ NEW! CUSTOM TILED BATHROOM W\/ ALL-NEW VANITIES\n✔️ NEW! CENTRAL AIR\n✔️ WASHER\/DRYER HOOKUP\n✔️ BACKYARD\n✔️ FINISHED BASEMENT\n✔️ ALL ELECTRIC\n✔️ CLOSE TO PUBLIC TRANSPORTATION!\n✔️ EASY ACCESS TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO AND FROM THE CITY!\n✔️ APPLY TODAY!!!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- Tenant pays all own utilities\n*** Build your credit! We report rent payments to Experian! ***\n*** Please apply online at https:\/\/redblock.com ***\nVIRTUAL TOUR:  https:\/\/my.matterport.com\/show\/?m=SFUoEj4haDk\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,200\nRental Terms\nRent: $1,700.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,400.00\n\n#nata\n","num_images":21.0,"lat":39.97512,"lng":-75.173886,"attrs":"['3BR \/ 2Ba', '1200ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T08:55:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7506624960.html","post_id":7506624960,"result_date":"2022-07-09 08:53","title":"SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN OGONTZ!","description":"SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN OGONTZ!\nProperty Address\n1526 W Grange Ave | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED, 1 BEDROOM & 1 BATH APARTMENT LOCATED IN OGONTZ!\n✔️ OPEN LAYOUT\n✔️ SPACIOUS KITCHEN\n✔️ SPACIOUS BEDROOM\n✔️ LAMINATE FLOORING\n✔️ LARGE CLOSETS\n✔️ LOTS OF NATURAL LIGHT\n✔️ ALL-ELECTRIC\n✔️ CUSTOM BATHROOM TILES\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nVirtual tour\nhttps:\/\/my.matterport.com\/show\/?m=pyB5PLfGNLG\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- The tenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\n***Please apply online at https:\/\/redblock.com\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\ntags: redblock realty, red block, septa, 1BD, 1 bedroom, La salle University, Ogontz, Mount airy, Logan, Germantown, Olney, brand new, route 309, spacious, cozy, nice, buses, schools, Philadelphia, broad st, Kembel park, Albert Einstein Medical Center, Pennsylvania College of Optometry, SEPTA, commuter, Fern rock, Gratz College, 19144, 19141, 19138, 19126, 19120, #nata\n\nAmenities\n1BR\n1BA\n1 bedroom\n1 bath\nStove\nrefrigerator\nmicrowave\nCable ready\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 700\nRental Terms\nRent: $950.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,900.00\n","num_images":7.0,"lat":40.041456,"lng":-75.146421,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T08:49:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-next-fall-will-be-here\/7506614032.html","post_id":7506614032,"result_date":"2022-07-09 08:10","title":"Next Fall will be here before you know it, have you found housing!!!!","description":"Next Fall will be here before you know it, have you found housing!!!!\nApartment Amenities:\n-Spacious Rooms and Private Bathrooms\n-Large Private Brick Patio\n-Full-size Washer and Dryer\n-Dishwasher, Microwave and Refrigerator with Ice Maker\n-Built-In Desk, with built in shelving above\n-2 Drawer Dresser Provided\n-Full-size bedframe\n-$60 ALL Inclusive Utilities Package\nCALL NOW: show contact info","num_images":5.0,"lat":40.0402,"lng":-75.2231,"attrs":"['2BR \/ 2Ba', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-07-09T08:00:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-comfortable-convenient\/7506613008.html","post_id":7506613008,"result_date":"2022-07-09 07:58","title":"Comfortable, Convenient 1 Bedroom Apt for rent in center of Mt. Airy","description":"Quiet, comfortable, 2nd floor one bedroom apartment available in the Center of tree-lined, desirable location of Mt Airy.  Convenient to East and West Chestnut Hill Septa train lines and multiple bus routes, 3 minutes from Chestnut Hill, 15 minutes to Center City.  Around the corner are shops, restaurants, bars and cafes, banking, fitness centers, convenience stores, florists, Acme supermarket, Earth and Bread Brew Pub, McMenamin's, Trattoria Moma and Jansen.  Two minutes from multiple points of access to Wissahickon Woods, and a few short blocks to Weavers Way Coop.  Apartment has hard wood floors, tiled bathroom, combined kitchen\/living area with plenty of cabinets.  Rear of building location makes for less street noise.  Free laundry facilities in the building.  Rent is $850 per month plus utilities.  First, last, and one month's security required for move-in.  Available early August.  Call or text Melissa to schedule showings:   show contact info\n.  Call or text Larry for questions about lease, etc.:   show contact info\n.  More photos to come.  In the meantime, text Larry for pdfs of apartment photos.","num_images":8.0,"lat":40.058688,"lng":-75.188906,"attrs":"['1BR \/ 1Ba', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T07:54:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-the-lodge-at-heritage-lakes\/7506596966.html","post_id":7506596966,"result_date":"2022-07-09 05:38","title":"The Lodge at Heritage Lakes - Magnificent amenities. Great location.","description":"As you enter you will find a spacious living and dining area with beautiful hardwood floors. The eat in kitchen has ample","num_images":0.0,"lat":40.1245,"lng":-75.3304,"attrs":"['3BR \/ 2Ba', '1000ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T04:55:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spectacular-custom\/7506593143.html","post_id":7506593143,"result_date":"2022-07-09 03:55","title":"A SPECTACULAR CUSTOM RENOVATION IN THE HEART OF WASHINGTON SQUARE WES","description":"A spectacular custom renovation in the heart of Washington Square West. This classic brownstone condominium has been thoughtfully outfitted throughout by an expert interior designer and handsomely combines materials and textures to produce a look out of the pages of a magazine. Enter Unit 1 through its own private courtyard, paved in slate, and with a surround of custom planters. New contemporary kitchen with sleek cabinetry and quartz counters, and gourmet Bertazzoni appliances. Spacious square footage offers myriad options for furnishing the large living and dining spaces, which are trimmed with a fireplace, and large windows with tailored molding and window treatments. Roomy bedroom, and luxurious bathroom with drop-in tub, tile tub surround, tile floor, and floating vanity. Ample closet space throughout, all with custom fit-outs. Portico Place Condominiums offer an unparalleled living experience in Philadelphia, with stately marble steps and columns and situated on a five-star tree-lined block near Washington Square Park, Pennsylvania and Jefferson Hospitals, Broad Street, and every exciting dining and shopping experience that Center City has to offer, not to mention lovely shared garden space and room for a grill in addition to the exclusive-use front Patio.","num_images":16.0,"lat":39.945944,"lng":-75.156499,"attrs":"['1BR \/ 1Ba', '976ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T03:44:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/dublin-room-for-rent-in-brand-new-town\/7506567247.html","post_id":7506567247,"result_date":"2022-07-09 00:00","title":"Room for Rent in Brand NEW Town house w\/ amazing sunset","description":"Hello! I am looking for a 20 something to share my beautiful brand new 3 bedroom townhouse located in Dublin Crossing. An end unit, outdoor deck with an amazing sunset, garage spot, laundry in unit, whole house will be furnished besides for bedrooms, and so much more. Utilities not included in this price. You will not only have access to a room, but the whole house. I am looking for someone respectful, clean, and responsible. I work a 9-5 job and travel frequently so a lot of the time you will have the entire house to yourself.","num_images":4.0,"lat":40.372809,"lng":-75.200558,"attrs":"['3BR \/ 4Ba', '2088ft2', 'available now', 'air conditioning', 'townhouse', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-08T23:41:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-bedroom-townhome-garden\/7506807618.html","post_id":7506807618,"result_date":"2022-07-09 15:54","title":"2 Bedroom Townhome + Garden","description":"New Ardmore townhouse with private garden. This 2-bedroom, 1.5 bathroom corner unit townhome offers comfort, space and privacy. Inside you will find a newly designed Ikea kitchen with stainless appliances, brand new cabinets, an abundance of counter space, in-unit laundry, renovated bathrooms, beautiful wood flooring, and lots of natural light. Master bedroom features incredible walk in closet. Personal HVAC system with your very own thermostat.\nPrivate, assigned parking is available just outside of your door. Property is smoke free and pet friendly! Located within the Lower Merion School District, in one of the most convenient neighborhoods along the Main Line. You have transportation, shopping, and dining just steps away! Only a short walk from the AMTRAK\/SEPTA station, Ardmore Farmers Market, Trader Joe's and downtown Ardmore. Minutes from Wynnewood, Narberth, Haverford College, Bryn Mawr College and Villanova.\nSecurity deposit is equal to one month's rent and application fee ($65 per adult applicant) is required to begin application process. Tenant is responsible for all utilities and will establish an account with PECO, tenant will also be billed by landlord for pro-rata share of common utilities. Property is smoke free and pet friendly!\n","num_images":14.0,"lat":40.00877,"lng":-75.28323,"attrs":"['2BR \/ 1.5Ba', '1150ft2', 'available nov 1', '\\nsaturday 2022-08-20\\n', '\\nsunday 2022-08-21\\n', '\\ntuesday 2022-08-23\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:38:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bedroom\/7506812561.html","post_id":7506812561,"result_date":"2022-07-09 15:54","title":"Newly Renovated 3-Bedroom Townhouse with Finished Basement & Home Gym","description":"This 3-Bedroom\/3-Bathroom Townhouse has been completely renovated and looks absolutely stunning! Located in the Cobbs Creek neighborhood of West Philadelphia, this home offers easy access to Chestnut Street, Walnut Street, Baltimore Ave, and the Market-Frankford line which make commuting to UPenn, Drexel, and Center City a breeze.\nEntrance into the home leads you into a foyer which can be used as a seating area, mud room, or even a home office. It leads into the living room, complete with wide-plank hardwood flooring that flows continuously into the dining area and kitchen.  The kitchen is modern with gray shaker-style cabinets with brushed nickel hardware, white quartz countertops, stainless steel refrigerator, a four-burner gas range, a microwave, and dishwasher, and a custom tile backsplash that brings the entire design together! The bedrooms include ample closet space and large windows which allow plenty of natural light to pour in. The master bedroom is very spacious and can fit a king-sized bed and a complete bedroom set with ease! There is also a private master bathroom which includes stone tile flooring, modern vanity with decorative light fixture, a shower stall with tile base, and an incredible tile surround that extends from floor to ceiling!\nWork out before work or class from the comfort of your home! The basement is completely finished with a full bathroom, a home gym, and an additional bonus room that can be used as an additional living room or playroom. The home gym comes equipped with full-length mirrors, padded floors, a boxing bag, a treadmill, a Bowflex, and an elliptical.  There is also a balcony off of the kitchen and a patio off of the basement which are the perfect spots for outdoor relaxation and grilling!\nTenant is responsible for electric, gas, water, and cable\/internet in addition to rent each month.\nApplication Qualifications: Minimum monthly income 3 times the tenant’s portion of the monthly rent, acceptable rental history, acceptable credit history, and acceptable criminal history. More specific information provided with the application.","num_images":21.0,"lat":39.955586,"lng":-75.247211,"attrs":"['3BR \/ 3Ba', '2457ft2', 'available now', 'air conditioning', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:50:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-facing-south\/7506806278.html","post_id":7506806278,"result_date":"2022-07-09 15:51","title":"one bedroom facing south overlooking a lovely courtyard","description":"Come visit this larger than norm one bedroom facing south overlooking a lovely courtyard, sundeck and association swimming pool. Brazilian cherry hardwood floors in the living room which accommodates a separate dining area. Galley kitchen with granite counter tops , white cabinetry, tile floors and stainless appliances, combination washer-dryer . Private main bedroom features fully wall of custom organized closed and an additional walk in closet. Floor plan has a great flow for entertaining. Building has 24 hour deskperson, clubroom, board room, lounge room , seasonal swimming pool and gym at no additional charge. Electric, internet is extra . Basic cable is included. Building has $250.00 move in fee. Floor plan is attached\n219-29 s 18th st #1620,\n","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '649ft2', 'available aug 5', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T15:35:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautiful-bedroom-25\/7506804922.html","post_id":7506804922,"result_date":"2022-07-09 15:46","title":"This beautiful 2 bedroom, 2.5 bathroom home","description":"Rittenhouse square location and private gated parking! This beautiful 2 bedroom, 2.5 bathroom home is defined by style, elegance and charm. Located in a classic brownstone on pine st., the building was meticulously renovated in 2015 to ensure all of its former character was maintained, while making room for four (4) fully renovated contemporary units. Unit a, which comes with its own private parking, is the largest of the four units and is perfectly situated at the front of this historic building featuring beautiful large windows that infuse the first floor and large master bedroom with light year-round and offer an an idyllic, classic philadelphia view of the lovely tree-lined block. Plus, it is in a hard-to-beat location just a few minutes away from the theatre district & rittenhouse square, yet still on a quiet and peaceful residential street, across the street from the best place in the city to get a cappuccino! 1508 pine st. Boasts ample living & dining spaces for all of your family & friends to enjoy. Enter through the main level, which has a spacious living area and dining room, a beautiful brick fireplace and a lovely powder room. Upstairs there are two generous bedrooms, each on their own level for optimal privacy and both equipped with their own private, luxurious tiled bathrooms with luxurious tile tub surrounds, tile floor and custom vanity. Down on the lower level, you will find a large family room and designer kitchen with travertine floors throughout. The kitchen features sleek, modern cabinetry, quartz countertops, and new premium appliances including a viking microwave, viking gas range, whirlpool refrigerator, and bosch dishwasher. High ceilings and plenty of windows flood this home with light and give it a bright, open and airy atmosphere, while classic architectural features like the brick fireplace, natural wood accents, and beautiful intricate moldings give it a warm and inviting feel. Not to mention the private gated parking located in the back of the property, laundry in-unit (+ brand new samsung washer & dryer) and an additional storage locker in the basement make this home as convenient as it is luxurious. Don't miss out on this incredible space close to rittenhouse square park, broad street, jefferson, upenn, and the cityã¢â€â™s finest restaurants, boutiques, and more! Recent updates by the current owners include new paint throughout the home, refinished hardwood floors throughout, resurfaced fireplace, new bathroom cabinetry, new washer & dryer, new quartz countertops and brand new state of the art kitchen appliances!\n1508 pine st #a\n","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2.5Ba', '1773ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:32:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-full-size-washer-and-dryer\/7506801012.html","post_id":7506801012,"result_date":"2022-07-09 15:27","title":"Full Size Washer and Dryer in All Units, Dishwasher, Dog Park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Gas FireplacesExecutive Business CenterOnline Payments AvailableOversized ClosetsSerene Wooded ViewWireless & High Speed Internet AccessCar Wash AreaCable ReadyExtra StorageExclusive & Newly Renovated ClubhouseDog ParkNewly Renovated InteriorsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/g63fvpss\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 1Ba', '926ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: weekly']","posted_date":"2022-07-09T15:23:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-beautiful-house-for-your\/7506787228.html","post_id":7506787228,"result_date":"2022-07-09 15:24","title":"Beautiful house for your single family","description":"This is a 3 bedroom, 2 full bathroom single level home in West Bradford Township. Private setting just outside of Marshalton and only 3.5 miles from West Chester Borough. Property features include large spacious eat-in kitchen, wall to wall carpet, and primary suite with its own bathroom and walk-in closet. This house will not last long Apply now","num_images":17.0,"lat":39.953532,"lng":-75.679321,"attrs":"['3BR \/ 2Ba', '600ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:54:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-available\/7506797531.html","post_id":7506797531,"result_date":"2022-07-09 15:20","title":"3 bedroom available","description":"Newly renovated 3 bedroom home for rent close to public transportation and shops\nRequirements\n•Income must be 3 times the rent\n• No evictions in the last 5 yrs\n• No felonies within the last 10 years\n• Credit score must be at least 580\n• First, last and security due at lease signing\nProcess\nIf interested you’ll submit a rental application the application fee is $55 for each adult over the age of 18 once your application is submitted you’ll receive a response within 2-3 business days if your approved we’ll schedule a day and time for you to conduct a walk through of the property if your interested in moving forward we’ll start the lease signing process\n","num_images":20.0,"lat":40.034891,"lng":-75.168844,"attrs":"['3BR \/ 1Ba', 'available jul 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:16:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7506796302.html","post_id":7506796302,"result_date":"2022-07-09 15:17","title":"2 Bedroom Apartment Available Now!","description":"Greetings to all! We have a 2 Bedroom\/1-1\/2 bathroom available at 4327 Roosevelt Blvd (across from Roosevelt Shopping Center). This wonderful apartment is conveniently located near SEPTA bus stops (for public transportation) and many shopping amenities! The move-in amount is $950 + $950 last month+ $950 Security Deposit ($2850). There is a $55 application fee (to include background check); credit score of 625+ is acceptable. To schedule a viewing of this wonderful apartment, please contact \"Gene\" @  show contact info\n! Hurry to obtain the keys to this apartment! It will be gone before you know it!!","num_images":8.0,"lat":40.028251,"lng":-75.105479,"attrs":"['2BR \/ 1.5Ba', '1002ft2', '\\nsunday 2022-07-10\\n', '\\nmonday 2022-07-11\\n', 'application fee details: $55 application fee', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:13:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-state-of-the-art-gym\/7506796213.html","post_id":7506796213,"result_date":"2022-07-09 15:17","title":"State of the Art Gym, Walking Trail, Dog Park, Outdoor Cinema, Grills","description":"Bedrooms: 1Bathrooms: 1Square Feet: 648Date Available: 2022-08-02Address: 1000 South Broad Street\nExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/jfka3yrf\/lincoln-square\n","num_images":1.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '648ft2', 'available aug 2', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-07-09T15:13:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lincoln-square-we-thought\/7506795416.html","post_id":7506795416,"result_date":"2022-07-09 15:15","title":"Lincoln Square-We Thought Of Everything!","description":"Bedrooms: 0Bathrooms: 1Square Feet: 380Date Available: 2022-07-09Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.Call:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/7oivamg7\/lincoln-square\n","num_images":1.0,"lat":39.9379,"lng":-75.1794,"attrs":"['0BR \/ 1Ba', '380ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-07-09T15:11:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-incredible-amenities\/7506794560.html","post_id":7506794560,"result_date":"2022-07-09 15:13","title":"Incredible Amenities, Stylish Features, Lease Today","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nLease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T15:09:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/clifton-heights-1st-flr-unit-central-c\/7506787934.html","post_id":7506787934,"result_date":"2022-07-09 15:13","title":"1st Flr. Unit! Central A\/C, Off-street Parking, Washer\/Dryer Hook-ups","description":"1st Flr. Unit! Central A\/C, Off-street Parking, Washer\/Dryer Hook-ups in shared basement!\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\nTO SEE MORE PROPERTIES GO TO: www.eliterps.com\/inventory\nOffered by: ELITE Rental Properties Inc.  show contact info\nx 1\n1st Flr. Unit! Central A\/C, Off-street Parking, Washer\/Dryer Hook-ups in shared basement!\n*PROPERTY INFORMATION*\n-PROPERTY STATUS: For Rent Only\n-ADDRESS: 111 West Maryland Ave. 1st Flr. Aldan, PA 19018\n-RENTAL SPECIALS: If credit score for all applicants is greater than 700 or above, total move-in costs are reduced*.\n-MONTHLY RENT: $1,200\n-MOVE-COSTS: Typically, three (3) times the monthly rent depending on credit\n-MINIMUM LEASE TERM: Through May 31st, 2024\n-UNIT TYPE: Duplex 2+1\n-HEATING: Gas-Radiant\n-AIR CONDITIONING: Central\n-LAUNDRY: Washer and Dryer Hookups in basement\n-PARKING: One (1) off-street, Street Parking\n-UTILITIES INCLUDED: Landscaping and Snow removal of front walkways only\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\nTO SEE MORE PROPERTIES GO TO: www.eliterps.com\/inventory\n*LANDLORD RENTAL REQUIREMENTS*\n-MONTHLY NET INCOME: Three (3) times the monthly rent in documented monthly net income\n-MIN. CREDIT SCORE: 650\n-MAX. IN COLLECTIONS: $0\n-PET OCCUPANTS: Not Allowed\n-SMOKING: Not Allowed\n-SECTION 8: Not Allowed\n*NEARBY NEIGHBORHOODS*\nCollingdale Darby 19023 Clifton Heights 19018 Sharon Hill 19079 Glenolden 19036\n*TO SCHEDULE A SHOWING*\n- Go to elitetenant.com\n- To see all of our available properties go to www.eliterps.com\/inventory.html\n*CONSUMER NOTICE*\nAs per Pennsylvania Real Estate Commission requirements, ELITE Rental Properties Inc. is hereby informing you that we represent the Landlord as its agent. ELITE Rental Properties Inc. does not represent any other person other than the Landlord.\n*DISCLAIMER*\nAny and all information provided is deemed accurate but not guaranteed. It is up to the individual to conduct their own due diligence to ensure the information provided is accurate\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\nTO SEE MORE PROPERTIES GO TO: www.eliterps.com\/inventory\nRental Terms\nRent: $1,200\nApplication Fee: $100\nSecurity Deposit: $1,200\nAvailable Now\nPet Policy\nCats not allowed\nDogs not allowed\n","num_images":4.0,"lat":39.9218,"lng":-75.2876,"attrs":"['2BR \/ 1Ba', '800ft2', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:56:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-closets-24-front\/7506793607.html","post_id":7506793607,"result_date":"2022-07-09 15:11","title":"Large Closets, 24\/7 Front Desk Attendant, Rooftop Deck","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1122Date Available: 2022-07-09Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Fitness Center w\/ Peloton Bikes24\/7 Front Desk AttendantLarge ClosetsWasher\/DryerHardwood FloorsElevatorOn-Site ManagementRefrigeratorHigh Speed InternetRecyclingParking Garage (Additional Fees)Smart Home FeaturesCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/me4xgl5d\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['2BR \/ 2Ba', '1122ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:07:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-bi-level-apartment\/7506785225.html","post_id":7506785225,"result_date":"2022-07-09 15:11","title":"luxury bi-level apartment","description":"Welcome to lawrence st! Be the first to live in this brand new, luxury bi-level apartment on a quiet block in northern liberties! This spacious 2 bed, 1.5 bath offers plenty of living space and has a perfect garden space for outdoor entertaining. Enter the unit from your private access alley into the main living space which features a large kitchen with eat-in bar, convenient half bath, 10+ foot ceilings, and large floor-to-ceiling windows that let in tons of natural light. The kitchen has tons of storage, high-end quartz countertops and modern subway tile backsplash with plenty of counter space for all your cooking and entertaining. The living room is a great size and looks out into the private garden space, offering an indoor-outdoor flow also excellent for entertaining. The garden is not pictured due to the ongoing work, but is large enough to fit your bbq and seating easily, plus room for all your flowers and plants! Head downstairs to find two generously sized bedrooms with large closets, a large full bath with great storage, and a full sized washer\/dryer. A polished concrete floor, stylish\/classic tile choices, and custom pella windows complete the modern vibe. No details were overlooked in this building! It has in-unit washer\/dryer, full kitchen appliance package including dishwasher and garbage disposal, hvac, solid hardwood floors, high ceilings over 10ft, gigantic windows to let in tons of natural light, as well as thoughtful layouts to minimize sound between units. Building is outfitted with fire alarm system, sprinklers, intercom and camera system to ensure safety and security. Conveniently located near i-95. Walking distance to great bars and restaurants including: yards brewing, cafe la maude, north third, and even target!\n555 n lawrence st #1r,\n","num_images":4.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1.5Ba', '1000ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:50:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/clifton-heights-2nd-flr-walk-up-unit\/7506786081.html","post_id":7506786081,"result_date":"2022-07-09 15:07","title":"2nd flr. walk-up Unit! Granite, Stainless, Central A\/C, Washer\/Dryer H","description":"2nd flr. walk-up Unit! Granite, Stainless, Central A\/C, Washer\/Dryer Hook-ups in shared basement!\nTO SCHEDULE A SHOWING GO TO: elitetenant.com\nELITE Rental Properties Inc.  show contact info\next. 1\n2nd flr. walk-up Unit! Granite, Stainless, Central A\/C, Washer\/Dryer Hook-ups in shared basement!\n*PROPERTY INFORMATION*\n- PROPERTY STATUS: For Rent Only\n- ADDRESS: 111 West Maryland Ave. 2nd Flr. Aldan, PA 19018\n-RENTAL SPECIALS: If credit score for all applicants is greater than 700 or above, total move-in costs are reduced*.\n- MONTHLY RENT: $1,200\n- MOVE-COSTS: Typically, three (3) times the monthly rent depending on credit\n- MOVE-IN DATES: 1st or 15th of the month\n- MINIMUM LEASE TERM: Through May 31st 2024\n- UNIT TYPE: Duplex 2+1\n- HEATING: Gas-Radiant\n- AIR CONDITIONING: Central\n- LAUNDRY: Washer and Dryer Hookups in basement\n- PARKING: One (1) Off-Street, Street Parking\n- UTILITIES INCLUDED: Landscaping and Snow removal of front walkways\n- PARKING: Unlimited street parking and one (1) off street parking\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\n*LANDLORD RENTAL REQUIREMENTS*\n- MONTHLY NET INCOME: Three (3) times the monthly rent in documented monthly net income\n- MIN. CREDIT SCORE: 650\n- MAX. IN COLLECTIONS: $0\n- PET OCCUPANTS: Not Allowed\n- SMOKING: Not Allowed\n- SECTION 8: Not Allowed\n*NEARBY NEIGHBORHOODS*\nCollingdale Darby 19023 Clifton Heights 19018 Sharon Hill 19079 Glenolden 19036\n*TO SCHEDULE A SHOWING*\n- Go to elitetenant.com\n- Or call ELITE Rental Properties Inc. at  show contact info\nx1\n- To see all of our available properties go to www.eliterps.com\/inventory.html\n*CONSUMER NOTICE*\nAs per Pennsylvania Real Estate Commission requirements, ELITE Rental Properties Inc. is hereby informing you that we represent the Landlord as its agent. ELITE Rental Properties Inc. does not represent any other person other than the Landlord.\n*DISCLAIMER*\nAny and all information provided is deemed accurate but not guaranteed. It is up to the individual to conduct their own due diligence to insure the information provided is accurate\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\nRental Terms\nRent: $1,200\nApplication Fee: $100\nSecurity Deposit: $1,200\nAvailable Now\nPet Policy\nCats not allowed\nDogs not allowed\n","num_images":4.0,"lat":39.9218,"lng":-75.2876,"attrs":"['2BR \/ 1Ba', '800ft2', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:52:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-bi-level-pvt\/7506791198.html","post_id":7506791198,"result_date":"2022-07-09 15:06","title":"Charming Bi-Level Pvt Entrance + patio","description":"Spacious, unique renovated Bi-level with private street entrance in the heart of Queen Village. Walk toward the back into an enchanting patio, a perfect space for outdoor dining and barbecue. You can take your bike directly out the gate without dragging it through the house. The apartment has a brand new hardwood floor in the bedroom. The entire apartment was just repainted. See and you will believe, The kitchen is fully equipped with a new refrigerator, dishwasher and garbage disposal. The dining area leads to a stairwell that will take you down to the living area, a dramatic space with its two-storied ceiling. Off of this room you will have your own sizable storage space with access to a full-size washer and dryer for your personal use. The bus stop is on the same corner just across the street. The apartment is unique on the nicest tree-lined street in Queen Village, only a few houses away from Mario Lanza Park with its dog run.","num_images":0.0,"lat":39.93714,"lng":-75.147791,"attrs":"['1BR \/ 1Ba', '900ft2', 'available aug 15', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T15:02:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bridge-on-race-is\/7506778537.html","post_id":7506778537,"result_date":"2022-07-09 15:02","title":"Bridge on race is philadelphia's only amenity-packed","description":"Bridge on race is philadelphia's only amenity-packed, leed gold boutique high-rise and offers thoughtfully-appointed apartments in a rental building designed for modern living in old city. The architecture bridges the charm of old city with modern design and amenities, tying classic aesthetics with considered, contemporary architecture. Bridge offers its residents a unique lifestyle with a plethora of services and amenities, such as an expansive 8,000 sf outdoor garden terraces with private grilling areas, a rooftop deck with the best views in philadelphia, state of the art fitness center, resident lounge, and much more. ** photos are of model units ** pricing and availability subject to change on daily basis ** parking may be available for additional fee **\n205 race st #1b-1004h,\n","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '614ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T14:36:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sun-dappled-bed-full-bath\/7506788378.html","post_id":7506788378,"result_date":"2022-07-09 15:00","title":"sun dappled, 2 bed, 2 full bath corner unit","description":"Welcome to this gorgeous, ultra modern, sun dappled, 2 bed, 2 full bath corner unit, offering beautiful city views at penn treaty residences at 1405 frankford avenue. This amazing condominium is located at the very heart of prime fishtown, philadelphia's most dynamic, vibrant and sought-after neighborhood! Situated directly behind fishtown's historic, and newly remodeled, rose garden, enter this barely 3 year old, secure, 30 unit building and enjoy your urban oasis to the fullest. Entering #409 you will find rich mocha colored flooring throughout, a convenient coat closet, then your first, oversized, full bathroom. Each spacious bedroom offers great light and the primary boasts and en suite full bathroom as well. Your ultra-modern designed bathrooms both feautre italian tile flooring and beautiful tiling andporcelain vanities. Down the hallway find an ideally located laundry closet on the way to your open concept kitchen\/living room offering wonderful views. Note the double thick quartz countertops , high end ge stainless steel appliances including a double wall oven, cooktop stove and french door refrigerator, complete with an electric fireplace. Need parking? No worries add a deeded garage parking space for an additional $250 a month!This beautifully maintained building's amenities include a spacious common roof deck with spectacular 360 views including center city and the ben franklin bridge, storage bins for each unit, bike room in the basement, secure key fob entry and of course an elevator. Mere steps from la columbe, suraya, wm mulherin's & sons, kensington quarters, ramona susan's bake shop, heffe tacos, city fitness gym and a myriad of other bars, restaurants, bakeries, souperies, specialty shops, nail salons, boutique clothiers and so much more. This is why forbes magazine called fishtown america's hottest \"new\" neighborhood in 2018 and it's only gotten better since. A 5 minute walk to the el or multiple bus lines, easy access to i-76 & i-95, walk & bike scores of 94 (\"paradise\") so what are you waiting for? Make it yours today!\n1405-21 frankford ave #409,\n","num_images":4.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 2Ba', '846ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T14:56:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-in-south\/7506787398.html","post_id":7506787398,"result_date":"2022-07-09 14:58","title":"1 Bedroom Apartment in South Philly","description":"Greetings to all! We currently have a 1 Bedroom\/ 1 bathroom Apartment that will be available by the 1st of August! It is conveniently located right outside of Center City! The move-in fee is $950 for 1st month+ $950 last month +$950 Security deposit ($2850); there is a $55 fee for background check, and credit score of 625+. All interested potential tenants can contact \"Gene\" @  show contact info\nto schedule a viewing for this wonderful apartment! Oh, and by the way, this apartment comes fully equipped with a Jacuzzi!","num_images":5.0,"lat":39.924314,"lng":-75.156273,"attrs":"['1BR \/ 1.5Ba', '802ft2', 'available aug 1', '\\nfriday 2022-07-29\\n', '\\nsaturday 2022-07-30\\n', '\\nsunday 2022-07-31\\n', 'application fee details: $55 application fee', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:54:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-unit-of-626\/7506787162.html","post_id":7506787162,"result_date":"2022-07-09 14:58","title":"Welcome to unit 3 of 626 s","description":"Welcome to unit 3 of 626 s. 12th street in queen village. This large two bedroom, 1 bathroom gem is located in a prime location, between washington square and bella vista. You’ll be blocks from washington square, seger dog park, and palumbo park. Plus you’re walking distance from acme, sprouts, whole foods, and great restaurants\/bars. The apartment features a spacious living room with lots of natural sunlight and a kitchen with stainless steel appliances. Best of all, there is a large shared roof deck, lounge, and bar where you’ll be able to enjoy wonderful views. Laundromat no longer! There is a washer\/dryer in-unit. Tenant pays utilities (.Water, electric, heat, internet\/cable) subject to credit and income requirements, small dogs ok with landlord approval and additional fee.\n626 s 12th st #3,\n","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '1170ft2', 'available jul 31', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:54:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-south-facing-light-filled\/7506783967.html","post_id":7506783967,"result_date":"2022-07-09 14:51","title":"South facing light filled home","description":"2000 sq ft 2bed 2bath huge bathrooms. Lots of storage. South facing light filled home. Available aug 1.\n314-22 n 12th st #505,\n","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '2000ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:47:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-unit-in-graduate\/7506782110.html","post_id":7506782110,"result_date":"2022-07-09 14:47","title":"3 bed, 3 bath unit in graduate hospital","description":"Gorgeous bi-level 3 bed, 3 bath unit in graduate hospital with tons of natural sunlight and a stunning kitchen complete with quartz countertops and stainless steel appliances. Huge living room with open floor plan and a large rear yard with enough room for entertaining. The first floor is complete with your 1st bedroom including full hallway bathroom. On the lower level you will find your generously sized 2nd and 3rd bedrooms one with an ensuite bathroom and the other is a hallway bathroom. Just a few blocks from rittenhouse square, one block off south street, and walking distance to entertainment, shopping and transportation. Don't miss this one!\n762 s 15th st #a,\n","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 3Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T14:43:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-on-the-penthouse\/7506773001.html","post_id":7506773001,"result_date":"2022-07-09 14:47","title":"Located on the penthouse level,","description":"Located on the penthouse level, this two-level condo has spectacular views both north and west. The heart of center city philadelphia is at your feet. As you walk into your well-appointed foyer, you are greeted by the kindest front door staff in center city. Your new home is located in the northwest corner of the highest floor. With 10 foot ceilings, brazilian cherry floors, dark granite in the kitchen and brookhaven cherry cabinets - the setting is simply beautiful. The open floor plan first floor is expansive and elegant. Go up the carpeted stairs to your spacious bedroom complete with its private bathroom. The view never ends in this exceptional condominium. Modern appliances, marble baths and spa showers. The ellington is the winner of five william penn awards of excellence from the building association of america. Additionally, there is a fitness center and residence lounge available 24\/7. 24 hour notice for all showings. Very convenient to shopping, restaurants, museums and entertainment in walking distance. Right next to mass transit and regional rails, including the airport line; a short transit ride to 30th street station for trains to new york, washington and beyond. This is complete with fine, comfortable furnishings and elegant light fixtures. The box spring is furnished; please bring your own mattress. Ready to move in and make this your home. No pets allowed. Note - there is a $300 move-in fee payable by the tenant to the building management. Exclusions - coffee maker, mattress (box spring is provided)\n1500 chestnut st #20j,\n","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1.5Ba', '1217ft2', 'available jul 15', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:25:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautiful-condo-for\/7506771774.html","post_id":7506771774,"result_date":"2022-07-09 14:46","title":"This beautiful condo for lease","description":"Live in a landmark at the beautiful boutique \"1737 chestnut\" located in historic rittenhouse square. This beautiful condo for lease is in the middle of fine dining, lively sidewalk cafes, one-of-a-kind shopping, and nightlife. The unit is +\/- 900 square feet, 2 spacious bedrooms and a wonderfully updated bathroom with floor to ceiling marble tile. Featuring an open floor plan with natural light throughout, multiple windows overlooking the hustle and bustle of chestnut street. The engineered floors, marble bathrooms and impeccable finishes are incredible. The sleek open kitchen has stainless steel appliances, granite countertops, and a breakfast bar. The large bedrooms have plenty of closet space and offers a separate utility room for additional storage. Live the boutique building lifestyle that includes a 24-hour virtual desk and security. The campuses of the university of pennsylvania and drexel university, major hospitals, 30th street station, and highways are all minutes away. Schedule your tour today.\n1737-39 chestnut st #401\n","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T14:22:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-three-bedroom-two-bath-home\/7506780314.html","post_id":7506780314,"result_date":"2022-07-09 14:44","title":"three bedroom two bath home","description":"Welcome home to this charming three bedroom two bath home with stunning roof deck and finish basement. Foyer entrance leads you to a quaint living room with marble fireplace, the space is open to the dining room and beautiful gourmet kitchen. Rear patio offers additional outdoor dining space and grilling. Wonderful storage space\/office is located in the lower level basement along with the laundry area. Schedule a visit to see the beautiful skyline views from the private rooftop deck.\n792 n croskey st\n","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2Ba', '1572ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:40:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-near-groceries\/7506776465.html","post_id":7506776465,"result_date":"2022-07-09 14:36","title":". Located near groceries, shopping","description":"307 is a bi-level unit with high ceilings and great natural light. Located near groceries, shopping, dining and public transit this building has everything you're looking for! Building amenities include a bi-level roof, 24- hour gym, free hot beverages and atm conveniently located in the lobby. Many floorplans available. Parking availability changes daily and requires additional fee- please inquire if interested in parking. $45 flat fee for sewer and water. Tenants also pay gas and electric. *photos are of model unit in the building. See virtual tour. * any lease term less than 12 months will be subject to premium pricing.\n1151-61 n 3rd #307\n","num_images":4.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1020ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:32:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-for-rent-meticulously\/7506774279.html","post_id":7506774279,"result_date":"2022-07-09 14:32","title":"For rent- a meticulously maintained","description":"For rent- a meticulously maintained and exquisitely rehabbed victorian townhome sitting on a quite fairmount block in highly desirable art museum area. Boasting a bright, open floor plan with high-ceilings, hardwood floors, bright and cheerful this is an ideal layout -an entertainer's dream. 1st floor: foyer entrance with lovely custom mosaic tile. Dining room with beautiful gas fireplace flows into a spacious living room featuring high-ceilings and recessed lighting that opens up to a fantastic kitchen via french doors. Spacious kitchen with tile floors and backsplash, granite counters, custom cabinetry, and stainless-steel ge appliances. Conveniently located laundry area with half bath leads to a superb patio with a raised wood deck, full landscaping and an outdoor speaker system. 2nd floor features three bedrooms with plenty of closet space and built-in storage space. Elegantly updated bathroom with tile floors, tiled bath and additional built-in storage. Gorgeous hardwood floors throughout. Three spacious bedrooms. Full and clean basement with plenty of storage space. Owner looking for good credit and good income- this is a spectacular home in a knock out location! Don't let this one pass by!\n2625 parrish st,\n","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 1.5Ba', '1300ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:28:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/merion-station-gem-in-bala-new-kit\/7506755086.html","post_id":7506755086,"result_date":"2022-07-09 14:32","title":"Gem in Bala! New Kit-Quartz Cntrs-W\/D-Great Closets-Sunny-Parking","description":"As they say \"Location, Location,Location\"...you can walk everywhere!\nSPECIAL SECURITY DEPOSIT: $500\n12 Month Lease\nSunny apartment home with courtyard views. Renovated Kitchen with stainless steel appliances and quartz counter tops. Apartment also fetures a washer and dryer and beautiful wood floors through the spacious floor plan. Wait until you see the amazing Breakfast Bar, great closet space and upgraded bath! Wait to you seeing your fabulous shopping options and eateries in Bala Cynwyd!\nContact Andrea for a live, video or FaceTime tour. Call today:  show contact info\nmetropolitan bala cynwyd apartments offer a beautiful courtyard setting and recently renovated apartment\nhomes that retain original, old-world charm. Located in Bala Cynwyd, PA in Lower Merion Township along the\nMain Line, the community is near shopping, restaurants, nightlife and theatres. It is also close to and an\naffordable alternative to living in Narberth, Ardmore and Manayunk. We are in top-rated Lower Merion School\nDistrict. Located minutes from Philadelphia, King of Prussia and other Main Line locations. Commute fast and easy to Lankenau Hospital, Saint Joeseph's University and Villanova University. Looking for an apartment in bala cynwyd? Schedule your tour today. metropolitan bala cynwyd...apartment homes for living!\nAPARTMENT FEATURES\n•New Kitchens w\/Stainless Steel Appliances and Quartz Counter Tops\n•Microwave, Dishwasher, Gas Range, and Refrigerator w\/Ice Maker\n•Washer and Dryer\n•Upgraded Bath\n•Great Closet Space\n•Newly Finished Hardwood Flooring\n•Spacious Floor Plans\n•New Double-Paned Windows\n•Individually Controlled Air Conditioning\n•Window Treatments\n•Dishwasher\n•Gas Cooking\nCOMMUNITY FEATURES\n• Lower Merion School District –Ranked 4th Best in Pennsylvania & 22nd in US\n• Beautiful Courtyard Views\n• Storage Lockers\n• Modern Laundry Facilities\n• Pet Friendly\n• Furnished Apartments Available\n• Off-Street Parking\n• Garage Parking Available\n• Professional On-Site Maintenance by Metropolitan Management\n• 24-Hour Emergency Maintenance Service\nFor more information, visit us at: https:https:\/\/www.yourmetropolitan.com\/find-an-apartment\/pennsylvania\/main-line\/bala-cynwyd\/bala-cynwyd\/\nLook and Lease Special is valid for new residence only and can be withdrawn at any time without prior written notice, restrictions apply!\nQualified applicants only.\nEqual Housing Opportunity\n$PECIAL-Security Deposit $500 ( Reduced for qualified applicants)\nCall today:  show contact info","num_images":12.0,"lat":40.005212,"lng":-75.23813,"attrs":"['1BR \/ 1Ba', 'available jul 29', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:49:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1bedden-unit-in-great\/7506758556.html","post_id":7506758556,"result_date":"2022-07-09 14:25","title":"1bed+den unit in a great location!","description":"$500 security deposit and 1st month's rent to move-in!! 1bed+den unit in a great location!! 1600 walnut is surrounded by the performing arts and numerous other cultural venues. One of the best values in center city. Secure entry, gym, bike room! Bright and sunny units with hardwood floors, large windows, marble baths and open layouts with great closet space. Known for its popular restaurants and nightlife spots, just steps away from some of philadelphia's best culinary experiences midtown philadelphia is a fun and exciting place to live. Pictures are of a similar unit.\n1600 walnut st #907\n","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '667ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T13:56:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-heart-of-narberth-corner\/7506759409.html","post_id":7506759409,"result_date":"2022-07-09 14:19","title":"Heart of Narberth-Corner-Sunny-New Kit-W\/D-Quartz-Space-Gym-Storage","description":"SPECIAL-Security Deposit $500\nOne Year Lease\nScond Floor....one fight walk-up...more steps in your day!\nThis elegant and sunny apartment home features a gourmet kitchen wood cabinets, quartz counters, huge breakfast bar, beautiful views and has designer wall and trim color.\nVisit to see our high-end appliances including a washer\/dryer, stainless-steel appliances, AC and dishwasher, newly renovatedapartment home with great closet space.\nAdditional stylish features are lovely Moroccan archways, rich wood floors, many windows, high ceilings and a spacious floor plan!\nAMENITIES\nGourmet Kitchen with Quartz Counters and Breakfast Bar\nWasher and Dryer in Apartment\nDishwasher\/ Microwave\nRefrigerator with Ice Maker\nAir Conditioning\nWindow Treatments\nUpgraded Bathroom\nWood Floors\nMoroccan Archways\nPet Friendly\nOnline Service Requests & Resident Portal\nProfessional On-Site Management\nProfessional On-Site Maintenance\n24 Hour Emergency Service\nStorage\nFitness Center\nPet Friendly! 🐶 🐱\nCall: show contact info\nfor a live, video or FaceTime tour!\nNEIGHBORHOOD\nTrain-\nShopping & Restaurants\nWalk to Playground, Basket Ball & Tennis Courts\nWalk to Narberth Library\nNarberth is the best of the Main Line! Living in your new apartment home offers a lifestyle unlike anywhere else. A quintessential town with peaceful-beautiful roads, parks, trails and play grounds. An array of international-specialty eateries, French bakery, boutiques, gift shops, book stores, vintage movie theatre, and super market with the best butcher in the Philly area. Either before or after your tour, plan an adventure to enjoy and exsperience the local delights, all unique to Narberth.\nFor more information, visit us at: https:\/\/www.yourmetropolitan.com\/find-an-apartment\/pennsylvania\/main-line\/narberth\/narberth-hall\/\nLook and Lease Special is valid for new residence only and can be withdrawn at any time without prior written notice, restrictions apply!\nQualified applicants only.\nEqual Housing Opportunity\nLeasing Office Hours: M-F: 9 am- 5 pm. Weekends available by appointment.\nCall:  show contact info","num_images":23.0,"lat":40.008552,"lng":-75.263922,"attrs":"['1BR \/ 1Ba', 'available sep 10', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:57:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-package-receiving-hardwood\/7506768121.html","post_id":7506768121,"result_date":"2022-07-09 14:19","title":"Package Receiving, Hardwood Floors, Recycling","description":"Bedrooms: 1Bathrooms: 1Square Feet: 518Date Available: 2022-07-09Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Window CoveringsFOB Controlled AccessSmart Home FeaturesElevatorRefrigeratorBike StorageHigh Speed InternetDishwasherWasher\/DryerOn-Site ManagementElectronic ThermostatHardwood FloorsCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/ljwso5aq\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '518ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:15:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-corner-one-bedroom-unit-at\/7506767951.html","post_id":7506767951,"result_date":"2022-07-09 14:18","title":"corner one bedroom unit at society hill towers!","description":"Stunning, fully renovated corner one bedroom unit at society hill towers! Enjoy magnificent views of the delaware river, ben franklin bridge, and society hill from floor to ceiling windows! Beautiful oak hardwood floors run throughout the unit. The kitchen boasts frigidaire stainless steel appliances, natural stone and porcelain backsplash, granite counters, and wood cabinets. The bathroom features a large sink and vanity, glass mosaic tiled shower walls, and white natural stone floors. The unit has newer hvac. The rent includes all utilities, 24\/7 concierge plus security guard, and verizon fios tv. Verizon internet is available for $30.99 monthly. Laundry room with newer machines are in the finished basement accessible by the elevators. No dogs allowed in building. The towers is uniquely located on five acres of suburban-like grounds yet is close to the delaware river, parks, and restaurants and shops of olde city, center city, rittenhouse, northern liberties and fishtown. The shopping plaza features zahav restaurant (previously named best u.S. Restaurant), sue's produce food market and a cleaners. There is an underground garage accessible by the elevators, with locked bicycle storage rooms. Enjoy the large, secluded outdoor in-ground swimming pool, its grounds, grills and locker rooms. The towers has an upgraded fitness center, hospitality suites for guests, community room, and storage lockers pending availability. The aforementioned are available for reasonable additional fees. Nearby is street parking, major highways and public transit. Your new home awaits! As per owner’s wishes, by july 31 all applications will be reviewed.\n210 locust st #16gw\n","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '803ft2', 'available sep 1', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T14:14:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7506767904.html","post_id":7506767904,"result_date":"2022-07-09 14:18","title":"Schedule a Tour, Granite Countertops, Playground","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, walk-in closet, and a patio\/balcony!","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available jul 21', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-07-09T14:14:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-summer-savings-2-months\/7506767175.html","post_id":7506767175,"result_date":"2022-07-09 14:17","title":"**SUMMER SAVINGS 1-2 months free _ HIGH-RISE _ HEATED POOL 1\/1","description":"Spacious 1br with wood floors, tall ceilings and washer\/dryer connections. Don't take a chance getting denied, I know which properties will work with you. Call Pete ( 8 7 7 ) 6 4 7 1 6 1 5\nUnit ID: 31706\nPrice, specials and availability can change at any time. Photos represent this community's model unit.\n","num_images":6.0,"lat":40.0343,"lng":-75.1213,"attrs":"['1BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-09T14:13:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7506765209.html","post_id":7506765209,"result_date":"2022-07-09 14:13","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:09:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-in-the-heart-of\/7506764991.html","post_id":7506764991,"result_date":"2022-07-09 14:12","title":"Located in the heart of olde city philadelphia.","description":"Located in the heart of olde city philadelphia. This home is refreshingly contemporary, with a spacious dining room and gourmet kitchen, equipped with high-end stainless steel appliances and granite countertops and silver walnut cabinets. There are incredible oak hardwood floors throughout. Entertain and unwind in the comfort of the living room and pamper yourself in the primary suite, with large walk-in closets and spa-like master bath. Enjoy the view of the philadelphia skyline from your secluded roof deck, and leave the car parked in your personal garage. With direct access to bus and train routes, community gardens, and shopping centers, you will rarely need it. This is a 9 month sub lease with ability to renew at the end of april 2023. Tenant responsible for all utilities. This is a 9 month sub lease, with the ability to renew the lease after april 30, 2023.\n150 n front st,\n","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['3BR \/ 3.5Ba', '2520ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T14:08:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/merion-station-heart-of-bala-living-the\/7506751560.html","post_id":7506751560,"result_date":"2022-07-09 14:10","title":"Heart of Bala! Living the Dream! New Kit-W\/D-Must See -Parking","description":"As they say \"Location, Location,Location\"...you can walk everywhere!\nSPECIAL SECURITY DEPOSIT: $500\n12 Month Lease\nSunny apartment home with courtyard views. Renovated Kitchen with stainless steel appliances and quartz counter tops. Apartment also fetures a washer and dryer and beautiful wood floors through the spacious floor plan. Wait until you see the amazing Breakfast Bar, great closet space and upgraded bath! Wait to you seeing your fabulous shopping options and eateries in Bala Cynwyd!\nContact Andrea for a live, video or FaceTime tour. Call today:  show contact info\nmetropolitan bala cynwyd apartments offer a beautiful courtyard setting and recently renovated apartment\nhomes that retain original, old-world charm. Located in Bala Cynwyd, PA in Lower Merion Township along the\nMain Line, the community is near shopping, restaurants, nightlife and theatres. It is also close to and an\naffordable alternative to living in Narberth, Ardmore and Manayunk. We are in top-rated Lower Merion School\nDistrict. Located minutes from Philadelphia, King of Prussia and other Main Line locations. Commute fast and easy to Lankenau Hospital, Saint Joeseph's University and Villanova University. Looking for an apartment in bala cynwyd? Schedule your tour today. metropolitan bala cynwyd...apartment homes for living!\nAPARTMENT FEATURES\n•New Kitchens w\/Stainless Steel Appliances and Quartz Counter Tops\n•Microwave, Dishwasher, Gas Range, and Refrigerator w\/Ice Maker\n•Washer and Dryer\n•Upgraded Bath\n•Great Closet Space\n•Newly Finished Hardwood Flooring\n•Spacious Floor Plans\n•New Double-Paned Windows\n•Individually Controlled Air Conditioning\n•Window Treatments\n•Dishwasher\n•Gas Cooking\nCOMMUNITY FEATURES\n• Lower Merion School District –Ranked 4th Best in Pennsylvania & 22nd in US\n• Beautiful Courtyard Views\n• Storage Lockers\n• Modern Laundry Facilities\n• Pet Friendly\n• Furnished Apartments Available\n• Off-Street Parking\n• Garage Parking Available\n• Professional On-Site Maintenance by Metropolitan Management\n• 24-Hour Emergency Maintenance Service\nFor more information, visit us at: https:https:\/\/www.yourmetropolitan.com\/find-an-apartment\/pennsylvania\/main-line\/bala-cynwyd\/bala-cynwyd\/\nLook and Lease Special is valid for new residence only and can be withdrawn at any time without prior written notice, restrictions apply!\nQualified applicants only.\nEqual Housing Opportunity\n$PECIAL-Security Deposit $500 ( Reduced for qualified applicants)\nCall today:  show contact info","num_images":13.0,"lat":40.005436,"lng":-75.238409,"attrs":"['2BR \/ 1Ba', 'available aug 8', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:42:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-the-ellington-has-24-hour\/7506763130.html","post_id":7506763130,"result_date":"2022-07-09 14:09","title":"The ellington has a 24 hour concierge,","description":"The ellington. 2 bedroom 2 full bath furnished , utilities included rental available. Gorgeous hardwood floors throughout, marble baths, large windows and high ceilings. Amazing location in center city close to trains and patco, city hall, avenue of the arts, and rittenhouse square. The ellington has a 24 hour concierge, a fitness center and a shared residents lounge. Location is within steps to the new w hotel adjacent to dilworth park and city hall. Monthly parking few blocks away..Dosent get much more convenient. Tenant pays cable\/wifi\n1500 chestnut st #13f","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', '918ft2', 'available aug 1', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T14:05:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-1br-in-manayunk-with\/7506760829.html","post_id":7506760829,"result_date":"2022-07-09 14:04","title":"Nice 1BR in Manayunk with Central Air and Laundry","description":"Very nice one-bedroom apartment coming available September 1. The apartment has an updated kitchen and bathroom. The kitchen has room for a small table and chairs. The living room and bedroom areas are spacious with original hardwood floors. The bedroom has two wide closets and a ceiling fan. The apartment has its own central HVAC system and its own washer\/dryer.\nThe rent for the apartment is $1195 plus utilities. If you are interested, send some basic information about yourself, who would be living in the apartment and when you are looking to move. Also let us know your availability to check it out. FYI, no pets and no smoking in the apartment.","num_images":8.0,"lat":40.028403,"lng":-75.217381,"attrs":"['1BR \/ 1Ba', '700ft2', 'available sep 1', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T14:00:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-very-cute-and-quaint\/7506746589.html","post_id":7506746589,"result_date":"2022-07-09 14:03","title":"@@@Very Cute and Quaint 2 Bedroom 2 Bath apartment for rent","description":"show contact info\nExtra large, spacious (about 1200 sq.ft) and bright 2 BR\/2BA upstairs apartment ,  short walk to grocery stores, gyms, restaurants and a few blocks from Liberty Station. Close to downtown and easy access to freeways. Large open floor plan for living room and kitchen area. European style kitchen, quartz countertops, electric stove, microwave, stainless fridge, dishwasher, garbage disposal and plenty of cabinet space. Easy maintenance with laminated floors in LR\/Hallway\/Bedrooms & tiles in entry, kitchen area and Bathrooms. Central HVAC. Energy efficient double pane windows in living room, kitchen and bedrooms. Sliding doors leading to balcony are also double pane. (2) large storage cabinets in hallway, (1) coat closet by entrance & (1) very large closet for extra storage on patio\nBuilt-in bookcase, Hardwood floors, Stainless steel appliances,  Granite countertops, Built-in desk, High ceilings, Wood plank flooring, Washer and dryer, Dual vanity, Floor-to-ceiling windows, Smart home package - coming soon, Patio\/ balcony, Travertine tile flooring in kitchen\/ bathroom, Stand-alone shower, Nest thermostat, Soaking tub, Walk-in closet\nshow contact info","num_images":13.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2Ba', '1200ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-09T13:31:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-philadelphia-row\/7506756758.html","post_id":7506756758,"result_date":"2022-07-09 13:56","title":"Lovely philadelphia row home on a corner","description":"Lovely philadelphia row home on a corner in queen village. A historic property in the meredith school catchment. Built in 1831, this home was originally an apothecary. The first floor still has some of the original built-ins! Recently upgraded flooring and bathrooms. Fully renovated and upgraded kitchen. New windows were installed in 2015. The first floor and finished basement have half baths. The second floor has 2 large bedrooms and a spacious full bathroom. The third floor is a finished attic bonus space that can be used as a bedroom, office, or play space. Plus a large deck off the bonus room! Don't miss this absolute gem.\n858 s front st,\n","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1.5Ba', '1828ft2', 'available aug 1', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:52:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedrooms-full-baths-1200\/7506742856.html","post_id":7506742856,"result_date":"2022-07-09 13:51","title":"2 bedrooms\/2 full baths, 1200 sq ft, 2 car garage,New flowing","description":"show contact info\nspacious living room boasts a built in entertainment center & stone fireplace with a dining area perfect for entertaining, game-night, or a wonderful meal. Gather around the kitchen island for meals prepared on all new gourmet appliances. The kitchen also features cinnamon cabinets, granite countertops, water filtration system, & a sunny breakfast area. Check out the large primary suite with quick access to the backyard, large walk-in closet & soaking tub. Don't miss the captivating park like yard with koi pond, waterfalls, hot tub, & mature trees that keep the backyard cool on hot summer days. The home also features plantation shutters, pre-wired security system, garage storage\/work area, drive through 2-car garage to concrete pad perfect for all your toys, Ring doorbell & leased solar power.\nNice neighborhood 2 bedroom 2 bathroom\nSpacious 1200 sq ft. Two Bedroom Plus Main Living Room with Full Bath Half Kitchen for rent. $800 per Month\nThis is an Addition attached to an existing home located in a cul-de-sac. Separate private entrance with small yard and shed for additional storage.\n 1200 sq. ft. Bedroom with joining full bath\n Main Living Room with kitchen cabinets \/ sink with garbage disposal\n Office\/Bedroom\n Refrigerator and room for cooking appliances \/ Microwave or convection oven.\n AC and Heating\n Vaulted Ceilings – Ceilings fans in every room\n Sink with Garbage Disposal\n Outside Yard Space Fenced with Shed\n tow Car Parking space off street, Addition Street Parking Available for 1 car.\nshow contact info","num_images":9.0,"lat":40.0343,"lng":-75.1213,"attrs":"['2BR \/ 2Ba', '1200ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-09T13:23:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-must-see-new-construction\/7506753847.html","post_id":7506753847,"result_date":"2022-07-09 13:50","title":"Must-see new construction!","description":"Must-see new construction! Unit 1l offers one bedroom plus a fully finished basement, which can be used as a den or a second bedroom, and 2 full baths. These spacious units with high ceilings offer tons of natural light and ample closet storage all throughout. This unit is just over 1000 sq feet and welcomes you into the combined living space and modern-design kitchen, which includes marble countertops, white cabinets, all stainless steel appliances, and plenty of pantry storage. Down the hall, you'll find the first full bathroom with a large vanity sink and white-tiled bathtub. The first bedroom faces your private backyard space, offering lots of natural light and closet space. Downstairs, you'll find the second full bathroom with a shower, as well as the in-unit washer and dryer. Whether you use the downstairs space for a second bedroom or another living space, you'll have lots of natural light and storage. Your private backyard can serve as your own oasis from the hustle and bustle of the town, or as a hosting area. You can also enjoy the massive 1200+ sqft shared roof deck to take in beautiful city views. Don't miss out on this gorgeous new construction apartment in a prime location! This stunning newly-constructed apartment home is right in the heart of philly's hippest neighborhood of fishtown. Only a block away from both frankford and girard ave, this unbeatable location puts you within walking distance of public transport, vibrant nightlife locations, bars, restaurants, and galleries.\n1223 leopard st #1l\n","num_images":4.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:46:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enjoy-living-in-this\/7506722710.html","post_id":7506722710,"result_date":"2022-07-09 13:50","title":"ENJOY LIVING IN THIS FORMER TUXEDO WAREHOUSE","description":"Enjoy living in this former tuxedo warehouse which has been transformed into fabulous loft style apartments! 2121 market street apartments offers stunning city views! Located in the rittenhouse square neighborhood, the spacious apartments feature super high ceilings with expansive 14-foot windows, hardwood floors, open floor-plans and amazing natural light. The kitchens are fully equipped and include a breakfast bar. Amenities include a resident sky box with a state of the art fitness center and resident lounge, roof deck with breathtaking city views, 24\/7 front desk attendant. We love pets! The building is super pet friendly and welcomes dogs and cats. Trader joe's is conveniently located on the lower level. Enjoy everything that the city has to offer at 2121 market street. **photos pictured are of the model unit with a similar floor-plan**\n2121-41 market st #306\n","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available aug 12', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T12:43:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bed-and-half\/7506743825.html","post_id":7506743825,"result_date":"2022-07-09 13:49","title":"Beautiful 4 bed, 2 and a half bath home","description":"Beautiful 4 bed, 2 and a half bath home for rent in graduate neighborhood! 1634 bainbridge has been lovingly maintained featuring hardwood floors, recessed lighting, and crown moulding throughout. The first floor boasts an open floor plan with a combination living and dining room space, a contemporary kitchen with island, ample cabinetry, granite countertops, stainless steel appliances, and a convenient half-bath. Moving up to the second floor, there are 2 bedrooms, one full bath and an area for laundry. On the top floor is the primary suite complete with bay windows, a generous walk-in closet, luxurious marble bath, a complete glass-enclosed shower plus a 4th bedroom that could be used for a nursery, office, or more closet space. This property also has ample outdoor space with a private backyard patio area off of the kitchen as well as a rooftop deck with city skyline views. The basement is fully finished and adds 400 additional square footage for storage, extra living space, or even a 5th bedroom. Located in one of the trendiest neighborhoods in philadelphia, this home is steps away from rittenhouse and fitler square parks, marian anderson recreation center, center city restaurants such as bistro la baia byob, miles table, & tio flores, and allows for easy access public transportation such as the market frankford line and broad street line.\n1634 bainbridge st\n","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['4BR \/ 3.5Ba', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-07-09T13:26:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-affordable-studio\/7506752783.html","post_id":7506752783,"result_date":"2022-07-09 13:48","title":"Affordable studio available now at 3412 Spring garden!","description":"Cozy studio available now in university city area. Walking distance to Drexel university. Laundry room in the building. Window air conditioning. Hardwood floors. Tenants will be responsible only for electric. Security deposit, first and last month to move in. $55 application fee.\nRental Terms\nRent: $890\nApplication Fee: $55\nSecurity Deposit: $890\nAvailable now\nPet Policy\nCats allowed\nDogs allowed\nCall Alena for showing at  show contact info\nAlena Skorynina\nCity wide realty\n","num_images":10.0,"lat":39.9597,"lng":-75.2024,"attrs":"['0BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:44:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-all-utilities-included-in\/7506752096.html","post_id":7506752096,"result_date":"2022-07-09 13:47","title":"All utilities included in the monthly rent of $2000.","description":"All utilities included in the monthly rent of $2000. You will not get a better deal living in rittenhouse. Enjoy the beautiful views from this centrally-located, corner 2 bedroom, 1 bathroom condo on the sixteenth floor. The large living area features beautiful hardwood flooring and a wall of windows with the view of city skyline. A galley-style kitchen provides good counter space, ample cabinetry and all new appliances. Two bedrooms with good closet space and new carpeting, an updated full bath, and large hall closet storage, complete this home. Residents at river west condominium enjoy a 24-hour front desk, secured entry, fitness center, resident's lounge. Utilities included are gas, electric, hot water, sewer, water and basic cable. Located in the rittenhouse square neighborhood, this home is blocks away from some of the best of philly's dining and retail scene, world-class museums and cultural attractions, and convenient to public and mass transit and much much more! Move-in fee: $200(m-f) & $300(sat)\n2101-17 chestnut st #1608\n","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '862ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:43:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom\/7506748788.html","post_id":7506748788,"result_date":"2022-07-09 13:47","title":"Renovated 1 bedroom available now at 4800 Brown st!","description":"Experience forward-thinking urban living.\n1, 2 & 3 bedroom luxury loft-style apartments located in an affordable up-and-coming district just north of University City make up this 34-unit complex. We offer thoughtful architecture and design creating a contemporary feel in an old factory setting. Elevator access, stainless steel appliances including a dishwasher and garbage disposal, a multi-camera security system, intercom system with remote door buzzer, on-site laundry, high ceilings, custom cabinetry with self-closing hardware, granite counters, kitchen pantry, exposed brick & concrete in many units, tile flooring, central heat & air, LED lighting, extra large commercial sized windows, large closets and large bright common hallways will be more than enough to make you want to come home!\nLive the uptown urban lifestyle you crave!\nAmenities:\n-Water $35.00 per month\n-Elevator\n-Assigned gated parking available for car and scooters ($150 per space, coming Summer 2021)\n-Multi-camera security system\n-Intercom system with electronic door opener\n-On-site laundry\n-Choice of Comcast or Verizon\n-Full-size stainless steel appliances\n-Bus line at corner\n-Garbage disposal\n-High ceilings\n-Large closets\n-Custom cabinetry with self closing cabinet doors & drawers\n-Sinks with magnetic retractable faucet hose\n-Granite counters\n-Pantries\n-Exposed ductwork, brick & concrete floors\/ceilings (in some units)\n-Central air and heat\nIn addition to monthly rent, tenant is responsible for their own electricity bill, a water fee of $35 & a liability insurance fee of $9.50\nCall Alena fro showing at  show contact info\nCity wide realty\n","num_images":17.0,"lat":39.966337,"lng":-75.216657,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:36:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fresh-bright-great\/7506751827.html","post_id":7506751827,"result_date":"2022-07-09 13:46","title":"Fresh & Bright, Great Location on Cul-De -Sac Street, Parking!!!","description":"Great Fresh & Bright modern 1 bedroom apartment with off-street parking (big plus)\nFeatures include:\nA very large nice bed room with great closet space\nfull tile bath, Large open living room dining area\nKitchen: with full size refrigerator\nLiving room (cable ready), lots of great closets\nOther Features: private street, close to Main Street, air-conditioning, wall-to-wall carpeting, washer & dryer, security system, recently the unit was renovated and looks GREAT!.\n..... You won't be disappointed, It truly looks magnificent.\napprox. 650 sq. ft.\n* Nice Cul-de-sac street\n* Off street parking\n* A\/C\n* Security System\n* Washer & Dryer\n* Newly renovated\n* Lots of Storage\nTrain- they are approximately 4 blocks walk to the Manayunk train station\nand 8 blocks to the Ivy Ridge Station which has free ample parking. They all\ngo direct to 30th street and I would expect you can call Septa for those\nStations but I believe they also go to Suburban station.\nRobert A. Palac\ncell:  show contact info\n(it is best to call my cell since I am rarely have access to my e-mail account during the day)\nthe best way to reach me is by cell phone since I am on the road most of the day.","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['1BR \/ 1Ba', '650ft2', 'air conditioning', 'broker fee details: $55 application credit fee', 'apartment', 'laundry in bldg', 'listed by: GC comm. building - electrical MEP design', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:42:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-1st-floor-studio\/7506750732.html","post_id":7506750732,"result_date":"2022-07-09 13:44","title":"Spacious, 1st floor studio available now at 3412 Spring garden!","description":"Cozy studio available now in university city area. Walking distance to Drexel university. Laundry room in the building. Window air conditioning. Hardwood floors. Tenants will be responsible only for electric. Security deposit, first and last month to move in. $55 application fee.\nRental Terms\nRent: $990\nApplication Fee: $55\nSecurity Deposit: $990\nAvailable now\nPet Policy\nCats allowed\nDogs allowed\nCall Alena for showing at  show contact info\nAlena Skorynina\nCity wide realtyI\n","num_images":10.0,"lat":39.9597,"lng":-75.2024,"attrs":"['0BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:40:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-and-modern-condo-at\/7506750607.html","post_id":7506750607,"result_date":"2022-07-09 13:44","title":"Bright and modern condo at the aria,","description":"Bright and modern condo at the aria, located in the heart of center city. This spacious one bedroom one bath unit has it all. The kitchen has ge stainless steel appliances, gas cooktop, granite counter tops and a large breakfast bar. The unit has beautiful dark hardwood floors. An energy efficient bosch in unit washer and dryer and gorgeous marble counters and floor in the bathroom. This well-established building also offers 24-hour security, concierge, a fitness center, owners lounge and an extra storage space.\n1425 locust st #9e\n","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '777ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:40:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-appreciate-value-youll-get\/7506750108.html","post_id":7506750108,"result_date":"2022-07-09 13:42","title":"Appreciate Value? You'll Get a Deal at The Gateway Apartments","description":"The Gateway Apartments 1515 Manley Rd West Chester, PA 19380 Upgraded Apartment . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Rental Size:  1 BR - 1 BA - 842 sq ft  Per Month: $2012 - $2449  Lease Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  Conveniently located in prestigious Chester County, The Gateway offers unique one and two bedroom apartments with den options in a beautiful setting. Commbine the comforts of home with superior resident services and amenities such as our resort style pool, business center, fitness center, and walking trail.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Features and Amenities: ● Business Center● Clubhouse● Fitness Center● Onsite Maintenance● Onsite Management● Package Service● Picnic and Grilling Area● Pool and Sundeck● Storage Space● Walking\/Biking Trails● Across From Wawa & Goshen Crossing Shopping Center● Garages For Lease● Gated Entrances● Maintenance Free Lifestyle● Onsite Leasing Office● Pet-Friendly● Resort-Style Pool With Sun Deck● Storage Units For Lease● Three BBQ\/Picnic Areas● Wi-Fi Access in Clubhouse and at Pool. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . This Unit Comes With: ● Air Conditioning & Heating● Cable Ready● Carpet● Dining Room● Dishwasher● High Speed Internet Access● Trash Compactor● Tub\/Shower● Walk-In Closets● Window Coverings● Built-In Computer Nook (select homes)● Frost-Free Refrigerator\/Ice Maker● Garden\/Spa Tub (select homes)● Gas Fire Place (select homes)● Kitchen Pantry● Mini Blinds On All Windows● Upgrade● Washer And Dryer In Each Apartment Home● Wired For High-Speed Internet● Wooded View\/Pool View (select homes). . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Call us for more information! --  show contact info\n-- Website: https:\/\/www.thegatewayapartments.com\/Pets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Mon. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY66333F8967D246\n","num_images":5.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '842ft2', 'available sep 23', 'air conditioning', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:38:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-cat-and-dog-heaven-amazing\/7506748190.html","post_id":7506748190,"result_date":"2022-07-09 13:38","title":"Cat and Dog Heaven! Amazing Pet-Friendly Community! 1 Bed \/ 1 Bath","description":"Welcome to The Gateway Apartments!1515 Manley Rd West Chester, PA 19380Rental Size: 1 BR - 1 BA - 842 sq ft | Per Month: $2012 - $2449 | Lease Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month Upgraded ApartmentOffering a vibrant selection of living options, The Gateway Apartment Homes maintains the prime for luxury apartments in West Chester, PA. Our open and inviting floor plans are enhanced by a variety of exclusive features which define the unique lifestyle only found at our community. With a great location in the East Goshen Township, you will love calling our apartments your home.  Our community features:   − Business Center− Clubhouse− Fitness Center− Onsite Maintenance− Onsite Management− Package Service− Picnic and Grilling Area− Pool and Sundeck− Storage Space− Walking\/Biking Trails− Across From Wawa & Goshen Crossing Shopping Center− Beautifully Landscaped Grounds− Garages For Lease− Gated Entrances− Pet-Friendly− Relaxing Fire Pit− Resort-Style Pool With Sun Deck− Storage Units For Lease− Three BBQ\/Picnic Areas− Wi-Fi Access in Clubhouse and at Pool  Our unit features: − Air Conditioning & Heating− Alarm− Cable Ready− Carpet− Garbage Disposal− High Speed Internet Access− Refrigerator, Freezer, Ice Maker− Trash Compactor− Tub\/Shower− Window Coverings− Built-In Computer Nook (select homes)− Disability Access (select homes)− Frost-Free Refrigerator\/Ice Maker− Garden\/Spa Tub (select homes)− Large Windows− Mini Blinds On All Windows− Private Entrance To Each Unit− Upgrade− Washer And Dryer In Each Apartment Home− Wooded View\/Pool View (select homes)   Contact us for more information! --  show contact info\n--Our Pet-Policy: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonWebsite: https:\/\/www.thegatewayapartments.com\/Property Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY66333F8967D246\n","num_images":5.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '842ft2', 'available sep 23', 'air conditioning', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:34:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-self-cleaning-oven-with\/7506706995.html","post_id":7506706995,"result_date":"2022-07-09 13:34","title":"-Self-Cleaning Oven with Range Avail 3BR\/2BA","description":"The Piero is the most prestigious address, in urban-style elegance, that take over payments has to offer extreme housing discounts. Experience gracious, apartment living in the heart of downtown. Our superior location is moments from the financial district, fine dining, glamorous shopping, and vibrant nightlife. Staples Center, Walt Disney Concert Hall, and Koreatown are just minutes from here. All of the culture and arts that define Los Angeles are within reach when you live at The Piero. With close proximity to the freeway, your commute in California is a breeze.\nCALL  show contact info\nAPARTMENT FEATURES\n-Self-Cleaning Oven with Range\n-Generous Walk-In or Double-Mirrored Closets\n-Designer Selected Color Schemes\n-Rich European-Style Beech Wood Cabinets\n-Eight Phone Line Capability\n-Crown Moldings\n-Individual Balconies or Patios\n-Automatic Dishwasher\n-Solid Hardwood Oak Entry Doors\n-Berber Carpeting\nCOMMUNITY AMENITIES\n-Yoga\/Dance Studio w\/ Large Flat-Screen TV and DVD Player\n-Junior Olympic-Size Swimming Pool (Heated for Year-Round Use)\n-Floor-to-Ceiling Mirrors\n-Four StarTrac Cycling Machines w\/ Individual Flat-Screen TV's\n-Conference\/Board Room for Meetings (Seats 8 Comfortably)\n-Mail Room with Package Acceptance Services\n-24-Hour Courtesy Patrol\n-Executive Business Center\n-Library\/Study Room with High Speed Internet Access\n-Four StarTrac Treadmills w\/ Individual Flat-Screen TV's\n","num_images":4.0,"lat":40.0422,"lng":-75.0244,"attrs":"['3BR \/ 2Ba', '1730ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T12:12:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-junior-olympic-size\/7506707061.html","post_id":7506707061,"result_date":"2022-07-09 13:33","title":"-Junior Olympic-Size Swimming Pool (Heated for Year-Round Use) 3BR\/2BA","description":"The Piero is the most prestigious address, in urban-style elegance, that take over payments has to offer extreme housing discounts. Experience gracious, apartment living in the heart of downtown. Our superior location is moments from the financial district, fine dining, glamorous shopping, and vibrant nightlife. Staples Center, Walt Disney Concert Hall, and Koreatown are just minutes from here. All of the culture and arts that define Los Angeles are within reach when you live at The Piero. With close proximity to the freeway, your commute in California is a breeze.\nCALL  show contact info\nAPARTMENT FEATURES\n-Self-Cleaning Oven with Range\n-Generous Walk-In or Double-Mirrored Closets\n-Designer Selected Color Schemes\n-Rich European-Style Beech Wood Cabinets\n-Eight Phone Line Capability\n-Crown Moldings\n-Individual Balconies or Patios\n-Automatic Dishwasher\n-Solid Hardwood Oak Entry Doors\n-Berber Carpeting\nCOMMUNITY AMENITIES\n-Yoga\/Dance Studio w\/ Large Flat-Screen TV and DVD Player\n-Junior Olympic-Size Swimming Pool (Heated for Year-Round Use)\n-Floor-to-Ceiling Mirrors\n-Four StarTrac Cycling Machines w\/ Individual Flat-Screen TV's\n-Conference\/Board Room for Meetings (Seats 8 Comfortably)\n-Mail Room with Package Acceptance Services\n-24-Hour Courtesy Patrol\n-Executive Business Center\n-Library\/Study Room with High Speed Internet Access\n-Four StarTrac Treadmills w\/ Individual Flat-Screen TV's","num_images":5.0,"lat":40.0422,"lng":-75.0244,"attrs":"['3BR \/ 2Ba', '1730ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T12:12:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-luxury-location-and\/7506743888.html","post_id":7506743888,"result_date":"2022-07-09 13:30","title":"Luxury, Location, and Convenience","description":"Apt. 2311 — Royal floor plan — 1,293 sq. ft. — $3,259\nThis 3rd floor royal boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture, a dining set and bar stools. The master suite comes with an enormous walk-in closet and double sinks with a luminous shower. The guest bedroom is room as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1293ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-09T13:26:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/merion-station-heart-of-narberth\/7506743352.html","post_id":7506743352,"result_date":"2022-07-09 13:29","title":"Heart of Narberth! Spacious! New Kit-W\/D-Fireplace-Den-Parking-LMSD","description":"SPECIAL: $500 Security Deposit\nYearly Lease\nCall  show contact info\nor email today to set up your personalized tour through our outstanding community.\nWe look forward to arranging your visit to view your new apartment home!\ncome tour your new Apartment Home that is renovated with white kitchen cabinets, stainless steel appliances, quartz counter tops all tastefully accented by the newly ebony stained flooring. Your new apartment home has a formal Dining room, a cozy fireplace and a dreamy Sun Room!\nAn absolutely stunning apartment home experience!\nLeasing Office Hours: M-F: 9am-6pm. Weekends available by appointment only.\nFEATURES\n*Renovated Kitchen\n*Quartz Counter Tops\n*Stainless Steel Appliances\n*Spacious Floor Plan w\/ Greenhouse\n*Fireplace in Living Room\n*Formal Dining Area\n*Washer\/Dryer In-Unit\n*Dishwasher\/ Microwave\n*Refrigerator with Ice Maker\n*Air Conditioning\n*Window Treatments\n*Upgraded Bathroom\n*Real Wooden Floors\n*Plush Wall-to-Wall Carpeting\n*Garage Parking Available\n*Online Service Requests & Resident Portal\nPET FRIENDLY!🐶🐱\nCOMMUNITY & NEIGHBORHOOD AMENITIES\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Close To Train\n*Close to Shopping & Restaurants\n*Close to Playground, Basket Ball & Tennis Courts\n*Close to Narberth Library\n*Lower Merion School District\nEnjoy the charm and convenience of Historic Narberth at metropolitan narberth station. Our PET FRIENDLY apartment homes in Narberth, PA are in the best location along the Main Line of Philadelphia, yet close to Center City and neighboring Suburban Square. Our Narberth, PA apartment homes are located in the heart of great shopping, gourmet restaurants, nightlife, Ardmore, Bala Cynwyd, and nearby Manayunk. the metropolitan narberth station is walking distance to the Narberth Train Station and the Septa Bus at the corner, allowing for easy access to Center City Philadelphia and the Main Line suburbs. Close to major Routes 1, 76, 476, 202 and the PA Turnpike. Our apartment home community in Lower Merion School District allows you to send children in your household to a top-rated school district. Looking for an apartment home in Narberth, PA? What are you waiting for? Schedule your tour today! the metropolitan narberth station. Apartment homes for living.\nFor more information, visit us at: https:\/\/www.yourmetropolitan.com\/find-an-apartment\/pennsylvania\/main-line\/narberth\/narberth-station\/\n*Special is valid for new residence only and can be withdrawn at any time without prior written notice.\nQualified applicants only.\nEqual Housing Opportunity\nCall:  show contact info","num_images":24.0,"lat":40.005856,"lng":-75.259395,"attrs":"['3BR \/ 1Ba', 'available sep 16', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:25:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-the-ellington\/7506742383.html","post_id":7506742383,"result_date":"2022-07-09 13:26","title":"Welcome to the ellington 10d","description":"Step outside to endless options for your every need! Welcome to the ellington 10d. This one-bedroom, one-bathroom condo combines great open space with lots of natural light and modern amenities. A beautiful white kitchen with granite counters, features stainless upgraded appliances and leads to a spacious living area with high ceilings and sleek wood floors. The bedroom is oversized and the sunny window nook is the perfect place for a home office or relaxing seating area. A spacious bathroom is outfitted in marble, and has a combination tub and shower. In-unit laundry is located just off of the kitchen area, and ample storage is found throughout. The ellington offers a resident’s lounge, 24-hour doorperson, on-site fitness center, and is conveniently located just steps from incredible dining options like mission, giuseppe & sons, harp & crown, oyster house, del frisco’s, and so many more. Enjoy the surrounding rittenhouse shopping district, and enjoy the conveniences of nearby public transportation and nightlife. Enjoy this incredible value while it lasts, whether for yourself, or as an investment opportunity!\n1500 chestnut st #10d\n","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '845ft2', 'available jul 15', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:22:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-set-your-appointment-today\/7506738932.html","post_id":7506738932,"result_date":"2022-07-09 13:20","title":"Set your appointment today!","description":"A great opportunity to live in this large beautiful home in an amazing neighborhood! The home has five bedrooms and three full bathrooms. On a unique street, this home has a charming rarely found front yard. A traditional home with many original details yet upgraded recently with quality and taste. The living room has a working fireplace and hardwood floors. Updated kitchen with an attractive countertop, backsplash, and appliances. The first floor full bathroom has an original clawfoot tub. The back first-floor room would work well as an office space. The second floor has three bedrooms with the second-floor bathroom being upgraded with a whirlpool tub. Each bedroom has original finishes. The third floor has two bedrooms. The middle bedroom was converted into a large closet and laundry room with high efficient washer and dryer. The back bedroom has sliding glass doors with the full bathroom also having a whirlpool tub. The basement is large but unfinished. There is good ceiling height in the basement if you choose to finish it. The home is approximately 1800 square feet. Set your appointment today!\n2139 bainbridge st,\n","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['5BR \/ 3Ba', '1686ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:16:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this-updated\/7506737377.html","post_id":7506737377,"result_date":"2022-07-09 13:17","title":"Welcome to this updated multi level unit","description":"Welcome to this updated multi level unit with 4 bedrooms and 2 full baths, conveniently located with easy access to center city, fairmount, and temple university. Enter into the straight-through layout on the first floor, where you're welcomed into the large, open living room area. The eat-in kitchen boasts stainless steel appliances, granite countertops, and a window overlooking the back patio area. With ample closet space in each of the 4 bedrooms, a designated basement storage space, washer and dryer, and central a\/c, this is the perfect place for roommates or a small family. Within walking distance are many neighborhood favorites like, thirsty dice, bar hygge, santucci's, and osteria. Only a 4 minute bike ride to temple u and just steps away from the bsl - fairmount station, gives the commuter quick access to center city. Contact us today to schedule your showing! Lease terms: generally, first and last month rent, and one month security deposit due at, or prior to, lease signing. Other terms may be required by landlord. $40 application fee per applicant. Tenants responsible for all other utilities: electricity, gas, and cable\/internet. $50 water fee additional to rent.\n1504 brown st #a\n","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['4BR \/ 2Ba', '1845ft2', 'available aug 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T13:13:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-yoga-dance-studio-large\/7506707020.html","post_id":7506707020,"result_date":"2022-07-09 13:16","title":"-Yoga\/Dance Studio w\/ Large Flat-Screen TV and DVD Player 3BR\/2BA","description":"The Piero is the most prestigious address, in urban-style elegance, that take over payments has to offer extreme housing discounts. Experience gracious, apartment living in the heart of downtown. Our superior location is moments from the financial district, fine dining, glamorous shopping, and vibrant nightlife. Staples Center, Walt Disney Concert Hall, and Koreatown are just minutes from here. All of the culture and arts that define Los Angeles are within reach when you live at The Piero. With close proximity to the freeway, your commute in California is a breeze.\nCALL  show contact info\nAPARTMENT FEATURES\n-Self-Cleaning Oven with Range\n-Generous Walk-In or Double-Mirrored Closets\n-Designer Selected Color Schemes\n-Rich European-Style Beech Wood Cabinets\n-Eight Phone Line Capability\n-Crown Moldings\n-Individual Balconies or Patios\n-Automatic Dishwasher\n-Solid Hardwood Oak Entry Doors\n-Berber Carpeting\nCOMMUNITY AMENITIES\n-Yoga\/Dance Studio w\/ Large Flat-Screen TV and DVD Player\n-Junior Olympic-Size Swimming Pool (Heated for Year-Round Use)\n-Floor-to-Ceiling Mirrors\n-Four StarTrac Cycling Machines w\/ Individual Flat-Screen TV's\n-Conference\/Board Room for Meetings (Seats 8 Comfortably)\n-Mail Room with Package Acceptance Services\n-24-Hour Courtesy Patrol\n-Executive Business Center\n-Library\/Study Room with High Speed Internet Access\n-Four StarTrac Treadmills w\/ Individual Flat-Screen TV's\n","num_images":5.0,"lat":40.0422,"lng":-75.0244,"attrs":"['3BR \/ 2Ba', '1730ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-07-09T12:12:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-two-bedroom-apartment-in\/7506735775.html","post_id":7506735775,"result_date":"2022-07-09 13:13","title":"Two Bedroom Apartment w\/ In Home Washer & Dryer","description":"The Glen at Lafayette Hill Bedroom: 2 | Bathroom: 2Square Footage: 1043 sq ftMonthly Rent: $2140 - $2692 show contact info\nCommunity Description  Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.    Community Amenities➢ 24 Hour Availability➢ Barbecue\/Grill➢ Business Center➢ Cardio Machines➢ Elevator➢ Gated, Controlled Access➢ Multi-Use Room➢ Online Services➢ Pet Friendly➢ Planned Social Activities➢ BBQ Picnic Garden➢ Billiards, Club Lounge, Cafe Area, Library and Community Room➢ Fitness Center w\/ Free Weights, Weight Machines➢ Message Therapist Practice On-site➢ Outdoor Cafe & Coffee Bar➢ Outdoor Patio Lounge➢ Sprinkler System➢ Storage Space➢ Wi-Fi at ClubhouseUnit Features➢ Air Conditioning & Heating➢ Cable Ready➢ Carpet➢ Ceiling Fans (Select Floor Plans)➢ Dining Room➢ Heating➢ Range, Oven, Disposal, Oven➢ Refrigerator, Freezer and Ice Maker➢ Tub\/Shower➢ Wi-Fi➢ Crown Molding (Select Floor Plans)➢ Dishwasher➢ High Speed Internet Access➢ Linen Closet➢ Microwave➢ Storage Units➢ Tile Floors➢ Trash Compactor➢ Walk-In Closets (Select Floor Plans)➢ Washer\/Dryer  Contact InformationVisit Us: 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.com   Additional DetailsPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthManagement Company: Paradise Management, LLC Price is subject to change without prior noticeAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7FEB687AB31D403\n","num_images":17.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1043ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-07-09T13:09:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-live-at-park-towne-place\/7506717377.html","post_id":7506717377,"result_date":"2022-07-09 13:13","title":"Live at park towne place apartment","description":"Live at park towne place apartment homes in center city philadelphia, and you'll be blocks from the center of nightlife in logan square and rittenhouse square. Unit features modern kitchens, quartz countertops, stainless steel appliances, in-unit washers and dryers, breakfast bars, pendant lighting, tile backsplashes, wood plank flooring throughout, walk-in closets. Stunning city and museum views are offered in a variety of floor plans! Mainstreet market and caf , featuring gourmet coffee and tea and much more! Fitness center with technogym equipment, queenax boxing gym, yoga\/spin studio with indoor\/outdoor workout space. It boasts philadelphia's largest pools, an art studio, fitness center with boxing gym, yoga\/spin studio, social lounge with demonstration kitchen, gourmet market and cafe, outdoor lounge with fire pit, 24-hour concierge, 24\/7 package acceptance, resident shuttle service to center city and university city and more. Make whole foods as your second kitchen conveniently located just 1 block away. Our apartments are within one mile of several institutions of higher education: drexel university, temple university, university of penn, chop, moore college of arts, community college of philadelphia. You won't find a better building to live with amenities in the fairmount area. Park towne place includes 948 apartment and penthouse homes within four high-rise towers. The community is nestled between green acres on the benjamin franklin parkway in the heart of center city philadelphia's museum district. Park town. ** prices and availability subject to change on a daily basis ** photos are of model units ** parking may be available for additional fee **\n2200 benjamin franklin pkwy #1b-e0112\n","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '511ft2', 'available jul 16', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-07-09T12:32:47-0400"}]