[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-west-chester2-bedroom-full\/7611220475.html","post_id":7611220475,"title":"West Chester~~2 Bedroom \/ 2 Full Baths + Easy access to Airport##","description":"West Chester~~2 Bedroom \/ 2 Full Baths with lots of privacy. Traditional, cozy, very clean, charming and light-filled Cape Cod style on a quiet street in good neighborhood. All new paint, refinished hardwood floors, remodeled interior, newer heater and roof. Have your own garage, laundry room, yard & BBQ patio area. Convenient to major highways - Routes 202, 322, and 1. You will be one mile from downtown West Chester and close to great restaurants, hiking trails, library and shopping. Easy access to Airport, Wilmington, King of Prussia and Philadelphia. This property will feel like your home as soon as you move in! Renting unfurnished.\nIF YOU ARE INTERESTED PLEASE, SEND YOUR EMAIL & CONTACT INFO","num_images":8,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T21:15:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-luxury-building\/7611234346.html","post_id":7611234346,"title":"Brand New Luxury Building- Elevator, Parking, Decks, Package Delivery!","description":"Welcome to The Howard, and the opportunity to live the way you've always wanted. Now’s your chance to live in a newly built, contemporary building. We offer EXCLUSIVE access to:\n- A limited number of off-street, covered parking spaces for rent\n- A few choice rooftop deck spaces left that can be rented for the season.\nEvery detail has been carefully considered in our distinctive apartments: Some of the features waiting to WOW you include:\n- Sleek, modern finishes,\n- Efficiency washer\/dryers\n- French Door Counter Depth Refrigerators\n- Expansive floor to ceiling windows\n- Keyless entry and package delivery\n- Elevator\nOur location is a unique fusion of urban chic and Sunday chill. You're just steps away from boutique dining, shopping, and nightlife right in the heart of Fishtown and you're located just a couple blocks from the Market Frankford Line. These apartments are rented on a first come first serve basis, so reach out now to reserve your spot and a new lease on life!\n","num_images":5,"lat":39.977854,"lng":-75.134767,"attrs":"['1BR \/ 1Ba', 'available apr 29', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T22:21:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-bright-2br-apt\/7611223206.html","post_id":7611223206,"title":"Bright 2BR Apt","description":"2 bedroom apartment in duplex\n2nd floor\n700sq ft.\nGas hot water\/heat\nw\/w carpet, tile bath, tile backsplash,\nstreet parking, garden.\n$1050+ utilities first \/last\/deposit to move in\nover 600 credit score required\nClose to everything!\nLocated next to 69th st. shopping area\nAvailable now\nLandlord pays $25 towards water (remaining bill is split between the 2 apartments)\n","num_images":6,"lat":39.9579,"lng":-75.2681,"attrs":"['2BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T21:27:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-in\/7611230437.html","post_id":7611230437,"title":"2-Bedroom Apartment in Swampoodle heights North Philly","description":"Property:\n2-story Row Duplex, 2-Bedroom Apartment on the 2nd floor.\nFull Bathroom, Living room\nBedroom(s):\nHas Laminated floors, freshly painted,closet(s). Ceiling fans.\nLiving room:\nFreshly painted, Laminated flooring, ceiling fans.\nKitchen:\nWater-Proof Laminate flooring, refrigerator.\nGas stove.\nWood, and metal cabinets top\/bottom.\nBathroom:\nFull ceramic tile tub\/shower tub. Medicine cabinet, and matching vanity. Stain glass window freshly painted.\nBasement:\nTenant has access to basement. Has private use only washer and dryer.\nUtilities:\nTenant(s) responsible for Electric, Gas service heat etc.,  and any and all other associated services. Landlord pays water.\nRent:\n$850\/month plus any and all associated utilities, and or services.\nParking:\nOn street parking only. Near public transportation.\nApplication fees:\nNon-Refundable $50.00 Application fee. any additional applicant over the age of 18 pays $40.00.\n*All Application fees are\/will be waived, for the 1st Accepted, and qualified prospective tenant.\nApartment is move-in ready. Make my house your home.\nPets:\nCats ok, no dogs of any kind.\nRental Documentation:\nStable, AND proof of documental income is a must. \"NO EXCEPTIONS\"\nMove In:\nFirst, last and 1-Month refundable security deposit rent is required in most cases. $2,550.00\nSerious applicants can contact me at  «show contact info» ask for Mr. White.  show contact info\nFYI: ALL SHOWINGS ARE BY APPOINTMENT ONLY.\nFYI: SERIOUS CALL INQUIRIES ONLY.\nPLEASE DO NOT TEXT, OR EMAIL WHEN INQUIRING.\n","num_images":16,"lat":39.998233,"lng":-75.175188,"attrs":"['2BR \/ 1Ba', '600ft2', 'available jun 1', 'application fee details: rental application fee.', 'cats are OK - purrr', 'duplex', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T22:01:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-west-chester-boro-bedroom\/7611220281.html","post_id":7611220281,"title":"West Chester Boro 1 Bedroom apt + Short walk to downtown!!","description":"West Chester Boro 1 Bedroom apt with 1 off-street parking space behind building. Clean, efficient, and affordable. Renovated bathroom. Short walk to downtown restaurants and stores.\nOwner pays hot water, water, & sewer. Tenant pays electric & trash. 1 year lease.\nStudent permitted. 1 Parking space included.\nPets are welcome\nIF YOU ARE INTERESTED PLEASE, SEND YOUR EMAIL & CONTACT INFO","num_images":5,"lat":39.9845,"lng":-75.5962,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T21:14:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-2nd-fl-bed-with\/7611226935.html","post_id":7611226935,"title":"Modern 2nd Fl 1 Bed with office\/den Queen Village Apt! W\/D! H\/W Fls!!!","description":"Move right into this great apartment in the heart of Queen Village! This space is walking distance from great restaurants, shops, galleries, Penns Landing , Whole Foods and so much more. The interior features gorgeous hardwood floors throughout with beautiful inlays, new kitchen with modern appliances including a refrigerator, gas range, microwave and disposal; granite countertops; good amount of closet space, living room, formal dining room, three-piece fully tiled bath, and ceiling fans. This apartment is a one bedroom and den. W\/D in unit! Radiator heat. Available June 1, 2023. Sorry no pets. No smoking. Tenant pays gas, electric and cable\/internet. Cold water\/sewer is included. $105 NON-REFUNDABLE application fee can be completed online at Forrester Property Mgmt. Two paystubs\/some income verification and photo ID are required to be submitted with the application. We run a credit, criminal and eviction check. For gross monthly income, we look for 3x the rent. If approved, you will be charged a document preparation fee of $100.00. THIS FEE IS NON-REFUNDABLE. Each resident over the age of 18 must submit a separate rental application. 1st, last and security deposit required upon lease signing. 1 year lease minimum.  Come check it out!  Contact Mike Giordano at  show contact info\n!","num_images":15,"lat":39.938509,"lng":-75.148242,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available jun 1', 'application fee details: $105 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $100', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T21:45:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-is-your-chance-to\/7611206504.html","post_id":7611206504,"title":"This is your chance to rent a fully restored 3 story townhome","description":"This is your chance to rent a fully restored 3 story townhome on prestigious Delancey Street. 128 Delancey Street is located on a tree lined historical cobblestone street, and allows the resident all the charm that Society Hill has to offer. Enter through the front door to an open concept floor plan that is filled with natural light and stunning hardwood flooring throughout. The living room boasts a gas fireplace, with a stunning built-ins surround. The dining room is located in the heart of the home and has a large window that overlooks the garden.. The kitchen is spacious and boasts custom cabinets, quartz countertops, a classic basket weave marble backsplash, and a GE Cafe stainless steel slide in gas range, french door stainless steel fridge and a stainless steel dishwasher. Enjoy dining in the kitchen's breakfast area while overlooking the stunning view of the landscaped back patio though over sided, southern facing windows. The perfect entertainers space. Showcasing evergreens, annuals and perennials. With raised brick beds and flagstone pavers. On the second level you will find 2 spacious bedrooms, and two other gas burning fireplaces, with period woodwork and a bonus room that could serve as a nursery, office, or dressing room. The full bathroom has a double vanity, gray subway tile backsplash, chrome fixtures, and quartz countertops. The 3rd level offers a large 3rd bedroom with a half bathroom. This home has been fully renovated. All new windows, electric, HVAC, washer and dryer, wireless smoke and CO detectors, smart alarm system, and many other modern updates. Steps away from all of local Society Hill restaurants, Spruce Harbor Park, Head house square, charming boutiques, grocery stores, old city, Washington Square and is minutes to all the major arteries of 95 and 76, and the bridges, which makes commuting a breeze. However, once you are home. The walk ability score here is 100%. You will never need to use your car. Do not miss the chance to live in this historic home in the heart of THRIVING Society Hill! Schedule your tour today!","num_images":24,"lat":39.943511,"lng":-75.143976,"attrs":"['3BR \/ 3Ba', '1208ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:15:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-3rd-fl-rear-bed\/7611215849.html","post_id":7611215849,"title":"Modern 3rd Fl Rear 1 Bed Passyunk Square Apt! Shared W\/D! H\/W fls!","description":"Modern 3rd Fl. Rear 1 Bedroom Passyunk Square Apartment located on the nationally acclaimed \"Miracle on S. 13th St.\" Block! Close to the Broad St. Subway, E. Passyunk Ave. Dining and Shopping District, Center City, Stadium District, and so much more! Hardwood floors throughout! Shared coin-operated laundry in the basement! Heat and cold water included up to $100 each per month. Walk into a large living room\/dining room\/kitchen combo with beautiful light hardwood floors; modern kitchen with upper and lower wood cabinets, formica countertops, and Stainless Steel Appliances including electric range, refrigerator, and microwave! Tile backsplash. Lots of natural light! Walk down and find the modern 3-piece ceramic tile bathroom! Large bedroom with hardwood floors and lots of natural light! 2 ACs! Shared coin-operated laundry in the basement! Tenant pays their own gas and electric and cable\/internet. Heat and cold water included up to $100 each per month, Tenant pays over $100. Tenant pays their own cable\/internet. Sorry, no pets. Sorry no smoking. 1 year lease minimum. 1st, last and security deposit required at lease signing. Potential tenants can apply online at Forrester Property Mgmt - $105 non refundable application fee with two paystubs\/some form income verification and photo ID. If approved, you will be charged a document preparation fee of $100.00. THIS FEE IS NON-REFUNDABLE. Each resident over the age of 18 must submit a separate rental application. Available June 1, 2023. Call or Text Mike Giordano for more info at  show contact info\n!","num_images":11,"lat":39.930207,"lng":-75.166246,"attrs":"['1BR \/ 1Ba', '600ft2', 'available jun 1', 'air conditioning', 'application fee details: $105 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $100', 'apartment', 'laundry in bldg', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:55:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-modern-bed-15\/7611217583.html","post_id":7611217583,"title":"Gorgeous & Modern 3 Bed 1.5 Bath Pennsport Home with Parking! W\/D! C\/A","description":"Gorgeous and Modern 3-Bedroom, 1.5 Bath Pennsport Home with PARKING! Step into an extra wide open living room and dining room combo with hardwood flooring, two large front windows with shutters that bring in a ton of nice natural light and an exposed brick wall. The charming eat-in kitchen features upper and lower cherry wood cabinets, granite countertops, tile backsplash, stainless steel appliances including a gas range, microwave, dishwasher, refrigerator, sink, and garbage disposal and a pantry closet. In the rear you'll find a laundry room with W\/D and tile floor and a door out to the rear yard where you'll find 1-car gated parking and 1-car driveway parking. The second floor features three nice-sized bedrooms with hardwood flooring, nice light and good closet space, in addition to a beautiful full 3-piece ceramic tile bath! The basement features an ideal space for storage; half bath; and all systems. Tenant pays gas, electric, cable\/internet and cold water\/sewer. Available June 1, 2023! Cats and small dogs below 25 lbs. are OK with a non-refundable Pet Fee. Potential tenants can apply online at Forrester Prop Mgmt - $105 non refundable application fee with two paystubs\/some income verification and photo ID. We run a credit, criminal and eviction check. For gross monthly income, we use 3x the monthly rent. If approved, you will be charged a document preparation fee of $100.00. THIS FEE IS NON-REFUNDABLE. Each resident over the age of 18 must submit a separate rental application. 1 year lease minimum. There is a camera system but the Landlord does not have it hooked up, tenant may connect it at their own expense. Contact Mike Giordano for more info at  show contact info\n!","num_images":19,"lat":39.923311,"lng":-75.153244,"attrs":"['3BR \/ 1.5Ba', '1512ft2', 'available jun 1', 'air conditioning', 'application fee details: $105 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $100', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'listed by: Mike Giordano Jr, Forrester Property Mgmt', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T21:02:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-well-kept-2nd-fl-bed-bath\/7611218503.html","post_id":7611218503,"title":"Well-kept 2nd Fl 2 Bed 1 Bath Queen Village Apt! W\/D! Modern bath!","description":"Well-maintained 2nd Fl. 2 Bedroom, 1 Bath Queen Village Apartment with large living room space; eat-in kitchen with nice amount of cabinet space and W\/D; beautiful brand new modern 3 piece ceramic tile bathroom and 2 nice-sized bedrooms with closets. Come see! Radiator Gas Heat. Tenants to supply their own AC UNITs. Cats or Small dogs under 25 lbs. are ok with non-refundable pet fee. Available June 1, 2023! Tenant pays gas, electric, cable\/internet and flat amount towards the cold water bill! 1 year lease minimum. 1st, last and security required at lease signing. $75 non refundable application fee with two paystubs\/some income verification and photo ID. We run a credit, criminal, and eviction check. For gross monthly income, we look for 3x the rent. Come check it out! Please Contact Mike Giordano for more info at  show contact info\n!","num_images":14,"lat":39.939888,"lng":-75.14794,"attrs":"['2BR \/ 1Ba', '800ft2', 'available jun 1', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T21:06:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-come-in-as-stranger-and-stay\/7611073949.html","post_id":7611073949,"title":"Come in as a stranger and stay as a neighbor! 1 Bed\/1 Bath\/948 SqFt","description":"Silk Factory Lofts200 S Line St Lansdale, PA 19446Pricing: $1930\/Month*Bedrooms: 1  Bathrooms: 1 Square Footage: 948 sq ft show contact info\nFeatures in this apartment home:➢ Cable & Hi-Speed Internet Ready➢ Central Air Conditioning➢ Courtyard View in select apartments➢ Dishwasher➢ Full Size Washer & Dryer➢ Large Windows➢ Range \/ Oven➢ Secured Building Access➢ Storage Spaces➢ Upgraded Kitchens in Select ApartmentsAbout the community:  SEE WHAT YOU'VE BEEN MISSING  Discover an upscale lifestyle at Silk Factory Apartments. Our landmark historic building features a brick exterior, soaring ceilings, large windows, and a beautiful courtyard with outdoor lounge seating and firepits, a picnic and grilling area with gas grills, and a community herb garden. Inside your spacious loft-style apartment you'll find modern style from your updated kitchen with dishwasher, stove, refrigerator, and microwave, to central air conditioning, and a private in-home washer and dryer. Call us today for a tour! Amenities at our property:➢ 18' Long Shuffle Board➢ Business Center➢ Dog Wash Room➢ Game Room & Free Wi-Fi➢ Laundry Facilities➢ Monthly Community Events➢ Package Service➢ Pet-Friendly Community➢ Pool Table➢ Vintage Building➢ Beautifully Landscaped Grounds with Access to Local Businesses➢ Close to Montgomeryville Mall and Routes 202 & 309➢ Courtyard featuring tasteful Outdoor Seating and Fire Pits➢ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting➢ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi➢ Free Parking - 2 Spaces per Apartment Home + Guest Parking➢ Lobby Area with Complimentary Coffee➢ Maintenance-Free Lifestyle➢ Professional On-Site Management Team➢ Within Walking Distance to TrainsAdditional information:Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthPets: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephWebsite: https:\/\/www.silkfactoryapts.com\/Phone:  show contact info\n*Prices are subject to change without notice Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYF76CF909050544A5\n","num_images":16,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '948ft2', 'available may 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T13:36:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-sundeck-electronic\/7611065862.html","post_id":7611065862,"title":"Sundeck, Electronic Thermostat, Playground","description":"Call Now -  show contact info\nx 129OR Text 129 to  show contact info\nto text us.This is a 1 Bedroom, 1 Bath, Approximately 632 Sq. Ft. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Features: Disposal, Electronic Thermostat, Patio\/Balcony*, Large Closets with Organizing Systems, Premium Stainless Steel Appliance Package, Cable Ready, Air Conditioner, Gas Range, Hardwood Style Flooring, Selected, Flush Mount Sinks with Goose Neck Faucets, Washer\/Dryer, Dishwasher, Custom Subway Tile Backsplashes, Tons of Natural Lighting Throughout, Stone Counters  *In Select Apartment Homes Community Amenities: Off Street Parking, On-Site Management, Multiple, Expansive Outdoor Spaces, Parisian Style Café with Demonstration Kitchen, Playground, Sundeck, On-Site Maintenance, Elevator, Free Weights, Rooftop Dog Park, BBQ\/Picnic Area, Smoke-Free Community, Covered Parking, Tennis Court, Selected, Garage, Multiple Co-Working Studios, Fitness Center, Courtyard Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. See our property details here:https:\/\/mack.touraptnow.com\/58828pEqual Housing Opportunity 0JC3ATwI1qr\n","num_images":14,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '632ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T13:14:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-laundry-in-unit-central\/7611056970.html","post_id":7611056970,"title":"Laundry in Unit, Central Location, Ideal Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nApartment Features\n* Washer and Dryer in unit\n* Kitchen Island\n* Garden Tub\n* Stainless Steel Appliances\n* Walk-in Closet\n* Private Patio or Private Balcony (on select apartments)\n* Linen Closet","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1110ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T12:51:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-ready-to-lease-beautifully\/7611052520.html","post_id":7611052520,"title":"Ready to lease! Beautifully designed 1 bed 1 bath apartment","description":"Community Location: 200 S Line St - Lansdale, PA 19446 Rental Information: $1736\/Month | 1 Bedroom 1 Bath | 797 sq ftLeasing Options:  3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-Month show contact info\nApartment Amenities:  ◾ Cable & Hi-Speed Internet Ready◾ Courtyard View in select apartments◾ Dishwasher◾ Full Size Washer & Dryer◾ Large Windows◾ Range \/ Oven◾ Refrigerator\/Freezer◾ Secured Building Access◾ Storage Spaces◾ Upgraded Kitchens in Select ApartmentsProperty Features: ◾ 2 Weber Propane Grills◾ Dog Wash Room◾ Elevator◾ Game Room & Free Wi-Fi◾ Laundry Facilities◾ Monthly Community Events◾ Package Service◾ Pet-Friendly Community◾ Smoke-Free◾ Vintage Building◾ Beautifully Landscaped Grounds with Access to Local Businesses◾ Community Lounge featuring free Verizon Fios TV\/Wi-Fi◾ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting◾ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi◾ Free Parking - 2 Spaces per Apartment Home + Guest Parking◾ Lobby Area with Complimentary Coffee◾ Maintenance-Free Lifestyle◾ Professional On-Site Management Team◾ Storage units - $75\/$100 per month◾ Within Walking Distance to Trains Description: SEE WHAT YOU'VE BEEN MISSING  Silk Factory Lofts Apartments offers unique one bedroom, two bedroom, and three bedroom apartment homes in a beautiful setting that combines the comfort of home with exceptional resident services and outstanding community amenities. Options like large windows and storage spaces help you choose one of the apartment homes and create a style that is perfect for you. You will enjoy the convenience of living just minutes from major highways (1-476) and having easy access to transportation, employers, fine dining, parks and recreational areas, cultural events, historic attractions and shopping! By living luxuriously with a maintenance free lifestyle, you will find the serenity and convenience of Silk Factory Lofts Apartments to be your refreshing paradise. Schedule a tour of our beautiful Lansdale apartments today and see why residents love coming home to Silk Factory Lofts.Pets: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephCall: Silk Factory Lofts at  show contact info\nFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYCFB7D8D080894DAD\n","num_images":17,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '797ft2', 'available jun 15', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T12:39:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studios-with-perfect\/7611052201.html","post_id":7611052201,"title":"Studios with a PERFECT LOCATION! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', '\\nsunday 2023-04-16\\n', '\\nmonday 2023-04-17\\n', '\\ntuesday 2023-04-18\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T12:38:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-central-location-upgraded\/7611048961.html","post_id":7611048961,"title":"Central Location, Upgraded Finishes Available, Pet Park","description":"The Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nApartment Features\n* Pantry\n* Ceiling Fan\n* Disposal\n* Private Patio or Private Balcony (on select apartments)\n* Linen Closet\n* Lofty Vaulted Ceilings\n* High Efficiency Lighting Fixtures\n* Roommate Friendly Floor Plan\n* Breakfast Bar\n* Garden Tub\n* Granite Countertops\n* Pre-wired for internet and cable\n* Full sized Washer and Dryer in unit\n* Central Heat and Air\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Walk-in Closet\n* Window Coverings\n* Stainless Steel Appliances","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1138ft2', 'available apr 24', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T12:29:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-incredible-features-resort\/7611048636.html","post_id":7611048636,"title":"Incredible Features, Resort Style Pool, Upgraded Finishes Available","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester is the perfect location for your new home. Explore our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, Den, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nApartment Features\n* High Efficiency Lighting Fixtures\n* Breakfast Bar\n* Stainless Steel Appliances\n* Central Heat and Air\n* Private Patio or Private Balcony (on select apartments)\n* Lofty Vaulted Ceilings\n* Roommate Friendly Floor Plan\n* Full sized Washer and Dryer in unit\n* Garden Tub\n* Pre-wired for internet and cable\n* Linen Closet\n* Disposal\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Window Coverings\n* Ceiling Fan\n* Pantry\n* Granite Countertops\n* Walk-in Closet\nCommunity Features\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Outdoor Grill Area\n* Community Lounge\n* Community Kitchen\n* Billiards\n* EV Charging\n* Sun Deck\n* Long Term Lease Available\n* Controlled Access\n* Gaming Area\n* Minutes from Restaurants, Shopping, and Much More\n* Fitness Studio\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Package Acceptance\n* After-Hours Emergency Maintenance\n* Movie Theatre\n* Garage Parking\n* Renters Insurance is Required\n* WiFi Access\n* Elevator\n* Landscaped Courtyards\n* Credit Cards Accepted\n* Dry Cleaning and Laundry Service\n* Pet Salon\n* Extra Storage\n* TV Lounge\n* Bike Racks\n* Short or Long Term Lease Available\n* Swimming Pool\n* Bark Park\n* Playground\n* Easy Freeway Access\n* Professionally Managed\n* Non Smoking Community","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '785ft2', 'available apr 24', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T12:28:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fitness-center-incredible\/7611046132.html","post_id":7611046132,"title":"Fitness Center, Incredible Features, Central Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nBe the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '815ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T12:21:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-shop-eat-sleep-and-more-at\/7611045584.html","post_id":7611045584,"title":"Shop, Eat, Sleep and More at Park Lane!!","description":"Apt. 2410 — Oxford floor plan — 1,203 sq. ft. — $3,460\nThis 4th floor 2-bedroom\/2-bathroom apartment home has much to offer! It comes upgraded with hardwood LVT flooring, central heat and air, upgraded stainless steel appliances, and a lovely tile backsplash! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive living area is perfect for hosting! This gorgeous apartment has a beautiful view of the Philadelphia skyline. It is also within close proximity to our Clubhouse — featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T12:20:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-charming-bedroom-15\/7611021159.html","post_id":7611021159,"title":"This charming 3 bedroom, 1.5 bathroom home For Rent.","description":"This charming 3 bedroom, 1.5 bathroom home offers a comfortable and inviting living space with plenty of room for a family or for entertaining guests. Upstairs, you will find 3 generously sized bedrooms, ample closet space, and a full bathroom.  Downstairs, the finished basement provides additional living space and storage options and a half bathroom. The basement can be used as a media room, office, or even a home gym, making it a versatile space that can be adapted to suit your needs. The outside of the home is just as impressive as the inside, with a large, meticulously maintained yard that is perfect for outdoor activities and relaxing. Your very own private oasis in the City. Whether you want to host a barbecue or simply enjoy the beautiful scenery, this yard has everything you need to make the most of your time outside. Additionally, the 2 car garage provide convenience and peace of mind. The driveway is shared with 633 Summit. Situated between Ridge Avenue and Henry Avenue allowing for quick access to the main thoroughfares. Minutes from I-76, the Turnpike and the Blue Route makes it convenient to get almost anywhere you need to be.  Walking distance to Andorra shopping Center.  Are you a nature lover? This home is just a couple of blocks from the Schuylkill Center for Environmental Education, the preserved Reservoir and Farimount Park.  Overall, 635 Summit Ave is a must-see property that combines comfort, style, and convenience in one beautiful package. Don't miss out on this amazing opportunity to make this house your dream home!..Any Questions or to set up a private tour Text me*  show contact info","num_images":1,"lat":40.0402,"lng":-75.2231,"attrs":"['3BR \/ 1.5Ba', 'application fee details: *** App fee None (per person) & Processing fee $1 (Refundable)', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T11:12:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-2b-2b-house\/7611033289.html","post_id":7611033289,"title":"Renovated 2B\/ 2B House - Video Available","description":"2 bed\/ 2 bath renovated unfurnished trinity (3-story house for you out-of-towners) available in the charming Fitler Square neighborhood for a 1-year lease starting 07\/01.\nIdeal location for the University of Pennsylvania and Drexel in University City (20 min walk, 8 min bike), and Center City (15 min walk, 6 min bike).\nAmenities include:\n- Central A\/C\n- Dishwasher\n- Garbage disposal\n- Washer\/ Dryer\n- Petit patio\n- 2 Office nooks\n- Basement for storage\n- Ceiling fans\n- Reading lights over the bed\n- Pets negotiable\nAbout me, the owner: recently lef the house to move to the Midwest. The house will be managed by a professional (and reputable) management company, but you will not have to pay a broker's fee.\nPictures are from right after the renovation ~5 years ago. The house is still in good shape, more recent video available for those interested.\n","num_images":7,"lat":39.946501,"lng":-75.180484,"attrs":"['2BR \/ 2Ba', '1300ft2', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T11:48:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wayne-1990-month-st-davids-wayne\/7611027005.html","post_id":7611027005,"title":"$1990\/month - St. Davids\/Wayne - Walking Distance to Giant\/R5 - Quiet","description":"This rental is in St. Davids Park at 500 E Lancaster Avenue, Wayne, PA. It is an upstairs unit.  St. Davids Park is a quiet, primarily residential, condominium community with 4 units in each building.  It is within walking distance (5 minute walk) to Giant and HomeGoods.  It is walking distance to R5 St Davids Station.  It is approximately 970sq feet.  That calculation of square feet does not include a large bonus room.\nRental is being offered for minimum one year lease with preference given to longer lease commitment\nRent includes:\n1.  2 Bedrooms\n2.  1 ensuite bathroom\n3.  1 hallway 1\/2 bath\n4.  Locked outer door with \"buzz in\" intercom\n5.  Hall mailbox and covered location for package delivery\n6.  Private bonus room that is large enough to be a project room\/workout room\/ large storage space\n7.  Water included\n8.  Trash\/Snow removal\n9.  Outdoor parking\n10. Private washer\/dryer in bonus room\n11. Nest thermostat for heat pump HVAC\n12. No EV charging available on property\nRent does not include:\n1. Electricity\/Cable\/Internet\n2. Indoor Parking Space available (one space available): $60\/month\n3. Pets.  Pet will be evaluated on a case by case basis and subject to additional deposit and fee and are subject to condo association rules.\nLandlord\/owner lives within a few miles and is not a management company.  References from current tenant will be available upon request.  Current tenant will vacate condo on May 31st.\nNo smoking\/no incense\/no EV charging\/Lease subject to lessee reviewing and agreeing to condo association rules.  The building is a quiet building.","num_images":11,"lat":40.041727,"lng":-75.372756,"attrs":"['2BR \/ 1.5Ba', '970ft2', 'available jun 1', 'apartment', 'w\/d in unit', 'no smoking', 'detached garage', 'rent period: monthly']","posted_date":"2023-04-16T11:30:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-redefining-luxury-at-park\/7611023471.html","post_id":7611023471,"title":"Redefining Luxury at Park Lane!!","description":"Apt. 1401 — Trafalgar floor plan — 1,452 sq. ft. — $3,945\nThis large 4th floor corner apartment has so much to offer! This apartment home includes LVT flooring throughout the spacious living area, central heat and air, a spacious laundry room, stainless steel appliances, a large private balcony, and ample storage space. The master bedroom is equipped with a spacious walk-in closet and generously-sized bathroom with double vanity sinks. The guest bedroom and bathroom are spacious, as well! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T11:19:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautiful-large\/7611010740.html","post_id":7611010740,"title":"This beautiful large 4 bedroom 1 bath home","description":"Johnny Ramos\n5 5 1 2 9 6 5 8 9 5\nThis beautiful large 4 bedroom 1 bath home is ready for move-in. Gorgeous hardwood floors throughout with high ceiling plenty of lighting and ample closet space. This home also features a nice size yard and large basement that can be used for additional common area space to accommodate a work space, exercise area, or simple storage. There is no washer and dryer but one can be installed. Tenant is responsible for water usage, and snow removal. Schedule your appointment after submitting the house application form today!\nThis home is non-smoking, pets are on a one on one basis. Parking is street parking. Snow Removal and water usage is paid by tenant. Exterminator is paid by tenant. Any repairs needed must be reported as soon as possible.\nContact Johnny Ramos:5 5 1 2 9 6 5 8 9 5\n5 5 1 2 9 6 5 8 9 5\nHouse address:4424 N 16th St, Philadelphia, PA 19140\n","num_images":4,"lat":40.021094,"lng":-75.151961,"attrs":"['4BR \/ 1Ba', 'available now', 'EV charging', 'air conditioning', 'broker fee details: Backgrounc check', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'listed by: Rent by owner', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T10:40:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-15-bath-renovated-with\/7610992175.html","post_id":7610992175,"title":"3 BR 1.5 bath renovated with central air - FURNISHED","description":"Renovated and FURNISHED 3 bedroom 1.5 bath home on a beautiful one-way street in the Spruce Hill \/ Kingsessing neighborhood, just blocks from Baltimore Avenue, Kingsessing playground and Clark Park. 15 minute walk to SJU\/USciences and a 25-30 minute walk to Upenn \/ HUP \/ CHOP. Farmers Market every Saturday at Clark Park, all year round! Walk 1 block to the route 13 trolley or R3 regional rail line. This home has been renovated from top to bottom, with beautifully refinished floors throughout, brand new kitchen with ceramic tile and granite and bathrooms with ceramic tile and subway tiled shower. Central air and a huge outdoor living space finishes off this beautiful home. Street parking readily available! Note that the owners are a couple that travels 75% of the time and plan to use the basement and garage for storage, sleeping quarters for 5-10 days a month. Some furniture can be removed, depending on situation. Various lease terms can be worked out, including a 6-12 month lease converting to month to month. No smoking on premises. Pets acceptable with approval and additional deposit.","num_images":22,"lat":39.943771,"lng":-75.219402,"attrs":"['3BR \/ 1.5Ba', '1670ft2', 'available may 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T09:32:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-house\/7610998777.html","post_id":7610998777,"title":"Newly Renovated House Available Now !!","description":"Newly Renovated House Available Now\nUpgraded Kitchen\nNew Butcher Block Countertops\nSoft Closing Cabinets\nStainless Steel Appliance Package includes stove, fridge, microwave, AND dishwasher\nDryer currently onsite\nWasher Hookups\nBeautiful Accent Wall in livingroom\nUpgraded Light Fixtures\nNew Hardwood Engineered Flooring Throughout\nUpgraded Bathroom\nNew Roof\nNew Central HVAC\nBasement Parged & Drylocked; great storage option\nFront Porch\nPrivate Backyard\nWALKABILITY:\n5min walk or 2min car ride to the local shopping plaza that hosts:\nSave-A-Lot supermarket, The Laundry Cafe, Dollar Tree, Taco Bell and Lukoil gas station across the st.\nIn the opposite direction you'll find the infamous Sid Bookers within a 4min walk, Only 7min drive to the Einstein Hospital with Girls High across the street, and public trans options are only a 2min walk\n(If you are interested send me your mobile number for more detail. Thank You)\n","num_images":4,"lat":39.9227,"lng":-75.1812,"attrs":"['2BR \/ 1Ba', '970ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T09:58:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/clifton-heights-bedroom-apartment\/7611005414.html","post_id":7611005414,"title":"1 bedroom apartment","description":"1 bedroom apartment\nRecently renovated\nLarge closet space\nAll utilities included\nNo credit check required\nFirst and last months rent and security","num_images":4,"lat":39.928039,"lng":-75.283642,"attrs":"['1BR \/ 1Ba', '750ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T10:21:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nicely-and-beauty-bedroom\/7611002924.html","post_id":7611002924,"title":"NICELY AND BEAUTY 1 BEDROOM 1 BATH APARTMENT IN","description":"NICELY AND BEAUTY 1 BEDROOM 1 BATH APARTMENT IN Philadelphia - NEWLY RENOVATED 1 BEDROOM, 1 BATH APARTMENT IN STATE COLLEGE. WATER, SEWER, TRASH SERVICE, AND COMMON AREA MAINTENANCE INCLUDED. TENANTS PAY FOR ELECTRICITY. LAUNDRY ROOM ON PREMISES. DESIGNATED PARKING. WALKING DISTANCE TO SHOPPING, SCHOOLS, PARKS, ETC. $520\/MONTH. AVAILABLE NOW! THIS UNIT IS A GROUND FLOOR, CORNER UNIT. if you are interested Please Text: jessica77884gmailcom","num_images":3,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T10:12:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-theres-no-place-like-home-at\/7610979435.html","post_id":7610979435,"title":"There’s No Place Like Home at Green Forest Apartments","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T08:28:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-disposal-gas-range-bbq\/7611004090.html","post_id":7611004090,"title":"Disposal, Gas Range, BBQ\/Picnic Area, Air Conditioner","description":"The Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Call Now -  show contact info\nx 128OR Text 128 to  show contact info\nto text our team.Use the link below for more details:https:\/\/mack.touraptnow.com\/745wi1 Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree.This is a 2 Bedroom, 2 Bath, Approximately 954 Sq. Ft. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia. Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMEqual Housing Opportunity ISgi1NFko7\n","num_images":13,"lat":40.0118,"lng":-75.2342,"attrs":"['2BR \/ 2Ba', '954ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T10:16:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fresh-clean-bedroom-bath\/7610994680.html","post_id":7610994680,"title":"Fresh & Clean 2 bedroom\/1 bath apartment","description":"Fresh & Clean 2 bedroom\/1 bath apartment for rent in a Duplex - 2 Family home in Plymouth Meeting, Pennsylvania. Updated kitchen with new appliances (new oven & refrigerator will be supplied before move in), granite countertops and a freshly painted interior. Full Laminate flooring through-out and a brand new washer and dryer in your apartment. Bathroom floor will also be redone upon move in. Home just had new plumbing installed throughout entire house in December 2022, new concrete leading into apartment in the summer of 2022, new flooring put in summer 2022. Conveniently and centrally located in Plymouth Meeting just a short 5 minute travel to entertainment\/ shopping\/ restaurants in Conshohocken and Norristown, less than 10 minutes to King of Prussia, and 25 minutes to Philadelphia. The square footage of this apartment is 1,037 and the apartment has 2 separate entrances with street parking in the front of the property and street parking in the back.","num_images":3,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T09:43:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-air-conditioner-gas-range\/7611001491.html","post_id":7611001491,"title":"Air Conditioner, Gas Range, Premium Stainless Steel Appliance Package","description":"The Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Use this link for more info:https:\/\/mack.touraptnow.com\/7302na Call Now:  show contact info\nx 127OR Text 127 to  show contact info\nto text our team.Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree.This is a 1 Bedroom, 1 Bath, Approximately 745 Sq. Ft. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia. Features - Washer\/Dryer  - Gas Range  - Cable Ready  - Selected  - Dishwasher  - Tons of Natural Lighting Throughout  - Flush Mount Sinks with Goose Neck Faucets  - Electronic Thermostat  - Patio\/Balcony*  - Premium Stainless Steel Appliance Package  - Custom Subway Tile Backsplashes  - Air Conditioner  - Hardwood Style Flooring  - Large Closets with Organizing Systems  - Stone Counters  - Disposal *In Select Apartment Homes Community Amenities - Fitness Center  - Multiple Co-Working Studios  - Sundeck  - Multiple, Expansive Outdoor Spaces  - Tennis Court  - On-Site Maintenance  - Courtyard  - Selected  - BBQ\/Picnic Area  - Rooftop Dog Park  - Covered Parking  - Elevator  - Free Weights  - Parisian Style Café with Demonstration Kitchen  - Smoke-Free Community  - Garage  - Off Street Parking  - Playground  - On-Site Management Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMPet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Equal Housing Opportunity 5KV4gbU8\n","num_images":10,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '745ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T10:07:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-remarkable-value\/7610997898.html","post_id":7610997898,"title":"Remarkable Value. Unbeatable Location. Available 2nd Floor 1 Bed!","description":"The Gateway Apartments1515 Manley Rd West Chester, PA 19380Pricing: $1883 - $2560\/Month*Bedrooms: 1  Bathrooms: 1 Square Footage: 779 sq ft show contact info\nFeatures in this apartment home:● Air Conditioning & Heating● Cable Ready● Den● Dining Room● Dishwasher● High Speed Internet Access● Refrigerator, Freezer, Ice Maker● Trash Compactor● Walk-In Closets● Window Coverings● Built-In Computer Nook (select homes)● Frost-Free Refrigerator\/Ice Maker● Garden\/Spa Tub (select homes)● Kitchen Pantry● Large Windows● Private Entrance To Each Unit● Upgrade● Vaulted Ceiling (select homes)● Wired For High-Speed Internet● Wooded View\/Pool View (select homes)About the community:  Exclusive features, including a resort-style pool with a sun deck and a 24-hour fitness center, are what make us the best apartment homes in the West Chester, PA area. Whether you want to spend a tranquil afternoon enjoying our beautiful landscapes or invite people over for a social function in our clubhouse, our community has something to offer everyone. Secure gated entrances and 24-hour maintenance provide the residents of our pet-friendly apartments with peace of mind. If you are searching for luxury West Chester apartment homes or are simply looking to relocate to the East Goshen Township area, come tour our wonderful apartments. Offering the best apartments in the area, we will help you feel right at home. Whatever you desire in life, find it at The Gateway Apartments.Please take our virtual tour\nhttps:\/\/my.matterport.com\/show\/?m=4RkQ1PobBkE&brand=0 Amenities at our property:● Business Center● Clubhouse● Fitness Center● Onsite Maintenance● Onsite Management● Package Service● Picnic and Grilling Area● Pool and Sundeck● Storage Space● Walking\/Biking Trails● Across From Wawa & Goshen Crossing Shopping Center● Garages For Lease● Gated Entrances● Maintenance Free Lifestyle● Onsite Leasing Office● Relaxing Fire Pit● Resort-Style Pool With Sun Deck● Storage Units For Lease● Three BBQ\/Picnic Areas● Wi-Fi Access in Clubhouse and at PoolAdditional information:Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthPets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonWebsite: https:\/\/www.thegatewayapartments.com\/Phone:  show contact info\n*Prices are subject to change without notice All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY970F506CB0054A\n","num_images":21,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '779ft2', 'available apr 29', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T09:55:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom-bathroom\/7610995326.html","post_id":7610995326,"title":"Renovated 1 Bedroom, 1 Bathroom","description":"Fully renovated one bedroom one bathroom. Located near multiple public transportation options. One block away (5 min walk) to the supermarket, playground with a pool and other amenities. Stainless steel appliances and new flooring.\nPlease call us at  show contact info\nfor a walk through.\n","num_images":8,"lat":39.9612,"lng":-75.2303,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T09:45:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-lovely-bedroom-bathroom-waiting\/7610976608.html","post_id":7610976608,"title":"Lovely 2 Bedroom \/ 1 Bathroom… Waiting for You to Make it Home!","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T08:10:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-available-now-beautiful-bedroom\/7610976421.html","post_id":7610976421,"title":"Available Now – Beautiful 2 Bedroom \/ 1 Bathroom","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T08:08:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-with-backyard\/7610982138.html","post_id":7610982138,"title":"1 Bedroom with Backyard","description":"A very nice 1 bedroom apartment. The apartment includes a private backyard. Laminate hardwood floors and Tiles throughout.\nIn the middle of being updated.\nWasher and dryer in the building.\nConvenient location. 1 blocks to Tasker-Morris Subway stop. Short walk to Passyuqnk Walk, South Philadelphia Tap Room, American Sardine, South Street, and Rittenhouse Square. Walking distance to Center City. Free off street parking.\nCats\/Dogs are ok with a $250 non-refundable fee per pet.\n1st month, Last month and Security deposit required. We will be running a credit and background check.\nText or Email to schedule a showing.\nshow contact info","num_images":20,"lat":39.930799,"lng":-75.170844,"attrs":"['1BR \/ 1Ba', 'available may 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T08:44:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/fort-washington-beautiful-and-charming\/7610979707.html","post_id":7610979707,"title":"Beautiful and charming 2BD\/1BTH House for rent","description":"This 2 BR, 1 Bath Apt in Home converted to Triplex Serene Neighborhood Open & convenient floor plan 2 BR, 1 Bath Approximately 750+ square ft. NEW kitchen-white cabinets ALL NEW Appliances, including MW over Glass-Top Stove Laundry Room on premises with access from locked access from backyard 1 Off-Street Parking place-NO Commercial Vehicles allowed Street parking available AVAILABLE Additionally: 2+ Car Garage (Storage only) available","num_images":11,"lat":40.145005,"lng":-75.214685,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T08:30:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-listed-bed-25-bath\/7610972109.html","post_id":7610972109,"title":"JUST LISTED! 3 BED 2.5 BATH HOUSE, A\/C, PARKING, IN UNIT W\/D & MORE!!!","description":"6207 Wayne Ave. – 3 bed 1.5 bath house - H\/W floors, Central Air, Private backyard, In unit W\/D & off-street parking! $2349\/month\nCome see why so many people are calling Germantown home!! Located on Wayne Ave. within walking distance of the Fairmount Park towpath, Ultimo Coffee & MORE! This location is teeming with new and classic businesses from restaurants to small boutiques.\nLovingly maintained 3-bedroom 2.5 bath house with off street parking and more! Open floor plan in your living and dining area with hardwood flooring. Excellent light pours into the bay windows at the front of the house, perfect for your morning coffee! Updated kitchen with new tile flooring, stainless steel microwave, dishwasher and oven. Enjoy entertaining with your bar height kitchen island with room for seating.\nGet comfortable upstairs featuring three large bedrooms each with closet space with plenty of room for wardrobe and sneaker collection. Primary bedroom is a suite with private bathroom and shower.\nOff-street parking with garage space, and private backyard space perfect for hosting!\nFully finished basement with half bathroom and laundry room. CENTRAL AIR for those hot sticky days of summer!\nFeaturing:\n3 bedrooms\n2.5 bath\nStove\nDishwasher\nFull sized refrigerator\nMicrowave\nWasher & dryer\nCentral Air\nOff-street parking\nFull basement storage\nAND MORE!","num_images":16,"lat":40.036027,"lng":-75.186295,"attrs":"['3BR \/ 2.5Ba', 'available sep 1', 'application fee details: $50.00 per applicant', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T07:35:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-looking-for-2-bedroom\/7610976356.html","post_id":7610976356,"title":"Looking for a 2 Bedroom?","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1.5Ba', '1050ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T08:08:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-remodeled-bedroom\/7610974404.html","post_id":7610974404,"title":"REMODELED 1 BEDROOM APARTMENT BREWWEYTOWN W DECK!","description":"REMODELED, MODERN ONE BEDROOM APARTMENT IN HEART OF BREWERYTOWN (3R)\nAvailable for a August 6th move in!\nFor $1,225\/month rent, you get:\nNew stainless steel fridge, range\/oven and microwave.\nModern kitchen w\/ white Carrera porcelain, granite, and garbage disposal.\nFloor to ceiling white Carrera bathroom w\/ high-end glass shower door.\nModern light oak wood floors.\nWasher\/Dryer in unit\nRecessed lighting w\/ dimmers\nCentral-air, A\/C\nIntercom System\nRear deck\nBuilding has cameras in front and rear\nGreat location, within one or two blocks of The Monkey & The Elephant Cafe, Crime and Punishment Brewery, Ryebrew, Green Eggs Cafe, and Le Cat Cafe.\nWalking distance to Fairmount Park and Avenue and the Art Museum.\nUtilities not included. Water not included.","num_images":17,"lat":39.974672,"lng":-75.183834,"attrs":"['1BR \/ 1Ba', 'available aug 6', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T07:54:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fantastic-move-in\/7610971117.html","post_id":7610971117,"title":"Fantastic move-in condition 3 bedroom 2 bath plus sun room for rent~!~","description":"Be the first resident to live in this completely renovated 3-bed and 1.5 bath Mt. Airy townhome just a block from Germantown Ave. Enjoy all new hardwood floors, luxury kitchen. central AC and heating, main floor laundry and half bath with custom shelving, new windows throughout, fans in each bedroom, large walk in closet in main bedroom and a newly fenced private backyard for dinner with friends. Pets considered. 1st month and one month deposit upfront. Please email with interest. We will require W2 or 1099, recent pay stubs , and information for a background check. We will do our best to respond to each inquiry and will remove the listing once a tenant is selected.","num_images":4,"lat":40.0547,"lng":-75.1866,"attrs":"['3BR \/ 2Ba', '\\nsunday 2023-04-16\\n', 'application fee details: Application fees 75% per adult', 'broker fee details: Realtors and real estate brokers commission $75', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'listed by: Coldwell Banker', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T07:26:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-spacious-bedroom-in-chester\/7610972854.html","post_id":7610972854,"title":"Spacious 1 Bedroom in Chester","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4,"lat":39.869764,"lng":-75.36767,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T07:42:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-beautiful-bedroom\/7610972932.html","post_id":7610972932,"title":"Beautiful 1 Bedroom","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4,"lat":39.870027,"lng":-75.368185,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T07:42:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/brookhaven-the-best-bedroom-in-chester\/7610972598.html","post_id":7610972598,"title":"The Best 1 Bedroom in Chester","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4,"lat":39.869632,"lng":-75.368614,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T07:40:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-beautiful-bedroom\/7610972673.html","post_id":7610972673,"title":"Beautiful 1 Bedroom","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4,"lat":39.869698,"lng":-75.368013,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T07:40:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-wallingford-estates-apartments\/7610972773.html","post_id":7610972773,"title":"Wallingford Estates Apartments Has Availability","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4,"lat":39.869764,"lng":-75.367842,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T07:41:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-house\/7610970469.html","post_id":7610970469,"title":"Newly Renovated House Available Now","description":"Newly Renovated House Available Now\nUpgraded Kitchen\nNew Butcher Block Countertops\nSoft Closing Cabinets\nStainless Steel Appliance Package includes stove, fridge, microwave, AND dishwasher\nDryer currently onsite\nWasher Hookups\nBeautiful Accent Wall in livingroom\nUpgraded Light Fixtures\nNew Hardwood Engineered Flooring Throughout\nUpgraded Bathroom\nNew Roof\nNew Central HVAC\nBasement Parged & Drylocked; great storage option\nFront Porch\nPrivate Backyard\nWALKABILITY:\n5min walk or 2min car ride to the local shopping plaza that hosts:\nSave-A-Lot supermarket, The Laundry Cafe, Dollar Tree, Taco Bell and Lukoil gas station across the st.\nIn the opposite direction you'll find the infamous Sid Bookers within a 4min walk, Only 7min drive to the Einstein Hospital with Girls High across the street, and public trans options are only a 2min walk\n(If you are interested send me your mobile number for more detail. Thank You)\nCellphone number : show contact info\nText or call the above phone number for more details.\n","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T07:20:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom-in\/7610966952.html","post_id":7610966952,"title":"Renovated 2 bedroom in Germantown","description":"BEAUTIFULLY renovated 2 Bed \/ 1 Bath apartment In a great area!\nThe apartment features:\n-King sized bedrooms\n-Equipped kitchen\n-Brand NEW stainless steel appliances\n-Microwave\n-Hardwood floors\n-High ceiling\n-Ample closet space\n-Lots of windows with tons of natural light\n-WASHER \/ DRYER IN UNIT !!\nLocated in Germantown, across the street from Cliveden Park, which offers jogging and bike trails. Steps away from Washington Lane stop.\nNon-Smoking.\nPets case by case\nWater and trash covered in rent. Tenants pay for electric and gas.\nGet in touch today to schedule a viewing!","num_images":12,"lat":40.050609,"lng":-75.177447,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T06:40:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/croydon-stunning-3bd-for-rent\/7610958704.html","post_id":7610958704,"title":"Stunning 3BD for rent","description":"Recently remodeled Single Story Home with a basement and detached gagrage on a large lot!!!  Renovated home inside and out! Featuring high end upgrades and finishes, with new siding, doors and roof! New stainless steel appliances, granite countertops.   Some other notable features of the home include brand new central HVAC. There is no timeframe to submit offers. Seller will consider all offers as they come.","num_images":20,"lat":40.0933,"lng":-74.8991,"attrs":"['3BR \/ 1Ba', '1200ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-04-16T03:41:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/conshohocken-newly-refinished-natural\/7610960249.html","post_id":7610960249,"title":"Newly refinished natural hardwood flooring 3BD\/2BTH House for rent","description":"Welcome home to this twin home in the heart of Conshohocken Borough, which is located on a quiet street in the upper avenues. As you enter the home you are greeted by a bright and airy entryway with cedar ceilings which is currently serving as a home office\/entry way. As you walk in you will notice that the house is equipped with central air conditioning. The first floor of this home is very open and offers newly refinished natural hardwood flooring! All new windows throughout the house have been installed in February 2023. All rooms have been equipped with brand new recessed LED lighting throughout the home. The living room opens into the bright formal dining area which leads right into the kitchen. The kitchen is completely updated with granite countertops, brand new white cabinetry, high end stainless steel appliances, and plenty of storage. The kitchen also serves to be spacious enough for a breakfast table. Through the kitchen is the conveniently located updated laundry room\/mudroom and also attached is a completely updated full bathroom with a vaulted cedar ceiling. The upper level also boasts refinished hardwood flooring throughout and is home to three bedrooms, each with their own full sized closet space as well as a fully updated hallway bathroom with a tub\/shower and walnut accent wall. There are two nicely sized hallway linen\/storage closets as well! There is a finished basement that offers extra living space as well as extra storage space in the two back rooms. Off the rear of the home is a back deck\/patio with two tiers. Freshly painted! There is a wood fence in the backyard that continues to the side yard. Feel free to plant your very own garden with the best area for sunshine. This backyard is the perfect place for that morning cup of coffee or evening glass of wine by the fire with some of the best views that Conshohocken has to offer. Finally you will see this home is located on the corner lot which always provides ample parking on Jones! The location of this home cannot be beat. Within walking distance to parks, coffee shops, all of the restaurants and nightlife that Conshohocken has to offer, as well as the Spring Mill Septa Station for a short ride into the city! Pets are negotiable Lawn care is negotiable First and last month with -security deposit is required All applicants will be required to have credit score checked Start date is flexible! Must be before July 1st!","num_images":15,"lat":40.079141,"lng":-75.292981,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T04:19:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bristol-wonderful-3bd-for-single-family\/7610958936.html","post_id":7610958936,"title":"Wonderful 3BD for single family available for rent","description":"902 Warren Street in historic Bristol Borough could possibly be considered one of the most all-around perfect single-family homes available for purchase!  This 1600+  square foot home, with two levels and a walk-out basement, is a perfect size if you are looking to increase OR decrease your living space.  When you arrive home here at 902 Warren Street, you are greeted with a quaint front porch that leads into the main level of the home. The living room, with multiple huge windows allowing for loads of natural light, has a higher ceiling and open floor plan which flows right into the kitchen, where you will find additional windows and an updated style that's sure to please complete with all the amenities you'd expect to find in an eat-in kitchen. From the kitchen, you can access a generously sized bonus room, presently used as an office and a full bathroom which makes the bonus room perfect for an array of additional uses like a 4th bedroom or a  study\/library,  whatever the need- this bonus room is most likely perfect.  The kitchen is also  where you can access the full unfinished basement with access to the outside. The basement is where the laundry area is located, along with ample storage space.  The upper level is where you will find 3 generously sized bedrooms and a full bathroom to make the home complete.  This home has been perfectly maintained so that all you need to do is move right in and start living.  Scheduled showings will begin on Saturday.","num_images":12,"lat":40.1159,"lng":-74.8536,"attrs":"['3BR \/ 2Ba', '1671ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-04-16T03:46:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bristol-intriguing-3bd-for-lease\/7610958308.html","post_id":7610958308,"title":"Intriguing 3BD for lease","description":"WOW.... This is the one you have been waiting for!! Welcome to 603 Bath Street in the Bristol Borough offering 3 bedrooms, 2 full bathrooms and almost 1,800 square feet! This home is in move-in ready condition and awaits its new owners! As you enter the home you will immediately fall in love! The main level features a lovely living room, spacious dining room, luxurious kitchen and full bathroom. The second level features two generously sized bedrooms and one full bathroom. The third level features a massive forth bedroom. The lower level is an unfinished basement offering plenty of storage space! Enjoy the corner lot & very spacious backyard. So much to offer and will not last! Call to schedule a private showing today!","num_images":17,"lat":40.1159,"lng":-74.8536,"attrs":"['3BR \/ 2Ba', '1796ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-04-16T03:32:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-washington-square-one-bed\/7610951606.html","post_id":7610951606,"title":"Washington Square One Bed For June","description":"Top floor 1 bedroom, located on the 4th floor of a historic brownstone, located across the street from Washington Square Park. Laundry in the unit and pets are welcome, with one time $250 pet fee (two pet max). This unit is for an early June to July 1st move-in date. Unit is occupied 24 hours notice is needed to show. Please text for the quickest response","num_images":13,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1.5Ba', '800ft2', 'available jun 3', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-04-16T01:36:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-duplex\/7610942590.html","post_id":7610942590,"title":"+++Beautiful 3 bedroom duplex Home for rent.+++","description":"contact on: IF INTERESTED PLEASE SEND ME YOUR NUMBER  , For More Information\nPennsylvania (PA) Zip Code Map - Locations, Demographics ; Zip code 19102\nBeautiful 3 bedroom duplex Home for rent. Heat and water included in rent. Newer cabinets, plenty of kitchen cabinet space, stainless steel appliances, laminate flooring throughout. with neutral-colored carpeting. Very affordable rent available May 1st or earlier, onsite parking is available. Centrally located close to schools, shopping, city center and public transportation Updated kitchen with newer cabinets and counter tops. Refinished hardwood floors. Stove, dishwasher, refrigerator, washer and dryer included. Newer windows. Street parking only. Utilities are include in rent. Rent is $1095per month plus utilities, however, heat and water are included in the rent so tenant is paying for electricity and whatever internet provider (If any) that they choose to use. The unit is available for occupancy at noon on May 1, 2023.\n","num_images":10,"lat":39.9489,"lng":-75.1661,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T00:02:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/drexel-hill-townhouse-for-rent\/7610918291.html","post_id":7610918291,"title":"Townhouse for rent","description":"2 Bedroom 1 Bath, 2nd floor apartment. Brand new kitchen and Bathroom. Refinished Hardwood floors. Washer, Dryer and refrigerator. NO PETS\nUnit is approximately 600 sq ft. Owner's requirements- Credit based residential score of at least 650 and approximately $1150 weekly income. $60 application fee per adult. Available April 20th move in. Due at signing 1st month, last month and 1 month security. Owner is related to Agent.\n","num_images":7,"lat":39.9503,"lng":-75.304,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-04-15T21:29:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cute-2nd-fl-south-philly\/7611214987.html","post_id":7611214987,"title":"Cute 2nd Fl South Philly 1 Bed Apt w\/ H\/W fls, C\/A, & more! Nice space","description":"Cute 2nd fl. South Philadelphia 1 Bedroom Apt! H\/W Fls and Central Air! Large Living Room\/Dining Room combination with hardwood floors. Nice kitchen with wood cabinets and appliances including gas range and refrigerator. Good amount of counter top and cabinet space. Nice-sized bedroom with closets. Beautiful 3-piece ceramic tile bathroom! Nice windows with lots of natural light! Cats and small quiet dogs (less than 25 lbs.) are OK with a one-time non-refundable pet fee. Central Air and Heat! First, last, and security deposit required at lease signing. 1 year lease minimum. Applicant must first fill out an application with two recent pay stubs\/some income verification, copy of photo ID, and non refundable $75 application fee. Tenant is subject to credit check, criminal and eviction check. For gross monthly income, we look for 3x the rent. Sorry no smoking. Sorry no W\/D. Available mid May 2023! Tenant pays gas, electric, and cable\/internet. For showings, please call\/text Mike Giordano at  show contact info\n!","num_images":9,"lat":39.921977,"lng":-75.171943,"attrs":"['1BR \/ 1Ba', '700ft2', 'available may 15', 'air conditioning', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:51:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-bed-15-bath\/7611213933.html","post_id":7611213933,"title":"Modern 2 Bed 1.5 Bath Passyunk Square Home! W\/D! Yard! C\/A! And more!!","description":"WOW! New and Modern Passyunk Square 2 Bedroom, 1.5 Bath Home located just blocks from the fabulous restaurants and shops that East Passyunk has to offer. Look at that beautiful front...sleek and modern. Walk in to a large living room\/dining room combo with hardwood floors; half bath off of the kitchen; and gorgeous clean exposed brick. Beautiful floating staircase! Modern kitchen with a good amount of cabinet and countertop space, subway tile backsplash, stone countertop and stainless steel appliances including a gas range, dishwasher, microwave and refrigerator. Nice-sized rear yard that is perfect for entertaining! The basement is full and unfinished but very clean with all sound mechanicals and W\/D! Great for storage. The 2nd floor has 2 nice-sized bedrooms with closets and hardwood floors. Gorgeous tiled bathroom with glass enclosed tiled shower. This place is stunning! It has it all! Central Air and Heat. Nice amount of window space and natural light! Make your appointment today! Cats and small quiet dogs (less than 25 lbs.) are OK with a non-refundable pet fee. First, last, and security deposit required at lease signing. 1 year lease minimum. Applicant must first fill out an application with two recent pay stubs\/some income verification, copy of photo ID, and non refundable $75 application fee. For gross monthly income, we look for 3x the rent. Each person over 18 yr old has to fill out an application. Tenant is subject to credit check, criminal and eviction check. Available now! Move-in date is flexible. Tenant pays gas, electric, cold water\/sewer and cable\/internet. Contact Mike Giordano for more info at  show contact info\n!","num_images":24,"lat":39.928024,"lng":-75.155971,"attrs":"['2BR \/ 1.5Ba', '900ft2', 'available now', 'air conditioning', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'listed by: Mike Giordano, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:46:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom-in\/7611215485.html","post_id":7611215485,"title":"Renovated 1 Bedroom in NoLibs with Laundry and Central Air","description":"1 bedroom apartment with MAPLE HARDWOOD flooring, QUARTZ COUNTER kitchen with STAINLESS STEEL appliances and custom BUILT IN SHELVING throughout. The apartment has a beautiful tile bathroom and full LAUNDRY ROOM. Living room and bedroom are separated by CONTEMPORARY POCKET DOORS. Built-in split system heating and cooling with remote controls.","num_images":6,"lat":39.963964,"lng":-75.146441,"attrs":"['1BR \/ 1Ba', '550ft2', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:53:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2br-1ba-with-patio-for\/7611213729.html","post_id":7611213729,"title":"2BR\/1BA with Patio for July\/August at 338 S. 6th St!","description":"Available July\/August!\nCall or text Annie at  show contact info\nwith any questions or to set up a showing!\nRequirements\nCredit must be in good standing. FICO score and credit history will be reviewed. Monthly income must exceed 3x the rent. No evictions or serious crimes. We only require the security deposit and first month's rent to move in (no last month's rent upfront!) In the event you don't meet the credit or income requirements, cosigners can be considered.\nAddress: 338 S. 6th St #A\nThis property is professionally managed by AMC Delancey Group.\nAll of our buildings have the option to come furnished for an additional monthly cost.\nDescription\nThis 2BR\/1BA apartment is located in the heart of Society Hill. Features include hardwood floors throughout, private patio, central air, in-unit laundry area, and a great layout. Located within walking distance to Dottie's Donuts, Acme, Philadelphia Sports Club\/Gym, Penn Hospital, and Washington Square Park.\nPet Policy\nWe are pet friendly! No breed or weight restrictions - just a one-time fee of $250\/pet. Water is included in the rent. Only security deposit and first month's rent needed to move in! Credit requirements apply.\nContact Annie to schedule a showing!\nAnnie Oliver\nAMC Delancey\nshow contact info\n- text me!\n","num_images":8,"lat":39.944254,"lng":-75.151848,"attrs":"['2BR \/ 1Ba', 'available jul 7', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-16T20:45:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/drexel-hill-efficiency-1br-apt\/7611188275.html","post_id":7611188275,"title":"Efficiency 1BR APT","description":"This is a Small Jr one bedroom locate in DH. This is on top of a commercial strip. This is a one person unit. We do a credit and background check. Must have good credit. Please do not call of your credit is questionable. First Last and one month security requires.  priced  at $725.00 plus utilities. Email for more Info.","num_images":7,"lat":39.952712,"lng":-75.304731,"attrs":"['1BR \/ 1Ba', '575ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T19:10:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom-in\/7611212446.html","post_id":7611212446,"title":"Renovated 1 Bedroom in Fishtown with Laundry and Central Air","description":"Beautifully renovated 1 Bedroom apartment in FISHTOWN right on FRANKFORD AVE with lots of NATURAL LIGHT, WASHER\/DRYER in unit, GRANITE countertop, HARDWOOD FLOORING, STAINLESS STEEL APPLIANCES, HEATING\/AC. Perfect for a couple or individual.","num_images":12,"lat":39.980014,"lng":-75.129168,"attrs":"['1BR \/ 1Ba', '700ft2', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:40:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wyncote-wyncote-a-cozy-br-ba-aptapply\/7611206975.html","post_id":7611206975,"title":"~@wYnCoTe, P\/A*\/-Cozy 3 bR, 1 & ½ bA aPt@Apply TO-DAY!!! READY TO RENT","description":"Cozy 3 bedroom, 1 & ½ bathroom apartment in Wyncote, PA . Fully furnished, basement with washer and dryer. Off-street parking. No smoking, no pets. Apartment freshened up, newly painted and ready for you. Off street parking. Electric heat. Electric stove. Cable ready. Relax on the front porch with other residents. Income requirement of $2,000 per month gross income to qualify. Rent $1,049.00 per month. It has been upgraded throughout. New paint, new carpet and new vinyl plank flooring. The kitchen has been upgraded with new quartz countertops and new stainless steel appliances. Other great features include: private front patio, central AC and heat, Apply TODAY! SE RENTA STUDIO CON ENTRADA PRIVADA PARA UNA PAREJA INCLUYE REF ESTUFA UTILIDADES $1049\/Mo, Very affordable rent available MAY 1st!!! Please send your phone number for more details.","num_images":3,"lat":40.0867,"lng":-75.1524,"attrs":"['3BR \/ 1.5Ba', 'application fee details: App Costing---$29.99 each PERSON 18+\/*no prior evictions', 'broker fee details: Broker fees---$14.99 at Move In now', 'furnished', 'apartment', 'w\/d in unit', 'listed by: !!Coldwell Banker!!', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:17:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom-in\/7611210327.html","post_id":7611210327,"title":"Renovated 1 Bedroom in NoLibs with Deck, Central Air and Laundry","description":"Renovated 1 Bed \/ 1 Bath apartment located on a great central block in Northern Liberties. The apartment has been beautifully renovated and boasts plenty of NATURAL LIGHT. It includes an outdoor PRIVATE DECK, CENTRAL HVAC, WASHER \/ DRYER and STAINLESS STEEL APPLIANCES","num_images":16,"lat":39.961662,"lng":-75.144178,"attrs":"['1BR \/ 1Ba', '650ft2', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:31:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cobbs-creek-area\/7611207441.html","post_id":7611207441,"title":"Cobbs Creek Area","description":"Bright and beautiful spacious 3 bedroom house for rent, all modern, new kitchen\/updated bathroom, beautiful hardwood flooring, great for public transportation and all new Cobbs Creek Park with hiking\/biking trails..  Available now!  Call Ed @  show contact info\n.","num_images":0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', '1200ft2', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:19:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-bedroom-1bath\/7611203212.html","post_id":7611203212,"title":"Brand New 2 bedroom, 1bath apartment located in Philadelphia","description":"Brand New 2 bedroom, 1bath apartment located in Philadelphia . Fully furnished, basement with washer and dryer. Off street parking. No smoking, pets ok. Apartment freshened up, newly painted and ready for you. Off street parking. Electric heat. Income requirement of $2000 per month gross income to qualify. Rent $685 per month. It has been upgraded throughout. New paint, new carpet and new vinyl plank flooring. The kitchen has been upgraded with new quartz countertops and new stainless steel appliances. Other great features include: private front patio, central AC and heat, Apply TODAY! SE RENTA STUDIO CON ENTRADA PRIVADA PARA UNA PAREJA INCLUYE REF ESTUFA UTILIDADES $750. This sophisticated Apartment is complete WITH SPACIOUS BEDROOM and living area, plenty of closet space and on site washer\/dryer. Engineered sound proof wall and FLOOR SEPARATION IS PRESENT in all units as well as SECURITY SYSTEM WIRING AND cable wiring for all main rooms. Option is available to add a storage locker and\/or bike storage in the dedicated garage space Take your pick of completely remodeled rentals! There is a parking lot in the back for parking, and there will be a motorized gate installed to the parking lot as well and a grill area. No smoking, and a small pet could be considered with landlord approval. Excellent credit is required (must be over 500) and no prior evictions. Easy to show. Pets ok. So If you'd like to take a look, be sure Text me:::: jessica85160gmailcom","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:04:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/conshohocken-riverwalk-area\/7611205389.html","post_id":7611205389,"title":"Riverwalk Area","description":"Bright and beautiful 1 bedroom apartment, all modern, frig, dw\/gd, hardwood\/cermic\/vinyl flooring, washer & dryer in unit, potential off street parking, 2 blocks from the train station and all near the Riverwalk Apartment Complex with hiking\/biking trails leading to Philadelphia's Kelly Drive.  Available now!  Call Ed @  show contact info","num_images":0,"lat":40.0825,"lng":-75.3044,"attrs":"['1BR \/ 1Ba', '800ft2', 'available apr 21', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T20:11:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-freshly-painted\/7611181249.html","post_id":7611181249,"title":"This freshly painted 3 bedroom,2 bathroom homEE","description":"**OPEN HOUSE SATURDAY 4\/15 FROM 1PM-3PM** Welcome to East Pleasant Street, voted one of the cleanest blocks in the city!   This well maintained property does not disappoint and has been maintained by the same owners for over 25 years.   This freshly painted 3 bedroom, 1.5 bathroom & partially finished basement with central air is awaiting it's new family!  Relax with coffee or tea on the front patio, set up a children's playroom in the basement, or gather together to watch Philadelphia's sports teams. This home is a 10 minute walk from shopping, public transportation and playgrounds.   Property will be active on 4\/14 with showings beginning 4\/15 after the scheduled Open House.I will call you if you respond with your phone number and state that you are sincerely interested.","num_images":4,"lat":40.0547,"lng":-75.1866,"attrs":"['3BR \/ 2Ba', '1236ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T18:47:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-renovated-bedrooms\/7611188009.html","post_id":7611188009,"title":"Fully renovated 2 bedrooms, 1 Bath apartment in (philadelphia)","description":"Fully renovated 2 bedrooms, 1 Bath apartment. Washer and Dryer in the unit. Located in the beautiful, family friendly East Passyunk Crossing neighborhood. Less than a 4-minute walk to the shops, restaurants & nightlife of Passyunk Square. Conveniently located to public transportation along Broad Street. If you interested please Text your phone number.","num_images":4,"lat":39.9207,"lng":-75.1595,"attrs":"['2BR \/ 1Ba', 'available now', 'air conditioning', 'application fee details: Per persons $24.95 Refundable Credit report and Background', 'broker fee details: Fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Rental LLC', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T19:09:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/chalfont-absolutely-gorgeous-bedroom\/7611197954.html","post_id":7611197954,"title":"Absolutely Gorgeous 3 Bedroom 1 1\/2 Bath Townhouse For Rent!","description":"For rent in desirable Lindenfeild neighborhood, is this polished and updated 3 bedroom, 1.5 bath townhome located on a cul de sac lane. The home is practically next door to North Branch Park and Chestnut Street Park! There are walking trails and 3 playgrounds to get that breathe of fresh air every day. The home boasts a bright kitchen with granite countertops, elegant tile backsplash, smart lighting, recessed lights, stainless steel appliances, and direct access to the large deck. The kitchen is open to the dining room area which flows nicely into the living room. All luxury vinal planking flooring on the first floor and neutral paint. A powder room bathroom completes this floor. Upstairs there are 3 bedrooms a bathroom and access to the attic for additional storage space. Each bedroom has a ceiling fan, large closets, recessed lights and beautiful hardwood floors. The main bedroom has 3 large closets. The bathroom is a jack-n-jill style with access from the hallway or the main bedroom. The full bathroom has double sinks, tiled tub\/shower surround, curved shower rod, large shower head and ceramic flooring. Here you’ll find the easy access to the washer and dryer as well. Enjoy the spring, summer and fall seasons outside on the deck with natural privacy on 2 sides and fence panels on the other. For additional storage, there’s a tall garden shed on the deck. Flower beds add to the warmth of this home at both the front and the back of the house. The HOA community takes care of the lawn and common areas as well as the snow plowing. Close to Chalfont and Doylestown stores, shops, restaurants, parks, museums and Lake Galena at Peace Valley Park. Septa’s regional rail Chalfont Station is 1 mile from this home.  Sorry, but no pets.","num_images":12,"lat":40.2892,"lng":-75.2149,"attrs":"['3BR \/ 1.5Ba', '1440ft2', 'air conditioning', 'townhouse', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T19:44:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/chester-newly-rehabbed-3br-house\/7611138367.html","post_id":7611138367,"title":"Newly Rehabbed 3BR House","description":"Newly Rehabbed three bedroom one bath house. Hardwood floor through out. clean dry basement! Hurry and run to see.\nTenant pays all utilities and snow removal, pest control, and trash removal.\n","num_images":14,"lat":39.859516,"lng":-75.349103,"attrs":"['3BR \/ 1Ba', '1054ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T16:29:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ardmore-newly-renovated-bedroom\/7611158805.html","post_id":7611158805,"title":"Newly renovated 1 bedroom apartment in Ardmore!","description":"One Bedroom in Ardmore - Newly renovated 1 bedroom apartment in Ardmore. Only a five minute walk to the Ardmore train station (R-5 line). Many restaurants and shops within walking distance as well (walkable score of 87 out of 100). This one bedroom unit has brand new everything. The kitchen boasts granite countertops, white shaker style cabinetry, and stainless steel appliances. The apartment has 1.5 bathrooms and in unit laundry. The living room can double as a guest room by simply closing the beautifully restored pocket doors. Out back there is a small patio that is great for entertaining. Off-street parking is available. One year lease minimum at $700 per month. No pets allowed. $30 application fee.No Pets Allowed.Only with your phone number is required. I will text you for more information.","num_images":4,"lat":40.002,"lng":-75.2966,"attrs":"['1BR \/ 1.5Ba', 'furnished', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T17:31:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ardmore-renovated-bedroom-bath-house\/7611159514.html","post_id":7611159514,"title":"Renovated 4 Bedroom \/ 1 Bath House For Rent!","description":"Great Ardmore Location! - Renovated 4 Bedroom \/ 1 Bathroom Twin Home is Move-In Ready - Very Convenient Location in Ardmore!Renovation Includes:- Newer Kitchen Cabinets- Newer Appliances,- Newer Flooring Throughout- Newer Lighting- Newer Bathroom- Large Front & Back YardConveniently Located on Ardmore Ave, Walking Distance to all of the Shops, Dining & Entertainment that Ardmore has to offer!Next door to brand new $700 townhouses!For more information or if there are any questions you might have, feel free to contact me. Leave a name and number.","num_images":4,"lat":40.002,"lng":-75.2966,"attrs":"['4BR \/ 1Ba', 'air conditioning', 'furnished', 'townhouse', 'w\/d hookups', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T17:33:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-mt-airy-apartment-2-beds\/7611165642.html","post_id":7611165642,"title":"Mt. Airy Apartment. 1\/2 beds","description":"Spacious apartment. Previous tenant used it as a 2 bedroom.\nThe apartment was just recently painted throughout.\nGreat neighborhood and off street parking.\nLarge rear yard and friendly neighbors.\nThis is the 1st floor of a triplex apartment.\nPlease text with any questions. I will not answer any phone calls due the the volume of calls.\nThere will be a form that will need to be filled out so I can gather information.","num_images":24,"lat":40.068422,"lng":-75.161837,"attrs":"['2BR \/ 1Ba', '800ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T17:54:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-516-church-st-second\/7611151813.html","post_id":7611151813,"title":"516 N Church St, \/\/(Second floor)**Rent:$730+SDP...@@","description":"Renovated second floor Two bedroom with private entrance.\nVery nice kitchen fully applianced with dishwasher and microwave.\nBig modern bath with closet. Hardwood floors in kitchen.\nOne car off street parking and coin op laundry in the basement,\nTenant pays gas heat, electric hot water, and lights.\nGood rental history required and proof of income.\nLocation in 516 N Church St, West Chester, PA!\nRent:$730+SDP...\nAvailable on May 15th...\nI WOULD LOVE TO SPEAK WITH YOU. CAN YOU SEND ME A NUMBER TO DISCUSS MORE DETAILS.","num_images":4,"lat":39.9845,"lng":-75.5962,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T17:09:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/thorndale-its-all-about-charm-and\/7611130419.html","post_id":7611130419,"title":"It's all about charm and character.","description":"It's all about charm and character with this solid old log home. Private setting in rear overlooking pool and valley. Spring house and large shed that is workshop, with electric. Updated kitchen with professional Delonghi stove. Rear enclosed porch could be laundry future bath. Upstairs 2 bedrooms. 1st floor family room was used as bedroom. Finished walk out basement has 1\/2 bath. Original Chestnut logs thought to date to 1750's.","num_images":12,"lat":39.970403,"lng":-75.727133,"attrs":"['2BR \/ 1Ba', '2000ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T16:07:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1b-1b-available-for-sublet\/7611141823.html","post_id":7611141823,"title":"1B\/1B available for sublet till September 2023","description":"Lovely 1 bedroom 1 bathroom apartment available near City Avenue, right next to a bus stop. The apartment is neat and clean and is in good condition. Parking is also available. Apartment complex has a gym and is pet friendly. Apartment comes with a gas stove, dishwasher, fridge and microwave. Building has an elevator. AC and heat is provided by the building. Comes with Xfinity wiring.\nRent is $1,300 per month which is a steal for this area. Grocery stores and Bala Cynwyd shopping complex is easily accessible. Lease can be transferred till September and can then be renewed for a full year.","num_images":3,"lat":39.9845,"lng":-75.2282,"attrs":"['1BR \/ 1Ba', 'available may 31', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T16:39:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nicely-and-beauty-bedroom\/7611131996.html","post_id":7611131996,"title":"NICELY AND BEAUTY 1 BEDROOM 1 BATH","description":"NICELY AND BEAUTY 1 BEDROOM 1 BATH APARTMENT IN philadelphia - NEWLY RENOVATED 1 BEDROOM, 1 BATH APARTMENT IN STATE COLLEGE. WATER, SEWER, TRASH SERVICE, AND COMMON AREA MAINTENANCE INCLUDED. TENANTS PAY FOR ELECTRICITY. LAUNDRY ROOM ON PREMISES. DESIGNATED PARKING. WALKING DISTANCE TO SHOPPING, SCHOOLS, PARKS, ETC. $520\/MONTH. AVAILABLE NOW! THIS UNIT IS A GROUND FLOOR, CORNER UNIT. if you are interested Please Text: lucy85828gmailcom","num_images":1,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'furnished', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T16:11:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-bathroom\/7611135718.html","post_id":7611135718,"title":"Large 2 Bedroom 1 Bathroom Condo In Fairmount","description":"This large condo spans three levels with beautiful features including large windows, exposed brick, and natural light. There are also fantastic views of the Philadelphia skyline. The location is central to the Fairmount neighborhood with walkability to many neighborhoods gems.\nCurrently the condo has radiator heat and window A.C. units which is reflected in the rental price. No extra\/surprise fees. Pets are welcome.\nI am looking for a short-term lease (3-6 months) but am flexible to your situation.","num_images":13,"lat":39.967199,"lng":-75.167632,"attrs":"['2BR \/ 1Ba', '1150ft2', 'available may 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T16:21:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-bedroom-bath\/7611127681.html","post_id":7611127681,"title":"Nice 1 bedroom, 1 bath apartment located in Philadelphia.","description":"Nice 1 bedroom, 1 bath apartment located in Philadelphia. basement with washer and dryer. Off-street parking. No smoking, ok pets. Apartment freshened up, newly painted and ready for you. Off street parking. Electric heat. Electric stove. Cable ready. Relax on the front porch with other residents. Income requirement of $1500 per month gross income to qualify. Rent $700 per month. It has been upgraded throughout. New paint, new carpet and new vinyl plank flooring. The kitchen has been upgraded with new quartz countertops and new stainless steel appliances. Other great features include: private front patio, central AC and heat, Close to award winning schools, parks, freeways, shopping, dining and entertainment. Won't last long. Apply TODAY, Applicants are required to complete credit\/background check application fee $29.95 details! SE RENTA STUDIO CON ENTRADA PRIVADA PARA UNA PAREJA INCLUYE REF ESTUFA UTILIDADES $700,Text me show contact info","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T16:00:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-cozy-bedroom-bath-apartment\/7611128329.html","post_id":7611128329,"title":"Cozy 2 bedroom, 1 bath apartment located in Philadelphia.","description":"Cozy 2 bedroom, 1 bath apartment located in Philadelphia. basement with washer and dryer. Off-street parking. No smoking, ok pets. Apartment freshened up, newly painted and ready for you. Off street parking. Electric heat. Electric stove. Cable ready. Relax on the front porch with other residents. Income requirement of $1500 per month gross income to qualify. Rent $820 per month. It has been upgraded throughout. New paint, new carpet and new vinyl plank flooring. The kitchen has been upgraded with new quartz countertops and new stainless steel appliances. All utilities are included in the rent. No security deposit is required. And totally pets friendly. Won't last long. Apply TODAY, Applicants are required to complete credit\/background check application fee $1 details! SE RENTA STUDIO CON ENTRADA PRIVADA PARA UNA PAREJA INCLUYE REF ESTUFA UTILIDADES $820,Newly remodeled. Walk to the Hospital, ferries and restaurants within minutes. All utilities included except trash and internet, no smoking. Serious inquiries only . Easy to show. Pets ok. So If you'd like to take a look, be sure Text me:::: alishaaa368𝐆𝐦𝐚𝐢𝐥com","num_images":4,"lat":39.9579,"lng":-75.2681,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T16:02:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-bedroom-bath\/7611126905.html","post_id":7611126905,"title":"Cozy ++ 1 bedroom, 1 bath apartment located in Philadelphia+++","description":"Cozy !!!!!++(@@@) 1 bedroom, 1 bath apartment located in Philadelphia. Fully furnished, basement with washer and dryer. Offstreet parking. No smoking. Apartment freshened up, newly painted and ready for you. Off street parking. Electric heat. Electric stove. Cable ready. Relax on the front porch with other residents. Income requirement of $1500 per month gross income to qualify. Rent $600 per month. It has been upgraded throughout. New paint, new carpet and new vinyl plank flooring. The kitchen has been upgraded with new quartz countertops and new stainless steel appliances. Other great features include: private front patio, central AC and heat, Close to award winning schools, parks, freeways, shopping, dining and entertainment. Won't last long. Apply TODAY! SE RENTA STUDIO CON ENTRADA PRIVADA PARA UNA PAREJA INCLUYE REF ESTUFA UTILIDADES $600. TEXT ME NUMBER.","num_images":4,"lat":39.9925,"lng":-75.1415,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T15:58:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedrooms-with-perfect\/7611121807.html","post_id":7611121807,"title":"Two Bedrooms with a PERFECT LOCATION! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N American St Suite 101\nPhiladelphia Pa 19122\nBedrooms:2\nBathrooms:2\nSquare Footage:1088-1261 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 2BR floor-plans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1,"lat":39.971179,"lng":-75.140092,"attrs":"['2BR \/ 2Ba', '1128ft2', 'available now', '\\nsunday 2023-04-16\\n', '\\nmonday 2023-04-17\\n', '\\ntuesday 2023-04-18\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T15:43:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-luxury-premier\/7611106274.html","post_id":7611106274,"title":"BRAND NEW Luxury Premier ~ 2 Bedroom","description":"Cozy 2 bedroom, 1 bath apartment located in philadelphia. basement with washer and dryer. Off-street parking. No smoking, ok pets. Apartment freshened up, newly painted and ready for you. Off street parking. Electric heat. Electric stove. Cable ready. Relax on the front porch with other residents. Income requirement of $750 per month gross income to qualify. Rent $820 per month. It has been upgraded throughout. New paint, new carpet and new vinyl plank flooring. The kitchen has been upgraded with new quartz countertops and new stainless steel appliances. Other great features include: private front patio, central AC and heat, Close to award winning schools, parks, freeways, shopping, dining and entertainment. Won't last long. Apply TODAY, Applicants are required to complete credit\/background check application fee $1 details! SE RENTA STUDIO CON ENTRADA PRIVADA PARA UNA PAREJA INCLUYE REF ESTUFA UTILIDADES $820,Text me","num_images":5,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T15:00:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-1st-floor-upgraded-bd\/7611111083.html","post_id":7611111083,"title":"1st Floor Upgraded 1 BD\/1BATH! Easy Access to Apartment Home!","description":"Community Location: 1515 Manley Rd - West Chester, PA 19380 Rental Information: $2004 - $2704\/Month | 1 Bedroom 1 Bath | 842 sq ftLeasing Options:  3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthUpgraded ApartmentApartment Amenities:  − Air Conditioning & Heating− Cable Ready− Dining Room− Dishwasher− Garbage Disposal− High Speed Internet Access− Trash Compactor− Tub\/Shower− Walk-In Closets− Window Coverings− Built-In Computer Nook (select homes)− Disability Access (select homes)− Gas Fire Place (select homes)− Kitchen Pantry− Mini Blinds On All Windows− Private Entrance To Each Unit− Upgrade− Washer And Dryer In Each Apartment Home− Wired For High-Speed Internet− Wooded View\/Pool View (select homes)Property Features: − Business Center− Clubhouse− Fitness Center− Onsite Maintenance− Onsite Management− Package Service− Picnic and Grilling Area− Pool and Sundeck− Storage Space− Walking\/Biking Trails− Across From Wawa & Goshen Crossing Shopping Center− Beautifully Landscaped Grounds− Gated Entrances− Onsite Leasing Office− Pet-Friendly− Relaxing Fire Pit− Resort-Style Pool With Sun Deck− Storage Units For Lease− Three BBQ\/Picnic Areas− Wi-Fi Access in Clubhouse and at Pool Description: Residents of our West Chester, PA apartments enjoy a spacious one or two bedroom floor plan which adds warmth and comfort to any lifestyle. The Gateway provides a number of lavish amenities, including a full kitchen, 9-foot ceilings, walk-in closets, and large windows. Our premier location is close to public transportation and the most prominent dining, shopping, and recreational venues in the area, making our community perfect for commuters all across Chester County. Schedule a tour of our West Chester community today and see why residents love coming home.Pets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonCall: The Gateway Apartments at  show contact info\nFacebook: https:\/\/www.facebook.com\/TheGatewayApartmentsAParadiseManagementCommunity\/ Website: https:\/\/www.thegatewayapartments.com\/All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY66333F8967D246\n","num_images":18,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '842ft2', 'available apr 18', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T15:13:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/collegeville-groundkeepers-apartment\/7611105458.html","post_id":7611105458,"title":"groundkeeper's apartment utilities included","description":"1 bedroom apartment. Rent reduced in exchange for gardening and property maintenance work at $22.50 per hr..\n2 hours per week required, more hours available if wanted. Utilities and Wifi included\n","num_images":8,"lat":40.1913,"lng":-75.4373,"attrs":"['1BR \/ 1Ba', '500ft2', 'available may 1', 'EV charging', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T14:58:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bristol-beautiful-move-in-ready-3br\/7611087915.html","post_id":7611087915,"title":"Beautiful move in ready 3br","description":"Beautiful Move in Ready, 3 bed 1 and 1\/2 Bath Rehabbed home. All new stainless steel kitchen Appliances with built in dishwasher and microwave. New kitchen cabinets. New hard wood laminate flooring, new carpets, new ceiling fans, new freshly painted, new tile back splash, electrical system has been upgraded and up to codes. There is a back yard in which the rear of the yard has room for a driveway to be put in, no fighting over street parking. A view of Silver lake is also an extra to the home. There is a full unfinished basement also. Take a nice stroll to the river front park.","num_images":13,"lat":40.1159,"lng":-74.8536,"attrs":"['3BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-04-16T14:12:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-washer-dryer-smoke-free\/7611100602.html","post_id":7611100602,"title":"Washer\/Dryer, Smoke-Free Community, Multiple, Expansive Outdoor Spaces","description":"Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Call Now:  show contact info\nx 130OR Text 130 to  show contact info\nto contact our leasing team.Use the link below for more details:https:\/\/mack.touraptnow.com\/1hpe7yThis is a 1 Bedroom, 1 Bath, Approximately 650 Sq. Ft.Features - Electronic Thermostat  - Flush Mount Sinks with Goose Neck Faucets  - Patio\/Balcony*  - Dishwasher  - Stone Counters  - Gas Range  - Air Conditioner  - Selected  - Hardwood Style Flooring  - Premium Stainless Steel Appliance Package  - Disposal  - Washer\/Dryer  - Custom Subway Tile Backsplashes  - Large Closets with Organizing Systems  - Cable Ready  - Tons of Natural Lighting Throughout *In Select Apartment Homes Community Amenities - Parisian Style Café with Demonstration Kitchen  - Smoke-Free Community  - On-Site Management  - BBQ\/Picnic Area  - Covered Parking  - Off Street Parking  - Playground  - Sundeck  - Tennis Court  - Elevator  - On-Site Maintenance  - Rooftop Dog Park  - Multiple Co-Working Studios  - Courtyard  - Multiple, Expansive Outdoor Spaces  - Fitness Center  - Free Weights  - Selected  - Garage Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMThe Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Equal Housing Opportunity uNQ9Uj2W2\n","num_images":11,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '650ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T14:45:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedrooms-with-perfect\/7611098203.html","post_id":7611098203,"title":"One Bedrooms with a PERFECT LOCATION! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:760-800 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '767ft2', 'available now', '\\nsunday 2023-04-16\\n', '\\nmonday 2023-04-17\\n', '\\ntuesday 2023-04-18\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T14:39:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-professionally-managed\/7611091433.html","post_id":7611091433,"title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nWhen you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1075ft2', 'available apr 24', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T14:21:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-well-maintaned-bed-bath\/7611057413.html","post_id":7611057413,"title":"Well maintaned 2 bed 2 bath & Granite Countertops with Cabinetry","description":"Welcome to this beautiful end unit condominium in the highly desired 55+ neighborhood of Gwynedd Commons in Upper Gwynedd Township. As you enter the home, it will be love at first sight. The home features 2 bedrooms, 2 full bathrooms, eat-in kitchen, a second-floor loft, a garage and new carpeting throughout.  Not to mention the 9 foot ceilings and recessed lighting. You can sell that lawn mower and leaf blower before you move in as the Gwynedd Commons association maintains the lawn, snow and seasonal clean up giving you the free time you deserve. As you enter the home you will step into the warm and cozy living room that has beautiful gas fireplace and plantation shutters. Just off the kitchen is the stunning eat-in kitchen with stainless steel appliances, black granite countertops, 42” Cherry cabinetry, two pantries and beautiful hardwood floors.  The dining area is a good size for family dinners and entertaining with access to the well-maintained deck.  Crown molding and chair rails surround the kitchen and dining area. Just off the kitchen is the main level laundry with plenty of storage and access to the garage. Two very large bedrooms are on the first floor with 2 full bathrooms. The primary bedroom is carpeted with recessed lighting, a walk-in closet and 3-piece on-suite bathroom. The other bedroom is very roomy with carpeting and a closet.  One the second floor is a loft that is a perfect place for a hobby room, theatre space, office, or another space for guests to stay over.  The basement is full sized with ample storage space. The location of Gwynedd Commons is close to shopping, restaurants, and major arteries such as 476 and Sumneytown Pike for an easy commute.  Lansdale provides so many activities including First Fridays, farmers market, parades, and main street is lined with restaurants.  This home goes on the market on 4\/13 so book your appointment to see this house soon. It will not last. SEND NUMBER FOR MORE INFORMATION","num_images":4,"lat":40.2378,"lng":-75.2955,"attrs":"['2BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-16T12:52:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-stainless-steel-appliances\/7611089356.html","post_id":7611089356,"title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Garden Tub\n* Walk-in Closet\n* Kitchen Island\n* Washer and Dryer in unit\n* Private Patio or Private Balcony (on select apartments)\n* Linen Closet\n* Stainless Steel Appliances\n[#9652977]","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-16T14:16:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-price-drop-one-month-free\/7611082467.html","post_id":7611082467,"title":"PRICE DROP! ONE MONTH FREE! WOW! 2 BED 1 BATH, W\/D, YARD & MORE!!!!!!!","description":"4833 Germantown Ave #1  – 2 bed 1 bath apartment w\/private entrance & in-unit laundry! $1199\/month\nONE MONTH FREE RENT!\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co. or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nExcellent spacious 2 bed 1 bathroom first floor apartment with private entrance.  Eat – in kitchen with gas stove and full-sized refrigerator. Boasting hardwood flooring throughout, bedrooms offer plenty of room. Living space is large featuring bay windows and classic fireplace mantle. Exclusive access to basement and storage purposes.\nLaundry is a breeze with your own in unit washer & dryer!\nFeaturing:\n2 bedrooms\n1 bathroom\nGas stove\nFull sized refrigerator\nFull basement storage\nHardwood floors\nPrivate entrance\nIn Unit Laundry\nAND MORE!","num_images":12,"lat":40.028245,"lng":-75.162125,"attrs":"['2BR \/ 1Ba', 'available may 1', 'application fee details: $50.00 per applicant', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T13:58:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-price-drop-one-month-free\/7611082499.html","post_id":7611082499,"title":"PRICE DROP! ONE MONTH FREE! 3 BED 1.5 BATH, W\/D IN UNIT, A\/C & MORE!!!","description":"5046  Germantown Ave #1  – 3 bed 1.5 bath apartment w\/private entrance & in-unit laundry! $1299\/month\nONE MONTH FREE RENT!\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co., or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nTerrific 3 bed 1.5 bath 1st floor apartment. Large open concept living space with. Three spacious bedrooms with closet storage. Full sized 3-piece bathroom with tub\/shower, vanity and toilet. Eat-in kitchen with stainless steel appliances including dishwasher, microwave & gas stove.\nLaundry is a breeze with convenient laundry room! CENTRAL AIR! keeping you cool in the summertime!\nFeaturing:\n3 bedrooms\n1.5 bathroom\nCentral Air\nGas stove\nMicrowave\nDishwasher\nEat – in kitchen\nFull sized refrigerator\nPrivate entrance\nIn-unit laundry\nPrivate yard\/patio space\nAND MORE!","num_images":14,"lat":40.029945,"lng":-75.164949,"attrs":"['3BR \/ 1.5Ba', 'available may 1', 'application fee details: $50.00 per applicant', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-16T13:58:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-available-2bd-2bath-look\/7611079577.html","post_id":7611079577,"title":"Available 2BD\/2BATH! Look & Lease and Receive a Yeti Cooler!","description":"The Gateway ApartmentsVisit Our Community Today!1515 Manley Rd West Chester, PA 19380  show contact info\nConveniently located in prestigious Chester County, The Gateway offers unique one and two bedroom apartments with den options in a beautiful setting. Commbine the comforts of home with superior resident services and amenities such as our resort style pool, business center, fitness center, and walking trail.Bedrooms: 2 |  Bathrooms:  2  Square Footage: 1199 sq ft Rental Pricing: $2431 - $3152\/Month  Our Residents Enjoy:  ✓ Business Center✓ Clubhouse✓ Fitness Center✓ Onsite Maintenance✓ Onsite Management✓ Package Service✓ Picnic and Grilling Area✓ Pool and Sundeck✓ Storage Space✓ Walking\/Biking Trails✓ Across From Wawa & Goshen Crossing Shopping Center✓ Beautifully Landscaped Grounds✓ Garages For Lease✓ Maintenance Free Lifestyle✓ Onsite Leasing Office✓ Pet-Friendly✓ Relaxing Fire Pit✓ Storage Units For Lease✓ Three BBQ\/Picnic Areas✓ Wi-Fi Access in Clubhouse and at Pool This Unit Comes With: ✓ Air Conditioning & Heating✓ Alarm✓ Carpet✓ Dining Room✓ Dishwasher✓ Garbage Disposal✓ Refrigerator, Freezer, Ice Maker✓ Tub\/Shower✓ Walk-In Closets✓ Window Coverings✓ Built-In Computer Nook (select homes)✓ Built-In Microwave Oven✓ Frost-Free Refrigerator\/Ice Maker✓ Gas Fire Place (select homes)✓ Large Windows✓ Mini Blinds On All Windows✓ Upgrade✓ Washer And Dryer In Each Apartment Home✓ Wired For High-Speed Internet✓ Wooded View\/Pool View (select homes)Website: https:\/\/www.thegatewayapartments.com\/ Phone-Number:  show contact info\nPet-Policy: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonLease-Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthCall for Directions  All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYFC0F0603CBEC49\n","num_images":16,"lat":39.967056,"lng":-75.529129,"attrs":"['2BR \/ 2Ba', '1199ft2', 'available now', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T13:50:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wilmington-north-brandywine-amazing\/7611034566.html","post_id":7611034566,"title":"North Brandywine- Amazing 3 bedroom 1 bathroom apartment in Wilmington","description":"Amenities included: updated kitchen and updated bathroom. Utilities included: heat, gas and water. It's pet friendly. Date Available: May 1st 2023. $900\/month rent. $900 security deposit required","num_images":4,"lat":39.7378,"lng":-75.5497,"attrs":"['3BR \/ 1Ba', '1250ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-16T11:52:14-0400"}]