[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-sunny-bedroom\/7489641800.html","post_id":7489641800,"result_date":"2022-05-28 23:16","title":"Large, sunny 1 bedroom apartment in West Philly","description":"Available May 31, 2022 with open house on Tuesday May 31 from 6:00-7:30pm: large, sunny 1 bedroom apartment in West Philly on 50th Street.\nThe apartment is the entire second floor of an approximately 100-year-old house. The street entrance and hallway up to the 3rd floor entrance is shared with only the third floor resident.\nThe apartment features:\n- Large living room with tall ceilings, original refinishing hardwood floors and custom trim, large  panel of west-facing windows, 2-zone dimmable lighting, variable speed fan with remote, and AC unit\n- Medium bedroom with tall ceilings, original refinished hardwood floors and custom trim, tall closet for storage, north and east-facing windows (one is original to house and is working, one ir recent replacement), dimmable lights, variable-speed fan with light and remote, AC unit, and walk-out to roof\n- Custom kitchen, with granite countertops, stainless appliances, gas stove with an exhaust fan venting outside, a Bosch dishwasher, built-in microwave, sink disposal, tile backsplash, variable-speed fan with light and remote, custom-built trim for cabinets, working original wood windows, AC unit, and a small breakfast nook area with south and north facing windows\n- Renovated bathroom with tile shower with custom niche, sliding glass door, tiled floor and walls, Toto toilet, solid surface sink with four drawers for storage, medicine cabinet with mirror and integrated side panel lighting, dimmable ceiling lighting, including lighting in shower, towel shelf, built-in wall storage shelves, exhaust fan and privacy window\n- In-unit washer\/dryer\n- Radiant heat throughout (not forced air)\n- Solid wood doors with vintage brass hardware\n- Wireless doorbell\n- French door separating living room from rear of apartment (great for work from home or shared living situations)\n- Coat closet and hallway closet for storage\n- Dedicated hot water heater and boiler with individual utility account (resident only pays for their specific use for electric and natural gas)\n- Heavy wood door at entrance, and brightly-lit hallway with skylight\nThe neighborhood features:\n- Baltimore Avenue commercial corridor about 10 blocks south, with lots of pedestrian amenities including Clark Park and Cedar Park, Dock Street Brewery and Mariposa Co-op\n- Aldi nearby at 46\/Market\n- Ten-minute connections to Center City (six stops), or 15 minute to Old City via SEPTA stations at 46th or 52nd Street stations nearby, or via Route 21 (Chestnut east, Walnut going west) or Route 42 (Spruce St)\n- CHOP Karabots and KIPP school\n- CVS at 49th\/Market\n- Malcolm X Park at 52nd and Osage\n- mixed of PPA permitted and non-permitted street parking for cars\nFloor plan: the apartment opens to a hall with the living room to the left, bathroom straight ahead and kitchen to the right. The living room has a french door that can be closed for privacy - great for work-from-home situations or shared living situations. The hall includes the coat closet and the washer\/dryer. The bedroom is accessed via the kitchen and has a door to the roof deck.\nThe apartment has only hardwood floors or tiled floors. There is no carpet anywhere.\nThe apartment floor is insulated from the third floor above, so the noise level is lower than you might expect for an old house.\nThe house allows some pets, at the owner’s discretion.\nThe current resident on the third floor is a young professional and has been there for nearly five years.\nThe first floor resident is an elderly resident who has lived there for over 10 years.\nApartment is managed by the owner who is responsive to maintenance issues and lives nearby.\nThe apartment is available Tuesday May 31, 2021, with an open house happening the same day - Tuesday May 31 - from 6:00-7:30pm. Virtual viewings and more photos will be available soon.\nThe lease is offered on a yearly basis. Preference may be given to applicants who are interested to sign a 2 year lease.\nThis is 2022, and this is an equal housing opportunity, regardless of color, orientation or national origin. You will be more than welcome as a resident if you can appreciate living in a 100 year home, demonstrate respect for the other residents and the property itself, and be thoughtful and considerate regarding noise (residents on the other floors have lived there for at least five years).\nIf interested, please reply to this post and include some information about yourself and what brings you to West Philly. To confirm you read to the bottom of the ad, please mention your favorite color in the subject or body of your email (or a cool fact about you, something interesting you learned recently, or anything that shows you read to the end).","num_images":22.0,"lat":39.957227,"lng":-75.221397,"attrs":"['1BR \/ 1Ba', 'available may 31', '\\ntuesday 2022-05-31\\n', 'air conditioning', 'application fee details: $35 fee paid directly to screening company', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T23:11:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/completely-renovated-bedrooms-bathrooms\/7489634259.html","post_id":7489634259,"result_date":"2022-05-28 22:33","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bd-ba-apartment-in-downtown\/7489631404.html","post_id":7489631404,"result_date":"2022-05-28 22:28","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-3bed\/7489616896.html","post_id":7489616896,"result_date":"2022-05-28 22:06","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bd-ba-apartment-in-downtown\/7489622680.html","post_id":7489622680,"result_date":"2022-05-28 21:36","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-apartment-for-rent-near\/7489607938.html","post_id":7489607938,"result_date":"2022-05-28 20:35","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-deluxe-furnished\/7489607474.html","post_id":7489607474,"result_date":"2022-05-28 20:33","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bed-apartment-in\/7489602676.html","post_id":7489602676,"result_date":"2022-05-28 20:16","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-beautiful-bed-bat-house\/7489594909.html","post_id":7489594909,"result_date":"2022-05-28 19:50","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-beautiful-bed-bat-house\/7489594910.html","post_id":7489594910,"result_date":"2022-05-28 19:50","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-4241-ridge-ave-great\/7489586260.html","post_id":7489586260,"result_date":"2022-05-28 19:22","title":"4241 Ridge Ave #A, Great location in East Falls","description":"Sunny, Bi-level, 1 bedroom, 1 bath, approximately 750 sq.ft. $1095. Available now. Great location in East Falls, walking distance to coffee shops, such as Thunder Mug and Vault and Vine, restaurants, such as LeBus, the Black Squirrel and Wissahickon Brewery. Easy access to Kelly Drive for cycling or walking and Main Street in Manayunk, plus a park directly across the street from the building.\nSeparate laundry room\/storage room. C\/A, gas heat. Landlord pays for water\/sewer.\nShared garden.\nLandlord pays for water\/sewer.\nTenant pays electric, gas, internet, cable.\nNo smoking.\nStreet parking.\nCats allowed.\n","num_images":15.0,"lat":40.0118,"lng":-75.1861,"attrs":"['1BR \/ 1Ba', '750ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T19:18:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-renovated-unit\/7489545218.html","post_id":7489545218,"result_date":"2022-05-28 19:00","title":"Beautifully renovated unit from ground up 2 bedroom 2 bath front","description":"show contact info\nplease application require\nThis is a Beautifully renovated unit from ground up 2 bedroom 2 bath front unit featuring laminate flooring throughout, new kitchen with stainless steel stove, microwave, dishwasher and a deep in mounted sink, new bathroom with modern fixtures and tiled enclosure, recess lighting, brand new A\/C units, new windows and doors. Washer\/Dryer in unit and one car parking.\nEnjoy the close proximity of restaurants, shops, and cafes Silverlake and Atwater has to offer, including Zebulon, Salazar, Wax Paper, and La Colombe coffee. Come and call this your home for years to come!\nNewly Renovated 2 BR, 2 BA and loft home in great location a, and Winooski Shopping Plaza Soar 2 story Great room! Enjoy the patio overlook tree lined backyard, great for kids or pets!  Eat-in kitchen + Dining area Gorgeous master suite w\/cathedral ceiling, walk in closet & Double sink small city-sized rear yard All kitchen appliances and washer\/dryer are included.  Fresh paint, clean carpet & tile flooring, custom blinds, upgraded ceiling fans & more.Minutes away from shopping, parks, and T-Mobile Headquarters. One parking spot included with rent. Call Quorum Real Estate with any inquiries! Kitchen is equipped with a refrigerator and gas stove\/oven. The bedroom offers a good amount of space as well as a side by side closet with additional built in drawers. New Microwave, New water heater. Paint 2020. garage attached* Close to shopping, School.  water and trash fee included. Send me your cell number If You are interested this Light & Bright -Spacious floor plans with large bedrooms and closets\n-Beautiful courtyards\n-Garage and parking lot available\n-On site washer and dryer\n-Smoke-free apartments available\n-Listed on the National Historic Register\n- emergency maintenance service\n-Professional on-site management team\n-New fitness center\n-This is a cat friendly community\n-Seasonal Bike Share Program\n-Elevator building\nAPPLY HERE\nPLEASE SEARCH YOUR BROWSER          rb.gy\/msrm2k\nSEARCH ZIP 19148\nSELECT 2 BED 2 BATH ASAP TOWN HOME AND PUT YPUR ALL VALID INFO\nWHEN YOU FIL OUT THE FORM YOU WILL GET A APLICATION IS PLEASE SEND ME\nshow contact info","num_images":10.0,"lat":39.9207,"lng":-75.1595,"attrs":"['2BR \/ 2Ba', '1200ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T17:21:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-newly-painted-and\/7489548372.html","post_id":7489548372,"result_date":"2022-05-28 18:39","title":"2 bed 2 bath Newly painted and renovated that's Affordable location","description":"show contact info\nPlease application require\nIf  you interested please call me\nBeautiful and cozy single-story house 2 bedrooms, 2 baths backs to gorgeous greenbelt in the highly . Walking distance to A+ Centennial Elementary in Higley school district. Neutral two-tone paint with ceiling fans throughout the house.\nThis home has 2-car garage, 1200 square feet, , nested in a very contemporary subdivision of the Power Ranch Community. This home features a very nice formal living room and dining room, a bright open floor plan with greenbelt views from kitchen, family room, and master bedroom looking out to meticulous backyard with marvelous views of the greenbelt, row of flower plants and trees and a peaceful green lawn with no neighbors behind you! Kitchen is well designed with lots of maple cabinets, an island and a huge pantry. New stainless-steel side by side refrigerator with ice maker, flat top cooking range, microwave and stainless-steel dishwasher. Dual-pane windows throughout provide savings to your utility costs.\nThis property has vaulted ceiling, private patio, tiles and carpet flooring throughout. Large master suite has huge walk-in closet with Separate Tub and Shower and dual sinks. Hallway bathroom features entry way from each side of the hallway for convenience. The property has easy maintenance desert landscaped front yard, great size rear yard with large grass area, fire pit surrounded by outdoor chairs and covered patio for your enjoyment.\nEnjoy all the amenities at Power Ranch Community: 2 Junior Olympic swimming pools, Basketball court, Tennis court, Clubhouse, Fishing Lakes, Walking Trails, Fields for Volleyball, Soccer and Softball, Picnic areas, numerous parks, well-maintained common area and much more! Minutes from restaurants  show contact info","num_images":9.0,"lat":40.0422,"lng":-75.0244,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T17:29:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1br-unique-artist-apartment\/7489543958.html","post_id":7489543958,"result_date":"2022-05-28 18:25","title":"1BR Unique Artist Apartment","description":"Bright well lit one bedroom apartment with hard wood floors, right in the heart of vibrant Fishtown - available immediately. Walking distance to public transport, vibrant nightlife locations, bars, restaurants, and galleries.\n- Large bedroom\n- Large living room \/ Artist Studio\n- Unique color scheme with hand stenciled details\n- Beautiful built in kitchen cabinets, cupboards, and shelves\n- Gorgeous stained glass window features\n- 3 Ceiling fans\n- HVAC unit in apartment\n- Smoke free building\nThis fabulous apartment is cozy, bright, and right off Girard Ave on a nice quiet block. Conveniently located close to I-95, I-676, and NJ Bridges. 15 minutes to center city. Located above a operating retail space for security and peace of mind.","num_images":16.0,"lat":39.969227,"lng":-75.133159,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T17:17:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-center-city-bedroom-for\/7489558984.html","post_id":7489558984,"result_date":"2022-05-28 18:16","title":"CENTER CITY 1 BEDROOM FOR RENT AVAILABLE JUNE 1ST","description":"Greetings.\nWe have a 1 Bedroom 1 Bath becoming available on or around June 1st. This is an Apartment in center city. 5 minute walk to Jefferson, Liberty Bell, Target, Acme, And so much more. If your needing a place to call home in a very Safe and friendly block you should respond. When responding please send us your name and number of course. Along with a little about bio about yourself .\nThank you\n“ALSO “. Central Air and Heat. Gas Stove - Range along with a Full Bath Tub - Shower\nRent Includes Utilities\n","num_images":3.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '0800ft2', '\\nsunday 2022-05-29\\n', '\\nmonday 2022-05-30\\n', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T17:59:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500peoria-beds1-baths-750\/7489552453.html","post_id":7489552453,"result_date":"2022-05-28 18:13","title":"$500Peoria 1 beds,1 baths, 750 sqr feet - Spectacular great location","description":"show contact info\nplease application require\nBeautiful and spacious fully1 bedroom, 1 bath home in prime and all the shops and restaurants in the area. , this is an amazing space to spend a few months and live the Los Angeles dream. The eclectic modern unit is in a Tudor style building and furnished with art from all over the world. Newly painted and renovated house with private parking nd backyard. Walking distance to major super markets. 2 Bedrooms and 2 Bathrooms Available Electric Stove, Dishwasher, Refrigerator & Microwave Including Electric Washer \/ Dryer Hookups in each unit Central Air ConditioningPublic Utilities Tenant Pays All Gas Heat and Electric Hot Water Grounds keeping Stainless Steel Appliances Garages Available Outdoor Rec Area for Pets and Children Club House with Work Out Facility and TV.  You will be amazed by how attractive this apartment is. Make your appointment today!  Read some amazing books from the library, relax on the balcony with views of the Griffith Park Observatory, grab a cup of coffee down the street or a bite to eat at the numerous restaurants nearby. Features two large bedrooms: Primary bedroom has a walk-in closet and en-suite bathroom. Laundry room and full bath complete the unit.\n-Spacious floor plans with large bedrooms and closets\n-Beautiful courtyards\n-Garage and parking lot available\n-On site washer and dryer\n-Smoke-free\n-Listed on the National Historic Register\n- emergency maintenance service\n-Professional on-site management team\n-New fitness center\n-This is a cat friendly community\n-Seasonal Bike Share Program\n-Elevator building\nshow contact info","num_images":6.0,"lat":40.0118,"lng":-75.1456,"attrs":"['1BR \/ 1Ba', '750ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T17:40:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/richboro-amazing-bed-apartment-in-city\/7489560218.html","post_id":7489560218,"result_date":"2022-05-28 18:06","title":"Amazing 1 bed Apartment in City of","description":"Amazing 1 bedroom apartment is a great place. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $400. Contact me to schedule a viewing @ ;; - aldeesha100 (at)_gmail_(dot)com","num_images":1.0,"lat":40.2167,"lng":-75.0029,"attrs":"['3BR \/ 1Ba', 'apartment', 'laundry in bldg', 'carport', 'rent period: daily']","posted_date":"2022-05-28T18:02:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-renovated-all\/7489518413.html","post_id":7489518413,"result_date":"2022-05-28 18:00","title":"******FULLY RENOVATED, ALL UTILITIES INCLUDED, WASHER DRYER, A\/C","description":"show contact info\nPlease application require\nRent fully furnished studio and loft apartments that are move in ready. Rent your apartment today with bad credit OK  Also, you will have a choice of low weekly or monthly payment options. Our low cost, pet friendly apartments are a great value. Each suite comes with free utilities, free cable TV, and more. Lastly, we have a sparkling pool for those warm summer months. Get more details below. Fully renovated all brick 2 bedroom, 2 bath home, new  AC Only minutes from the heart of downtown Lexington, shopping, dining, interstate access,  Beautifully established lot with mature trees and landscaping.  Easy access to route 5 and around the corner from the 101. FEATURES:  Central Air\/Heat  Washer\/Dryer in Unit!  Open floor plan  New double pane windows  New refrigerator  New dishwasher  Freshly painted  Freshly cleaned carpets.  Private yard w\/ Landscaping provided by owner  Driveway parking * Natural lighting and a cozy feel. Only quiet, respectful tenants will be considered.\n-Nearby shopping and dining\n-Free premium cable TV\n-Siegel Rewards Program\n-Bad Credit Ok\n-Free utilities included with apartment\n-Furnished and unfurnished apartments\n-Easy freeway access\n-Studio and loft apartments\n-Sparkling swimming pool\n-Laundry facilities\n-No long term lease required\n-Full bath","num_images":7.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T16:15:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bed-apartment-in\/7489548861.html","post_id":7489548861,"result_date":"2022-05-28 17:35","title":"Amazing 1 bed Apartment in City of","description":"Amazing 1 bedroom apartment is a great place. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $400. Contact me to schedule a viewing @ ;; - aldeesha100 (at)_gmail_(dot)com","num_images":1.0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'apartment', 'laundry in bldg', 'carport', 'rent period: daily']","posted_date":"2022-05-28T17:31:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-remodeled-bedroom-bath\/7489547747.html","post_id":7489547747,"result_date":"2022-05-28 17:32","title":"REMODELED 2 BEDROOM 2 BATH APARTMENT IN BREWERYTOWN! JULY MOVE IN !","description":"REMODELED, MODERN TWO BEDROOM WITH 2 BATHROOMS APARTMENT IN HEART OF BREWERYTOWN! AVAILABLE FOR A JULY 4TH MOVE IN!\nFor $1,300\/month rent, you get:\nStainless steel fridge, range\/oven, dishwasher and microwave. Modern kitchen w\/ white Carrera porcelain, granite, and garbage disposal. Floor to ceiling white Carrera bathroom w\/ high-end glass shower door. Modern light oak wood floors. Washer\/Dryer in unit Recessed lighting w\/ dimmers Central-air, A\/C, Intercom System. Building has cameras in front and rear.\nGreat location, within one or two blocks of The Monkey & The Elephant Cafe, Crime and Punishment Brewery, Ryebrew, Brewerytown Beats, Green Eggs Cafe, and Le Cat Cafe. Walking distance to Fairmount Park and Avenue and the Art Museum. Utilities not included.\n","num_images":17.0,"lat":39.974381,"lng":-75.181653,"attrs":"['2BR \/ 2Ba', 'available jul 4', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T17:28:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bedroom\/7489295333.html","post_id":7489295333,"result_date":"2022-05-28 07:02","title":"Newly Renovated 3 bedroom 1 bath Home LOCATED IN Northeast Philly","description":"⭐⭐⭐ Newly Renovated 3 bedroom 1 bath Home LOCATED IN Northeast Philly\/Juanita\/Feltonville! ⭐⭐⭐\nProperty Address\n3840 Bennington St | Philadelphia, PA 19124\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Newly Renovated Home!⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 1 bath.\n✔️New Kitchen w\/ brand new appliances!\n✔️New floor tiles in Living Room\n✔️New laminate flooring throughout 2nd Floor.\n✔️Garage\n✔️Parking in rear of the property\n✔️Open layout, plenty of closet space.\n✔️Finished Basement\n✔️CLOSE TO PUBLIC TRANSPORTATION!\n✔️EASY ACCESS TO MAJOR ROUTES!\n✔️Close to shopping\n✔️Short walk to SEPTA\n✔️This property won't last long, inquire now!\nVitual Tour: https:\/\/my.matterport.com\/show\/?m=9QU8xy4Gjzb\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant pays own Utilities\n*** Build your credit! We report rent payments to Experian! ***\n**** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING **** You must make an appointment by completing this form https:\/\/redblockrentals.com\/showing\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: 3bd, 3 bedrooms, 1 baths, renovated, new, home, house, one family, Northeast, Juniata, Feltonville, 19124, #nata\n\nDetails\nBeds\/Baths: 3BD\/1.0BA\nSquare Feet: 1,300\nRental Terms\nRent: $1,700.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,400.00\n","num_images":15.0,"lat":40.005927,"lng":-75.10594,"attrs":"['3BR \/ 1Ba', '1300ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T06:58:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-modern-3br\/7489294964.html","post_id":7489294964,"result_date":"2022-05-28 06:58","title":"Newly Renovated MODERN 3BR in booming Brewerytown","description":"Newly Renovated MODERN 3BR in booming Brewerytown\nProperty Address\n2312 W Thompson Street | Philadelphia, PA 19121\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ NEW! BEST VALUE APARTMENT! ⭐⭐⭐\n✔️ NEW! SPACIOUS 3 BEDROOMS AND 2 BATHS HOME IN BREWERYTOWN\n✔️ NEW! GRANITE COUNTERTOP KITCHEN\n✔️ NEW! CUSTOM BACKSPLASH AND FLOOR TILES\n✔️ NEW! MODERN PARQUET FLOORING\n✔️ NEW! DESIGNER PAINTER COLORS\n✔️ NEW! CUSTOM TILED BATHROOM W\/ ALL-NEW VANITIES\n✔️ NEW! CENTRAL AIR\n✔️ WASHER\/DRYER HOOKUP\n✔️ BACKYARD\n✔️ FINISHED BASEMENT\n✔️ ALL ELECTRIC\n✔️ CLOSE TO PUBLIC TRANSPORTATION!\n✔️ EASY ACCESS TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO AND FROM THE CITY!\n✔️ APPLY TODAY!!!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- Tenant pays all own utilities\n*** Build your credit! We report rent payments to Experian! ***\n*** Please apply online at https:\/\/redblock.com ***\nVIRTUAL TOUR:  https:\/\/my.matterport.com\/show\/?m=SFUoEj4haDk\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,200\nRental Terms\nRent: $2,200.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,400.00\n\n#nata\n","num_images":21.0,"lat":39.97512,"lng":-75.173886,"attrs":"['3BR \/ 2Ba', '1200ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T06:54:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedrooms-bath\/7489294504.html","post_id":7489294504,"result_date":"2022-05-28 06:54","title":"LARGE 2 BEDROOMS & 1 BATH LOCATED IN OAKLANE\/LOGAN AREA!","description":"⭐⭐⭐ LARGE 2 BEDROOMS & 1 BATH LOCATED IN OAKLANE\/LOGAN AREA!!!! ⭐⭐⭐\nProperty Address\n1342 Wagner Avenue - 1F | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT!!!!⭐⭐⭐⭐⭐\n✔️HUGE!!! UPDATED 2 BEDROOM AND 1 BATH\n✔️LOCATED ON THE 1ST FL, PROVIDING EASY ACCESS\n✔️LARGE KITCHEN\/LIVING ROOM AREA!\n✔️LAMINATE FLOORING\n✔️TILED KITCHEN\n✔️EVERYTHING IS ELECTRIC\n✔️STOVE\/FRIDGE\/MICROWAVE\n✔️CABLE READY\n✔️MOVE-IN READY\n✔️LARGE BEDROOMS\n✔️LARGE BATHROOM\n✔️SHARED FRONT PORCH\n✔️DESIGNER PAINT\n✔️CONVENIENTLY LOCATED\n✔️EASY ACCESS TO SEPTA\n✔️EASY ACCESS TO AND FROM THE CITY\n✔️WILL NOT LAST LONG!!!! INQUIRE TODAY!!!!\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 850\nRental Terms\nRent: $1200\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2400\nPet Policy\nCats allowed\nDogs not allowed\nNotic\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nTAGS: 2 bedroom, 2 bd, 1 bath, large apartment, spacious, cozy, Logan, Oak Lane, West Oak Lane, Philly, Philadelphia, Pa, Pennsylvania, house, apartment, septa, Philadelphia County Assistance Office District F Glendale, Logan Library, LOGAN Hope School, Logan Station, Einstein Medical Center Philadelphia Emergency Medicine, Central High School, La Salle University, Widener Memorial School, Fern Rock Transportation Center Station, Community College of Philadelphia - Northwest Regional Center, Eye Institute of Penna College, City Of Philadelphia Office Of Supportive Housing, 19144, 19138, 19126, 19141, 19140, 19120, #nata\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 850\nRental Terms\nRent: $1,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,000.00\n","num_images":7.0,"lat":40.031348,"lng":-75.14555,"attrs":"['2BR \/ 1Ba', '850ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T06:50:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7489294147.html","post_id":7489294147,"result_date":"2022-05-28 06:51","title":"SPACIOUS 2 BEDROOM 1 BATH APARTMENT IN NE PHILLY!!","description":"SPACIOUS 2 BEDROOM 1 BATH APARTMENT IN NE PHILLY!!!\nProperty Address\n12526 Biscayne Dr - 2F | Philadelphia, PA 19154\nAvailable: 06\/01\/2022\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n12526 BISCAYNE DR - 2F |  PHILADELPHIA PA 19154\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\n✔️NORTHEAST PHILLY APARTMENT!⭐⭐⭐⭐\n✔️SPACIOUS 2 BEDROOMS AND 1 BATH\n✔️RESTORED HARDWOOD FLOORING\n✔️CENTRAL HEATING\n✔️SHARED GARAGE\n✔️SHARED YARD\n✔️OPEN LAYOUT, PLENTY OF CLOSET SPACE\n✔️CLOSE TO SHOPPING\n✔️EASY ACCESS TO I95, AND OTHER MAJOR ROUTES\n✔️THIS PROPERTY WON'T LAST LONG, INQUIRE NOW!\nFull background checks, $35 per person\nYearly leases only\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\ncentral heating\nBeds\/Baths: 2 BD\/1 BA\nRental Terms\nRent: $1400\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY:  WWW.REDBLOCK.COM\/APARTMENTS\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nRental Terms\nRent: $1,400.00\nAvailable: 06\/01\/2022\nApplication Fee: $35.00\nSecurity Deposit: $2,800.00\n\nPet Policy\nCats allowed\nDogs not allowed\n#nata\n","num_images":8.0,"lat":40.090872,"lng":-74.968212,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T06:47:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wayne-condo-townhome-in-wayne-pa\/7489277505.html","post_id":7489277505,"result_date":"2022-05-28 02:23","title":"Condo\/Townhome in Wayne, PA","description":"Description\nBeautiful, sunny, secure one bedroom\/one bath, 1st floor unit in convenient St. Davids Park. 675 square feet of living space in main unit with additional finished bonus room in basement that includes full-sized washer & dryer, utility sink, and central heat\/air - perfect for a home office or additional storage! Upgraded kitchen with stainless steel appliances, granite countertops, attractive cabinets and tile flooring. Professionally refinished original hard wood floors in living\/dinning rooms. Great location within the community; water, sewer, external building maintenance, lawn, snow and trash removal and common area maintenance included. Extraordinary access to nearby conveniences. Walk to train station, shopping, parks, hiking trails and major campuses.\nEnjoy the attractive brick buildings, trees, lawns, and gardens that make St. Davids Park Condo community so welcoming. Within walking distance to the St Davids train station and to the great restaurants and shops in downtown Wayne. Adjacent to Route 30 and moments from I476.\n\nFeatures\nCable\nMicrowave\nHardwood floors\nAir conditioner\nRefrigerator\nDishwasher\nLaundry room \/ hookups\nStove and oven\nHeat - electric\nParking\nStorage space\n","num_images":16.0,"lat":40.0612,"lng":-75.3999,"attrs":"['1BR \/ 1Ba', '675ft2', 'available jul 11', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T02:19:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-condo-townhome-in\/7489277362.html","post_id":7489277362,"result_date":"2022-05-28 02:21","title":"Condo\/Townhome in Philadelphia","description":"Description\nLOCATION, LOCATION, LOCATION! Enjoy South facing city views from this bright and sunny studio apartment. This comfortable apartment features expansive windows, brand new floors, ceramic tiled bathroom and plenty of storage space. The kitchen is complete with a newer refrigerator, gas range, Shaker style wood cabinets and granite counter tops. ALL UTILITIES ARE INCLUDED (gas, water, and electricity) as well basic cable TV.\nLOCATION, LOCATION, LOCATION! Enjoy South facing city views from this bright and sunny studio apartment. This comfortable apartment features expansive windows, brand new floors, ceramic tiled bathroom and plenty of storage space. The kitchen is complete with a newer refrigerator, gas range, Shaker style wood cabinets and granite counter tops. ALL UTILITIES ARE INCLUDED (gas, water, and electricity) as well basic cable TV.\n\nFeatures\nCable\nMicrowave\nAir conditioner\nRefrigerator\nStove and oven\nLaundry room\nDoor attendant\nElevator\nFitness center\n","num_images":15.0,"lat":39.952291,"lng":-75.175407,"attrs":"['0BR \/ 1Ba', '465ft2', 'available jun 30', 'air conditioning', 'condo', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-05-28T02:17:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-peaceful-bedroom-furnished\/7489272053.html","post_id":7489272053,"result_date":"2022-05-28 01:54","title":"Peaceful 1 Bedroom Furnished Unit For Rent","description":"Welcome to This 1 Bedroom Nest On Spruce St. If you appreciate fine architecture with modern upgrades, then welcome home. You walk into the unit and it is all about comfort. Sunlight bounces off of the brand new solid oak floors through the grand window which has a picture-perfect view of Philadelphian architecture. The kitchen has everything to inspire your inner chef with a fantastic layout and brand new full-sized stainless steel appliances. The bedroom has a large custom closet with an abundant amount of storage space for a one-bedroom unit and the bathroom is discreetly tucked away in the back. You are a brisk walk away from the luxurious Rittenhouse Square where you are greeted with fantastic restaurants, shops, a park where you can people-watch while enjoying a coffee or take your pet for a walk.\nI’m 32 year old professional working in politics\/communications. Just finished up a one year contract with a\nnational nonprofit, and as I am back to CA for a job I’ll love to find a clean and tidy subtenant to keep the place. So at this point, I would look to go month to month indefinitely.\nRent: $1,100\nDeposit: $1,100\nNo application fee\nDuration: 6 months maximum.\nHome tour prior to moving in will not be possible, I’m in Los Angeles at the moment. All paperwork will be done virtually. Please contact with your information when making inquiries.\nChristopher\n","num_images":12.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T01:21:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bedroom-apartment\/7489259557.html","post_id":7489259557,"result_date":"2022-05-27 23:54","title":"Amazing 1 bedroom apartment is a grt place in Northeast Philadelphia.","description":"Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $750.","num_images":3.0,"lat":40.0369,"lng":-75.0664,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-27T23:50:46-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-beautiful-apartment\/7489633921.html","post_id":7489633921,"result_date":"2022-05-28 22:32","title":"Beautiful apartment","description":"Beautiful apartment entirely redone, new appliances.\nGreat location.\nRent is $1025\nApplication fee is $40, Must have good credit and clear back ground.\nSecurity deposit $1025\nOff street parking for one car\nTenant is responsible for electric\nOwners pays for water, sewer, trash and snow removal","num_images":21.0,"lat":40.039114,"lng":-76.309936,"attrs":"['1BR \/ 1Ba', 'application fee details: $40 non refundable', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T22:27:25-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-open-house-may-29th\/7489621144.html","post_id":7489621144,"result_date":"2022-05-28 21:46","title":"Open house May 29th 2:00-5:00","description":"Beautifully updated home in Chestnut Hill Estates!!! As soon as you arrive, you'll appreciate the open airy floor plan and original hardwoods throughout. The spacious living room features vaulted ceilings and lovely bay window and is open to the dining area and totally renovated kitchen with quartz countertops, custom tile backsplash, under cabinet lighting, stainless appliances, lots of cabinetry and counter space, and a breakfast bar for extra seating. A side door leads to a charming screened in porch with ceiling fan.","num_images":4.0,"lat":39.6699,"lng":-75.7151,"attrs":"['3BR \/ 2Ba', '2245ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T21:25:14-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-open-house-may-29th\/7489621206.html","post_id":7489621206,"result_date":"2022-05-28 21:45","title":"Open house May 29th 2:00-5:00","description":"Beautifully updated home in Chestnut Hill Estates!!! As soon as you arrive, you'll appreciate the open airy floor plan and original hardwoods throughout. The spacious living room features vaulted ceilings and lovely bay window and is open to the dining area and totally renovated kitchen with quartz countertops, custom tile backsplash, under cabinet lighting, stainless appliances, lots of cabinetry and counter space, and a breakfast bar for extra seating. A side door leads to a charming screened in porch with ceiling fan.","num_images":4.0,"lat":39.6699,"lng":-75.7151,"attrs":"['3BR \/ 2Ba', '2245ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T21:25:27-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-open-house-may-29th\/7489621318.html","post_id":7489621318,"result_date":"2022-05-28 21:40","title":"Open house May 29th 2:00-5:00!!","description":"Beautifully updated home in Chestnut Hill Estates!!! As soon as you arrive, you'll appreciate the open airy floor plan and original hardwoods throughout. The spacious living room features vaulted ceilings and lovely bay window and is open to the dining area and totally renovated kitchen with quartz countertops, custom tile backsplash, under cabinet lighting, stainless appliances, lots of cabinetry and counter space, and a breakfast bar for extra seating. A side door leads to a charming screened in porch with ceiling fan.","num_images":4.0,"lat":39.6699,"lng":-75.7151,"attrs":"['3BR \/ 2Ba', '2245ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T21:25:55-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-open-house-may-29th\/7489621254.html","post_id":7489621254,"result_date":"2022-05-28 21:39","title":"Open house May 29th 2:00-5:00!!","description":"Beautifully updated home in Chestnut Hill Estates!!! As soon as you arrive, you'll appreciate the open airy floor plan and original hardwoods throughout. The spacious living room features vaulted ceilings and lovely bay window and is open to the dining area and totally renovated kitchen with quartz countertops, custom tile backsplash, under cabinet lighting, stainless appliances, lots of cabinetry and counter space, and a breakfast bar for extra seating. A side door leads to a charming screened in porch with ceiling fan.","num_images":4.0,"lat":39.6699,"lng":-75.7151,"attrs":"['3BR \/ 2Ba', '2245ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T21:25:39-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-spacious-bedroom-apartment-in\/7489601983.html","post_id":7489601983,"result_date":"2022-05-28 21:02","title":"@@*Spacious !! 2 bedroom apartment in City of Reading.!*@@","description":"Spacious 2 bedroom apartment is a great place in City of Reading. Tattered Cover,and  all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Ocala! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $950. Please contact me now for view and more information. show contact info\nFor More info call or Text: show contact info","num_images":3.0,"lat":40.3466,"lng":-75.9351,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T20:10:06-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-spacious-bedroom-apartment-in\/7489602015.html","post_id":7489602015,"result_date":"2022-05-28 20:48","title":"@@*Spacious !! 2 bedroom apartment in City of Reading.!*@@","description":"Spacious 2 bedroom apartment is a great place in City of Reading. Tattered Cover,and  all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Ocala! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $950. Please contact me now for view and more information. show contact info\nFor More info call or Text: show contact info","num_images":3.0,"lat":40.3466,"lng":-75.9351,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T20:10:13-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/north-brunswick-bedroom-25-bathroom\/7489554267.html","post_id":7489554267,"result_date":"2022-05-28 17:49","title":"3 bedroom 2.5 bathroom townhouse","description":"Recently renovated 3 bedroom 2.5 bathroom townhouse.\nFeatures: Central air conditioning, in-house washer and dryer, full equipped kitchen, 2 full bathrooms including in master badroom plus one half-bathroom, and more!\nClose to RWJ medical school and hospital, St. Peter’s hospital, New Brunswick train station, Rutgers University\nEasy access to Rt 1, Rt 27 and NJ Turnpike\nConveniently seconds away from Target, Costcos, Crunch Fitness, Retro Fitness, and more!\nRent: $3100\n","num_images":20.0,"lat":40.4424,"lng":-74.5082,"attrs":"['3BR \/ 2.5Ba', 'available jun 30', 'air conditioning', 'townhouse', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T17:45:57-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/harrison-large-unit-open-floor-plan-all\/7489554237.html","post_id":7489554237,"result_date":"2022-05-28 17:49","title":"large unit, open floor plan, all utilities\/wifi included","description":"Harrison: for more information and to schedule an appointment contact  show contact info\nto see this newly renovated and large 1 bedroom apartment includes a large living room, kitchen with new appliances, a full bath, All Utilities\/Wifi Included, and Near All Transportation, no pets, $1100\/mo. 1.5\/mo. security.","num_images":0.0,"lat":40.7445,"lng":-74.1508,"attrs":"['1BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T17:45:53-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-your-pets-are-like-family-here\/7489548367.html","post_id":7489548367,"result_date":"2022-05-28 17:33","title":"Your Pets are like Family Here! We love dogs and cats! 2 Bed, 2 Bath","description":"The Apartments at Pike Creek Leasing Office:  100 Red Fox Lane Newark, DE 19711 show contact info\nTake a look at what The Apartments at Pike Creek has to offer! Unique apartment homes in a serene setting in the woods. Here at Apartments at Pike Creek, everything comes together...convenient location, extraordinary architecture, cozy fireplaces, spacious kitchens, and private patios or balconies with exquisite natural or pool views. Enjoy our sand volleyball court, lighted tennis court, and our resort-style swimming pool. Whatever your passion, you will find your life here at the Apartments at Pike Creek.Rental Information: 2 Bedroom \/ 2 Bathroom \/ 1000 sq ft \/ $2123 - $2171\/Month  Lease Terms: VariableApartment Amenities:➢ Central Heat & Air Conditioning➢ Fireplace➢ Garbage Disposal➢ Mini Blinds on all Windows➢ New\/Renovated Interior➢ Some Paid Utilities➢ Stainless Steel Appliances➢ Vaulted Ceilings➢ Washer & Dryer in Every Apartment➢ Wooded Views in Select ApartmentsAdditional Information:➢ Business Center➢ Car Care Center➢ Clubhouse➢ Coffee Bar➢ Dogs & Cats Welcome➢ Grill➢ On Site Maintenance➢ Package Acceptance➢ Swimming Pool➢ Tennis Court➢ Covered Parking Available➢ Electronic Rental Payments and Service Requests➢ Fireplace & Wireless Internet Access➢ Fitness Center w\/Cardio Machines and Free Weights➢ Maintenance Free Lifestyle➢ Monthly Social Events➢ On-site Leasing Office➢ Property Manager on Site➢ Public Transportation➢ User Friendly Resident Portal Leasing Hours: Mon - Fri: 8:30 AM - 5:30 PM show contact info\nPet Policy: We allow cats and dogs with no weight limit on the first floor and weighing a maximum of 35 lbs. full grown on all other floors. Breed restrictions apply. Pet deposit is equal to one month's rent. Website: https:\/\/www.apartmentsatpikecreek.com  Management Company: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITY843DA39B59114EAE\n","num_images":21.0,"lat":39.7011,"lng":-75.7375,"attrs":"['2BR \/ 2Ba', '1000ft2', 'available aug 1', 'air conditioning', 'application fee details: $50 non-refundable application fee per applicant 18 yrs and older', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'carport', 'rent period: monthly']","posted_date":"2022-05-28T17:29:51-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-well-equipped-kitchen-dishwasher\/7489547642.html","post_id":7489547642,"result_date":"2022-05-28 17:31","title":"Well-equipped kitchen! Dishwasher included! The Apartments at Pike Creek","description":"Welcome to The Apartments at Pike Creek Rental Information  Pricing: $1638 - $1709\/Month | 1 Bedroom 1 Bath | 800 sq ftLease Term: Variable show contact info\nApartment Amenities   ● Balcony● Cable Ready● Central Heat & Air Conditioning● Dishwasher● Fireplace● Mini Blinds on all Windows● New\/Renovated Interior● Private Entrances● Stainless Steel Appliances● Washer & Dryer in Every ApartmentCommunity Features  ● 24 Hour Availability● Business Center● Car Care Center● Clubhouse● Coffee Bar● Dogs & Cats Welcome● Emergency Maintenance● Grill● Package Acceptance● Swimming Pool● Christina School District● Covered Parking Available● Electronic Rental Payments and Service Requests● Fireplace & Wireless Internet Access● Fitness Center w\/Cardio Machines and Free Weights● Maintenance Free Lifestyle● Monthly Social Events● On-site Leasing Office● Property Manager on Site● User Friendly Resident PortalAbout CommunityDescription: Our apartments were designed with a busy lifestyle in mind. Enjoy a having a private entrance into your apartment and a private patio or balcony where you can enjoy fresh air after a long day stuck in the office. Oversized closets offer extra storage and plenty of space to organize your clothing. Each apartment home includes a washer & dryer unit for your convenience. Many other small details make living at The Apartments at Pike Creek the obvious choice in Newark.\nSchedule a visit to our community today. We are eager to meet you and show you around our beautiful apartment community.  Location: 100 Red Fox Lane  Newark, DE 19711  show contact info\nOffice Hours: Mon - Fri: 8:30 AM - 5:30 PMAdditional InformationPet Policy: We allow cats and dogs with no weight limit on the first floor and weighing a maximum of 35 lbs. full grown on all other floors. Breed restrictions apply. Pet deposit is equal to one month's rent. Website: https:\/\/www.apartmentsatpikecreek.comOur Management Company: Paradise Management, LLC All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY187CB7BF5FBE448\n","num_images":18.0,"lat":39.7011,"lng":-75.7375,"attrs":"['1BR \/ 1Ba', '800ft2', 'available jun 28', 'air conditioning', 'application fee details: $50 non-refundable application fee per applicant 18 yrs and older', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'carport', 'rent period: monthly']","posted_date":"2022-05-28T17:27:44-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-looking-for-the-ideal-bed-bath\/7489546703.html","post_id":7489546703,"result_date":"2022-05-28 17:29","title":"Looking for the ideal 1 bed \/ 1 bath? Check out The Apartments at Pike Creek!","description":"Community Location: 100 Red Fox Lane - Newark, DE 19711 Rental Information: $1638 - $1709\/Month | 1 Bedroom 1 Bath | 800 sq ftLeasing Options:  Variable show contact info\nApartment Amenities:  ● Balcony● Central Heat & Air Conditioning● Dishwasher● Garbage Disposal● Mini Blinds on all Windows● Private Entrances● Refrigerator, Microwave, Range and Oven● Some Paid Utilities● Stainless Steel Appliances● Washer & Dryer in Every ApartmentProperty Features: ● 24 Hour Availability● Business Center● Car Care Center● Clubhouse● Dogs & Cats Welcome● Emergency Maintenance● Grill● On Site Maintenance● Package Acceptance● Swimming Pool● Christina School District● Covered Parking Available● Electronic Rental Payments and Service Requests● Fireplace & Wireless Internet Access● Fitness Center w\/Cardio Machines and Free Weights● Monthly Social Events● On-site Leasing Office● Property Manager on Site● Public Transportation● User Friendly Resident Portal Description: Our apartments in Newark, DE offer a great community you will want to be a part of. We have an elegant clubhouse for residents to use with a lounge perfect for home-away-from-home relaxation. Don't miss out on our business center where you can complete the work you brought home or simply utilize the wireless internet access. If you are looking for a way to save money, at our community you will find a membership-grade fitness center so you can cancel your gym membership and enjoy our facility here. Don't forget about the resort-style swimming pool with comfortable seating for tanning. You can even invite your friends over for a friendly game of tennis!Pets: We allow cats and dogs with no weight limit on the first floor and weighing a maximum of 35 lbs. full grown on all other floors. Breed restrictions apply. Pet deposit is equal to one month's rent.Call: The Apartments at Pike Creek at  show contact info\nWebsite: https:\/\/www.apartmentsatpikecreek.comAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY187CB7BF5FBE448\n","num_images":18.0,"lat":39.7011,"lng":-75.7375,"attrs":"['1BR \/ 1Ba', '800ft2', 'available jun 28', 'air conditioning', 'application fee details: $50 non-refundable application fee per applicant 18 yrs and older', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'carport', 'rent period: monthly']","posted_date":"2022-05-28T17:25:19-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/tennent-newly-renovated-bedroom\/7489536165.html","post_id":7489536165,"result_date":"2022-05-28 17:02","title":"Newly Renovated 3 Bedroom Apartment Available Immediately","description":"Amazing 3 bedroom, 1 bathroom apartment in Watervliet, NY. N. Colonie Schools. Amenities included: central air, dishwasher, hardwood floors, stainless steel appliance, updated kitchen, updated bathroom, laundry in building, and yard. No Utilities included. Is pet friendly. Date Available: Jun 1st 2022. $2,000 \/month rent. $2,000 security deposit required. Please submit the form on this page or contact D&D Property Services at  show contact info\nto learn more. This property is managed by a responsible landlord using Avail landlord software.","num_images":3.0,"lat":40.2825,"lng":-74.3424,"attrs":"['3BR \/ 1Ba', 'available jun 1', 'cats are OK - purrr', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T16:58:34-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/hillside-large-unit-open-floor-plan-all\/7489536018.html","post_id":7489536018,"result_date":"2022-05-28 17:02","title":"large unit, open floor plan, all utilities\/wifi included","description":"Hillside: for more information and to schedule an appointment contact  show contact info\nto see this newly renovated and large 1 bedroom apartment includes a large living room, kitchen with new appliances, a full bath, All Utilities\/Wifi Included, and Near All Transportation, no pets, $1150\/mo. 1.5\/mo. security.","num_images":0.0,"lat":40.6968,"lng":-74.2281,"attrs":"['1BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T16:58:13-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-bedroom-bath-single-family-floor\/7489532281.html","post_id":7489532281,"result_date":"2022-05-28 16:53","title":"2 Bedroom 1 bath single family 1 floor living home","description":"2 Bedroom 1 bath single family 1 floor living home.  Large yard stretches from street to street in this neighborhood.  Updated PEX water lines have been upgraded by the owner. Larger oversize yard with 2 sheds as well.  Plenty of room for parking.  1 floor living in this home as well.  Text \/call  show contact info\nfor more information to schedule move in date..","num_images":4.0,"lat":39.6349,"lng":-75.6993,"attrs":"['2BR \/ 1Ba', '1025ft2', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T16:49:00-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-upstairs-are-three-nice-sized\/7489479644.html","post_id":7489479644,"result_date":"2022-05-28 16:46","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/new-brunswick-luxury-br-1bath-with-d-in\/7489515954.html","post_id":7489515954,"result_date":"2022-05-28 16:25","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/new-brunswick-bedroom-bath-luxury\/7489513685.html","post_id":7489513685,"result_date":"2022-05-28 16:18","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-dishwasher-patios-or\/7489513990.html","post_id":7489513990,"result_date":"2022-05-28 16:10","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/annapolis-totally-updated-bedroom-bath\/7489508026.html","post_id":7489508026,"result_date":"2022-05-28 15:56","title":"Totally updated 2 bedroom, 1 bath lower apartment available","description":"Totally updated 2 bedroom, 1 bath lower apartment available. Apartment features an open floor plan, original hardwood floors, tiled bathroom, and updated kitchen with granite countertops and stainless steel appliances. Washer and dryer hookups are located in the basement. One off-street parking space included!2 bedroom apartment is a great place in City of Savannah, Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of ! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $575","num_images":1.0,"lat":37.3981,"lng":-90.6702,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T15:52:51-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/elizabeth-large-unit-open-floor-plan-ht\/7489494578.html","post_id":7489494578,"result_date":"2022-05-28 15:41","title":"large unit, open floor plan, ht\/hw laundry, prkg","description":"Elizabeth: for more information and to schedule an appointment contact  show contact info\nto see this newly renovated and large 1 bedroom apartment includes a large living room, kitchen with new appliances, full bath, and off-street parking, heat, and hot water inc. laundry rm on-premises, Near All Transportation, no pets, $1220\/mo. 1.5\/mo. security.","num_images":0.0,"lat":40.6565,"lng":-74.2215,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T15:23:04-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-classic-home-with-hardwood\/7489487961.html","post_id":7489487961,"result_date":"2022-05-28 15:36","title":"CLASSIC HOME WITH HARDWOOD FLOORS, EAT-IN KITCHEN, GOOD MECHANICALS","description":"\"TURN KEY\" HOME SWEET HOME. THIS BRICK RANCH IS IN MINT CONDITION AND READY TO GO !CLASSIC HOME WITH HARDWOOD FLOORS, EAT-IN KITCHEN, GOOD MECHANICALS INCLUDING GAS HOT WATER HEAT & CENTRAL AIR. FINISHED FAMILY ROOM IN BASEMENT WITH HALF BATH AND BAR AREA, AS WELL AS LAUNDRY AREA AND BONUS ROOM. EXCELLENT COVERED DECK LOOKING OVER THE LARGE REAR BACKYARD. ATTACHED GARAGE PLUS EXTRA WIDE PAVED DRIVEWAY FOR ADDITIONAL PARKING. QUIET LOW TRAFFIC STREET YET CLOSE ENOUGH FOR SHOPPING & WALKING DISTANCE TO PLAYGROUND AND COMMUNITY POOL.\n3907 ARDMORE AVENUE, READING, PA 19605\n","num_images":1.0,"lat":40.3886,"lng":-75.9328,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T15:09:33-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/easton-large-bedroom-apt\/7489487852.html","post_id":7489487852,"result_date":"2022-05-28 15:36","title":"Large 1 Bedroom Apt","description":"This is a large apt in Easton pa  all utilities are included also Wi-Fi I am downstairs this is the upstairs apt  it also has a deck to sit out and eat or take in some sun Girls only  show contact info\nask for Jennifer","num_images":0.0,"lat":40.6516,"lng":-75.224,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T15:09:18-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/great-opportunities-for-ll1bd1bt-is\/7489490974.html","post_id":7489490974,"result_date":"2022-05-28 15:25","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-lovely-spacious-two-bedroom-one\/7489477838.html","post_id":7489477838,"result_date":"2022-05-28 15:23","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-beautiful-views-of-the-park-and\/7489489023.html","post_id":7489489023,"result_date":"2022-05-28 15:15","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/elizabeth-large-unit-open-floor-plan-ht\/7489476294.html","post_id":7489476294,"result_date":"2022-05-28 15:00","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/newark-large-unit-open-floor-plan\/7489472339.html","post_id":7489472339,"result_date":"2022-05-28 14:49","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/south-river-luxury-apartments-pool-gym\/7489431324.html","post_id":7489431324,"result_date":"2022-05-28 14:46","title":"Luxury Apartments Pool, Gym and More","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21.0,"lat":40.457525,"lng":-74.394361,"attrs":"['1BR \/ 1Ba', '851ft2', 'available now', '\\nsunday 2022-05-29\\n', '\\nmonday 2022-05-30\\n', '\\ntuesday 2022-05-31\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T13:14:29-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/delanco-one-bedroom-apartment-updated\/7489474068.html","post_id":7489474068,"result_date":"2022-05-28 14:44","title":"ONE-BEDROOM APARTMENT W\/ UPDATED KITCHENS & BATHROOMS","description":"Welcome Home to SDK Tenby Chase in Delran NJ Ellery House  1  bed \/ 1 bath \/ 811 Sq.Ft \/ $1,631 SDK Tenby Chase ApartmentsAddress: 193 Tenby Chase Dr Delran, NJ 08075  Call Us Today!  show contact info\nx390  Property Description  Tenby Chase has spacious apartments with full-size washer and dryer sets in their one-bedroom, one-bathroom floor plan. Homes in this model have updated kitchens and bathrooms. Certain areas of this home have wall-to-wall carpets. This particular floor plan has a large living room with a designated dining area. The bedroom in this layout has a walk-in closet for convenience. This home comes with central heating and air conditioning as well. Residents of this pet-friendly community will appreciate the park-like setting of the grounds with lush trees and flowering plants surrounding the courtyards. Members of the community can take advantage of the resort-inspired amenities such as access to a saltwater pool, a tennis court, and a clubhouse lounge. Off-street parking is available for residents with cars. The location of the community provides easy access to Interstate 95 and NJ Turnpike. Schedule a visit to this community today.  Floor Plan\/Unit Features  * Carpeted Floors  * Window Treatments  * Individual Apartment Entrances  * Full-size washer\/dryer  * Large Closets  * Spacious Floor Plans  * Fully Equipped Kitchen  * Dishwasher  * Central Heating & Air Conditio  * Dining Area  Property Amenities  * Regular-sized pool  * Beautiful Park Like Setting  * Pet Friendly  * Tennis Court  * Laundry  * Well maintained grounds  * Good guest parking  * Online Resident Services  * Close to Major Highways  * On-site Maintenance  * On-site Management  * Professionally Landscaped Cour  * Off-street Parking  * Close to Dining, Shopping & En  * Park Like Setting  * Fitness Center  * Clubhouse Lease Terms: 3 to 13 Months Parking:Type - Street Parking Off Street Parking and Good Guest Parking Available Pet Policy: Cat, Dog s are allowed. There is a one-time non-refundable pet fee of $250.00 per pet. Monthly pet rent is $35.00 per pet. Aggressive breeds are prohibited. Example: Pit Bulls and Dobermans are not permitted Units: 327 Office HoursMonday:   9:00am to 5:00pm    Tuesday:   9:00am to 5:00pm    Wednesday:   9:00am to 5:00pm    Thursday:   9:00am to 5:00pm    Friday:   9:00am to 5:00pm    Saturday:   11:00am to 3:00pm    Management Company: SDK Apartments  Call Us Today!  show contact info\nx390 Equal Housing Opportunity\n","num_images":0.0,"lat":40.008697,"lng":-74.962943,"attrs":"['1BR \/ 1Ba', '811ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T14:40:14-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mount-royal-perfect-location-playground\/7489471754.html","post_id":7489471754,"result_date":"2022-05-28 14:39","title":"Perfect Location, Playground Area, Dog Park","description":"Heather Ridge Apartments, managed by Panco Management\n454 Heather Drive\nMantua, NJ 08051\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/heatherridgeapts.net\nLocated in desirable Gloucester County, our residents enjoy nearby attractions including shopping, recreation, and fine dining. Your day-to-day needs can be easily met within the surrounding area, but if you wish to explore a bit further, our location offers that as well! In less than fifteen minutes you can enjoy the city of Philadelphia or head thirty minutes south to Wilmington.\nThis two bedroom one bathroom apartment has a large living and dining room and the benefit of a great closet off for extra storage. Each bedroom has it's own large closet. Washer dryer and more!","num_images":18.0,"lat":39.807871,"lng":-75.176093,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T14:35:19-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/trumbauersville-house-shed-for-rent-only\/7489470622.html","post_id":7489470622,"result_date":"2022-05-28 14:36","title":"House w\/shed for RENT ONLY","description":"House for rent in Quakertown $1600\/ month , must have good credit and background check is needed ... PLEASE NOTE THIS HOUSE IS ON A PRIVATE LOT , we do not want a big family residing here for private septic reasons . 3 full bedrooms with 2 full bathrooms, private location, trex deck , washer\/dryer area ,full kitchen with dining area, storage shed . Tenant will be responsible for trash\/electric\/cable\/ OIL HEAT\/ lawn care. If you are interested please DM me , if you have any other comments please keep them to yourself. Disclaimer: sidewalks are being done next month. *** LONG TERM A MUST , not looking for “in between purchasing a home “ please !!!  Serious inquiries only , please do not message unless you are interested. Pets will be considered for a fee .","num_images":22.0,"lat":40.409673,"lng":-75.348852,"attrs":"['3BR \/ 2Ba', '1300ft2', 'available jun 1', '\\nsunday 2022-05-29\\n', 'application fee details: 150.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'manufactured', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T14:32:58-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-perfect-location-laundry\/7489462508.html","post_id":7489462508,"result_date":"2022-05-28 14:20","title":"Perfect Location, Laundry Room, Tree Lined Streets","description":"Top of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nTop of the Hill has a park like setting. Surrounded by two parks and lush wooded landscaping.\nThis two bedroom two bathroom apartment has plenty of space and a walk in closet. Balcony and more.","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['2BR \/ 2Ba', '1221ft2', 'available jun 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T14:16:20-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/linden-large-unit-open-floor-plan\/7489458981.html","post_id":7489458981,"result_date":"2022-05-28 14:16","title":"large unit, open floor plan, laundry, prkg","description":"Linden: for more information and to schedule an appointment contact  show contact info\nto see this newly renovated and large 2 bedroom apartment includes a large living rm, kitchen with new appliances, full bath, off-street parking, laundry rm on-premises, surveillance camera, Near All Transportation, no pets, $1750\/mo. 1.5\/mo. security.","num_images":0.0,"lat":40.6354,"lng":-74.2556,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T14:09:20-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/helmetta-luxury-2bed-2bath-with\/7489439270.html","post_id":7489439270,"result_date":"2022-05-28 14:11","title":"Luxury 2Bed 2Bath with Luxurious Amenities","description":"Contact info:\nThe Lofts at Monroe Parke |  show contact info\nTHE LOFTS AT MONROE PARKE\n623 Spotswood Englishtown Rd, Monroe Township, NJ 08831\nshow contact info\nwww.theloftsatmonroeparke.com\nIDEALLY SITUATED IN MONROE TOWNSHOP\nConvenient to Route 9\nClose to shopping centers\nLocated near many parks and recreation (Thompson Park, Manalapan Lake, hiking trails, beaches and more!)\nDESCRIPTION\nLive the lifestyle you deserve at The Lofts at Monroe Parke, a brand new luxurious community offering spacious one and two bedroom apartment homes. The Lofts will offer incredible convenience to its residents with shops and eateries below the apartments. The community has easy access to Routes 9, 18, 33 and The New Jersey Turnpike. Be among the first to live in one of the beautiful homes at The Lofts at Monroe Parke!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theloftsatmonroeparke.com\nContact info:\nThe Lofts at Monroe Parke\nshow contact info\n","num_images":8.0,"lat":40.370722,"lng":-74.401398,"attrs":"['2BR \/ 2Ba', '1031ft2', 'available jul 31', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T13:30:09-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/helmetta-beautifully-luxurious-2bed\/7489436030.html","post_id":7489436030,"result_date":"2022-05-28 14:02","title":"Beautifully Luxurious 2Bed 2Bath with Amazing Amenities","description":"Contact info:\nThe Lofts at Monroe Parke |  show contact info\nTHE LOFTS AT MONROE PARKE\n623 Spotswood Englishtown Rd, Monroe Township, NJ 08831\nshow contact info\nwww.theloftsatmonroeparke.com\nKEY FEATURES\n1 and 2 Bedroom Apartments\n9’ ceilings\nLuxury plank flooring\nQuartz countertops and vanities\nStainless steel appliances\nLarge walk-in closets with custom shelving\n… AND MORE!\nDESCRIPTION\nLive the lifestyle you deserve at The Lofts at Monroe Parke, a brand new luxurious apartment community offering spacious one and two bedroom apartment homes. With layouts ranging up to 1,358 square feet and a fabulous array of modern features, The Lofts brings a new level of style to Monroe Township. Start living in TRUE luxury. Contact us today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theloftsatmonroeparke.com\nContact info:\nThe Lofts at Monroe Parke\nshow contact info\n","num_images":8.0,"lat":40.370722,"lng":-74.401398,"attrs":"['2BR \/ 2Ba', '1031ft2', 'available jul 31', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T13:23:46-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-gas-heat-included-laundry\/7489450952.html","post_id":7489450952,"result_date":"2022-05-28 13:57","title":"Gas & Heat Included, Laundry Facilities, Playground","description":"Bedrooms: 2Bathrooms: 1Square Feet: 760Date Available: 2022-06-01Address: 601 North Black Horse PikeWork, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes. Amenities Include:Public TransportationCable HookupPoolAir ConditioningPets WelcomePrivate EntrancesGas & Heat IncludedParkingW\/W CarpetingCeiling FanPlaygroundDishwasherCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/h6kwvu3x\/laurelton-village*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":7.0,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available jun 1', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T13:53:22-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-amazing-bed-apt-is-great\/7489447109.html","post_id":7489447109,"result_date":"2022-05-28 13:49","title":"Amazing 1 bed apt is a great place in City of Allentown !","description":"Amazing 1 bedroom apartment is a great place in City of Allentown. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Capitol Hill! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $550. Please contact our courteous property Owner,","num_images":3.0,"lat":40.6068,"lng":-75.4781,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T13:45:23-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-cozy-21-in-allentown\/7489447093.html","post_id":7489447093,"result_date":"2022-05-28 13:49","title":"Cozy 2.1 In Allentown !!","description":"Cozy 2 bedroom apartment is a great place in City of Allentown. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Capitol Hill! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $850. Please contact our courteous property Owner,","num_images":3.0,"lat":40.6068,"lng":-75.4781,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T13:45:21-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/neptune-bedroom-luxury-apartment\/7489443075.html","post_id":7489443075,"result_date":"2022-05-28 13:41","title":"2 bedroom Luxury Apartment","description":"Contact info:\nThe Pointe at Neptune | Edgewood Properties |  show contact info\nTHE POINTE AT NEPTUNE\n3425 W. Bangs Avenue, Neptune, NJ 07753\nshow contact info\nwww.pointeatneptune.com\nLOCATED NEAR POPULAR DESTINATIONS\nClose to popular destinations such as Jersey Shore points, Asbury Park Boardwalk, Belmar Boardwalk\nNear popular shopping centers such as Jersey Shore Premium Outlets, Seaview Square Shopping Center, Freehold Raceway Mall, Monmouth Mall, and more!\nNext to tons of dining destinations\nEasy access to major highways\nEasy access to Jersey Shore University Medical Center\nNear numerous colleges\/universities, such as Monmouth University, Brookdale Community College, Fairleigh Dickinson University - Eatontown, and more!\nDESCRIPTION\nWelcome to The Pointe at Neptune, Edgewood Properties’ premier garden style rental community located in the heart of Monmouth County. You are invited to experience excellence in living with our scenic views, proximity to major highways and transportation, and luxurious amenities. Your new community includes concierge service, 24-hour business and fitness center, emergency maintenance and a resort style pool. A variety of spacious floor plans that offer full size washer\/ dryers, over-sized patios, and extensive kitchens. Basements are included in selected floor plans. We are open 7 days a week, and just a call or click away. Schedule your visit with our leasing professionals and you too will find that “All Roads Lead to the Pointe.”\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/pointeatneptune.com\nContact info:\nThe Pointe at Neptune\nEdgewood Properties\nshow contact info\n","num_images":5.0,"lat":40.2096,"lng":-74.0714,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T13:37:33-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-luxury-location-and\/7489437952.html","post_id":7489437952,"result_date":"2022-05-28 13:31","title":"Luxury, Location, and Convenience","description":"Apt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T13:27:36-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-lease-today-great-views\/7489427202.html","post_id":7489427202,"result_date":"2022-05-28 13:10","title":"Lease Today, Great Views, Minutes to I 95","description":"Top of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nLease today at Top of the Hill! Call for leasing details.\nThis two bedroom two bathroom apartment has plenty of space and a walk in closet. Balcony and more.\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nCommunity Features\n* After-Hours Emergency Maintenance\n* Sun Deck\n* Tennis Court\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Professionally Managed\n* Laundry Care Center\n* Renters Insurance is Required\n* Some Utilities Included\n* Car Wash Area\n* Swimming Pool\n* Fitness Studio\n* Playground\n[#9240665]","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['2BR \/ 2Ba', '1221ft2', 'available jun 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T13:06:10-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/manville-awesome-2bd-1ba-house-for-rent\/7489403856.html","post_id":7489403856,"result_date":"2022-05-28 13:08","title":"Awesome 2bd\/1ba house for rent","description":"This charming 2 bedroom, 1 bath bungalow is priced to sell at an incredible price for Manville area. Newly updated, the bones are good and the new owner can move in right away. There is a newer roof, terrific porch with bank of windows, hardwood floors, rooms freshly painted throughout in neutral colors, new flooring and ceiling fixture in the bedrooms, full basement, attic and great back garden. What an opportunity to update a home to your taste. Additionally, the home is in a terrific location with an easy walk to shopping, great schools and a beautiful park and Dell.","num_images":1.0,"lat":40.539215,"lng":-74.589453,"attrs":"['2BR \/ 1Ba', '1260ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-05-28T12:19:39-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-convenient-location-tree\/7489424245.html","post_id":7489424245,"result_date":"2022-05-28 13:04","title":"Convenient Location, Tree Lined Streets, Great Views","description":"Top of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nThis community features tennis courts, a pool and fitness center. Call Top of the Hill today!\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Central Heat and Air\n* Refrigerator\n* Vertical Blinds\n* Pre-wired for internet and cable\n* Gas Stove\n* Microwave\n* Walk-in Closet\n* Dishwasher\n[#9240376]","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['1BR \/ 1Ba', '740ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T13:00:29-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/delaware-city-amazing-bedroom-apartment\/7489413891.html","post_id":7489413891,"result_date":"2022-05-28 12:43","title":"Amazing 3  bedroom apartment is a great place in City of Wilmington.","description":"Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 3 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.  call-  show contact info\n!!","num_images":3.0,"lat":39.5725,"lng":-75.5957,"attrs":"['3BR \/ 2Ba', '2500ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T12:39:46-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/delanco-two-bedroom-townhome-with-fully\/7489411172.html","post_id":7489411172,"result_date":"2022-05-28 12:38","title":"Two-Bedroom Townhome with a Fully Equipped Kitchen & a Laundry Room","description":"Welcome Home to SDK Tenby Chase in Delran NJ  Quincy House I  2  bed \/ 2 bath \/ 2662 Sq.Ft \/ $2,637 - $2,787 SDK Tenby Chase ApartmentsAddress:  193 Tenby Chase Dr Delran, NJ 08075  Call Us Today!  show contact info\nx389  Property Description  Tenby Chase Apartments has townhomes available in the community’s largest two-bedroom, two-bathroom floor plan. This two-story layout includes a finished entertainment area and a laundry room in the basement. The foyer upstairs connects to a sunken living room that has a fireplace and wall-to-wall carpeting. Central heating and cooling ensure year-round comfort. A hallway leads to the bedrooms, including the master suite that has its own bathroom. Past the hallway closets, you will see the dining room, as well as the fully equipped kitchen. Though apartments of this floor plan have patios, the community offers more spaces for outdoor leisure, such as the saltwater pool and landscaped courtyards. The fitness center and tennis court provide various options for recreation. This pet-friendly community has a park-like setting. On-site laundry and off-street parking are available. Inquire today.  Floor Plan\/Unit Features  * Wall to wall carpeting  * New window treatments  * Fireplaces in select units  * Full-sized washer & dryer  * Abundance of closet space  * Unbelievably spacious floor plans  * Updated kitchens and baths with new appliances  * Dishwasher  * Central Heating & Air Conditio  * Dining Area  Property Amenities  * Swimming pool with free Wi-Fi  * Playground  * Pet friendly  * Tennis court  * On-site laundry  * Park like setting  * Off-street parking  * Online resident services  * Close to major highways  * On-site 24-hour maintenance  * Professional on-site management  * Professionally landscaped courtyards  * Off-street parking  * Close to dining, shopping and entertainment  * Park like setting  * Fitness center  * Clubhouse Lease Terms: 3 to 13 Months Parking:Type - Street Parking Off Street Parking and Good Guest Parking Available Pet Policy: Cat, Dog s are allowed. There is a one-time non-refundable pet fee of $250.00 per pet. Monthly pet rent is $35.00 per pet. Aggressive breeds are prohibited. Example: Pit Bulls and Dobermans are not permitted Units: 327 Office HoursMonday:   9:00am to 5:00pm   Tuesday:   9:00am to 5:00pm   Wednesday:   9:00am to 5:00pm   Thursday:   9:00am to 5:00pm   Friday:   9:00am to 5:00pm   Saturday:   11:00am to 3:00pm   Management Company: SDK Apartments Call Us Today!  show contact info\nx389 Equal Housing Opportunity\n","num_images":0.0,"lat":40.008697,"lng":-74.962943,"attrs":"['2BR \/ 2Ba', '2662ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T12:34:15-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-multi-family-units-for-rent\/7489404049.html","post_id":7489404049,"result_date":"2022-05-28 12:24","title":"MULTI FAMILY 2 UNITS FOR RENT","description":"One of a Kind, Brand New Construction 2 family house- 4 levels of space.  Finished basement, Each unit has 3 BR’s  3 full baths, 2 (1\/2 baths). One unit  has an office All new appliances – Stove, Dishwasher, Microwave, Refrigerator, Kitchen with granite counter tops.  Each unit has a one car garage.  Beautiful Parklike yard.  Available July 1st.  Credit Check, NTN report, job verification, no pets.\nCommuters delight – block from Woodbridge Train Station, NJ Transit bus.  One unit $4,500 per month  & other unit with office $5,000 per month.  Landlord hands the snow removal and landscaping.","num_images":3.0,"lat":40.5576,"lng":-74.284053,"attrs":"['3BR \/ 3Ba', 'available jul 1', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T12:20:03-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-tattered-cover-twist-and-shout\/7489393366.html","post_id":7489393366,"result_date":"2022-05-28 12:02","title":"Tattered Cover, Twist and Shout, Starbucks and Sprouts +","description":"Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.\nContact me to schedule a viewing @ ;;Please call or text for showing::   show contact info","num_images":6.0,"lat":40.338,"lng":-75.978,"attrs":"['3BR \/ 2Ba', '1408ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T11:58:32-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-tattered-cover-twist-and-shout\/7489393364.html","post_id":7489393364,"result_date":"2022-05-28 12:02","title":"Tattered Cover, Twist and Shout, Starbucks and Sprouts +++","description":"Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.\nContact me to schedule a viewing @ ;;Please call or text for showing::   show contact info","num_images":6.0,"lat":40.338,"lng":-75.978,"attrs":"['3BR \/ 2Ba', '1408ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T11:58:31-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-spacious-bedroom-apartment-is\/7489386602.html","post_id":7489386602,"result_date":"2022-05-28 11:48","title":"spacious 2 bedroom apartment is a great place in reading","description":"spacious 2 bedroom apartment is a great place in reading  . Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $700. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Capitol Hill! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $660.","num_images":1.0,"lat":40.3886,"lng":-75.9328,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-28T11:44:32-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/south-river-luxury-apartments-pool-gym\/7489356395.html","post_id":7489356395,"result_date":"2022-05-28 11:45","title":"Luxury Apartments Pool, Gym and More","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21.0,"lat":40.457525,"lng":-74.394361,"attrs":"['1BR \/ 1Ba', '817ft2', 'available now', '\\nsunday 2022-05-29\\n', '\\nmonday 2022-05-30\\n', '\\ntuesday 2022-05-31\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T10:38:58-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/wrightstown-for-rent-duplex-bedroom\/7489384683.html","post_id":7489384683,"result_date":"2022-05-28 11:44","title":"For Rent duplex 3 bedroom North Hanover","description":"Quiet neighborhood\nLivingroom Kitchen 3 bedrooms Bath\nCentral air-condition Fans in several rooms washer and dryer\nReference required\/ credit check  1 1\/2 month security  at move in One year lease\nrequired\nNo pets no exceptions\nexcellent school district\nContact Al mendicino at  show contact info\nfor application Leave message if no answer","num_images":10.0,"lat":40.059075,"lng":-74.587512,"attrs":"['3BR \/ 1Ba', 'available jun 15', 'air conditioning', 'duplex', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:40:28-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/ashland-amazing-bed-apartment-in-city-of\/7489382177.html","post_id":7489382177,"result_date":"2022-05-28 11:39","title":"Amazing 1 bed Apartment in City of","description":"Amazing 1 bedroom apartment is a great place. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $400. Contact me to schedule a viewing @ ;; - aldeesha100 (at)_gmail_(dot)com","num_images":1.0,"lat":40.7732,"lng":-76.343,"attrs":"['3BR \/ 1Ba', 'apartment', 'laundry in bldg', 'carport', 'rent period: daily']","posted_date":"2022-05-28T11:35:15-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/manville-awesome-2bd-1ba-house-for-rent\/7489352561.html","post_id":7489352561,"result_date":"2022-05-28 11:39","title":"Awesome 2bd\/1ba house for rent","description":"Come check out this well maintained one family home located in Manville. The first floor features a large living room with an electric fireplace, formal dining room, and a half bathroom. As well as an eat in kitchen and a sunny and bright sunroom. The second floor contains 2 large bedrooms with a large full bathroom. The home also features a 1 car attached garage. Do not miss your opportunity to see the beautiful yard and large deck for entertainment! Call today to schedule your private viewing!","num_images":1.0,"lat":40.539445,"lng":-74.602557,"attrs":"['2BR \/ 1Ba', '1270ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-05-28T10:30:04-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-laundry-facilities-gas\/7489378745.html","post_id":7489378745,"result_date":"2022-05-28 11:32","title":"Laundry Facilities, Gas & Heat Included, Pets Welcome","description":"Bedrooms: 2Bathrooms: 1Square Feet: 760Date Available: 2022-06-01Address: 601 North Black Horse PikeWork, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes. Amenities Include:PlaygroundCable HookupPets WelcomeW\/W CarpetingCeiling FanDishwasherLaundry FacilitiesPrivate EntrancesParkingLarge Floor PlansGas & Heat IncludedAir ConditioningCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/rwqgr2ao\/laurelton-village*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":7.0,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available jun 1', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:28:15-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-spacious-modern-living\/7489376698.html","post_id":7489376698,"result_date":"2022-05-28 11:27","title":"Spacious Modern Living","description":"Apt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T11:23:37-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-charming-bed-bath-move-in\/7489348651.html","post_id":7489348651,"result_date":"2022-05-28 11:12","title":"Charming 4 bed 4 bath MOVE IN READY ranch!!!","description":"W Chew St,  Mint condition 2 story colonial situated on a .295 acre cul-de-sac lot backing up to open space in the popular Springwood Hills subdivision - Parkland Schools and steps away from Trexler Park. 1st flr has a 2 story entry foyer, formal living room, formal dining room, nicely appointed kitchen w\/light maple cabinetry, granite counters and custom center island opens to the vaulted ceiling family room with marble surround fireplace, oversized window & a back staircase to the 2nd flr. In addition there is an office w\/back lit accent ceiling & French door, powder rm & access to a 2 car garage. HW floors thru-out most of the 1st flr. 2nd flr has a MBR suite w\/tray ceiling, full bath & walk-in cedar closet. Additional 3 bedrooms w\/split full bath. You are going to love the amazing finished basement w\/built in wet bar, full bath & walk-out. Enjoy the outdoor living that this home offers on the multi-tiered Trex deck w\/pergola. Close to schools, shopping, park, Wegmans, golf course and Rt 78. Please call or text::   show contact info","num_images":7.0,"lat":40.6018,"lng":-75.5225,"attrs":"['4BR \/ 4Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T10:20:18-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/matawan-waitlist-1b-1b-beautiful\/7489368449.html","post_id":7489368449,"result_date":"2022-05-28 11:09","title":"Waitlist 1B\/1B w Beautiful Amenities and 24 Hr Fitness Center","description":"Contact info:\nThe Edge at Matawan | Edgewood Properties |  show contact info\nTHE EDGE AT MATAWAN\n249 Broad St, Matawan, NJ 07747\nshow contact info\nwww.theedgeatmatawan.com\nResidential Community with Luxurious Services and Amenities\nResident Lounge\nBusiness Center\n24 Hour Fitness Center\nConference Room\nElevators\nBicycle Storage\nCovered and Surface Parking\nDESCRIPTION\nLive the lifestyle you deserve at The Edge at Matawan, a brand new luxurious apartment community offering spacious one and two bedroom apartment homes. The Edge will offer incredible convenience to its residents with shops and eateries below the apartments. The community has easy access to the Garden State Parkway, Routes 34, 35, and 36 and I-287. The Edge at Matawan offers commuter convenience,the Matawan Aberdeen Train station is just minutes away, and a NJ Transit bus stops at the community. Be the first to rent a first class apartment home at The Edge at Matawan!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/theedgeatmatawan.com\nContact info:\nThe Edge at Matawan\nEdgewood Properties\nshow contact info\n","num_images":24.0,"lat":40.4085,"lng":-74.233458,"attrs":"['1BR \/ 1Ba', '1003ft2', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T11:05:24-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/vineland-welcome-home-bedroom-bath-home\/7489361666.html","post_id":7489361666,"result_date":"2022-05-28 10:55","title":"Welcome home! 2 bedroom 1 bath home@@@!!!@@!","description":"Welcome home! Enjoy a relaxing weekend read on the front porch, featuring a newly finished epoxy non skid coating. This turnkey rancher boasts 2 bedrooms and 1 bathroom, single level living,\nCALL\/TEXT ME  show contact info\nAmazing 2 bedroom apartment is a great place in City of Hartford. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity.Reasonably priced at $732.\nJust finishing up fresh apt, quality renovations including new kitchen cabinets, counters, appliances, new bathrooms, new hardwood floors throughout entire apartment! 2 huge bedrooms, 1 spacious bathroom, in-building laundry room with full size washer and dryer. Lots of closet space. Parking available. An incredible deal. What are you waiting for?\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmazing 3 bedroom apartment is a great place in City of . Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 3 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $750\n","num_images":4.0,"lat":39.4818,"lng":-75.0091,"attrs":"['2BR \/ 1Ba', '1008ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-28T10:51:10-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/vineland-welcome-home-bedroom-bath-home\/7489361658.html","post_id":7489361658,"result_date":"2022-05-28 10:55","title":"Welcome home! 2 bedroom 1 bath home@@@!!!@@!","description":"Welcome home! Enjoy a relaxing weekend read on the front porch, featuring a newly finished epoxy non skid coating. This turnkey rancher boasts 2 bedrooms and 1 bathroom, single level living,\nCALL\/TEXT ME  show contact info\nAmazing 2 bedroom apartment is a great place in City of Hartford. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity.Reasonably priced at $732.\nJust finishing up fresh apt, quality renovations including new kitchen cabinets, counters, appliances, new bathrooms, new hardwood floors throughout entire apartment! 2 huge bedrooms, 1 spacious bathroom, in-building laundry room with full size washer and dryer. Lots of closet space. Parking available. An incredible deal. What are you waiting for?\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmazing 3 bedroom apartment is a great place in City of . Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 3 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $750\n","num_images":4.0,"lat":39.4818,"lng":-75.0091,"attrs":"['2BR \/ 1Ba', '1008ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-28T10:51:09-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/vineland-welcome-home-bedroom-bath-home\/7489361645.html","post_id":7489361645,"result_date":"2022-05-28 10:55","title":"Welcome home! 2 bedroom 1 bath home@@@!!!@@!","description":"Welcome home! Enjoy a relaxing weekend read on the front porch, featuring a newly finished epoxy non skid coating. This turnkey rancher boasts 2 bedrooms and 1 bathroom, single level living,\nCALL\/TEXT ME  show contact info\nAmazing 2 bedroom apartment is a great place in City of Hartford. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity.Reasonably priced at $732.\nJust finishing up fresh apt, quality renovations including new kitchen cabinets, counters, appliances, new bathrooms, new hardwood floors throughout entire apartment! 2 huge bedrooms, 1 spacious bathroom, in-building laundry room with full size washer and dryer. Lots of closet space. Parking available. An incredible deal. What are you waiting for?\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmazing 3 bedroom apartment is a great place in City of . Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 3 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $750\n","num_images":4.0,"lat":39.4818,"lng":-75.0091,"attrs":"['2BR \/ 1Ba', '1008ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-28T10:51:07-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/highland-park-bedroom-bath-1fl-apt\/7489344262.html","post_id":7489344262,"result_date":"2022-05-28 10:13","title":"3 Bedroom 1 Bath (1FL Apt)","description":"3 Bedroom 1 Bath, 1 FL whole floor for rent.  Include Washer and Dryer in unit, living room, all furniture, Window AC units (additional $30 per month, per unit from June to September).\n5 minutes walk to the bus station that will take you to Rutger's University, New Brunswick Train Station.\nWalking to Stop & Stop.  5 minutes to HMart, 99 Ranch Market by car.\nPlease email me (Miao Li) or TEXT Wentai Li (owner) at the phone number provided for schedule showing.\n","num_images":9.0,"lat":40.499985,"lng":-74.4207,"attrs":"['3BR \/ 1Ba', '1000ft2', '\\nsaturday 2022-05-28\\n', '\\nsunday 2022-05-29\\n', '\\nmonday 2022-05-30\\n', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T10:09:32-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-one-level-living-in-an\/7489335192.html","post_id":7489335192,"result_date":"2022-05-28 10:01","title":"One Level Living in an attractive all brick unit.","description":"One Level Living in an attractive all brick unit. Enter and find a spacious Foyer with plenty of closet space. To your left is the entrance to the second Bedroom and the second Bathroom. If you don't have a need for a second bedroom you could make it into what ever you desire, like a den\/office, or reading room. The second bathroom features a step in Shower, tile flooring and a granite counter top. Down the hall you will find a very spacious Living Room, with a very nice Brick Wood Burning Fireplace. There are built-ins on both sides of the fireplace. The home owner has not used the wood burning fireplace but is using an electric insert. New Flooring through out. To the back of the Living Room you will find the Kitchen with S\/S appliances and sink. Plenty of cabinet storage, garbage disposal, Corian countertops and bar. At the end of the bar you will find an area that could be used for a formal Dining Room. Here you will also exit to the Laundry Room\/Utility Room, which if you continue on you will enter the one car Garage with garage opener and an outside Keypad.\n","num_images":6.0,"lat":40.2995,"lng":-75.9876,"attrs":"['3BR \/ 2.5Ba', '1967ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T09:47:06-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-amazing-bedroom-apartment-is\/7489338023.html","post_id":7489338023,"result_date":"2022-05-28 09:58","title":"Amazing 1 bedroom apartment is a great place in City of Wilmington.","description":"Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.","num_images":3.0,"lat":39.7168,"lng":-75.6184,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T09:54:10-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-townhomes-for-rent\/7489337582.html","post_id":7489337582,"result_date":"2022-05-28 09:57","title":"Townhomes for rent@@@","description":"Just finishing up fresh Townhomes, quality renovations including new kitchen cabinets, counters, appliances, new bathrooms, new hardwood floors throughout entire apartment! 2 huge bedrooms, 1 spacious bathroom, in-building laundry room with full size washer and dryer. Lots of closet space. Parking available. An incredible deal. What are you waiting for?\nIf interested please call or text for more information & booking:: show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmazing 1 bedroom apartment is a great place in City of . Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity.\n","num_images":5.0,"lat":40.6018,"lng":-75.5225,"attrs":"['3BR \/ 2.5Ba', '2022ft2', 'available now', 'townhouse', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T09:53:03-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-parking-dishwasher-w\/7489337082.html","post_id":7489337082,"result_date":"2022-05-28 09:55","title":"Parking, Dishwasher, W\/W Carpeting","description":"Work, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes.\n-Gas & Heat Included\n-Dishwasher\n-Private Entrances\n-Laundry Facilities\n-Pool\n-Playground\n-W\/W Carpeting\n-Parking\n-Cable Hookup\n-Ceiling Fan\n-Pets Welcome\n-Air Conditioning\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/lhy43z4q\/laurelton-village\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":7.0,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available jun 1', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T09:51:47-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-love-where-you-live\/7489331528.html","post_id":7489331528,"result_date":"2022-05-28 09:41","title":"Love Where You Live","description":"Apt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T09:37:47-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-recently-renovated-spacious\/7489306384.html","post_id":7489306384,"result_date":"2022-05-28 08:48","title":"Recently renovated spacious 2 Bedroom APT For rent In Lawrence Townshi","description":"Recently renovated spacious 2 Bedroom. New kitchen, new bathroom, restored floors, combined with old house charm. Newly painted. Walking distance to The Lawrence school and downtown. Extra large walk up 2nd bedroom, Water, Hot Water included, Laundry on site, off street parking. Shops, Cafe, Dining, Right across from Lawrenceville prep, and close to transportation. Rte 295, 206, a few miles to Princeton.","num_images":1.0,"lat":40.2171,"lng":-74.7429,"attrs":"['2BR \/ 1Ba', 'available jun 1', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T08:06:34-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-amazing-bedroom-apartment-is\/7489315249.html","post_id":7489315249,"result_date":"2022-05-28 08:48","title":"**Amazing 3 bedroom apartment is a great place in City of lancaster.**","description":"Amazing 3 bedroom apartment is a great place in City of lancaster. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Capitol Hill! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $620. Please contact our courteous property Owner, at massage me:  show contact info","num_images":3.0,"lat":40.0091,"lng":-76.3671,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T08:44:13-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/harrisburg-amazing-bedroom-apartment-is\/7489313226.html","post_id":7489313226,"result_date":"2022-05-28 08:40","title":"Amazing 1 bedroom apartment is a great place in City of Lancaster.","description":"Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $850.","num_images":0.0,"lat":40.2927,"lng":-76.8501,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T08:36:41-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-nice-2br-ranch-home\/7489310139.html","post_id":7489310139,"result_date":"2022-05-28 08:28","title":"Nice 2br Ranch Home - Conveniently Located","description":"Fabulous 2 bedroom 1 bath ranch Features an attached garage, wonderful wooden back deck in the fully fenced backyard, dedicated laundry area with washer\/dryer hookups, updated kitchen with all appliances, formal dining area and hardwood flooring throughout.  Move in ready!!\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmazing 1 bedroom apartment is a great place in City of .\nTattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.\n","num_images":8.0,"lat":40.6018,"lng":-75.5225,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T08:24:17-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/princeton-furnished-bed-apartment-in\/7489306807.html","post_id":7489306807,"result_date":"2022-05-28 08:27","title":"*FURNISHED 2-bed apartment in the heart of Palmer Square !!","description":"This 2Bed\/1Bath apartment is centrally located in Princeton downtown. You will enjoy modern conveniences while appreciating its historic status at the same time. This beautiful apartment was completely modernized with interior design by a leading architecture design firm. The quality of workmanship can be observed in the details of every corner. It will not disappoint any discerning eyes! With high ceilings, hardwood floors, built-in bookshelf cabinetry flanking the fireplace, this bright apartment has a Bosch washer and dryer in the unit. The designer kitchen has a Bertazzoni gas stove, Liebherr refrigerator, Bosch dishwasher, granite countertops, under-cabinet lighting, glass tile backsplash, and a built-in breakfast nook overlooking the Green on Palmer Square.","num_images":4.0,"lat":40.3535,"lng":-74.6594,"attrs":"['2BR \/ 1Ba', 'available jun 1', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T08:08:38-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-amazing-bed-apartment-in-city\/7489309055.html","post_id":7489309055,"result_date":"2022-05-28 08:23","title":"Amazing 1 bed Apartment in City of","description":"Amazing 1 bedroom apartment is a great place. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $400. Contact me to schedule a viewing @ ;; - aldeesha100 (at)_gmail_(dot)com","num_images":1.0,"lat":40.0262,"lng":-76.1686,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T08:19:06-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-tennyson-ave-pa-new-microwave\/7489308711.html","post_id":7489308711,"result_date":"2022-05-28 08:21","title":"Tennyson Ave +  PA 19608 + New Microwave + Stove+ Den!","description":"Amazing 1 bedroom apartment is a great place in City of Tennyson Ave, Reading,PA. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment.Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.","num_images":3.0,"lat":40.3113,"lng":-76.0345,"attrs":"['2BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T08:17:39-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/edison-great-location-convenient-to\/7489308536.html","post_id":7489308536,"result_date":"2022-05-28 08:20","title":"Great location - convenient to shopping, schools.","description":"This 2 ba 2 br home has laminate floors in great room, kitchen, and foyer. Both bedrooms are carpeted. Nice fenced backyard with storage area. Location is convenient to shopping, schools, medical facilities.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmazing 1 bedroom apartment is a great place in City of .\nTattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.\n","num_images":6.0,"lat":40.578,"lng":-74.3589,"attrs":"['2BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-28T08:16:46-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-beautiful-renovated-house\/7489300911.html","post_id":7489300911,"result_date":"2022-05-28 08:19","title":"Beautiful renovated house","description":"Large 1 bedroom with finished attic and basement 1 baths, laundry hook up. Freshly painted inside and out. New kitchen with dishwasher. Wood laminate floors. Parking is on street. Large backyard with great view. Near Lehigh University, shopping and casino. NO CATS. Must have proof of income $750 per month. Great for professionals or professor. No evictions or criminal history. Credit of 650 or more.\nif qualified.\n","num_images":0.0,"lat":40.6068,"lng":-75.4781,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T07:36:21-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/glassboro-fantastic-well-maintained-end\/7489303357.html","post_id":7489303357,"result_date":"2022-05-28 08:06","title":"Fantastic well maintained end unit ready for occupancy!! Unit was recently updat","description":"TEXT ONLY FOR FAST RESPONSE PLEASE!!!\nshow contact info\nFantastic well maintained end unit ready for occupancy!! Unit was recently updated with new paint and new carpet installed on second floor! Awesome finished basement with bonus room and lighted bar.Fireplace in living room and large deck.Lots of storage space.\n","num_images":17.0,"lat":39.698,"lng":-75.131,"attrs":"['2BR \/ 1.5Ba', '1474ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T07:51:03-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/centerport-free-room-for-grandma\/7489300962.html","post_id":7489300962,"result_date":"2022-05-28 07:40","title":"FREE Room For Grandma!","description":"Local family wants to 'adopt' a live-in Grandma who can assist mom in chores and old fashion discipline training for cutest girls.\n**In GORGEOUS Pennsylvania**\n- Food Included\n- Free Housing\n- All utilities with WiFi\n- Car for errands\n- Own Room\n- Great schedule\n- Fun activities\n- Spending money\n- Neighborly environment\n- Countryside walks\nLooking forward to meeting you!","num_images":0.0,"lat":40.4783,"lng":-76.0125,"attrs":"['4BR \/ 1.5Ba', '1500ft2', 'available jun 1', 'air conditioning', 'dogs are OK - wooof', 'furnished', 'house', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T07:36:41-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/amazing-bedroom-apartment-is-great\/7489300688.html","post_id":7489300688,"result_date":"2022-05-28 07:38","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-studio-apartment-available\/7489271371.html","post_id":7489271371,"result_date":"2022-05-28 01:18","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-amazing-bedroom-apartment-is\/7489267766.html","post_id":7489267766,"result_date":"2022-05-28 00:50","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-amazing-bedroom-apartment-is\/7489258940.html","post_id":7489258940,"result_date":"2022-05-27 23:51","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-convenient-location-fitness\/7489545713.html","post_id":7489545713,"result_date":"2022-05-28 17:26","title":"Convenient Location, Fitness Center, Close to Shops and Dining","description":"Discover an easier, more fulfilling way of life at The Point at Plymouth Meeting. We have all the modern amenities in a great location close to some if the areas best dining, retail, and entertainment options. Call for a tour!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, walk-in closet, and a private patio\/balcony!\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\n[#9240412]","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['2BR \/ 2Ba', '1078ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-05-28T17:22:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-35-bath-home\/7489509310.html","post_id":7489509310,"result_date":"2022-05-28 17:01","title":"4 bedroom\/3.5 bath home, complete with 4-car parking!!","description":"N Beechwood St, Look no further; this exceptional, architect-designed Art Museum home has space, space and more space! With seemingly endless improvements, this 2-story, 4 bedroom\/3.5 bath home, complete with 4-car parking (2-car garage & 2 driveway spaces) will tick all your boxes. Nestled on a quiet tree-lined street in the Fairmount area of Philadelphia, this home offers a rare chance to own 2400+ square feet in the city (plus roughly 1000 sq ft below grade!). The owners combined the two side-by-side homes in a thoughtful and practical way, allowing for interesting and smart spaces. The expansive enclosed porch welcomes you as the perfect place to sit year-round to watch the world go by.  Enter into the airy foyer featuring original oak floors with walnut inlay. The living room flows off of the foyer in one direction, and the dining room in another, giving the main living level an open and casual vibe. Step from the living room into a cozy sitting area, which then leads you into your bonus room. Currently used as an office, this fabulously placed room could serve as an office, playroom, art\/homework room, or home gym! Towards the rear of the house,  the butler's pantry - complete with wet bar and wine fridge - leads you to the dining room and kitchen, making holidays and entertaining effortless. The bright and cheerful kitchen (renovated in 2017) features chic quartz counter tops, large subway tile backsplash, glass front cabinetry, stainless steel appliances, including a hand-made Blue Star chef’s range and access to a peaceful, private deck. The main level, completed by a powder room, also offers central AC and refinished floors. The upper level has a special layout and can be as conventional or unique as you want! Welcoming you at the top of the stairs is the lovely sitting area which could be kept as is, turned into a home library, reading\/tv lounge, art nook, etc. There are 4 spacious bedrooms, and the current owners have used two of them - plus one of the two hall baths - as the primary suite. There is a second full bath on the upper level, as well. The lower level finished basement just keeps going and features a large laundry room with a full bathroom, another bonus room, ample storage, a massive walk-in pantry, and interior access to 2 separate garages and 2 additional parking spots. This special home also boasts a 2017 roof, updated plumbing and electrical, new porch windows, fresh paint, and more! This home was truly loved and cherished and is waiting for you. Schedule your private showing today!\nFor more information and pictures call 🏠 ☎️  show contact info","num_images":14.0,"lat":39.9677,"lng":-75.1735,"attrs":"['4BR \/ 3.5Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T15:55:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bright-unique-home\/7489528801.html","post_id":7489528801,"result_date":"2022-05-28 16:44","title":"This bright, unique home includes central heat\/air","description":"This bright, unique home includes central heat\/air, a newly remodeled bathroom with a soaking tub & shower, a kitchen with stainless steel appliances and granite countertops, two bedrooms with ample closet space, and a gorgeous screened-in porch leading to a back yard. The cobblestone patio is surrounded by gardens with local native plantings and fruit trees, encircled by gorgeous bamboo fencing and honeysuckle.Full unfinished basement includes a new dryer and a washer. Text \/call  show contact info\nfor more information to schedule move in date..","num_images":8.0,"lat":39.9207,"lng":-75.1595,"attrs":"['2BR \/ 1Ba', '1008ft2', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T16:40:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/annapolis-totally-updated-bedroom-bath\/7489525923.html","post_id":7489525923,"result_date":"2022-05-28 16:37","title":"Totally updated 2 bedroom, 1 bath lower apartment available","description":"Totally updated 2 bedroom, 1 bath lower apartment available. Apartment features an open floor plan, original hardwood floors, tiled bathroom, and updated kitchen with granite countertops and stainless steel appliances. Washer and dryer hookups are located in the basement. One off-street parking space included!2 bedroom apartment is a great place in City of Savannah, Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of ! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $575","num_images":1.0,"lat":37.3981,"lng":-90.6702,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-28T16:33:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bedroom-full-bath\/7489508105.html","post_id":7489508105,"result_date":"2022-05-28 16:17","title":"Amazing 3-bedroom, 2 full bath HOUSE FOR RENT@!","description":"W Mount Airy Ave, Welcome to 436 W Mt Airy Ave, an exceptional Northwest twin on a quiet tree-lined street in beautiful West Mt.Airy. This turnkey home was has been rewired (no knob and tube!)  and boasts air conditioning, (mini-splits), a garage, and lovely patio surrounded by greenery.  As one enters the house, there is a light-filled converted sunroom that features the lovely crown molding and trim found throughout the house. Hardwood floors flow from the sunroom through the living room and into the dining room, giving the first floor a cohesive, open feeling, perfect for entertaining. The living room, itself, features an ornamental fireplace that can accommodate a gas insert if desired. The full dining room includes a beautiful alcove, perfect for your hutch or sideboard, a large storage closet and a built-in corner cabinet for table-setting essentials. Beyond, the eat-in kitchen has been updated with granite countertops, a dishwasher and garbage disposal, solid wood soft-close cabinets, a stainless steel refrigerator, and is made particularly special with a backsplash of Mercer tiles from the legendary Moravian tileworks. There is an exterior door that leads from the kitchen to the side yard and the steps to the garage at the rear of the house, making unloading groceries a breeze. Additional living space, including a half-bathroom can be found in the partially finished basement, which also includes a washer\/dryer,  room for extra storage or additional living space, and walk out access to the alley.  On the second floor, you will find 3 generously-sized bedrooms, all with original hardwood floors, updated windows, ceiling fans, and each with its own mini-split unit for air conditioning—but also for heating on those chilly Fall nights when you don’t want to turn on the furnace. The larger front bedroom features an abundance of closet space, a built-in makeup table and tree top views of lovely West Mount Airy Avenue.  The hall bath, with white tile, has a shower and tub combo, a vanity with storage, and a full-sized linen closet.  Beyond what the eye can easily see, 436 W Mt Airy offers peace of mind for the savvy buyer with its new sewer line, replacement windows, updated wiring (no knob and tube!) and the mini-split AC system.  What’s more, the home was certified lead safe in 2021.  Full of character and charm, this home is walking distance to the Allen Lane Septa train station (where you will find the famous and much-loved High Point Café), Huston Elementary, Allens Lane Arts Center (with its theatre, art classes, tennis courts and playground) and the walking and biking trails of Wissahickon Park. It is also near Weaver’s Way Co-op, Mt. Airy Tap Room, and all the shopping both Mt. Airy and Chestnut Hill have to offer. Come and see, you won’t be disappointed!\nFor more information and pictures call 🏠 ☎️  show contact info","num_images":10.0,"lat":40.0547,"lng":-75.1866,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T15:53:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1br-private-bathroom\/7489514242.html","post_id":7489514242,"result_date":"2022-05-28 16:10","title":"1BR + Private Bathroom Available in Fishtown!","description":"Hi All!\nI’m looking for someone to take over my room in a 4 bedroom\/4 bathroom house in Fishtown! Room is very spacious with a private bathroom, closet, and additional closet space in the hallway. Laundry in the basement! Pet friendly! There are currently two dogs living here, but one will be moving out at the end of August - more pets welcome!\nAbout a 15 minute walk to all the bars and restaurants and close to Fishtown Crossing w\/ a grocery store and Starbucks😊\n$787.50 rent + water, electric, gas, and internet so comes to around $850-$900 total a month.\n$ 750 security deposit\n$ 55 application fee\n(Total rent subject to 5% increase at the end of August - still working out the details with the leasing company!)\nLooking for someone to move in on July 17th - would work out half a months rent!\nPhoto of dog, Hank (a Chiefs fan), that will be staying included😅\nThank you!\n","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['4BR \/ 4Ba', 'available jul 17', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T16:06:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-perfect-location-fenced-dog\/7489511712.html","post_id":7489511712,"result_date":"2022-05-28 16:05","title":"Perfect Location, Fenced Dog Park, Fitness Center","description":"VIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nLease today at The Point at Plymouth Meeting in Norristown, PA. Our community has a resort-style swimming pool, an outdoor lounge, and a newly renovated clubhouse. Contact us for more information!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, entry closet, washer\/dryer, walk-in closet, and a private patio\/balcony!\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['1BR \/ 1Ba', '769ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-05-28T16:01:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-lease-today-close-to-shops\/7489511402.html","post_id":7489511402,"result_date":"2022-05-28 16:04","title":"Lease Today, Close to Shops and Dining, Laundry in Unit","description":"VIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nThe Point at Plymouth Meeting offers open floor plans, clean white cabinetry, and sleek kitchens that immerse you in style, while sunny dining areas, wall-to-wall carpeting, and private patios will lull you into the easy life. Visit us today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, entry closet, washer\/dryer, walk-in closet, and a private patio\/balcony!\n[#9240613]","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['1BR \/ 1Ba', '769ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-05-28T16:00:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cute-fishtown-row-house\/7489502014.html","post_id":7489502014,"result_date":"2022-05-28 15:45","title":"Cute Fishtown Row house","description":"Really cute home for rent with backyard and basement. First floor has hardwood floors and open dining and living room. Ikea Kitchen with two rooms with door out to back yard. Backyard has rose bush and grille. Second floor has two rooms that open out onto each other, there is no hallway. Large bath with tub. Basement has fill size washer and dryer. Plenty of off street parking on quiet street down the block from Memphis TapRoom. Nothing fancy - just a great house that you will feel at home in and love.\nFirst, last and security rents needed to move in.\nNo dogs.\nNo smoking.","num_images":9.0,"lat":39.979124,"lng":-75.125593,"attrs":"['2BR \/ 1Ba', '1100ft2', 'available jul 4', 'cats are OK - purrr', 'house', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T15:39:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/guilderland-cozy-21-in-philadelphia\/7489496528.html","post_id":7489496528,"result_date":"2022-05-28 15:31","title":"Cozy 2.1 In Philadelphia  !!","description":"Cozy 2 bedroom apartment is a great place in City of Philadelphia . Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Capitol Hill! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $750. Please contact our courteous property Owner, show contact info","num_images":4.0,"lat":42.6973,"lng":-73.8975,"attrs":"['2BR \/ 1Ba', 'EV charging', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T15:27:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-opportunities-for\/7489489156.html","post_id":7489489156,"result_date":"2022-05-28 15:21","title":"Great opportunities for @ll(1bd+1bt) is a great City of Philadelphia","description":"Great opportunities for @ll(1bd+1bt) is a great City of Philadelphia. Twist and Shout,Tattered Cover, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighbourhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $600. Quick response, text here :  show contact info\nUpdated interior, new kitchen cabinets, vanity set, appliances, w\/c closet.","num_images":3.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-28T15:12:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-incredible-amenities\/7489478688.html","post_id":7489478688,"result_date":"2022-05-28 14:54","title":"Incredible Amenities, Stylish Features, Lease Today","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nLease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Putting Green\n* TV Lounge\n* Bark Park\n* Outdoor Grill Area\n* Swimming Pool\n* Bocce Ball\n* Sun Deck\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* Yoga Lounge\n* Professionally Managed\n* Easy Freeway Access\n* Community Lounge\n* Fitness Studio\n[#9241091]","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-05-28T14:50:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7489473876.html","post_id":7489473876,"result_date":"2022-05-28 14:43","title":"Schedule a Tour, Granite Countertops, Playground","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, master suite, washer\/dryer, walk-in closets, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\n[#9241150]","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1210ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T14:39:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-charming-bedroom-apartment\/7489470624.html","post_id":7489470624,"result_date":"2022-05-28 14:36","title":"Charming 2 bedroom apartment is a great place in City of philidilphia.","description":"Charming 2 bedroom apartment is a great place in City of Philidilphia. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Ocala! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $500. Please contact me now for view and more information. Text  show contact info","num_images":1.0,"lat":39.9579,"lng":-75.2681,"attrs":"['2BR \/ 1.5Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T14:32:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-perfect-location-direct-access\/7489468197.html","post_id":7489468197,"result_date":"2022-05-28 14:32","title":"Perfect Location, Direct Access Garages, Fitness Center","description":"The Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nYou will love living at The Point at Pennbrook Station. From our prime location in Lansdale, PA, you can easily travel to North Wales, Hatfield, Blue Bell, City Center Philadelphia, and the Philadelphia International Airport. Visit us today!\nThis second floor two bedroom two bathroom apartment features a fully equipped kitchen with island, coat closet, walk-in closets, washer\/dryer, two porches, and direct access to the garage downstairs!\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nApartment Features\n* Central Heat and Air\n* Stainless Steel Appliances\n* Microwave\n* Disposal\n* Refrigerator\n* Wood-Like Floors\n* Dishwasher\n* Full sized Washer and Dryer in unit\n* Granite Countertops\nCommunity Features\n* Easy Freeway Access\n* Short Term Lease Available\n* After-Hours Emergency Maintenance\n* Package Acceptance\n* Garage Parking\n* Swimming Pool\n* Bark Park\n* WiFi Access\n* Fitness Studio\n* Easy Access to Public Transportation\n* Community Kitchen\n* Outdoor Grill Area\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Community Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Sun Deck\n[#9241016]","num_images":12.0,"lat":40.226234,"lng":-75.283466,"attrs":"['2BR \/ 2Ba', '989ft2', 'available aug 6', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T14:28:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated-1250\/7489463677.html","post_id":7489463677,"result_date":"2022-05-28 14:22","title":"Completely renovated 1250 sq ft upstairs apartment,++","description":"Completely renovated 1250 sq ft upstairs apartment, beautiful 2 bedrooms 2 bathrooms, hardwood floors, laundry hook up and plenty of closet space, off street parking, walking distance to Arnot Hospital,\n2 bedroom apartment is a great place in City of Elmira, Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Elmira! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650 Please contact our courteous property Owner, at Text me:  show contact info","num_images":4.0,"lat":39.9523,"lng":-75.1638,"attrs":"['2BR \/ 2Ba', '1250ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T14:18:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7489463172.html","post_id":7489463172,"result_date":"2022-05-28 14:21","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"When you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nApartment Features\n* Stainless Steel Appliances\n* Garden Tub\n* Linen Closet\n* Walk-in Closet\n* Private Patio or Private Balcony (on select apartments)\n* Kitchen Island\n* Washer and Dryer in unit","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T14:17:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bath-queen-village\/7489463100.html","post_id":7489463100,"result_date":"2022-05-28 14:21","title":"3 Bedroom\/2 bath Queen Village Townhouse","description":"Awesome 3 bedroom, 2 bathroom entire corner rowhouse available July 1st - finish our lease as a sublet through September 15th with option to renew an annual lease at that time. We have lived here since September of '21 and are buying a house in the same neighborhood.\n$2700\/month plus utilities\nAbout the home:\nThis is a fantastic, remodeled townhouse (the architect who did it used to own this house) with a back patio and a working wood-burning fireplace in the Meredith school catchment! The entrance opens onto a quaint and quiet side street in a fantastic neighborhood! 3 bedrooms and 2 full bathrooms and a giant walk-in closet (really it is an entire room full of closets). Large basement for storage. Dogs\/cats OK! Central air, gas range and loads of natural light.\nPlease contact me if you are interested!\nLonger description of home:\nLight soaked, Queen Village corner property in the Meredith School Catchment. This contemporary 3 bed, 2 bath home was designed, built & lived in by architect\/designer Jerry Jarosinski. The open floor plan with hardwood floors and wood burning fireplace sets the tone for a very warm and inviting home. On the second floor you will find 2 bedrooms with custom built-ins and a well appointed bathroom. The Master Suite is found on the top floor and includes a separate dressing area with extra closets. The Master bathroom features a deep soaking tub, light fixtures and a vanity. With a Walk Score of 100, the walkability of this neighborhood makes living here very easy since you are surrounded by cafes, restaurants and multiple city parks. The clean basement includes a washer\/dryer and an ample amount of storage space. Also enjoy a built in, wired speaker system throughout the house.\n*pets OK with owner permission\n*Security system on premises, has option to be activated and payments are solely responsibility of tenant\n","num_images":18.0,"lat":39.939709,"lng":-75.15285,"attrs":"['3BR \/ 2Ba', '1500ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T14:17:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-newly-renovated\/7489457461.html","post_id":7489457461,"result_date":"2022-05-28 14:10","title":"4 Br newly renovated","description":"Newly Renovated 3 bedrooms upstairs, 1 bedroom on the first floor possibly for elder parents.  Full Bathroom upstairs, 1\/2 bath on first floor, Gas heat, Central Air.","num_images":0.0,"lat":39.9925,"lng":-75.1133,"attrs":"['4BR \/ 1.5Ba', '1400ft2', 'available jul 1', 'air conditioning', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T14:06:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-bedroom-15\/7489455606.html","post_id":7489455606,"result_date":"2022-05-28 14:06","title":"Charming 2 bedroom 1.5 Barhroom apartment place in City of philidilphi","description":"Charming 2 bedroom apartment is a great place in City of philidilphia. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Ocala! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $500. Please contact me now for view and more information. Text  show contact info","num_images":4.0,"lat":40.0903,"lng":-75.041,"attrs":"['2BR \/ 1.5Ba', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T14:02:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7489445111.html","post_id":7489445111,"result_date":"2022-05-28 13:45","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nFind yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two story two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, two patio\/balconies, and a loft with a closet upstairs!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Ceiling Fan\n* Private Patio or Private Balcony (on select apartments)\n* Walk-in Closet\n* Air Conditioning\n* Garden Tub\n* Granite Countertops\n* Pantry\n* Pre-wired for internet and cable\n* Full sized Washer and Dryer in unit\n* Linen Closet\nCommunity Features\n* Swimming Pool\n* Pet Salon\n* Easy Freeway Access\n* Sun Deck\n* Fitness Studio\n* Playground\n* Billiards\n* Minutes from Restaurants, Shopping, and Much More\n* EV Charging\n* Bark Park\n* Gaming Area\n[#9240890]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1376ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T13:41:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7489444968.html","post_id":7489444968,"result_date":"2022-05-28 13:45","title":"Lease Today, Playground, Luxurious Bathrooms","description":"Schedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Walk-in Closet\n* Pantry\n* Linen Closet\n* Granite Countertops\n* Full sized Washer and Dryer in unit\n* Air Conditioning\n* Garden Tub\n* Pre-wired for internet and cable\n* Ceiling Fan\n[#9240481]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '833ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T13:41:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7489444350.html","post_id":7489444350,"result_date":"2022-05-28 13:43","title":"Private Balcony, Quiet Community, Move In Now","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\n[#9240757]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1363ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T13:39:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-luxury-location-and\/7489437963.html","post_id":7489437963,"result_date":"2022-05-28 13:31","title":"Luxury, Location, and Convenience","description":"Apt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T13:27:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bedroom-apartment\/7489436589.html","post_id":7489436589,"result_date":"2022-05-28 13:28","title":"Amazing 2 bedroom apartment washer\/dryer in philadelphia, PN","description":"Amazing 2 bedroom apartment washer\/dryer. in philadelphia, PN. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Capitol Hill! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $1000. Please contact our courteous property Spacious 2BR English Basement apartment in a historic rowhouse on a beautiful tree lined street in the heart of . 1100+ sq ft, open floor plan with nice hardwood floors, washer\/dryer in unit, and ample closets. Private front & back entrances and lovely outdoor patio shared with upper house. washer\/dryer.","num_images":1.0,"lat":40.0343,"lng":-75.1213,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T13:24:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-salt-water-pool-with\/7489422429.html","post_id":7489422429,"result_date":"2022-05-28 13:00","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nYou will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\n[#9240860]","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-05-28T12:56:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-laundry-in-unit-lease\/7489422189.html","post_id":7489422189,"result_date":"2022-05-28 13:00","title":"Laundry in Unit, Lease Today, Convenient Location","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nLooking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\n[#9240436]","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-05-28T12:56:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7489418158.html","post_id":7489418158,"result_date":"2022-05-28 12:52","title":"Pets Welcome, Lease Today, Quiet Community","description":"The Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\n[#9240418]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '789ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T12:48:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-convenient-location-fitness\/7489417140.html","post_id":7489417140,"result_date":"2022-05-28 12:50","title":"Convenient Location, Fitness Center, Close to Shops and Dining","description":"The Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nThe Point at Pennbrook Station has all the modern amenities in a great location. You will enjoy complimentary coffee, WiFi, and printing services in our clubhouse. or you can use our social hub, complete with computers and individual or communal workspaces, to work on your passion project. We have everything you need! Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, walk-inc lost, laundry room with washer\/dryer, and a private porch!\n[#9240411]","num_images":12.0,"lat":40.226234,"lng":-75.283466,"attrs":"['1BR \/ 1Ba', '755ft2', 'available jul 19', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T12:46:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bedroom-apartment\/7489413687.html","post_id":7489413687,"result_date":"2022-05-28 12:43","title":"Amazing 1 bedroom apartment is a great place","description":"Amazing 1 bedroom apartment is a great place. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $500.\nText me :~ ‪‪‪(573) 32six-9387‬\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nIncreíble apartamento de 1 habitación es un excelente lugar. Tattered Cover, Twist and Shout, Starbucks y Sprouts, todo a una corta distancia a pie de tu espacioso apartamento de 1 habitación. ¡Este vecindario es un excelente equilibrio entre la vida pacífica y tranquila y la emoción! Estacionamiento gratuito fuera de la vía pública y todos los servicios públicos cubiertos, excepto la electricidad. A un precio razonable de $ 500.\nEscríbeme :~ (573) 32six-9387\n","num_images":3.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T12:39:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-spacious-bedroom-apartment-is\/7489407158.html","post_id":7489407158,"result_date":"2022-05-28 12:30","title":"spacious 2 bedroom apartment is a great place in Philadelphia.","description":"spacious 2 bedroom apartment is a great place in Philadelphia. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $700. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement of Capitol Hill! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $660.\nText me:  show contact info","num_images":4.0,"lat":39.9375,"lng":-75.2637,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T12:26:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bed-apartment-in\/7489403385.html","post_id":7489403385,"result_date":"2022-05-28 12:22","title":"Amazing 1 bed Apartment in City of","description":"Amazing 1 bedroom apartment is a great place. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $400. Contact me to schedule a viewing @ ;; - aldeesha100 (at)_gmail_(dot)com","num_images":1.0,"lat":39.9207,"lng":-75.1595,"attrs":"['3BR \/ 1Ba', 'apartment', 'laundry in bldg', 'carport', 'rent period: daily']","posted_date":"2022-05-28T12:18:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-listed-bedroom-bath\/7489387971.html","post_id":7489387971,"result_date":"2022-05-28 12:17","title":"Just listed! 2 bedroom\/1 bath home in Philadelphia.!!","description":"Just listed! 2 bedroom\/1 bath home in Philadelphia.!!\nPrime location, Private, Outdoor space\/backyard for BBQ, gardening.\nNatural light from each room.\nClean, Open concept Kitchen\/living space.\nLaminate floors throughout. Balcony off bedroom.\nCarport parking with street parking available.\nQuiet Neighborhood. Washer\/Dryer in unit.\nWalk to: Downtown, (Skypark) parks, Community Center, coffee shops, grocery stores, library and movie theaters.\nOwner pays water. Tenant pays for electricity\/trash\/wifi. Tenant maintains yard space.\n","num_images":5.0,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 1Ba', '1250ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T11:47:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedrooms-bathrooms-lease\/7489397432.html","post_id":7489397432,"result_date":"2022-05-28 12:10","title":"2 bedrooms 2 bathrooms lease takeover","description":"Our 2b2b will be available since July 18. The lease will end in October, and you can renew for the long term if needed at a much lower price than the market price.  You can walk to Upenn in 3 minutes. The 2 bedrooms are fully furnished. Pet friendly. Application fees and security deposits are required.","num_images":4.0,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 2Ba', '1045ft2', 'available jul 18', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T12:06:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7489391780.html","post_id":7489391780,"result_date":"2022-05-28 11:59","title":"1 Bedroom Apartment","description":"Apt 2\n1 BEDROOM APT\nWOOD FLOOR\nNEW KITCHEN\nNEW BATHROOM\nCLOSE TO SCHOOL CLOSE TO PARK\nLOCATION :5900 PINE ST 19143 (COBBS CREEK)","num_images":4.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:55:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7489391122.html","post_id":7489391122,"result_date":"2022-05-28 11:57","title":"1 Bedroom Apartment","description":"Apt 2\n1 BEDROOM APT\nWOOD FLOOR\nNEW KITCHEN\nNEW BATHROOM\nCLOSE TO SCHOOL CLOSE TO PARK\nLOCATION :5900 PINE ST 19143 (COBBS CREEK)","num_images":4.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:53:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/amazing-bed-apartment-in-city-of\/7489388520.html","post_id":7489388520,"result_date":"2022-05-28 11:52","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house\/7489386963.html","post_id":7489386963,"result_date":"2022-05-28 11:49","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house\/7489386407.html","post_id":7489386407,"result_date":"2022-05-28 11:48","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house\/7489385857.html","post_id":7489385857,"result_date":"2022-05-28 11:46","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house\/7489385406.html","post_id":7489385406,"result_date":"2022-05-28 11:45","title":"3 Bedroom house","description":"3 BEDROOM HOUSE\nCOMPLETELY RENOVATED\nWOOD FLOOR\nNEW KITCHEN\nNEW BATHROOM\nFRONT PORCH\nBACKYARD\nCLOSE TO TRANSPORTATION\nLOCATION: 3351 N SYDENHAM ST 19140 (TEMPLE HOSPITAL)","num_images":4.0,"lat":40.0118,"lng":-75.1456,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:41:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house\/7489384711.html","post_id":7489384711,"result_date":"2022-05-28 11:44","title":"3 Bedroom house","description":"LARGE 3 BEDROOM HOUSE\nWOOD FLOOR\nFRONT PORCH\nCLOSE TO SCHOOL\nCLOSE TO TRANSPORTATION\nLOCATION: 1721 BRIDGE ST 19124 (NORTHEAST)","num_images":7.0,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:40:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house\/7489383210.html","post_id":7489383210,"result_date":"2022-05-28 11:41","title":"3 Bedroom house","description":"LARGE 3 BEDROOM HOUSE\nWOOD FLOOR\nFRONT PORCH\nCLOSE TO SCHOOL\nCLOSE TO TRANSPORTATION\nLOCATION: 1721 BRIDGE ST 19124 (NORTHEAST)","num_images":7.0,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:37:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7489378974.html","post_id":7489378974,"result_date":"2022-05-28 11:32","title":"2 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3F\nDUPLEX\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY","num_images":10.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:28:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-tile-flooring-throughout\/7489354202.html","post_id":7489354202,"result_date":"2022-05-28 11:29","title":"TILE FLOORING THROUGHOUT THE HOME","description":"CALL ( 8 5 5 ) 7 0 2 2 7 1 8___________________________________________________\nCharming 3 bedroom, 1.75 Bath Home, 1 Car Garage, and 1 Car Carport await its new family. This home is conveniently located off 116 N to the new loop that provides easy access to Fort Hood, Central Texas College, and Hwy 190 South.\n____________________________\nThis home features:\nTile Flooring throughout the home\nMini-blinds throughout home\nStainless steel Stove\/Oven with Vent-A-Hood\nStainless steel Dishwasher\nEat-In Kitchen\n3 Bedrooms\n1 Full Bathroom\n3\/4 Bathroom in Master Bedroom\nHis & Her Closets in Master Bedroom\n1 Car Garage AND 1 Car Carport\nCovered Porch\nChain Link Fenced Back Yard\nLocated on a Cul-De-Sac street\nAnd More!\nPet Friendly-Yes\n____________________________________________________________________________\nAll information provided; including square footage, is deemed reliable but not guaranteed. Information for square footage is gathered from County Tax Records and is public information.\nPet Policy: There is a $200.00 Non-Refundable Pet Fee PER Pet and a maximum 2 pet standard. We DO NOT allow aggressive animals to reside in our homes including Pit Bulls, Ankita's, German Shepherds, Rottweilers, Husky, Malamute, Doberman Pinscher, Chow Chow, Great Dane, Saint Bernard, Presa Canarias, Wolf Hybrids, ANY mix of these breeds or ANY vicious animal; regardless of size.\n__________________________________________________________________________________\nIf you would like to view a home please call the office and we will gladly schedule you an appointment to come to check out the keys.\n","num_images":3.0,"lat":40.0343,"lng":-75.1213,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-28T10:33:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7489376709.html","post_id":7489376709,"result_date":"2022-05-28 11:27","title":"2 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3F\nDUPLEX\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY","num_images":10.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:23:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-spacious-modern-living\/7489376706.html","post_id":7489376706,"result_date":"2022-05-28 11:27","title":"Spacious Modern Living","description":"Apt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T11:23:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7489370096.html","post_id":7489370096,"result_date":"2022-05-28 11:18","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3B\nDUPLEX\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":7.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:09:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7489369232.html","post_id":7489369232,"result_date":"2022-05-28 11:11","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #2\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":7.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:07:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7489367817.html","post_id":7489367817,"result_date":"2022-05-28 11:08","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #2\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":7.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:04:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7489366088.html","post_id":7489366088,"result_date":"2022-05-28 11:04","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #2\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":8.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T11:00:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-rn-bath-home\/7489352453.html","post_id":7489352453,"result_date":"2022-05-28 10:51","title":"2 Bed Rn 1 Bath Home","description":"2 Bedroom 1 Bath Lovely Home Ready To Move In .. All Brand New Appliances, New Wood Floors. Nice size backyard great for Outdoors.","num_images":0.0,"lat":40.017691,"lng":-75.087261,"attrs":"['2BR \/ 1Ba', 'available may 30', 'application fee details: $75', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T10:29:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-dog-and-cat-friendly\/7489357997.html","post_id":7489357997,"result_date":"2022-05-28 10:46","title":"Dog and Cat-Friendly 1157 SqFt 2 Bed \/ 2 Bath! Pets Welcome Here!","description":"The Glen at Lafayette Hill Visit our community today! 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nUnit Rates:  $2366 - $2454\/month Unit Type: 2-BR 2-BA Unit Size: 1157 sq ftLease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.What you’ll find in our community: ➢ 24 Hour Availability➢ Barbecue\/Grill➢ Business Center➢ Elevator➢ Furnished Units Available➢ Gated, Controlled Access➢ Online Services➢ Package Service➢ Planned Social Activities➢ Renters Insurance Program➢ BBQ Picnic Garden➢ Billiards, Club Lounge, Cafe Area, Library and Community Room➢ Fitness Center w\/ Free Weights, Weight Machines➢ Message Therapist Practice On-site➢ Outdoor Cafe & Coffee Bar➢ Outdoor Patio Lounge➢ Sprinkler System➢ Storage Space➢ Wi-Fi at ClubhouseDescription: Are you searching for the best apartments in Lafayette Hill? Look no further than The Glen Apartments. Take a tour of our property to see everything our pet-friendly Lafayette Hill apartments have to offer. Our professional staff is waiting to welcome you home to a care-free lifestyle. Please schedule a tour today and see what the best Lafayette Hill, PA apartments have for you.\n* We have Garages ( Approx. 19.5x9.5) available for $185.00 Monthly & Storage Lockers available for $40.00 Monthly ( Approx. 4x4x7) & $75.00 Monthly ( Approx. 4x8x7)This unit comes with: ➢ Air Conditioning & Heating➢ Cable Ready➢ Carpet➢ Ceiling Fans (Select Floor Plans)➢ Dining Room➢ Heating➢ Range, Oven, Disposal, Oven➢ Refrigerator, Freezer and Ice Maker➢ Wi-Fi➢ Window Coverings➢ Crown Molding (Select Floor Plans)➢ Dishwasher➢ High Speed Internet Access➢ Linen Closet➢ Microwave➢ Storage Units➢ Trash Compactor➢ Vaulted Ceiling (Select Floor Plans)➢ Washer\/Dryer➢ Wheelchair Accessible (Rooms)Call or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.comProperty Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":17.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T10:42:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bedroom-apartment\/7489357226.html","post_id":7489357226,"result_date":"2022-05-28 10:44","title":"Amazing 1 bedroom apartment is a great place.","description":"Amazing 1 bedroom apartment is a great place. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $400. Contact me to schedule a viewing ;; -(213) 429-3SIX4SIX","num_images":1.0,"lat":40.0343,"lng":-75.1213,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T10:40:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7489352873.html","post_id":7489352873,"result_date":"2022-05-28 10:34","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH  STREET 19121","num_images":14.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T10:30:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-amd-amazing-bed\/7489349518.html","post_id":7489349518,"result_date":"2022-05-28 10:26","title":"@@@Charming amd amazing 2 bed\/ 1 bath apart for rent@@@","description":"Thanks for stopping by and welcome to Old Brick Lofts at 300 Richmond Street in FISHTOWN! We're Greenzang Properties and we will be your main point of contact for anything and everything related to these beautiful new apartments hitting the Fishtown market! This is the perfect building if you are looking for a bit of history mixed with an updated, modern finish!\nCALL\/TEXT ME::  show contact info\nAmazing 1 bedroom apartment is a great place in City of Hartford. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity.Reasonably priced at $632.\n","num_images":5.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T10:22:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-amd-amazing-bed\/7489349517.html","post_id":7489349517,"result_date":"2022-05-28 10:26","title":"@@@Charming amd amazing 2 bed\/ 1 bath apart for rent@@@","description":"Thanks for stopping by and welcome to Old Brick Lofts at 300 Richmond Street in FISHTOWN! We're Greenzang Properties and we will be your main point of contact for anything and everything related to these beautiful new apartments hitting the Fishtown market! This is the perfect building if you are looking for a bit of history mixed with an updated, modern finish!\nCALL\/TEXT ME::  show contact info\nAmazing 1 bedroom apartment is a great place in City of Hartford. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 2 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity.Reasonably priced at $632.\n","num_images":5.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T10:22:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7489348997.html","post_id":7489348997,"result_date":"2022-05-28 10:25","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH  STREET 19121","num_images":14.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T10:21:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fob-controlled-access\/7489346271.html","post_id":7489346271,"result_date":"2022-05-28 10:18","title":"FOB Controlled Access, Microwave","description":"Bedrooms: 0Bathrooms: 1Square Feet: 390Date Available: 2022-05-28Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:RefrigeratorBike StorageSmart Home FeaturesWindow CoveringsElectronic ThermostatRecyclingFOB Controlled AccessOn-Site ManagementElevatorFitness Center w\/ Peloton BikesPackage ReceivingMicrowaveCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/utygcu2l\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '390ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T10:14:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-and\/7489340273.html","post_id":7489340273,"result_date":"2022-05-28 10:03","title":"Newly renovated and conveniently located! Call to schedule your tour *","description":"Newly renovated and conveniently located! Call to schedule your tour today.! Hardwood floors throughout the apartment and a decorative fireplace in the living room. The dining room has decorative wood work that has a modern touch! The apartment has 1 bedrooms and 1 bath.!! Contact my phone number  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmazing 1 bedroom apartment is a great place in City of . Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.\n","num_images":1.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T09:59:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-and\/7489340223.html","post_id":7489340223,"result_date":"2022-05-28 10:03","title":"Newly renovated and conveniently located! Call to schedule your tour *","description":"Newly renovated and conveniently located! Call to schedule your tour today.! Hardwood floors throughout the apartment and a decorative fireplace in the living room. The dining room has decorative wood work that has a modern touch! The apartment has 1 bedrooms and 1 bath.!! Contact my phone number  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmazing 1 bedroom apartment is a great place in City of . Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.\n","num_images":1.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', 'available now', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-28T09:59:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-love-where-you-live\/7489331546.html","post_id":7489331546,"result_date":"2022-05-28 09:41","title":"Love Where You Live","description":"Apt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T09:37:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bedroom-apartment\/7489325166.html","post_id":7489325166,"result_date":"2022-05-28 09:31","title":"Amazing 2 bedroom apartment","description":"Amazing 2 bedroom apartment is a great place in City of Philadelphia. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment","num_images":4.0,"lat":40.0596,"lng":-75.0818,"attrs":"['2BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-28T09:18:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-extremely-large-twin\/7489320835.html","post_id":7489320835,"result_date":"2022-05-28 09:28","title":"This extremely large twin has tons of space and potential!!","description":"Outside you have a front lawn, porch, side yard, huge rear yard with detached garage.  Inside on the 1st floor you have a large living room, dining room, eat in kitchen with built in pantry.  The 2nd floor features 3 large bedrooms including the master bedroom with a sitting area and a full hall bath.  There is steps up the 3rd floor walkable attic as well.  Downstairs in the basement you have a door with rear yard\/garage access, a large laundry room\/storage room, a half bath, a finished room, a mechanical room and a workshop.  This home is across the the street from Northwood Park and around the corner from Alfred Simpson Rec Center an Northwood Charter School.  Close to schools, public transportation and shopping.","num_images":5.0,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 2Ba', '1664ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T09:04:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bed-apartment-in\/7489324742.html","post_id":7489324742,"result_date":"2022-05-28 09:21","title":"Amazing 2 bed Apartment in City of Philadelphia PA ..!!","description":"Thanks for stopping by and welcome to Old Brick Lofts at 300 Richmond Street in FISHTOWN! We're Greenzang Properties and we will be your main point of contact for anything and everything related to these beautiful new apartments hitting the Fishtown market! Call\/Text:  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmazing 1 bedroom apartment is a great place in City of . Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.\n","num_images":3.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-28T09:17:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bed-apartment-in\/7489324686.html","post_id":7489324686,"result_date":"2022-05-28 09:21","title":"Amazing 2 bed Apartment in City of Philadelphia PA ..!!","description":"Thanks for stopping by and welcome to Old Brick Lofts at 300 Richmond Street in FISHTOWN! We're Greenzang Properties and we will be your main point of contact for anything and everything related to these beautiful new apartments hitting the Fishtown market! Call\/Text:  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmazing 1 bedroom apartment is a great place in City of . Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity. Reasonably priced at $650.\n","num_images":3.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-28T09:17:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-4687-adams\/7489321001.html","post_id":7489321001,"result_date":"2022-05-28 09:13","title":"Welcome to 4687 Adams Avenue in the Northwood Section of Philadelphia!","description":"Outside you have a front lawn, porch, side yard, huge rear yard with detached garage.  Inside on the 1st floor you have a large living room, dining room, eat in kitchen with built in pantry.  The 2nd floor features 3 large bedrooms including the master bedroom with a sitting area and a full hall bath.  There is steps up the 3rd floor walkable attic as well.  Downstairs in the basement you have a door with rear yard\/garage access, a large laundry room\/storage room, a half bath, a finished room, a mechanical room and a workshop.  This home is across the the street from Northwood Park and around the corner from Alfred Simpson Rec Center an Northwood Charter School.  Close to schools, public transportation and shopping.","num_images":5.0,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 2Ba', '1664ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-28T09:04:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-junior-bedroom-utilities\/7489311380.html","post_id":7489311380,"result_date":"2022-05-28 08:33","title":"Junior 1 Bedroom- Utilities Included","description":"Recently renovated first floor junior 1 bedroom apartment available in 4-unit building.\nFeatures: Original refinished hardwood flooring throughout, ample counter\/cabinet space in kitchen with granite counters and stainless steel appliances, in-unit laundry, ceiling fans, updated vintage bath, large storage locker in basement. Outdoor space includes shared courtyard and backyard.\nAmple\/free on street parking, walking distance to 18, 23 and H bus routes. Short drive to 76 and 309 expressways. Across the street from Regional Rail, Chestnut Hill East for convenient commute to Temple University, University City and Center City.\nRent includes: Heat, cold water\/sewer, hot water, cooking gas and trash collection. Tenant responsible for electricity, approximately $20.00\/m.\nIncome requirements: Minimum monthly income of 3X one months rent.\nNonrefundable $40.00 application fee per adult.","num_images":21.0,"lat":40.059704,"lng":-75.178248,"attrs":"['1BR \/ 1Ba', '520ft2', 'available now', 'application fee details: Non-refundable 40.00 Credit\/Background Check per Adult', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T08:29:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-mt-airy-bed\/7489305505.html","post_id":7489305505,"result_date":"2022-05-28 08:06","title":"Renovated Mt. Airy 1 Bed - Utilities Included","description":"Recently renovated first floor junior 1 bedroom apartment available in 4-unit building.\nFeatures: Original refinished hardwood flooring throughout, ample counter\/cabinet space in kitchen with granite counters and stainless steel appliances, in-unit laundry, ceiling fans, updated vintage bath, large storage locker in basement. Outdoor space includes shared courtyard and backyard.\nAmple\/free on street parking, walking distance to 18, 23 and H bus routes. Short drive to 76 and 309 expressways. Across the street from Regional Rail, Chestnut Hill East for convenient commute to Temple University, University City and Center City.\nRent includes: Heat, cold water\/sewer, hot water, cooking gas and trash collection. Tenant responsible for electricity, approximately $20.00\/m.\nIncome requirements: Minimum monthly income of 3X one months rent.\nNonrefundable $40.00 application fee per adult.","num_images":16.0,"lat":40.059704,"lng":-75.178248,"attrs":"['1BR \/ 1Ba', '520ft2', 'available now', 'application fee details: Non-refundable 40.00 Credit\/Background Check per Adult', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T08:02:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-bedroom-15-bath-1000\/7489302979.html","post_id":7489302979,"result_date":"2022-05-28 07:52","title":"Nice 3 bedroom 1.5 bath $1000 per month","description":"This is a freshly remodeled 3 bedroom 1.5 bath (half bath in the basement) with a new kitchen that had quartz counters new cabinets, new back splash, new faucet. The home was completely painted and all the floors were replaced with a luxury vinyl. This is a must see because it won’t last.\nRent is 1000 dollars per month with a 1000 dollar deposit (depending on credit). 2000 moves you in!\nCall now to schedule a viewing or questions.\nPlease call Nicole  show contact info\nThe home is located at 3343 American Street 19140\n","num_images":17.0,"lat":40.001489,"lng":-75.133934,"attrs":"['3BR \/ 1.5Ba', 'available may 31', 'cats are OK - purrr', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T07:48:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedrooms-bath-apt\/7489301797.html","post_id":7489301797,"result_date":"2022-05-28 07:45","title":"LARGE 2 BEDROOMS & 1 BATH APT LOCATED CLOSE TO LA SALLE UNIVERSITY!","description":"⭐⭐⭐ LARGE 2 BEDROOMS & 1 BATH APARTMENT LOCATED CLOSE TO LA SALLE UNIVERSITY! ⭐⭐⭐\nProperty Address\n5701 N 17th Street | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ LARGE 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN OGONTZ\/WEST OAK LANE! ⭐⭐⭐\n✔️ LARGE LIVING ROOM\n✔️ UPDATED DESIGNER KITCHEN W\/ BREAKFAST BAR\n✔️ STOVE, FRIDGE, & MICROWAVE\n✔️ SPACIOUS BEDROOMS\n✔️ WATER-RESISTANT LAMINATE FOR EASY CLEANING\n✔️ OPEN LAYOUT CONCEPT\n✔️ CEILING FANS\n✔️ CABLE READY\n✔️ LOCATED CLOSE TO KEMBEL PARK!\n✔️ SHORT COMMUTE FROM LA SALLE UNIVERSITY!\n✔️ EASY ACCESS TO PUBLIC TRANSPORTATION!\n✔️ CLOSE TO MAJOR ROADS!\n✔️ EASY COMMUTE TO CENTER CITY!\n✔️ WON'T LAST LONG INQUIRE TODAY!\nDETAILS\nFull background checks,\n$35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\nAMENITIES\nOpen layout\nconveniently located\ncable ready\nclose to public transportation\nSIZE\nBeds\/Baths: 2 BD\/1 BA\nSquare Feet: Apx. 850\nRENTAL TERMS\nRent: $1000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2000\nPET POLICY\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY:  WWW.REDBLOCK.COM\/APARTMENTS\ntags: 2 bedroom, two-bedroom, redblock, redblock realty inc, ogontz, west oak lane, east oak lane, logan, Germantown, East Germantown, Olney, La Salle University, central high school, spacious, Olney Transportation Center - BSL, 19141, 19144, 19138, 19126, 19120, 19119, Kemble Park, Philadelphia High School for Girls, Einstein Medical Center Philadelphia, Cristo Rey Philadelphia High School, Central High School, Belfield Recreation Center, Community College of Philadelphia - Northwest Regional.\nAvailability and pricing are subject to change.  Information Deemed Reliable But Not Guaranteed. All information is subject to errors, omissions, or withdrawal without notice.\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 925\nRental Terms\nRent: $1,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,000.00\n\n#nata\n","num_images":6.0,"lat":40.040606,"lng":-75.15035,"attrs":"['2BR \/ 1Ba', '925ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T07:41:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated\/7489300794.html","post_id":7489300794,"result_date":"2022-05-28 07:39","title":"Completely Renovated 3 bedrooms and 2 bath home in West Oak Lane!","description":"Completely Renovated 3 bedrooms and 2 bath home in West Oak Lane!!!\nProperty Address\n2472 77th Ave | Philadelphia, PA 19150, PA 19150\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE HOUSE! ⭐⭐⭐⭐⭐\n✔️Completely Renovated 3 bedrooms and 2 bath home\n✔️Spacious living room\n✔️Large dining area\n✔️Brand New kitchen with Island\n✔️Open Concept 1st Floo\n✔️Large Master Suite with private Master Bath\n✔️Contemporary Designs\n✔️Plenty of Natural Light\n✔️Washer\/Dryer Hook Up\n✔️Brand New Central Air\n✔️Rear Deck\n✔️Attached Garage\n✔️Plenty of closet space\n✔️Unfinished basement for storage\n✔️Custom color paint\n✔️Easy access to and from the city\n✔️Easy access to public transportation\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1900\nRental Terms\nRent: $2000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n\n#nata\n","num_images":24.0,"lat":40.070381,"lng":-75.159595,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T07:35:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-spacious\/7489299543.html","post_id":7489299543,"result_date":"2022-05-28 07:31","title":"NEWLY RENOVATED! SPACIOUS, 1 BEDROOM AND 1 BATH APARTMENT!","description":"⭐⭐⭐ NEWLY RENOVATED! SPACIOUS, 1 BEDROOM AND 1 BATH APARTMENT LOCATED IN WEST OAK LANE!!! ⭐⭐⭐\nProperty Address\n6709 Ogontz Ave - 2F | suite 200 | philadelphia, PA 19126\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ BRAND NEW EVERYTHING! 1 BEDROOM & 1BATH, LOCATED IN WEST OAK LANE!!!\n✔️ NEW!!! KITCHEN W\/ !!!\n✔️ NEW!!! CUSTOM BACKSPLASH !!!\n✔️ NEW!!! DESINER COUNTERS !!!\n✔️ NEW!!! STAINLESS STEEL APPLIANCES !!!\n✔️ NEW!!! LAMINATE FLOORING !!!\n✔️ NEW!!! STYLISH DESIGNER PAINT COLOR !!!\n✔️ NEW!!! ELECTRIC HEATING AND COOKING !!!\n✔️ NEW!!! STYLISH BATHROOM DESIGN W\/\n✔️ NEW!!! CUSTOM TILES !!!\n✔️ NEW!!! SPACIOUS ROOMS !!!\n✔️ NEW!!! TONS OF CLOSET SPACE !!!\n✔️ SHORT WALK FROM SHOPPING !!!\n✔️ CLOSE TO ALL MAJOR ROUTES !!!\n✔️ EASY COMMUTE TO CENTER CITY !!!\n✔️ WILL NOT LAST LONG, INQUIRE TODAY !!!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenants pay own utilities\n*** Build your credit! We report rent payments to Experian! ***\n****************************************************************************************************************************\nTAGS: brand new, 1 bedroom, 1bd, one, one-bedroom, 1 bath, multi-unit, apartment, flat, 19126, 19120, 19141, 19144, 19138, 19117, 19012, Mt Airy, Germantown, Logan, Olney, west oak lane, Elkins park, septa, Rowan William School, Broad Street, redblock, red block, Redblock Realty Inc, #nata\n\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 600\nRental Terms\nRent: $850.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,700.00\n\nPet Policy\nCats allowed\nDogs not allowed","num_images":6.0,"lat":40.056217,"lng":-75.149478,"attrs":"['1BR \/ 1Ba', '600ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T07:27:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-and-bath\/7489299139.html","post_id":7489299139,"result_date":"2022-05-28 07:29","title":"LARGE 1 BEDROOM AND 1 BATH APARTMENT LOCATED IN WEST OAK LANE!","description":"⭐LARGE 1 BEDROOM AND 1 BATH APARTMENT LOCATED IN WEST OAK LANE!\nProperty Address\n6701 Ogontz Ave - 2F | Philadelphia, PA 19126\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n**** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING **** You must make an appointment by completing this form https:\/\/redblockrentals.com\/showing\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n✔️BEST VALUE APARTMENT ⭐⭐⭐⭐⭐\n✔️Updated Apartment\n✔️Spacious 1 Bedroom \/ 1 Bathrooms\n✔️2nd-floor apartment in a small building, easy access\n✔️Hardwood flooring\n✔️Lots of closet space\n✔️High ceilings\n✔️Spacious rooms\n✔️Eat-in Kitchen\n✔️Ceiling fans\n✔️Easy access to and from the city\n✔️Easy access to public transportation\n✔️Conveniently located close to major routes\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities (electric and water)\n*** Build your credit! We report rent payments to Experian! ***\nTO SCHEDULE A SHOWING:\n⭐⭐⭐ https:\/\/redblockrentals.com\/showing ⭐⭐⭐\n**** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING **** You must make an appointment by completing this form https:\/\/redblockrentals.com\/showing\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: 19126, 19120, 19141, 19144, 19138, 19117, 19012, Mt Airy, germantown, logan, olney, west oak lane, elkins park, septa, Rowan William School, Broad Street, redblock, red block, Redblock Realty Inc, one bedroom, 1 bedroom, #nata\n\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 650\nRental Terms\nRent: $850.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,700.00\n\nPet Policy\nCats allowed\nDogs not allowed","num_images":12.0,"lat":40.056217,"lng":-75.149478,"attrs":"['1BR \/ 1Ba', '650ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T07:25:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated-bd-ba\/7489298694.html","post_id":7489298694,"result_date":"2022-05-28 07:26","title":"Completely Renovated 3 Bd \/ 2 Ba Home, Central Air, Private Rear Deck!","description":"Completely Renovated 3 Bedroom 2 Bath Home, Central Air, Private Rear Deck, brand new rehab in Elmwood Park\/Kingsessing\nProperty Address\n6345 Kingsessing Ave | Philadelphia, PA 19142\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Stunning renovation in Elmwood Park\/Kingsessing! ⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 2 Bath\n✔️Updated Kitchen w\/ custom designer backsplash\n✔️Master Bedroom has a Private brand new full bath\n✔️Located just minutes to schools, parks, and University City\n✔️All New Appliances\n✔️Hardwood flooring throughout\n✔️Recessed Lighting\n✔️Spacious bedrooms\n✔️Open layout, plenty of closet space.\n✔️Large basement perfect for storage\n✔️Central Air\n✔️Private Rear Deck\n✔️Washer\/Dryer Hookup\n✔️Located just minutes to schools, parks, and University City\n✔️Easy commute to and from the city\n✔️This property won't last long, inquire now!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1330\nRental Terms\nRent: $2000\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nVirtual Tour: https:\/\/my.matterport.com\/show\/?m=xG8QmjAkkCh\nStunning renovation in Elmwood Park\/Kingsessing! This immaculate home has been completely renovated from top to bottom! Located just minutes to schools, parks, and University City. Brand new renovation! Steps to UPENN, Drexel, USciences, Center City CHOP, and Hospital of the University of Pennsylvania. Home features 3 bedrooms, 2 baths! Central air! Private Rear Deck! Washer\/dryer hookup! Absolutely everything here is brand new! #nata\nFor security purposes, all of our properties are under live video and audio surveillance. All access and showings are recorded and monitored remotely\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,332\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n\nPet Policy\nCats allowed\nDogs not allowed","num_images":24.0,"lat":39.928403,"lng":-75.236155,"attrs":"['3BR \/ 2Ba', '1332ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T07:22:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated\/7489297996.html","post_id":7489297996,"result_date":"2022-05-28 07:21","title":"Completely Renovated 3 bedrooms and 2.5 bath home in East Germantown!","description":"Completely Renovated 3 bedrooms and 2.5 bath home in East Germantown\nProperty Address\n6128 Lensen Street | Philadelphia, PA 19144\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE HOUSE! ⭐⭐⭐⭐⭐\n✔️Completely Renovated 3 bedrooms and 2.5 bath home\n✔️Spacious living room\n✔️Large dining area\n✔️Updated eat-in kitchen\n✔️Open Concept 1st Floor\n✔️Large Master Suite with private Master Bath\n✔️Contemporary Designs\n✔️Plenty of Natural Light\n✔️Washer\/Dryer Hook Up\n✔️Brand New Central Air\n✔️Large backyard\n✔️Spacious front yard\n✔️Plenty of closet space\n✔️Unfinished basement for storage\n✔️Custom color paint\n✔️Easy access to and from the city\n✔️Easy access to public transportation\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2.5 BA\nSquare Feet: 1528\nRental Terms\nRent: $2000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n\nDetails\nBeds\/Baths: 3BD\/2.5BA\nSquare Feet: 1,528\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n\n#nata\n","num_images":19.0,"lat":40.047156,"lng":-75.172877,"attrs":"['3BR \/ 2.5Ba', '1528ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T07:17:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated-bd-ba\/7489296399.html","post_id":7489296399,"result_date":"2022-05-28 07:10","title":"Completely Renovated 3 Bd \/ 2 Ba Home, Central Air, Private Rear Deck","description":"Completely Renovated 3 Bedroom 2 Bath Home, Central Air, Private Rear Deck, brand new rehab in Kingsessing\nProperty Address\n5951 Belmar Street | Philadelphia, PA 19143\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Stunning renovation in Kingsessing! ⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 2 Bath\n✔️Updated Kitchen w\/ custom designer backsplash\n✔️Master Bedroom has a Private brand new full bath\n✔️Located just minutes to schools, parks, and University City\n✔️All New Appliances\n✔️Hardwood flooring throughout\n✔️Recessed Lighting\n✔️Spacious bedrooms\n✔️Open layout, plenty of closet space.\n✔️Large basement perfect for storage\n✔️Central Air\n✔️Private Rear Deck\n✔️Washer\/Dryer Hookup\n✔️Located just minutes to schools, parks, and University City\n✔️Easy commute to and from the city\n✔️This property won't last long, inquire now!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1330\nRental Terms\nRent: $2000\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nVirtual Tour: https:\/\/my.matterport.com\/show\/?m=ZUonK11wfaB\nStunning renovation in Kingsessing! This immaculate home has been completely renovated from top to bottom! Located just minutes to schools, parks, and University City. Brand new renovation! Steps to UPENN, Drexel, USciences, Center City CHOP, and Hospital of the University of Pennsylvania. Home features 3 bedrooms, 2 baths! Central air! Private Rear Deck! Washer\/dryer hookup! Absolutely everything here is brand new! #nata\nFor security purposes, all of our properties are under live video and audio surveillance. All access and showings are recorded and monitored remotely\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,300\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n","num_images":24.0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 2Ba', '1300ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T07:06:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedrooms-bath-apt\/7489295768.html","post_id":7489295768,"result_date":"2022-05-28 07:05","title":"SPACIOUS 2 BEDROOMS & 1 BATH APT LOCATED CLOSE TO EINSTEIN HOSPITAL!","description":"SPACIOUS 2 BEDROOMS & 1 BATH APARTMENT LOCATED CLOSE TO EINSTEIN HOSPITAL!\nProperty Address\n5117 N Broad St | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ SPACIOUS, 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN OGONTZ\/LOGAN AREA\n✔️ BRAND NEW EAT-IN KITCHEN W\/ DESIGNER BACKSPLASH\n✔️ WATER-RESISTANT DESIGNER LAMINATE IN THE KITCHEN\n✔️ SPACIOUS BEDROOMS\n✔️ PARQUET FLOORING\n✔️ LARGE CLOSETS\n✔️ LOTS OF NATURAL LIGHT\n✔️ ALL-ELECTRIC HEATING\n✔️ GAS STOVE AND WATER HEATER\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ CLOSE TO EINSTEIN HOSPITAL\n✔️ SHORT DISTANCE FROM LA SALLE UNIVERSITY AND PHILADELPHIA EYE INSTITUTE\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- The tenant is responsible for electric, gas, andwater fee\nBuild your credit! We report rent payments to Experian!\n**** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING **** You must make an appointment by completing this form https:\/\/redblockrentals.com\/showing *****\nTags: REDBLOCK Realty inc, redblock, Albert Einstein Healthcare Network, Widener Memorial School, Delaware Valley Charter High School, Logan Station, Logan School, La Salle University, Howe Academic Plus School, Pennsylvania College of Optometry, Joseph Pennell Elementary School, Stenton Park, Jay Cooke Elementary School, Wister Woods Park, Wakefield, Prince Hall Elementary School, Logan, Olney, Germantown, Oak Lane, 19144, 19126, 19141, 19138, 19120, 19140, 2BR, 2 bedrooms, #nata\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 750\nRental Terms\nRent: $1,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,000.00\n\nPet Policy\nCats allowed","num_images":8.0,"lat":40.031351,"lng":-75.146411,"attrs":"['2BR \/ 1Ba', '750ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-28T07:01:33-0400"}]