[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561404236.html","post_id":7561404236,"result_date":"Sat Nov 26 2022 00:31:26 GMT+0000 ","title":"Wonderful one bedroom, one bath","description":"his property is situated in the Rittenhouse Square area of Philadelphia. From amenities to availability, the professional leasing team will assist you in finding your new home\nLocated in Center City Philadelphia, Rittenhouse Square is an upscale neighborhood teeming with luxury retailers, independent boutique stores, art galleries, theaters, cafes, bars, and a wide variety of restaurants. At the neighborhood’s core sits Rittenhouse Square, a tree-filled one-square-block park that hosts numerous festivals, fairs, and farmers markets.\n","num_images":6.0,"lat":39.944867,"lng":-75.166972,"attrs":"['1BR \/ 1Ba', '600ft2', 'available now', '\\nfriday 2022-11-25\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T19:02:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561340602.html","post_id":7561340602,"result_date":"Fri Nov 25 2022 22:55:32 GMT+0000 ","title":"$850 monthly.🏠 Spacious and bright 2 bedroom 2 bath Apartment in Phil","description":"$850 monthly.🏠 Spacious and bright 2 bedroom 2 bath Apartment in Philadelphia .Hardwood floors, Abundant Light, Granite Countertops. The kitchen features new appliances, including a gas stove and a stainless steel fridge and wall-mounted microwave.. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion.space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug.\n🏠If you are interested in getting it please Text me::: s show contact info","num_images":1.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T15:51:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561380838.html","post_id":7561380838,"result_date":"Fri Nov 25 2022 22:49:22 GMT+0000 ","title":"Conveniently Located! 1br 1ba W\/A Wooded View! Call For More Info!","description":"Millview Apartments Bedroom: 1 | Bathroom: 1Square Footage: 845 sq ftMonthly Rent: $1476 - $1969 show contact info\nCommunity Description  Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.    Community Amenities✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral BonusesUnit Features✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In Closets  Contact InformationVisit Us: 100 Cobblestone Dr Coatesville, PA 19320 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/   Additional DetailsPet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Lease Terms: VariableManagement Company: Paradise Management, LLC Price is subject to change without prior noticeEQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":13.0,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T17:45:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561379963.html","post_id":7561379963,"result_date":"Fri Nov 25 2022 22:46:40 GMT+0000 ","title":"Comfortable living. Conveniently located, spacious 1 bed 1 bath!","description":"Millview Apartments Featured Floorplan: 1-bed \/ 1-bath \/ 771 sq ftMonthly Rent: $1389- $1865Deposit: Call  show contact info\nDescription: Nestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!Lease Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Apartment Amenities:◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In Closets Community Features:◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral Bonuses Call us:  show contact info\n100 Cobblestone Dr Coatesville, PA 19320Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ EQUAL HOUSING OPPORTUNITY27A7057C58A14CE\n","num_images":13.0,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '771ft2', 'available dec 9', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T17:42:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561378043.html","post_id":7561378043,"result_date":"Fri Nov 25 2022 22:40:16 GMT+0000 ","title":"Wonderful 3 bedroom, 2 bath home with modern amenities","description":"Wonderful 3 bedroom, 2 bath home with modern amenities in a fantastic Fishtown location! Upon entering this charming home, you are welcomed with a large living room that has pristine hardwood floors and plenty of natural light. This leads to a convenient coat closet as well as access to the fully finished basement and the upscale kitchen that boasts cherry wood cabinetry, granite countertops, a full set of stainless steel appliances, and a custom storage pantry. Kindly text mr James Decker on  show contact info\nHe will be the one to forward you the application processing Asap.","num_images":11.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T17:36:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561376437.html","post_id":7561376437,"result_date":"Fri Nov 25 2022 22:35:25 GMT+0000 ","title":"Wonderful 3 bedroom, 2 bath home with modern amenities","description":"Wonderful 3 bedroom, 2 bath home with modern amenities in a fantastic Fishtown location! Upon entering this charming home, you are welcomed with a large living room that has pristine hardwood floors and plenty of natural light. This leads to a convenient coat closet as well as access to the fully finished basement and the upscale kitchen that boasts cherry wood cabinetry, granite countertops, a full set of stainless steel appliances, and a custom storage pantry. Kindly text mr James Decker on  show contact info\nHe will be the one to forward you the application processing Asap.","num_images":11.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2Ba', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T17:31:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561355233.html","post_id":7561355233,"result_date":"Fri Nov 25 2022 21:33:50 GMT+0000 ","title":"Sunny, Pet-Friendly 1 Bedroom in Fishtown!","description":"Sunny, Pet-Friendly 1 Bedroom in Fishtown!\nCome join The Parkside in the heart of Fishtown! A few minutes from the Berks Station, 15 minutes to downtown. Walking distance to all Frankford Ave bars and restaurants.\nThis one bedroom, one bathroom apartment with all brand new appliances including washer, dryer, dishwasher, and disposal has all of the amenities you’re looking for. High-efficiency heating and cooling keeps costs down year-round. Huge windows in living room and bedroom give plenty of natural south-facing light.\nPet-friendly with a one-time deposit, so bring your best pal. There’s a gym in the building, free for all residents, which includes a Peleton, treadmills, weights, and more. A community room is available for your special events, and the roof has stunning 360-views, perfect for fireworks watching or hanging out on work calls.\nThere is a secure package room and app for connecting with your neighbors in the building. Street parking readily available, garage parking may be available.\nApartment is available on February 1st. Lease for one-year minimum. Have questions? Let me know! Happy to give a tour in person or virtually via Zoom or WhatsApp.\nDon’t wait! Lock in this price now.\n","num_images":14.0,"lat":39.980006,"lng":-75.132954,"attrs":"['1BR \/ 1Ba', 'available feb 1, 2023', 'air conditioning', 'application fee details: 50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T16:29:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561344248.html","post_id":7561344248,"result_date":"Fri Nov 25 2022 21:21:07 GMT+0000 ","title":"Spacious living with beautiful views of the Philly Skyline","description":"Available: 11\/30\/22\nBalmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":18.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T16:01:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561344441.html","post_id":7561344441,"result_date":"Fri Nov 25 2022 21:16:28 GMT+0000 ","title":"NEW 1 BEDROOM + 1 OFFICE + 2 BATHROOM - MOVE IN NOW","description":"Freshly Available - 1 Bedroom + 1 office + 2 Bathroom Apartment. Located just steps from Norris Square in the Fishtown\/Olde Kennington Area.\nSpacious living area\nmodern kitchen\noutdoor patio\nwalk-in closet!\nhuge windows\nnew AC and Heat\nin-unit washer & dryer\nand more!\nDon't miss this opportunity to be the first to live in this bright and ultra clean apartment close to all the popular attractions in Fishtown, Kensington and Northern Liberties! Short walk to the Berks El stop. Immediate move-in available. Tenant responsible for utilities (Electric + Water).  Credit check + application.\nThank you :)\n","num_images":16.0,"lat":39.982147,"lng":-75.136848,"attrs":"['1BR \/ 2Ba', '1000ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T16:01:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561340076.html","post_id":7561340076,"result_date":"Fri Nov 25 2022 20:54:14 GMT+0000 ","title":"NEW CONSTRUCTION 2BED\/2BATH - FISHTOWN\/NORRIS SQUARE","description":"New construction two bed, two bath apartment available now! Located in desirable Olde Kensington and just steps from Norris Square, this beautiful flat offers a spacious living area, modern kitchen, outdoor patio, walk-in closet, in-unit washer & dryer and more! Don't miss this opportunity to be the first to live in this bright and clean apartment close to all the popular attractions in Fishtown, Kensington and Northern Liberties! Short walk to the Berks L stop. Immediate move-in available. Tenant responsible for utilities (Water and Electric).  Credit check and application.  Thank you! :)","num_images":15.0,"lat":39.982147,"lng":-75.136848,"attrs":"['2BR \/ 2Ba', '1000ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T15:50:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561316097.html","post_id":7561316097,"result_date":"Fri Nov 25 2022 20:20:08 GMT+0000 ","title":"Adorable 2 Bedroom | 2 Baths Trinity - Available Now!!","description":"Adorable 2 bedroom, 2 bathroom trinity house located on a quiet street on 84 Jackson St, Doylestown, PA. Offset from the street, enter into the living room with hardwood floors and decorative fireplace. The lower level features a French country-inspired full kitchen with a large farmer's sink, ample cabinet and shelving space, modern stainless steel appliances, and built in washer\/dryer. The second floor has a full bathroom as well as a bedroom with hardwood floors, exposed brick, and decorative fireplace. A large bedroom makes up the third level with bamboo floors, half vaulted ceiling and storage space. Great location in Northern Liberties close to Fish town neighborhood and within close proximity to restaurants, shops, and public transportation. Please Text here: juliabonds472gmail.com","num_images":6.0,"lat":40.306816,"lng":-75.131305,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T14:50:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561317460.html","post_id":7561317460,"result_date":"Fri Nov 25 2022 20:14:40 GMT+0000 ","title":"Jackson St ~Affordable 3 Bedroom, 2½ Bath Trinity House - Tour Today!!","description":"Affordable 3 bedroom, 2½ bath trinity house located on a quiet street on Jackson St, Doylestown, PA. Offset from the street, enter into the living room with hardwood floors and decorative fireplace. The lower level features a French country-inspired full kitchen with a large farmer's sink, ample cabinet and shelving space, modern stainless steel appliances, and built in washer\/dryer. RENT@ $1,255.00 PER MONTH. The second floor has a full bathroom as well as a bedroom with hardwood floors, exposed brick, and decorative fireplace. A large bedroom makes up the third level with bamboo floors, half vaulted ceiling and storage space. Great location in Northern Liberties close to Fish town neighborhood and within close proximity to restaurants, shops, and public transportation. Please Text here: juliabonds472gmail.com","num_images":5.0,"lat":40.306816,"lng":-75.131305,"attrs":"['3BR \/ 2.5Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T14:53:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561196615.html","post_id":7561196615,"result_date":"Fri Nov 25 2022 15:24:00 GMT+0000 ","title":"ONE-MONTH FREE, PETS, W\/D, 24\/7 GYM, D\/W","description":"❄️Snow place like HOME- Apply Now - Receive One-Month FREE❄️\nApt #C-18 Second floor apartment with beautiful courtyard view. Newly renovated and close to the train!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 8:30 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":24.0,"lat":40.0,"lng":-75.276,"attrs":"['1BR \/ 1Ba', '663ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T10:20:00-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561196532.html","post_id":7561196532,"result_date":"Fri Nov 25 2022 15:23:44 GMT+0000 ","title":"2BR\/1BA | Bella Vista $2095","description":"•\tFully equipped kitchen w\/new counters & appliances\n•\tSpacious living room w\/high ceiling\n•\tCeramic tile bath w\/full-size tub, wood vanity with solid surface top, stylish mirror, and designer lighting\n•\tLinen\/towel\/pantry closet\n•\tBedrooms w\/great closet space\n•\tLarge high-efficiency windows\/lots of natural light\n•\tUpdated lighting\nEasy walk to a wide variety of shopping, restaurants, and sites, including Acme market, Whole Foods, Starbucks, The Magic Garden, world Famous Italian Market as well as Walnut, Market and South Street shopping and dining.\nJust steps away are medical and educational facilities of Jefferson, University of Pennsylvania, Wills Eye, and Pennsylvania Hospitals, University of the Arts, Temple, and Avenue of the Arts theaters.\nClose Public Transportation, including buses, subway and Patco lines.   Plenty of off-street parking options available.\nProfessionally managed and excellently maintained. For more information or to schedule an appointment, visit our website at www.alvinlevinrealestate.com or call  show contact info\n.","num_images":10.0,"lat":39.942112,"lng":-75.160327,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T10:19:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561191515.html","post_id":7561191515,"result_date":"Fri Nov 25 2022 15:23:33 GMT+0000 ","title":"Pet Spa Station, Quartz Countertops, Flexible Lease Options","description":"Bedrooms: 0Bathrooms: 1Square Feet: 405Address: 1401 Arch Street\nLocated in Philadelphia’s historic Center City neighborhood, One City offers modern elegance with timeless grandeur. With views of Philadelphia's City Hall and just steps away from iconic Philly locations such as the Pennsylvania Convention Center, Reading Terminal Market, and Love Park, One City offers sophisticated luxury in the heart of Philadelphia. One City offers the most discerning residents the ultimate living experience. Inside this historic building, located at 1401 Arch Street, each apartment residence holds unique original features coupled with contemporary sophistication. Thoughtful design details include custom built-in storage, stainless steel appliances, and modern connectivity offering luxury and convenience to a range of lifestyles. Control is always at your fingertips with your app-based smart home features including keyless entry.\nAmenities Include:\nPet Spa Station\nPackage Receiving System\nEuropean style\nPet Friendly 2 pets max; up to 40 lbs. Some restrictions and fees apply.\nConference Room\nQuartz Countertops\nKeyless Entry\nIn Unit Washer & Dryer\nRooftop Sundeck\nTech- Connected Living\nLobby Lounge Photo Featured amenity\nRooftop Grilling Stations\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/zzwrbtc7\/one-cityPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '405ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T10:05:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561194026.html","post_id":7561194026,"result_date":"Fri Nov 25 2022 15:16:38 GMT+0000 ","title":"2BR\/1BA w\/large private patio | Bella Vista $2150","description":"•\tFully equipped kitchen w\/new counters & appliances\n•\tSpacious living room w\/recessed lighting\n•\tCeramic tile bath w\/full-size tub, wood vanity with granite top, stylish mirror, and designer lighting\n•\tLinen\/towel\/pantry closet\n•\tBedrooms w\/great closet space\n•\tLarge high-efficiency windows\/lots of natural light\n•\tUpdated lighting\n•\tPrivate patio\nEasy walk to a wide variety of shopping, restaurants, and sites, including Acme market, Whole Foods, Starbucks, The Magic Garden, world Famous Italian Market as well as Walnut, Market and South Street shopping and dining.\nJust steps away are medical and educational facilities of Jefferson, University of Pennsylvania, Wills Eye, and Pennsylvania Hospitals, University of the Arts, Temple, and Avenue of the Arts theaters.\nClose Public Transportation, including buses, subway and Patco lines.   Plenty of off-street parking options available.\nProfessionally managed and excellently maintained. For more information or to schedule an appointment, visit our website at www.alvinlevinrealestate.com or call  show contact info\n.","num_images":9.0,"lat":39.942112,"lng":-75.160327,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T10:12:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561192487.html","post_id":7561192487,"result_date":"Fri Nov 25 2022 15:12:35 GMT+0000 ","title":"1BR\/1BA Corner Unit Modern | Bella Vista $1695","description":"•\tFully equipped kitchen w\/new counters & appliances\n•\tBreakfast bar w\/designer lighting pendant\n•\tLiving room w\/recessed lighting\n•\tOversize ceramic tile bath w\/full-size tub, wood vanity with solid surface top, stylish mirror, and designer lighting\n•\tLinen\/towel\/pantry closet\n•\tSpacious bedroom w\/great closet space\n•\tLarge high-efficiency windows\/lots of natural light\nEasy walk to a wide variety of shopping, restaurants, and sites, including Acme market, Whole Foods, Starbucks, The Magic Garden, world Famous Italian Market as well as Walnut, Market and South Street shopping and dining.\nJust steps away are medical and educational facilities of Jefferson, University of Pennsylvania, Wills Eye, and Pennsylvania Hospitals, University of the Arts, Temple, and Avenue of the Arts theaters.\nClose Public Transportation, including buses, subway and Patco lines.   Plenty of off-street parking options available.\nProfessionally managed and excellently maintained. For more information or to schedule an appointment, visit our website at www.alvinlevinrealestate.com or call  show contact info\n.","num_images":8.0,"lat":39.942112,"lng":-75.160327,"attrs":"['1BR \/ 1Ba', '900ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T10:08:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561188904.html","post_id":7561188904,"result_date":"Fri Nov 25 2022 15:12:26 GMT+0000 ","title":"On-site bike storage, Online Payments Available, Bark park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardOn-site bike storageAlexa or Google Home Capable in all ApartmentsUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsPet-friendly livingJogging trail right outside your doorBBQ and deck areaBark parkHuge walk-in closets with ample storageMarble master baths, some with deep linen storageBocce ball fieldCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/cusqsfcs\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T09:59:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561192289.html","post_id":7561192289,"result_date":"Fri Nov 25 2022 15:11:59 GMT+0000 ","title":"Microwave, Extra Storage, Electronic Thermostat","description":"Bedrooms: 1Bathrooms: 1Square Feet: 506Date Available: 2022-11-23Address: 2601 Poplar St\nFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive.\nAmenities Include:\nCentral Air Conditioning\nQuartz Countertops\nState-of-the-Art Fitness Center\nExtra Storage\nBike Storage\nHardwood Floors\nRecycling\nLatch Security System\nElectronic Thermostat\nOn-Site Management\nMicrowave\nOn-Site Maintenance\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/exerbhh6\/fairmount-northPricing and availability are subject to change.\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['1BR \/ 1Ba', '506ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T10:07:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561190089.html","post_id":7561190089,"result_date":"Fri Nov 25 2022 15:05:56 GMT+0000 ","title":"Washer Dryer in Unit, Easy Freeway Access, Professionally Managed","description":"The Point at Glen Mills has several floor plan layouts to choose from. We offer a wide range of options: including layouts with dens, lofts, and private balconies. No matter which layout you choose you will love living at The Point at Glen Mills. Visit our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T10:01:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561188579.html","post_id":7561188579,"result_date":"Fri Nov 25 2022 15:02:34 GMT+0000 ","title":"Call for Details, Pet Friendly, Visit Us Today","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nYou will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1108ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T09:58:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561188417.html","post_id":7561188417,"result_date":"Fri Nov 25 2022 15:02:08 GMT+0000 ","title":"Lease Today, Pet Spa, Convenient Location","description":"Looking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with granite countertops, stainless steel appliances and a breakfast bar. this unit also features a large entry closet, full sized washer\/dryer, linen closets, and a private balcony. The bedrooms features walk-in closets, and ensuite bathrooms.\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1095ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T09:58:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561188145.html","post_id":7561188145,"result_date":"Fri Nov 25 2022 15:01:25 GMT+0000 ","title":"Stainless Steel Appliances, Visit Us Today, Pet Spa","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nHome is where the heart is, and here at The Point at Glen Mills, it's never been easier to love where you live. Contact us today to schedule your tour. You'll be glad you did!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T09:57:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561179673.html","post_id":7561179673,"result_date":"Fri Nov 25 2022 15:00:09 GMT+0000 ","title":"Beautiful 3 Bedroom 1.5 Bath in Eddystone!","description":"show contact info\n- Welcome to 712 Saville Ave! Spacious 3 bedroom, 1.5 bath home features Central A\/C, large kitchen with ample storage, a Gas Range, Dishwasher, Microwave and stainless steal fridge. Convenient first floor powder room. Washer and Dryer included. Upstairs there are 3 large bedrooms and 1 full bath. There is an enclosed back deck along with a storage shed in the fenced in backyard!\nMove in costs will include first month, and one month security deposit.\nWe do not accept Section 8 vouchers for this property.\nNo Cats Allowed.\nYou don't want to miss this opportunity.\n*Message to fill application form and set an appointment for viewing!\n*One Year Lease required!\n*Background and Credit Check Required!\n*Text: Suzanne house owner for more information and to get the application form. Thank you.  show contact info","num_images":23.0,"lat":39.858096,"lng":-75.341455,"attrs":"['3BR \/ 1.5Ba', '1456ft2', 'available now', 'EV charging', 'air conditioning', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T09:31:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561175792.html","post_id":7561175792,"result_date":"Fri Nov 25 2022 14:53:02 GMT+0000 ","title":"Leed Gold Boutique High-rise and Offers Thoughtfully-appointed Apts!!","description":"Bridge On Race is Philadelphia's only amenity-packed, LEED Gold boutique high-rise and offers thoughtfully-appointed apartments in a rental building designed for modern living in Old City. The architecture bridges the charm of Old City with modern design and amenities, tying classic aesthetics with considered, contemporary architecture. Bridge offers its residents a unique lifestyle with a plethora of services and amenities, such as an expansive 8,000 sf outdoor garden terraces with private grilling areas, a rooftop deck with the best views in Philadelphia, state of the art fitness center, resident lounge, and much more. ** Photos are of model units ** Pricing and availability subject to change on daily basis ** Parking may be available for additional fee **\n205 Race St #0B-09E","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['0BR \/ 1Ba', '825ft2', 'available dec 11', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T09:18:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561179408.html","post_id":7561179408,"result_date":"Fri Nov 25 2022 14:48:25 GMT+0000 ","title":"Stop!! Take the Opportunity and See This Beautifully Done 2 Bed\/1 Bath","description":"Take the opportunity to stop by and see this beautifully done 2 bedroom\/1 bath apartment in one of the best locations in the city. Close to the Business District University City Major highways and The Art Museum this apartment provides proximity to everything. The hardwood floors flow throughout the entire apartment; the newly renovated kitchen boasts high end cabinetry and a lot of storage space; the wood-burning fireplace provides the warm cozy feeling during harsh winters and the deck provides the outdoor space for grilling and planting in the spring and summer. This is a must see apartment! Listing agent is related to the owner\n133 N 21st St #3","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T09:30:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561183350.html","post_id":7561183350,"result_date":"Fri Nov 25 2022 14:46:48 GMT+0000 ","title":"LIGHT-FILLED 3 BED PLUS DEN BI-LEVEL APTS IN THE HEART OF QUEEN VILLAG","description":"JUST RENOVATED WITH A BRAND NEW KITCHEN!! Light filled 3 bedroom plus den bi-level apartment in the heart of QUEEN VILLAGE! Enormous living and dining area with 15 ft ceilings. Kitchen with MARBLE floor and tons of cabinet and counter space. Each bedroom is well proportioned, with fantastic closets. Additional den\/ in home office is a fantastic bonus, located just off of the living area. New HARDWOOD floors throughout. Central air and gas heat, laundry in building, as well as a charming shared court yard.\n234 Bainbridge St #G3","num_images":5.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1Ba', '1275ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T09:42:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561182722.html","post_id":7561182722,"result_date":"Fri Nov 25 2022 14:44:58 GMT+0000 ","title":"SPREAD OUT IN THIS LUXE 2 BEDROOM, 2 BATHROOM !!","description":"Spread out in this luxe 2 bedroom, 2 bathroom located on a shaded Society Hill block offering solitude. This fully renovated bi-level apartment includes a cooks kitchen with stainless steel appliances (including a dishwasher), in-unit laundry, central air, 2 modern bathrooms, and more. Convenient to TJUH, Pennsylvania Hospital, historic parks, top-rated restaurants, and food markets. Available for immediate occupancy. The building is not dog friendly.\n317 S 6th St #1F","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T09:40:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561181841.html","post_id":7561181841,"result_date":"Fri Nov 25 2022 14:42:03 GMT+0000 ","title":"Large 2 Bed\/2 Bath Available for Rent in the Becker Building!","description":"Large 2 bedroom\/2 bathroom unit(s) available for rent in The Becker Building with PARKING for some units. A classic turn of the century converted warehouse in Philly's trendy Northern Liberties, The Becker Building is just steps from the shops\/restaurants on Liberty's Walk and 2nd Street, one block from the ACME Grocery Store, 2 blocks from the Frankford EL and just 3 blocks from uber hip Frankford Avenue in Fishtown. BECKER BUILDING AMENITIES INCLUDE: INTERCOM , FITNESS CENTER , LARGE OUTDOOR ROOF DECK FOR ENTERTAINING, KEYLESS ENTRY, HIGH CEILINGS, ELEVATOR IN BUILDING, CENTRAL AIR, IN-UNIT WASHER & DRYER, PET FRIENDLY, FRIENDLY 24 HOUR MAINTENANCE, HARDWOOD FLOORS, TRASH INCLUDED, CABLE READY, 24 HOUR SECURITY SYSTEM, PRIVATE PARKING AVAILABLE FOR SOME UNITS FOR AN ADDITIONAL CHARGE.\n1151-61 N 3rd St","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T09:38:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561181074.html","post_id":7561181074,"result_date":"Fri Nov 25 2022 14:39:45 GMT+0000 ","title":"Bark Park, Leasing Now, Stop by Today","description":"Schedule a tour today at The Point at Downingtown. We'd love to help you explore our floorplans and let us help you find a new home that perfectly fits your style. Call now!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Linen Closet\n* Walk-in Closet\n* Garden Tub\n* Stainless Steel Appliances\n* Kitchen Island\n* Washer and Dryer in unit","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '733ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T09:35:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561180144.html","post_id":7561180144,"result_date":"Fri Nov 25 2022 14:36:42 GMT+0000 ","title":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!!!!!!!!","description":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!!!!!!!! LET the SUNSETS be your permanent back drop!!!!!!!!! This ONE BEDROOM residence, at FRANKLIN TOWER, located at 16TH and RACE STREET is a must see!!! All open and spacious living and dining area, kitchen with STAINLESS steel appliances, breakfast bar, and CUSTOM cabinetry. The Bedroom is VERY spacious, with an all tile EUROPEAN style bathroom. There is nothing like FRANKLIN TOWER apartments, in all of Philadelphia!!! With amenities on EVERY FLOOR, Peloton Rooms, Yoga studios, Screening Rooms, Game Rooms, Lounges, and Gyms, as well as the ROOF TOP LOUNGE , with flat screen, grills, and fire place. A BASKETBALL COURT, and GARAGE PARKING. Parking available for additional cost. Photo's are of model unit.\n200 N 16th St #1606","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '656ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T09:32:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561180087.html","post_id":7561180087,"result_date":"Fri Nov 25 2022 14:36:30 GMT+0000 ","title":"Latch Security System, Central Air Conditioning, On-Site Maintenance","description":"Bedrooms: 0Bathrooms: 1Square Feet: 530Date Available: 2022-11-23Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:MicrowaveRecyclingBike StorageOn-Site MaintenanceDishwasherWasher\/DryerAmazon Package Locker SystemElevatorState-of-the-Art Fitness CenterOn-Site ManagementExtra StorageLatch Security SystemCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/czzza7nq\/fairmount-northPricing and availability are subject to change.\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['0BR \/ 1Ba', '530ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T09:32:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561176173.html","post_id":7561176173,"result_date":"Fri Nov 25 2022 14:35:31 GMT+0000 ","title":"Lovely Bi-level Apartment is Located at 239 Fairmount Ave Available Nw","description":"Located at 239 Fairmount Ave (#1) in the highly desirable Northern Liberties section of Philadelphia, we have a lovely bi-level apartment becoming available now. The apartment features one large bedroom and one full bathroom. There are hardwood floors on the main level and tiled floors on the lower level and bathroom. The kitchen has plenty of counter\/cabinet space and is equipped with an electric stove, refrigerator, and dishwasher. The apartment has a lot of character and there is ample space to get creative and really make the place your own. Plenty of closet space. For your convenience, there is a washer\/dryer in the unit. Pets are negotiable. Public transportation is easily assessable. Just a short stroll to Piazza at Schmidt's, bars, restaurants, CVS, Riteaid, etc etc.\n239 Fairmount Ave #1ST FLOOR","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1.5Ba', '1878ft2', 'available now', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T09:19:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561178774.html","post_id":7561178774,"result_date":"Fri Nov 25 2022 14:32:22 GMT+0000 ","title":"GORGEOUS AND HUGE NEW CONSTRUCTION HOME IN THE HEART OF FISHTOWN!","description":"Absolutely GORGEOUS and HUGE new construction home in the heart of Fishtown available for rent. This property has so much space! There are living rooms on the first and 2nd floors, a fully finished basement, 4 large bedrooms, 2 full bathrooms and a powder room on the first floor. The kitchen has been perfectly updated with lots of cabinets and a gleaming granite island. The kitchen leads to the backyard, a private outdoor oasis with room to play and relax. This home has more windows than the average row home, and each room is filled with a lovely natural light. The location cannot be beat-- super walkable to shops, restaurants bakeries, music venues, breweries, parks, public transportation, shopping, gyms, salons, truly the best of city living at your fingertips! Pets are ok on a case-by case- basis. Easy online application-- available for immediate move-in!\n1212 E Oxford St","num_images":5.0,"lat":39.9788,"lng":-75.1262,"attrs":"['4BR \/ 2.5Ba', '2224ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T09:28:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561175093.html","post_id":7561175093,"result_date":"Fri Nov 25 2022 14:31:34 GMT+0000 ","title":"Spectacular & Grand 2-story\/2 Bedroom, 2 Bathroom Renovated Apts!","description":"Spectacular & Grand 2-story\/2 bedroom, 2 bathroom renovated apartment filled with charming old-world architectural details that features a private rear garden and PARKING located on beautiful Green Street in the heart of the Art Museum Area! First month's rent, last month's rent, and one month's security deposit is sue at lease signing. $50 application fee per applicant.\n1838 Green St #1","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '4040ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T09:15:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561177986.html","post_id":7561177986,"result_date":"Fri Nov 25 2022 14:29:35 GMT+0000 ","title":"WELCOME TO UNIT 15A IN THE FABULOUS ELLINGTON BUILDING!","description":"Welcome to Unit 15A in the fabulous Ellington building! Unit 15A is a light-filled, south facing corner unit in one of the more spacious layouts of the building. High up on the 15th floor, you have views of South Philadelphia as well as the iconic Comcast building! High ceilings and oversized windows make for a comfortable living & dining space. The kitchen has plenty of cabinet and counter space plus stainless steel appliances. Storage is not an issue in this unit - the hall is lined with deep closets for all of your belongings and both bedrooms have ample closet space. The primary bedroom is complete with an en-suite bathroom. Stackable washer\/dryer is located right off the kitchen. The Ellington is a secure, convenient building with a 24-hour concierge, fitness center, meeting & party rooms, and a library. Several parking garages with monthly options are within a block of the front door. No pets. First, last, and security deposit due prior to move-in. $300 non-refundable move-in fee required by the building. All utilities included except cable\/internet.\n1500 Chestnut St #15A","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '1096ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T09:25:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561174958.html","post_id":7561174958,"result_date":"Fri Nov 25 2022 14:19:09 GMT+0000 ","title":"Leasing Now, Fitness Center, Residents Lounge","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester offers small town charm close to everything you need. Stop by today for a tour!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, coat closet, washer\/dryer, walk-through closet, and a patio\/balcony!\nCommunity Features\n* Community Kitchen\n* Easy Freeway Access\n* EV Charging\n* Garage Parking\n* Bark Park\n* Minutes from Restaurants, Shopping, and Much More\n* Package Acceptance\n* Landscaped Courtyards\n* Pet Salon\n* Renters Insurance is Required\n* Gaming Area\n* Community Lounge\n* Controlled Access\n* Sun Deck\n* Elevator\n* WiFi Access\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Playground\n* Extra Storage\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* After-Hours Emergency Maintenance\n* Non Smoking Community\n* Fitness Studio\n* TV Lounge\n* Swimming Pool\n* Bike Racks\n* Billiards\n* Outdoor Grill Area\n* Movie Theatre\n* Short or Long Term Lease Available\n* Long Term Lease Available\n* Dry Cleaning and Laundry Service\n* Professionally Managed\n* Credit Cards Accepted","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '785ft2', 'available nov 30', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T09:15:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561174681.html","post_id":7561174681,"result_date":"Fri Nov 25 2022 14:18:05 GMT+0000 ","title":"Peloton Room, NEST Learning Thermostats, Roof Deck","description":"Bedrooms: 1Bathrooms: 1Square Feet: 711Date Available: 2022-11-25Address: 631 N Broad StThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past. Amenities Include:Energy-efficient, gas-powered HVACClementine's Stable CafeEfficient AppliancesHardwood FloorsLatchOS technology lock systemLuxer Package RoomElevatorNEST Learning ThermostatsOn-Site ManagementExposed Brick & Spiral DuctworkPet friendlyPeloton RoomCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/a5b5onwb\/stable-loftsPricing and availability are subject to change.\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['1BR \/ 1Ba', '711ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T09:14:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561168237.html","post_id":7561168237,"result_date":"Fri Nov 25 2022 14:06:58 GMT+0000 ","title":"Experience all of Center City's Comforts at Riverloft Apartments","description":"Experience all of Center City's Comforts at Riverloft Apartments. Let our 24-hour front desk attendant receive your guests, your deliveries, dry cleaning, or anything else you may need. Our high-rise apartment building also offers an on-site ATM and controlled access guest parking and garage parking for an additional fee. Relax in your loft-style apartment with 16-foot ceilings, 12-foot windows and stainless steel kitchen appliances. There are high-tech touches throughout Riverloft - tech bars with data and charging ports provide convenient pit stops, plus there is a tech lounge with pod seating, a gas fireplace and a Smart TV. Riverloft has free Wi-Fi in all common areas, and iPads are available for check-out at the tech bar. Work out in our 24-hour Resort-Style Fitness with state-of-the-art equipment featuring personal TVs and iPod jacks. There are also weight machines and free weights for a lower-impact workout. Located steps from Rittenhouse Square surrounded by world class dinning and shopping. Monthly rent amount varies based on move-in date, and prices subject to change on daily basis. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n2302 Walnut St #0B1BA","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:49:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561165849.html","post_id":7561165849,"result_date":"Fri Nov 25 2022 14:04:27 GMT+0000 ","title":"Midtown Village Loft Style Apartments and Duplexes in Center City!","description":"Midtown Village Loft Style Apartments and Duplexes In Center City Philadelphia. At The Collins, you are in the heart of Midtown Village where it's all happening, from street festivals to cocktail hours to art openings. Stake your claim to insider status in the neighborhood's newest shopping-and-dining destination, home to Target Express, Starbucks, Planet Fitness and all of your neighborhood essentials. Indulge in luxury loft living steps from the Blue and Orange lines near the best of downtown. Get into The Collins, and live all in. Whether you need a 1 or 2 bedroom home, The Collins has a variety of loft style floor plan layouts and spacious 2 bedroom duplex options. The Collins is ideally located just moments from University of the Arts (UARTS) and Thomas Jefferson University (Center City Campus). It's also a perfect location for Drexel University, Temple University and University of Pennsylvania (UPENN). ** Photos are of model units ** Pricing and availability subject to change on a daily basis ***\n1125 Sansom St #2B-621","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '1597ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:39:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561169616.html","post_id":7561169616,"result_date":"Fri Nov 25 2022 13:59:49 GMT+0000 ","title":"Wonderful 3 Bedroom, 2.5 Bath Townhouse With a Dedicated Parking Spot","description":"Wonderful 3 bedroom, 2.5 bath townhouse with a dedicated parking spot right in front of this house! Located in Logan Square, Nectarine Street is between 19th & 20th, Spring Garden and Hamilton Streets. Main Floor offers an open floor plan with a spacious dining room and living room with hardwood floors and a charming balcony\/deck. Also on this floor is an exceptional kitchen with beautiful custom wood cabinetry and stainless steel appliances, and a modern half-bath and a laundry area. Upper level offers an amazing main bedroom with an upscale ensuite bathroom, a cathedral ceiling, huge closets, and the most beautiful natural light! There are also 2 more bedrooms with good closets and a fabulous hall bathroom. This townhouse has every amenity! Convenient to shopping, the Art Museum, and Fairmount Park. Available as of 12\/1\/22.\n1924 Nectarine St","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2.5Ba', '1694ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:55:49-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561169292.html","post_id":7561169292,"result_date":"Fri Nov 25 2022 13:58:29 GMT+0000 ","title":"WELCOME TO BRIDGEVIEW! LOCATED IN BUSTLING OLD CITY!","description":"SHORT TERM 6 MONTH LEASE. Welcome to Bridgeview! Located in bustling Old City, on a quiet cobblestone street, is a renovated, top floor loft for you to call home. The building features high quality amenities including roof deck, garage parking, 24 hour concierge service, and a thriving association of owners. Your new home, unit 616, is bathed in natural light and features the high ceilings and exposed brick walls of your dreams. Enter the unit and find ample storage by the door before moving toward the kitchen, notice the hardwood floors throughout. You’ll first find an updated kitchen with a fresh new backsplash, stainless steel appliances and tons of storage. From here, you’ll enter the open living space with plenty of room for a dining table and living room set. Notice the size of these windows! You’ll find more closet storage on the way to the full bath that features stone tile and radiant heating in the floors. Next, is the large primary bedroom with two huge windows and more exposed brick. Another closet here for additional storage. Lastly you’ll find a BONUS room that is perfect for a nursery, home office, gym, dressing room, yoga room, guest bedroom or whatever you desire to make of it! Unit 616 comes with a 3x6 storage unit on the 6th floor (near the elevator and unit). GARAGE PARKING AVAILABLE FOR ADDITIONAL $250\/ MO. Easy access to the Market Frankford Line, I-95 and the Ben Franklin Bridge make this a commuter's dream and on the evenings and weekends you are in the heart of everything that Old City has to offer including tons of boutiques, coffee shops, restaurants and museums. Don’t miss your opportunity to claim this stylish home for yourself!\n315 New St #616","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '790ft2', 'available dec 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T08:54:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561168937.html","post_id":7561168937,"result_date":"Fri Nov 25 2022 13:57:03 GMT+0000 ","title":"HIGH SOARING CEILINGS WITH UNIQUE FLOOR PLAN!! AWESOME 1BED 1BATH","description":"Over 1100 sq ft in desirable MetroClub Condominiums! ! HIGH SOARING CEILINGS with unique Floor Plan!! Awesome 1Bed 1Bath condo & assigned gated parking space for additional cost ! Great kitchen w\/granite countertops & stainless steel appliances. Open liv & din room w\/dark hardwood fl's & beautiful N views fr HUGE windows for TONS of light! Bedroom with large w\/big closet! Bathroom has DOUBLE sinks & all marble. W\/D in UNIT. Building has a ton to offer, including total Renoved Beautiful New designed Hallways Coming Soon on each Floor!! 24 hr security\/concierge, Outdoor POOL and Hot Tub with Cabana Area including Grills and Firepit as well as beautiful GYM, Bike Room ! easy access highways - 95,76 and 676 and short walking to awesome restaurants and city attractions! $1825 deposit due with application, and first and last month due at signing of lease!\n201-59 N 8th St #211","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '1119ft2', 'available dec 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:53:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561168619.html","post_id":7561168619,"result_date":"Fri Nov 25 2022 13:55:30 GMT+0000 ","title":"FULLY FURNISHED RENTAL WITH HUGE SIDE YARD AVAILABLE!!","description":"Fully furnished rental with huge side yard available for month to month or short term lease. The side yard has a gate that provides plenty of outdoor space for entertaining and or motorcycle and bike parking. Wifi, 65\" TV and water included in the lease. New paint, carpet and lighting fixtures throughout. Prime Northern Liberties location just one block from the train station. Plenty of on street parking right under the I95 overpass. Walk out the front door to some of the best restaurants and bars in the city.\n152 Fairmount Ave","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '1365ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:51:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561167557.html","post_id":7561167557,"result_date":"Fri Nov 25 2022 13:51:11 GMT+0000 ","title":"SUN SOAKED, FRESHLY PAINTED, NO CARPET, 1BED 1BATH HOME!","description":"Sun soaked, freshly painted, no carpet, 1bed 1bath home located on the grounds of a gated community on the Delaware River. This Waterfront Square Condominium, located in the desired Regatta Building, offers views and amazing amenities, to INCLUDE PARKING, fitness center with indoor pool and a surrounding deck right on top of the river, 3 dog parks, 2 massive green space areas, Center City shuttle service, 24 hour concierge and 24 hour gated security and so much more. The unit features all hardwood floors, stainless steel appliances and in unit laundry. Working from home? The Regatta Community room provides reservable space for any conference, work or social need. Within a few minutes of walking, enjoy all the hotspots of Fishtown, Northern Liberties and the “Del Ave” bars and restaurants. Located just steps to the Spring Garden Elevated Station, bus lines and I95 for quick transit. Don’t wait, enjoy luxury living today! Sorry - No Cats.\n901 N Penn St #R605","num_images":4.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '738ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:47:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561167002.html","post_id":7561167002,"result_date":"Fri Nov 25 2022 13:48:39 GMT+0000 ","title":"The Best Location in Rittenhouse Square is Available to Rent!!","description":"Half a block way from Rittenhouse Square Park. Roof top deck with spectacular view of the park as seen in the photos. This rental has two generously size bedrooms (11x11 and 19x8) with two full bathrooms. A garden walkway welcomes you as you enter the property through a private gated entrance. The updated kitchen boasts granite counter tops, newer stainless steel appliances and a charming back splash. The second level offers a full bath with subway tiles and pedestal sink as well as a large bedroom (19x8) with more than ample closet space and built-in shelving - this level has plenty of natural light shining through the windows. The third level features a nicely updated full bathroom with an 11x11 bedroom and plenty of natural light. The lower level has a nice sized unfinished basement with a full-size washer and dryer (included with rental). This home is just steps from Rittenhouse Square restaurants, shops, fabulous nightlife, parking garages, public transportation and everything Center City has to offer. Schedule your private showing today. Make yourself at home with 2 very nice size bedrooms (11x11) and (19x8) each with their own full bath. Ask about including your friendly pet or including utilities.\n1830 Manning St","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', '880ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T08:44:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561166635.html","post_id":7561166635,"result_date":"Fri Nov 25 2022 13:47:03 GMT+0000 ","title":"STUNNING, COMPLETELY RENOVATED 2 BEDROOM, 2 BATHROOM RESIDENCE!","description":"Stunning, completely renovated two bedroom, two bathroom residence located on the 19th floor of The Academy House along the Avenue of the Arts! Enter into the foyer with black tile floors and coat closet. The large eat-in kitchen has granite countertops, a peninsula, breakfast nook, modern wood cabinets, subway tile back splash and stainless steel appliances including a Frigidaire electric range, oven and microwave, a Kitchenaid refrigerator, and a Whirlpool dishwasher. The adjacent great room has hardwood floors and city views to the south and east from a private Juliet balcony which can be accessed from each room. The primary suite has great closet space and a spacious ensuite bathroom which features a shower\/tub with subway tile and a double vanity. The second bedroom is spacious and also has a large amount of closet space. Directly across is the hall bathroom which has tile flooring, a contemporary glass vanity, and a shower\/tub. There is a Maytag stackable washer\/dryer in the unit. No detail was left undone in this showplace condominium. The terrace doors were pushed out to increase interior square footage. Residents of Academy House enjoy a 24-hour doorman and a state-of-the-art fitness and aquatic center. There is valet parking in the building's garage for an additional monthly fee, subject to availability. The Academy House is located in the heart of Center City and within close walking distance to Rittenhouse Square, Washington Square, and the Broad Street and Market Street office corridors. The Philadelphia International Airport and Amtrak's 30th Street Station are easily accessible.\n1420 Locust St #19F","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:43:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561159722.html","post_id":7561159722,"result_date":"Fri Nov 25 2022 13:45:49 GMT+0000 ","title":"Updated 1 bedroom apartment in a landmark building","description":"$500 Security Deposit and 1st Month's Rent to move-in!! Updated 1 bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block off the Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit! Video can be provided upon request!\n1411 Walnut St #310","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '970ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:09:49-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561165534.html","post_id":7561165534,"result_date":"Fri Nov 25 2022 13:42:04 GMT+0000 ","title":"Magnificent 4-beds 5-baths, Townhome Equipped With an Elevator!","description":"Welcome to Northbank, Fishtown's newest development. 3203 Parkview Walk is a magnificent 4-bedroom 5-baths, 3844 sq. ft. townhome equipped with an elevator! It features an open, spacious floorplan, 500 sq. ft. rooftop terrace and beautiful gourmet chef's kitchen that is perfect for entertaining! The owners floor features a patio with view of the water, walk in closet, huge walk-in shower, and soaking tub. The ground floor has a 2 car garage an and a generously sized study that can be used as a home office or an additional bedroom, and private garage parking. The open kitchen includes a large island, separate pantry, and half bath. Features include: - Smart home technology - Energy Star certification - Elevator - 2 car garage - Pella windows - Private rooftop balcony - Chef's kitchen - Open floor plan\n3203 Parkview Walk","num_images":5.0,"lat":39.9788,"lng":-75.1262,"attrs":"['4BR \/ 5Ba', '3488ft2', 'available nov 30', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T08:38:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561163266.html","post_id":7561163266,"result_date":"Fri Nov 25 2022 13:31:51 GMT+0000 ","title":"BRIGHT & CHEERY STUDIO AT THE DORCHESTER, LOCATED ON RITTENHOUSE SQ!","description":"Bright and cheery studio at The Dorchester, located on Rittenhouse Square! The Dorchester, Unit 402 is a perfectly sized studio with parquet wood floors, great natural light and excellent storage space. Features include a sun-lit living area with oversized windows; a fully-equipped kitchen; and a dressing area that leads to a full bathroom with a single vanity and shower\/tub combination. The Dorchester is located directly on Rittenhouse Square, ranked the 6th best neighborhood in North America. Residents of The Dorchester enjoy a 24-hour doorman, fitness center, all utilities, and basic cable for TV. There is an additional fee for use of the seasonal rooftop pool. Parking is available for rent through the building for an additional fee, subject to availability.\n224-30 W Rittenhouse Sq #402","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '573ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T08:27:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561162926.html","post_id":7561162926,"result_date":"Fri Nov 25 2022 13:30:14 GMT+0000 ","title":"2 Bed 1 Bath Furnitured Apartment in Chinatown!","description":"2 Bed 1 bath FURNITURED apartment in Chinatown. Apartment is featured with hardwood floor, granite counter tops, large L shaped kitchen, central air, and laundry in the building. You will enjoy this ultra convenient center city location. Buses and Trains to NYC or D.C. , and Nave Yard Shuttles are just around the corners. It's 2 blocks to Broad Street Line, and surrounded by fantastic eateries and entertainment venues. Apartment is available. Water is included. Check out the YouTube virtual tour first, and call to schedule a showing!\n1211 Race St #2F","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', '6000ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:26:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561162253.html","post_id":7561162253,"result_date":"Fri Nov 25 2022 13:26:51 GMT+0000 ","title":"Full Floor 2 Bed 1 Bath Rental Unit in the Heart of Graduate Hospital!","description":"Full Floor 2 bedroom 1 Bath rental unit in the heart of graduate hospital. Spacious living space with two ample bedrooms, complete with laundry in the unit! Oversized living space, open to the kitchen. Available immediately.\n1819 Bainbridge St #3","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:22:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561159482.html","post_id":7561159482,"result_date":"Fri Nov 25 2022 13:20:32 GMT+0000 ","title":"PARKING IS INCLUDED WITH THIS FANTASTIC AND SPACIOUS 2 BED, 2 BATH!","description":"PARKING INCLUDED with this fantastic and spacious 2 Bedroom, 2 Bathroom Bi-Level Apartment w\/Garden In The Heart Of The Art Museum Area! Hardwood Floors, Upgraded Kitchen w\/Dishwasher + Washer\/Dryer. No Pets Allowed. First month, last month & security deposit due at lease signing. $50 application fee per applicant.\n2307 Fairmount Ave","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1.5Ba', '1164ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:08:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561160182.html","post_id":7561160182,"result_date":"Fri Nov 25 2022 13:16:29 GMT+0000 ","title":"Available Early January, Move in for the New Year!","description":"Available early January, move in for the New Year! Showcasing waterfront and city views from the exclusive vantage of a spacious unit in the Society Hill Towers (designed by IM Pei), this stunning two bedroom condo was designed to impress. Featuring floor to ceiling windows with custom treatments, vinyl plank wood flooring, an open concept living area, modern fixtures, and coveted building amenities including a 24 hour concierge, maintenance, as well as underground Parking, health club, and seasonal pool available for an additional monthly fee, this residence has it all. Rent includes all utilities and basic cable\/ internet. Upon entry through the gracious foyer, you will be entranced by the boundless views and natural light shining through the spacious, open living and dining area. The beautiful kitchen will instantly inspire you to begin preparing meals with features such as stainless steel appliances, granite countertops, and upper and lower cabinetry. The main bedroom is complete with a walk-in cedar closet, tons of space, and stunning views of the river. The second bedroom also includes ample closet space, river views, and tons of opportunity for a home office, guest suite, and more. Tiled hall bath just off the hall and across from both of the two bedrooms. The conveniences continue with a small supermarket on site with delivery service, as well as a dry cleaners and the well regarded Zahav Restaurant. Building has a $250 move in fee, and a $50 application fee for required credit and criminal background check. The building is non smoking and restricts pets.\n220 Locust St #15AS","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '1201ft2', 'available jan 6, 2023', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T08:12:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561158722.html","post_id":7561158722,"result_date":"Fri Nov 25 2022 13:08:37 GMT+0000 ","title":"Elevator, Central Air Conditioning, Washer\/Dryer","description":"Bedrooms: 0Bathrooms: 1Square Feet: 512Date Available: 2022-11-23Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:Electronic ThermostatElevatorBike StorageMicrowaveAmazon Package Locker SystemOn-Site ManagementRoof DeckCentral Air ConditioningHardwood FloorsQuartz CountertopsDishwasherState-of-the-Art Fitness CenterCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/pybkqedu\/fairmount-northPricing and availability are subject to change.\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['0BR \/ 1Ba', '512ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T08:04:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561157843.html","post_id":7561157843,"result_date":"Fri Nov 25 2022 13:04:44 GMT+0000 ","title":"Updated three bedroom home for rent","description":"Beautiful 3 bedroom home for rent. Home will feature a large nice size kitchen, dining and living room along with 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the first floor, fresh paint, brand new countertops and cabinets with new gray carpets on the stairs and second floor. Washer and dryer hookup can be added. Minutes away from shopping and public transportation. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only.","num_images":5.0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:00:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561157844.html","post_id":7561157844,"result_date":"Fri Nov 25 2022 13:04:44 GMT+0000 ","title":"Enjoy the Conveniences of City Living from This Sunny 1-bed 1-bath Unt","description":"Enjoy the conveniences of city living from this sunny one bedroom, one bath unit in Society Hill Towers with all utilities included! Located on the 5th floor of the West Tower, this home features hardwood floors, walls of oversized windows, and beautiful treetop views. The kitchen is opened up to the living and dining area and features a convenient breakfast bar, gas range, dishwasher and full-sized refrigerator. A spacious bedroom features an oversized closet, and additional closets off the entryway and hall provide great storage space. Part of the I.M. Pei-designed Society Hill Towers, this home is in an esteemed condo community featuring a 24 hr front desk, renovated common lobby, laundry facilities, and guest parking lot (w\/hourly metered parking). The gym, seasonal pool, and garage parking are available to residents at an additional monthly cost. Perfectly located in the heart of historic Society Hill, this home is steps away from Zahav, Ritz 5 theater, ACME, Independence Hall, Penn's Landing, Headhouse Square, and convenient to public transportation and major thoroughfares. Monthly rent includes all basic utilities (electric, gas, water, heating and cooling) with internet\/cable at an additional $64.00\/m.\n210 Locust St #5HW","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '683ft2', 'available jan 2, 2023', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T08:00:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561157053.html","post_id":7561157053,"result_date":"Fri Nov 25 2022 12:59:50 GMT+0000 ","title":"Renovated modern style home","description":"Beautiful 3 bedroom home with finished basement that can be used for entertainment or storage. Home will feature kitchen, nice sized dining room, living room and 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint and brand new countertops and cabinets. If that wasnt enough, home also has a deck that you can walk straight into from the dining room. The living room and dining room has beautiful recessed lights that makes the room appear larger and brighter. There is also a attached garage that can be used as storage. Washer and dryer hook up can be added. The home is down the street from cobbs creek parkway. Minutes away from shopping and yeadon. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only.","num_images":11.0,"lat":39.936534,"lng":-75.232002,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T07:55:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561156169.html","post_id":7561156169,"result_date":"Fri Nov 25 2022 12:54:34 GMT+0000 ","title":"Modern 4 bedroom home for rent","description":"Beautiful large 4 bedroom home with finished basement that can be used for entertainment or storage. Home will feature a large kitchen, large dining room, living room and 4 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint, a large fireplace and brand new countertops and cabinets. Recessed lights throughout. Washer and dryer hookup up can be added. Down the street from boys Latin high school. Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. 3rd party vouchers and payments will not be accepted. Serious inquiries only.","num_images":19.0,"lat":39.951696,"lng":-75.236861,"attrs":"['4BR \/ 1Ba', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T07:50:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561151498.html","post_id":7561151498,"result_date":"Fri Nov 25 2022 12:18:07 GMT+0000 ","title":"Package Receiving System, European style, Bike Storage","description":"Bedrooms: 0Bathrooms: 1Square Feet: 318Address: 1401 Arch StreetLocated in Philadelphia’s historic Center City neighborhood, One City offers modern elegance with timeless grandeur. With views of Philadelphia's City Hall and just steps away from iconic Philly locations such as the Pennsylvania Convention Center, Reading Terminal Market, and Love Park, One City offers sophisticated luxury in the heart of Philadelphia. One City offers the most discerning residents the ultimate living experience. Inside this historic building, located at 1401 Arch Street, each apartment residence holds unique original features coupled with contemporary sophistication. Thoughtful design details include custom built-in storage, stainless steel appliances, and modern connectivity offering luxury and convenience to a range of lifestyles. Control is always at your fingertips with your app-based smart home features including keyless entry. Amenities Include:Smart ThermostatStainless Steel AppliancesApp based compatibility with all virtual personal assistant systems; Including thermostats and other electrical components.Additional Storage AvailableProgrammable Smart Home FeaturesRooftop SundeckIn Unit Washer & DryerPackage Receiving SystemPet Friendly                                                                                                                                2 pets max; up to 40 lbs. Some restrictions and fees apply.Bike StorageLVT FlooringFully Equipped KitchensCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/uifbakn5\/one-cityPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '318ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T07:14:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561144242.html","post_id":7561144242,"result_date":"Fri Nov 25 2022 11:25:21 GMT+0000 ","title":"Two renovated 2 bedroom apartments ready for move in (Narberth)","description":"I have an upstairs 2 bedroom apartment, and a downstairs 2 bedroom apartment for rent, located at 219 Grayling Ave. in Narberth.\nBosch high efficiency washer & dryer in unit. Central Air. Fireplace. Off Street parking. Top floor. 2 off street parking spaces. Hardwood floors throughout. Both units are almost identically remodeled.\nRent is $1600\/month + $800 security deposit.\nPets are allowed, as long as they're house trained. One-time pet fee of $200.\nYou must fill out an application first and foremost, as it's a 2.5 hour drive each way for me, so I'd have to know that you're approved before comitting to that drive.  Text Phebe for an application at  show contact info","num_images":18.0,"lat":40.008174,"lng":-75.260189,"attrs":"['2BR \/ 1Ba', '1104ft2', 'available now', 'air conditioning', 'application fee details: $34.99 rental history and background check', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T05:37:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561145854.html","post_id":7561145854,"result_date":"Fri Nov 25 2022 11:20:40 GMT+0000 ","title":"Keyless Entry, Quartz Countertops, Stainless Steel Appliances","description":"Bedrooms: 0Bathrooms: 1Square Feet: 338Address: 1401 Arch Street\nLocated in Philadelphia’s historic Center City neighborhood, One City offers modern elegance with timeless grandeur. With views of Philadelphia's City Hall and just steps away from iconic Philly locations such as the Pennsylvania Convention Center, Reading Terminal Market, and Love Park, One City offers sophisticated luxury in the heart of Philadelphia. One City offers the most discerning residents the ultimate living experience. Inside this historic building, located at 1401 Arch Street, each apartment residence holds unique original features coupled with contemporary sophistication. Thoughtful design details include custom built-in storage, stainless steel appliances, and modern connectivity offering luxury and convenience to a range of lifestyles. Control is always at your fingertips with your app-based smart home features including keyless entry.\nAmenities Include:\nStainless Steel Appliances\nLobby Lounge Photo Featured amenity\nPenthouse Hideaway Fully furnished bar and lounge area for BYO entertainment. Photo Featured amenity\nIn Unit Washer & Dryer\nPackage Receiving System\nEuropean style\nFitness\/ Wellness Center On screen fitness classes provided in private yoga studio\nBike Storage\nPet Friendly 2 pets max; up to 40 lbs. Some restrictions and fees apply.\nInterior & Exterior Entertainment Lounges\nGuest Suites\nTech- Connected Living\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/2tuvtzqi\/one-cityPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '338ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T06:04:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561142230.html","post_id":7561142230,"result_date":"Fri Nov 25 2022 10:22:30 GMT+0000 ","title":"One Bedrm \/No hidden costs**Dec. 10th, 2022... apprx 860sq.f","description":"1 bedroom, 1 Bath third floor apartment in 1045 Powell St, Norristown, PA . 860 square feet. Located on the far end of a quiet street, with plenty of street parking. Bus stop at end of street. Large yard and second floor front deck. Large yard. Free shares use of W\/D located in basement. Water and sewer included in rent. Electric heat. Tenants are responsible for gas, heat, electricity and renters insurance. No pets, no smoking.","num_images":4.0,"lat":40.1245,"lng":-75.3304,"attrs":"['1BR \/ 1Ba', 'available dec 10', 'application fee details: $9.00 APPLICATION FEE.??', 'broker fee details: NO BROKER FEE.??', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T05:00:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561138678.html","post_id":7561138678,"result_date":"Fri Nov 25 2022 09:01:09 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561112951.html","post_id":7561112951,"result_date":"Fri Nov 25 2022 03:39:51 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561324287.html","post_id":7561324287,"result_date":"Fri Nov 25 2022 20:13:40 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561316505.html","post_id":7561316505,"result_date":"Fri Nov 25 2022 19:55:13 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561315565.html","post_id":7561315565,"result_date":"Fri Nov 25 2022 19:52:46 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561313940.html","post_id":7561313940,"result_date":"Fri Nov 25 2022 19:48:49 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561310910.html","post_id":7561310910,"result_date":"Fri Nov 25 2022 19:41:13 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561309007.html","post_id":7561309007,"result_date":"Fri Nov 25 2022 19:36:57 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561304636.html","post_id":7561304636,"result_date":"Fri Nov 25 2022 19:26:44 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561247559.html","post_id":7561247559,"result_date":"Fri Nov 25 2022 19:22:24 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561302318.html","post_id":7561302318,"result_date":"Fri Nov 25 2022 19:21:26 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561280219.html","post_id":7561280219,"result_date":"Fri Nov 25 2022 18:32:48 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561277564.html","post_id":7561277564,"result_date":"Fri Nov 25 2022 18:31:48 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561269902.html","post_id":7561269902,"result_date":"Fri Nov 25 2022 18:10:41 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561262544.html","post_id":7561262544,"result_date":"Fri Nov 25 2022 17:55:23 GMT+0000 ","title":"Three Bedroom Rancher","description":"Three bedroom rancher, with full lower floor.\nFirst floor: Wrap around living \/ dining room, eat in kitchen, three bedrooms and full tile bath\nBasement level: Full rec room, full tile bath, utility room and one car garage (street front). Access to large, fenced rear yard and patio from rec room.\nWasher and dryer in utility room. Hot air heat and central air, Thermal windows, ample closet space.\nAvailable December 15th (or sooner).\nFour miles to Jefferson University. Access to public transportation\n2240.00 plus utilities.\nshow contact info","num_images":0.0,"lat":40.0471,"lng":-75.217827,"attrs":"['3BR \/ 2Ba', '2000ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T12:51:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561262123.html","post_id":7561262123,"result_date":"Fri Nov 25 2022 17:54:32 GMT+0000 ","title":"Large Soaking Tubs, Stop by Today, Central Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nBe the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, built-in desk, master suite, walk-in closets, a Den, washer\/dryer, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\n[#9495282]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1218ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T12:50:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561248005.html","post_id":7561248005,"result_date":"Fri Nov 25 2022 17:54:20 GMT+0000 ","title":"Brand New Toll Brothers Waterfront Condo for Rent in Fishtown!!","description":"Brand New Toll Brothers Waterfront Condo for Rent in Fishtown Grow Property Management presents this brand new luxury Toll Brother's Townhome, 3 bedroom condo located in Fishtown's Waterfront community Northbank. Attached Garage, Open Floor Designed, with 2.5 baths. Dramatic kitchen with center island, luxury finishes, cabinets, and stainless steel appliances. Over-sized bedrooms with over-sized closets. The master bedroom has its own covered balcony, lavish bathroom, and a walk-in closet. There is plenty of overflow street parking for your guests. Pictures are just representations and are not of the actual models & finishes & material will vary. Sitting on the Delaware River, Northbank, feature waterfront trails and breathtaking views of the Delaware River, the Ben Franklin Bridge and the City Skyline. Being in Fishtown the Philadelphia neighborhoid known for being the “Cool” kids with its unique approach to life and community here. Art, culinary and musical action with plenty of parks, outdoor cafes, gastro-pubs and strong hold in the food scene. NORTHBANK WATERFRONT COMMUNITY CONDOMINIUMS AMENITIES: • Beautifully Landscaped Courtyard. • Views of the Delaware River and the Ben Franklin Bridge. • Exceptional Walk Score & Immediate Public Transportation • Immediate to Coffee Shops, Gastro Pubs, Breweries, Parks • Close to Restaurants, Shopping, On\/Off Highway Ramps • Close to Market Street Subway Line SERVICES: • Managed by Grow Property Management • Tenant Portal System • 24-hr Emergency Maintenance SHOWING INSTRUCTIONS: You can schedule now, an instant self-showing. It can be at the time & day best for you. Visit our website at and select this property on our available properties tab. Please complete the contact info and details sections to be able to view the property.\n3001 City View Walk #196","num_images":5.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2.5Ba', '1493ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T12:20:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561253112.html","post_id":7561253112,"result_date":"Fri Nov 25 2022 17:35:11 GMT+0000 ","title":"Stop by Today, Residents Lounge, Upgraded Finishes Available","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester is the perfect location for your new home. Explore our location today!\nThis two-bedroom two-bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, two patio\/balcony!\nCommunity Features\n* Package Acceptance\n* Sun Deck\n* WiFi Access\n* Swimming Pool\n* Minutes from Restaurants, Shopping, and Much More\n* Bike Racks\n* Community Lounge\n* Long Term Lease Available\n* Renters Insurance is Required\n* Landscaped Courtyards\n* Easy Freeway Access\n* Fitness Studio\n* Controlled Access\n* After-Hours Emergency Maintenance\n* Gaming Area\n* TV Lounge\n* Outdoor Grill Area\n* Extra Storage\n* Movie Theatre\n* EV Charging\n* Short or Long Term Lease Available\n* Garage Parking\n* Pet Salon\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Professionally Managed\n* Credit Cards Accepted\n* Playground\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Bark Park\n* Elevator\n* Community Kitchen\n* Non Smoking Community\n* Dry Cleaning and Laundry Service\n* Billiards","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1190ft2', 'available nov 30', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T12:31:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561246055.html","post_id":7561246055,"result_date":"Fri Nov 25 2022 17:34:12 GMT+0000 ","title":"This Unit You Will Find a Spacious Kitchen With Granite Counters!!","description":"Upon entering this unit you will find a spacious kitchen with granite counters, and stainless appliances including brand new dishwasher and disposal. This kitchen features a large eat in area, with plenty of cabinet and counter space. Off of the kitchen is a storage area. From the kitchen you will head into the spacious and sun filled living and dining area. On your way from the kitchen there is a half bath to the left . The living room opens up to your new deck for all of your outdoor entertaining needs. Head upstairs where you will first find the main suite, featuring multiple closets and an on suite bath. Down the hall you will find the convenient second floor laundry with a brand new washing machine, and the full bath for the second and third bedrooms. The second and third bedroom are spacious and private from the main suite. This property is around the corner from 76, close to public transportation, walk-able to giant, whole foods, trader joes, Rittenhouse, and the art museum neighborhood. This location has it all, and this unit comes with a parking spot!\n214-30 N 22nd St #13L (14A)","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 2.5Ba', '1870ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T12:16:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561251324.html","post_id":7561251324,"result_date":"Fri Nov 25 2022 17:31:23 GMT+0000 ","title":"Resort Style Pool, Professionally Managed, Visit Your New Home","description":"Prepare to fall in love with The Point at Glen Mills! Kick back in our community lounge. Watch your furry friend frolic with his furry friends in our dog park. Challenge your friends to a game of golf on our outdoor putting green. Life is good at The Point at Glen Mills. Call today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with granite countertops, stainless steel appliances and a breakfast bar. this unit also features a large entry closet, full sized washer\/dryer, linen closets, and a private balcony. The bedrooms features walk-in closets, and ensuite bathrooms.\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\n[#9495406]","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1095ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T12:27:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561250812.html","post_id":7561250812,"result_date":"Fri Nov 25 2022 17:30:21 GMT+0000 ","title":"Wow! 2 Porches+Deck -Perfect West Philly Location","description":"A gorgeous old, victorian twin, this home is in a perfect location. It's just a couple blocks away from the many shops and restaurants on the Baltimore Ave. corridor.\nFrom the tree-lined street, you walk up onto your porch -- one that's large enough for a dining table or an outdoor sofa and chairs. From here, the front door will take you into a small mudroom before you walk into your living room where you'll find 10-foot-high ceilings, hardwood floors, and a (non-working) fireplace. In the front of the living room is a giant picture window and on the side is a bay window with a built-in window seat. Walking through the living room and past the powder room, you'll head into the dining room where the hardwood floors and 10-foot-high ceilings continue. Here you'll find another bay window and a built-in glass-fronted china closet. Past the dining room is the kitchen, which includes a dishwasher and brand new refrigerator. The kitchen has two doors: one that leads to the basement where you'll find more storage space than you'll ever need as well as your washer and dryer. The other door leads out to your private back porch and back yard, which also has an additional deck large enough for a dining table and an outdoor living room set up. This house has a significant amount of outdoor living space.\nAs you head back through the kitchen and dining room and up the stairs, you'll find three bedrooms and a full bathroom on the second floor. The ceilings on this floor are also ten feet high. The primary bedroom is enormous and h as a bay window overlooking the big old trees on 48th street. It also has a (non-working) fireplace. The other two bedrooms have a railroad configuration: In order to access one, you have to walk through the other. (Because of this, the home would probably not be a good set up for three roommates). All bedrooms have good sized closets and two have bay windows. The unit is cooled with a central air system and has additional mini splits that can add heat or add cooling in the upstairs rooms.\nThe way this home is set up, it feels like you'll be living in a victorian twin that you have all to yourself. However, there is a third floor apartment that has a long-term tenant who is a lovely person. The entrance to her third-floor apartment is on the side of the house in the alley so you'll rarely see her come and go. She does not share an entrance with you and her lease does not include either of the porches or the backyard -- those are 100% yours.\nThere is plenty of street parking. 90% of the time you can find parking on your block without having to look. The other 10% of the time, it won't take you longer than 2 minutes to look for parking and you'll never have to park more than 2 blocks away.\nThe photos are from when we, the landlords, lived in the unit a year and a half ago. The decor looks different now that tenants are living in the unit. So when you come to see the unit, it will look different because the house will have the current tenants' furniture and decor. The unit is being rented unfurnished.\nIn our opinion, the location is perfect. In one direction, you are two blocks away from the heart of the Baltimore corridor where you will find the Gold Standard Cafe, the Mariposa Co-Op, Vietiene Cafe, and many salons and shops. In the other direction, you are three blocks away from ReAnimator Coffee, the 48th Street Grille, and the shops on the Spruce Street Corridor. Turn in another direction and you're only 5 blocks from Clark Park and the farmer's market, and in the final direction you're only four blocks from Booker's Restaurant and the surrounding food and retail. You won't find a more perfect location in West Philly.\nIf you are interested in seeing the unit, please respond via email. Tell us a bit about you, what your target move-in date is, when you would be available to see the unit, and ask any questions that you have\nSome pets may be considered with an additional fee.\n","num_images":7.0,"lat":39.950273,"lng":-75.218833,"attrs":"['3BR \/ 1.5Ba', '1800ft2', 'available jan 1, 2023', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T12:26:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561248795.html","post_id":7561248795,"result_date":"Fri Nov 25 2022 17:26:03 GMT+0000 ","title":"Mayfair 1st Flr Duplex","description":"Newly renovated 1st duplex, 1bdr.\nNew paint, carpets and flooring.  Washer and dryer on site.  Unit has central air.\nRent is $900 and security is $1500.\nText message only  show contact info\nto schedule a showing.","num_images":6.0,"lat":40.0369,"lng":-75.0664,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T12:22:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561246672.html","post_id":7561246672,"result_date":"Fri Nov 25 2022 17:21:27 GMT+0000 ","title":"One-of-a-kind Community Combines the Convenience of City Living","description":"Brand new construction available for rental. This one-of-a-kind community combines the convenience of city living and the incredible views of the Delaware River and the Ben Franklin Bridge. This is corner lot and enjoy a leisurely stroll on the walking paths along the riverfront. Located within minutes to some of the finest restaurants and hot spots of Fishtown. The interior unit that offers the perfect open concept floorplan. The 9' first and second-floor ceilings add to the appeal and grandeur of this townhome. The kitchen equipped with stainless steel appliances has a generously sized island and leads to the living room and casual dining room lending itself perfectly for either a night of entertaining or relaxing. A spacious primary bedroom features an elegant tray ceiling and a covered deck. The Primary bath includes a dual-sink vanity, seated shower, separate water closet, and leads to a large walk-in closet. Two additional bedrooms on the 3rd level can be used for a home office or guest suite. Park your car in this attached, single car, rear entry garage. Overflow street parking is also available for you and your guests. Pictures from the model home.\n3109 Riseview Lane","num_images":5.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 3.5Ba', '1881ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T12:17:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561236925.html","post_id":7561236925,"result_date":"Fri Nov 25 2022 17:19:06 GMT+0000 ","title":"Spacious 1 Bedroom 1 Bath Apt $500 Security Deposit to Move-in!","description":"Just 1st month's rent and $500 security deposit to move-in!!! The Society Hill Building is a beautiful mid-rise community located in the Society Hill\/Washington Square neighborhood of Center City. This building features spacious 1 bedroom 1 bath apartments, overlooking scenic Washington Square Park. The Society Hill Building is within walking distance of historic Old City as well as close to all forms of public transportation. 10 foot high ceilings, controlled access keypad entry, hardwood floors in some units, abundant natural light, dishwasher, microwave, high-efficiency individually controlled A\/C and heat. Laundry on each floor and pet-friendly! Brand new windows in all apartments. Pictures are of a similar unit.\n701 Sansom St #206","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1170ft2', 'available dec 21', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T11:58:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561244566.html","post_id":7561244566,"result_date":"Fri Nov 25 2022 17:17:23 GMT+0000 ","title":"WOW, MODERN TOWNHOUSE FEATURED IN PHILADELPHIA MAGAZINE!","description":"WOW, MODERN TOWNHOUSE FEATURED IN PHILADELPHIA MAGAZINE! Here is a rare opportunity to live in a modern townhouse on a tree-lined, quiet Center City street. This beautifully maintained, eight-year-old home has an open floor plan on the first floor with a magnificent kitchen that leads to an ultra-private backyard with twinkle lights, wood decking, a chalkboard-paint wall, and a one-of-a-kind mural by local artist Kaitlin Chow. The second floor has 2 spacious bedrooms, generous closet space, and a full bath. The entire third floor is a primary suite with a custom paint treatment, 2 oversized closets including a custom closet system, and a full bath with large, glass-enclosed shower and double vanity - a rare find in Center City! Continue to the fourth floor for a roof deck offering views of the city. The finished basement has high ceilings, a laundry area, plenty of storage, and a half bath. This home is full of smart modern touches: video doorbell, dual-zone air conditioning and heating with Nest thermostats, high ceilings, wide stairs, hardwood floors, hardwired smoke detectors and sprinklers, custom blackout blinds, freshly painted walls, and more. 1309 Rodman Street is in the McCall School catchment, and a couple of blocks to Whole Foods, Acme, the Kimmel Center, Seger Park, and the hottest restaurants of Midtown Village and Rittenhouse.\n1309 Rodman St","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2.5Ba', '2200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T12:13:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561234978.html","post_id":7561234978,"result_date":"Fri Nov 25 2022 17:15:37 GMT+0000 ","title":"HALF MONTH FREE FOR APPLICATIONS BEFORE 11\/15!!!","description":"HALF MONTH FREE FOR APPLICATIONS BEFORE 11\/15!!! Just 1st month's rent and $500 security deposit to move-in!!! 1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. Hardwood floors in the living area and the bedroom is carpeted. The Warehouse Property is located in a highly walkable area with access to all forms of public transportation. Secured entry, gated property, gym\/fitness center and on-site parking- add'l $150 mo. with full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit.\n9 N 9th St #307","num_images":5.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '625ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T11:53:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561242848.html","post_id":7561242848,"result_date":"Fri Nov 25 2022 17:13:54 GMT+0000 ","title":"Available Now, 2 Full Bathrooms and an Updated Kitchen!!","description":"Available now, a top floor of a converted Warehouse, soaring ceilings, and exposed wood beams throughout. 2 Full Bathrooms and an updated Kitchen. Located at the intersection of Northern Liberties\/Fishtown\/Olde Kensington. Additionally, there is off-street parking available for additional convenience. Schedule your showing today!\n1210-15 Palethorp #301","num_images":5.0,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T12:09:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561241639.html","post_id":7561241639,"result_date":"Fri Nov 25 2022 17:11:30 GMT+0000 ","title":"BOUTIQUE apartment building in the HEART of LOGAN SQUARE!","description":"BOUTIQUE apartment building in the HEART of LOGAN SQUARE! Sun splashed living and dining area, with ENORMOUS windows, 10ft ceilings, and HARDWOOD FLOORS throughout. All open living and dining area. Stunning WHITE kitchen w\/ beautiful granite counter tops, and gracious breakfast bar. The bedroom boasts big closets, and super sleek, marble and tile bath. Enjoy living in this wonderful PMC property, with Fantastic gym, Walk to Giant Market, Schuylkill trail, Penn, Drexel and Rittenhouse sq Photo's are of model unit.\n2130 Arch St #206","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '800ft2', 'available dec 27', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T12:07:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561231710.html","post_id":7561231710,"result_date":"Fri Nov 25 2022 17:09:54 GMT+0000 ","title":"Sun-soaked 1-Bed Filled With Charm Available at the Historic Touraine!","description":"No. 710: Sun-soaked one bedroom filled with charm available at the Historic Touraine Building. This home features a large, fully appointed kitchen with Custom French Country Cabinetry, subway tile, and peninsula for your guests to sit while you’re cooking. The open floorplan also boasts a large closet outfitted with a custom closet kit, and crown molding in the living space. The Touraine: Formerly an elegant residential hotel built in 1917, The Touraine combines original architectural details with modern comforts. The Touraine is Philadelphia's most central and beautiful address. Located on a tree-lined block of Spruce Street, the Touraine is just a quick walk to Rittenhouse Square, the Avenue of the Arts, and all the transportation and shopping of Center City. Ours is a thriving community of locally owned businesses from craft beer to great coffee, bike repair to bagels, and countless beloved BYOB's where you can dine outside. Our block is home to exquisite buildings and vibrant street life. TouraineÃƒÂ¢Ã‚Â€Ã‚Â™s residents enjoy 24\/7 Front Desk Staff, 24 Hour Emergency Maintenance, on-site Management, Package Reception, Online Rent Pay and Service Request Entry through our Resident Portal which can be accessed online or with an app, our Fitness Center & Yoga Studio, Curated Workshops, Hospitality Suites, complimentary and secure document shredding, composting, recycling, Business Center, and more. **Pictures are of a different unit with the same floor plan.\n1520-28 Spruce St #710","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '305591ft2', 'available dec 27', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T11:45:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561234071.html","post_id":7561234071,"result_date":"Fri Nov 25 2022 17:08:28 GMT+0000 ","title":"Beautiful Rental in the Heart of Center City is Waiting for You","description":"Beautiful rental in the heart of Center City is waiting for you, a gorgeous sunny one-bedroom, one-bath condominium at the Packard Grande. Totally roomy loft-like open floor plan is south-facing with incredible skyline views which are pretty breathtaking!! High up on the 22nd floor, this unit has an ultimate open layout, southern views which really come to life at night providing an exciting feast for your senses and in the morning energizing sunrises...The open kitchen is huge perfect place for entertaining, stainless steel appliances, granite countertops, and ample cabinet space. Huge Spa-like bathroom features Italian ceramic tile chrome fixtures and a ceramic sink with storage vanity, huge bedroom with ample closet space as well.. be in the heart of Center City Philadelphia, come enjoy your new life.\n111 S 15th St #2209","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '761ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T11:51:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561240093.html","post_id":7561240093,"result_date":"Fri Nov 25 2022 17:08:24 GMT+0000 ","title":"This Mid-rise Unit Puts Your Right in the Middle of the Action!","description":"Spring has sprung on the square and this mid-rise unit puts your right in the middle of the action! Take in both city & sunset views, through the abundance of West facing windows. Saunter down the elevator and out your front door to take in all the heart of the city has to offer. Grab a coffee at La Colombe, lunch at Parc, get your sweat on at Unite fitness, and then pick up the freshest ingredients from Sue's Produce and Di Bruno's before heading home to prepare the perfect meal in your kitchen. Outfitted with stainless steel appliances, granite countertops, and a large pantry typically not found in center city condos. This location is just a quick commute to University City, 30th Street Station, Market Street, and City Hall. In addition to the application, the following items and criteria must be met: 1. Photo ID (gov't issued) 2. SSN or require double security deposit 3. Income requirement. 36 x rent. If not met, require co-signer 48 x rent 4. 1 month of pay stubs 5. FICO score minimum of 600. ONE FREE month on an 16 month lease. Listed price reflects 16 month lease with 1 month free amortized. Base rent is $1800. Please check with the agent as specials are subject to change without notice.\n37 S 20th St #4C","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '525ft2', 'available now', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T12:04:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561229757.html","post_id":7561229757,"result_date":"Fri Nov 25 2022 17:07:20 GMT+0000 ","title":"*Beautiful 2 bedroom, 2bathroom single family home located in Lawndale","description":"This is a beautiful 2 bedroom, 2bathroom single family home located in Lawndale. This cozy home offers a nice kitchen, 3 bedrooms, living room, kitchen and bathroom. Plenty of cabinet space in the kitchen area. Huge backyard with a deck, basement, forced air heating.Very cozy and lots of natural light. Minutes away from bus service, schools, shops, and restaurants. Washer included with the property. Great value and won’t last long! please text at  show contact info","num_images":6.0,"lat":40.05161,"lng":-75.09059,"attrs":"['2BR \/ 2Ba', 'available dec 8', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-25T11:41:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561235639.html","post_id":7561235639,"result_date":"Fri Nov 25 2022 17:07:09 GMT+0000 ","title":"2 bed\/2bath - Luxury Living","description":"Balmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":23.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T11:55:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561232461.html","post_id":7561232461,"result_date":"Fri Nov 25 2022 17:05:43 GMT+0000 ","title":"Unique Townhomes Offer an Exciting Opportunity to Enjoy Luxury Living!","description":"Introducing SoNo26, a premier living destination in Philadelphia?s Northern Liberties. Our unique townhomes offer an exciting opportunity to enjoy luxury living while being in the center of all the city has to offer. Stroll and shop along Liberty Walk or enjoy a gourmet meal at one of the critically acclaimed restaurants, bars and cafes. The homes at SoNo26 feature all of the high quality finishes you?ve come to expect from a Premier Access property. Step inside your front door and you will be greeted with a spacious open concept living and dining area with beautifully designed windows that offer magnificent natural sunlight. The living area flows nicely into the top of the line gourmet kitchen which features Arctic Quartz countertops, Bosch appliances and custom cabinets making this kitchen the perfect space to entertain friends. Open the sliding glass doors and you will find your back patio where you can enjoy your morning cup of coffee or glass of wine after dinner. Leading off of the kitchen are stairs to take you down to your full finished basement with washer and dryer and half bath giving you a great added space for guests or an entertainment center. Head back up the stairs and continue to the second floor where you will find two spacious bedrooms with large closets and plenty of storage as well as two bathrooms for your convenience. On the upper floor you will enter into the large master suite with incredible walk in closets and master bath with double sinks that will make you feel right at home. On the top floor you will find your unbelievable roof deck that offers spectacular views of the Philadelphia skyline making this a relaxing at home retreat. To add on to all that SoNo26 has to offer, each unit comes with 1 car parking to ensure you never have a problem finding a space for your car. These brand new units will not last long set up your showing today and come home to SoNo26!\n318 Potts Pl","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 3Ba', '2016ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T11:47:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561238481.html","post_id":7561238481,"result_date":"Fri Nov 25 2022 17:05:22 GMT+0000 ","title":"Renovated Bi-level 1 bedroom apartment in the heart of Rittenhouse Squ","description":"Renovated Bi-level 1 bedroom apartment in the heart of Rittenhouse Square!! This boutique vintage building has all of the historic charm of a converted brownstone paired with modern updates throughout making for stylish and comfortable living. Enjoy restored hardwood floors and a kitchen with brand new appliances and a huge in unit laundry closet. Upstairs you will find a large bedroom with lots of windows that can accomodate any size bed and perfect for at home office set up. There is also a brand new renovated bathroom. The spiral staircase provides access to both floors but also exterior access to hallways on both floors for easy move in. PETS WELCOME! Many parking garages close by. Only first month and 1 month security needed at signing.\n2015 Walnut St #201","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T12:01:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561237274.html","post_id":7561237274,"result_date":"Fri Nov 25 2022 17:02:59 GMT+0000 ","title":"❄️Hardwood Floors, Breakfast Bar, 24\/7 Gym, W\/D, PETS❄️","description":"❄️Snow Place like HOME- Apply Now - Receive One-Month FREE❄️\nApt #F-12 Second floor apartment w\/ beautiful courtyard view. Newly renovated, close to the train & shopping!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 8:30 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":24.0,"lat":40.0,"lng":-75.276,"attrs":"['2BR \/ 1Ba', '897ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T11:58:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561236111.html","post_id":7561236111,"result_date":"Fri Nov 25 2022 17:00:15 GMT+0000 ","title":"LIGHT ,BRIGHT, SOUTH FACING UNIT READY FOR YOU TO CALL HOME!!","description":"Washington Square| Hopkinson House - Light ,Bright, South facing unit ready for you to call HOME. Short or Long term unfurnished Lease welcome. This open floor plan has an abundance of storage, character and charm. WASHER & DRYER in unit, Garage Parking available for lease below , private outdoor space and a rooftop POOL (additional fee) are just a few amenities in this amazing, well managed building. Wood floors, spacious balcony, glass double doors, generous built ins and delightful, soothing VIEWS of the Delaware River and Cityscape await! Retail, Restaurants and Historic sites are all within minutes of your front door! Universities, Hospitals, Major Public transportation all near by. Easy Airport & Train accessibility. Enjoy Washington Square Park as your front yard!\n604-36 S Washington Sq #1209","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '778ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T11:56:15-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561233965.html","post_id":7561233965,"result_date":"Fri Nov 25 2022 16:55:13 GMT+0000 ","title":"2 bed\/2bath - Luxury Living","description":"Carlyle floor plan — 1,153 sq. ft. — $3,225 - $3275\nThis 2 bedroom\/2 bathroom apartment has so much to offer! This beautiful apartment home comes with\ncentral air and heat, a full-size front-loading washer and dryer, and stainless steel appliances.\nOur brand-new construction includes quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":23.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1153ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T11:51:13-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561233343.html","post_id":7561233343,"result_date":"Fri Nov 25 2022 16:53:53 GMT+0000 ","title":"SPACIOUS CORNER 2 BED, 1 BATH IN NORTHERN LIBERTIES","description":"Spacious corner 2 bed, 1 bath in Northern Liberties and just steps from Fishtown! MOVE IN SPECIAL! Only 1st month's rent and HALF month's security deposit due at lease signing. This second floor apartment in newly constructed 18 W. Girard comes with washer dryer in unit, stainless steel appliances, lots of storage, hardwood floors, juliet balcony and an open floorplan with an elevator in the building, bike storage and pet friendly for $25\/month and a one time $250 deposit! Come and check it out before it's gone! Available December 10th. Please note we have the same layout on the 4th floor coming for a mid January move in date if that timing is preferable.\n18 W Girard Ave #204","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '875ft2', 'available dec 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T11:49:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561231026.html","post_id":7561231026,"result_date":"Fri Nov 25 2022 16:48:23 GMT+0000 ","title":"Sunny 1 bedroom full floor apartment in Rittenhouse Area","description":"Sunny 1 bedroom full floor apartment in Rittenhouse Area. 2nd floor walk up in bright corner building. Wood floors, New kitchen in 2018 including wood cabinetry, appliances and washer\/dryer. Full tile bath with tub\/shower combination. Wood burning fireplace in spacious bedroom. Just blocks to Rittenhouse Square in the heart of everything! Close to shopping, theater, galleries, parks. Easy access to public transportation. and major highways. Owner supplies 2 window A\/C units. Owner pays heat, water, hot water. Tenant pays electric. 1st, last and 1 month security deposit. $50 application fee per person on lease. Pets and any pet fees are at sole discretion of owner. 3 blocks to Rittenhouse Square. Close to Restaurants, Theatre and shopping. Easy access to SEPTA, PATCO, AMTRAK and major highways.\n1701 Pine St #1","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '800ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T11:44:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561218046.html","post_id":7561218046,"result_date":"Fri Nov 25 2022 16:27:28 GMT+0000 ","title":"Beautifully Maintianed and Affordable House for rent","description":"Well maintained Four bedroom one bath Single-family House  situated on blooming neighborhood. The house has great layout, spacious bedrooms, hardwood floor thru out and HVAC system. Come and check out this beautiful home before it is gone!\nTenant is responsible for electricity, gas and $50 flat fee for water each month\n","num_images":7.0,"lat":40.010811,"lng":-75.163505,"attrs":"['4BR \/ 1Ba', '1500ft2', 'available jan 19, 2023', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-25T11:13:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561211398.html","post_id":7561211398,"result_date":"Fri Nov 25 2022 16:25:35 GMT+0000 ","title":"Spacious and Gracious Light Filled 1 Bedroom Unit!!","description":"THE MIDTOWN! This value priced spacious and gracious light filled 1 bedroom offers: Wonderful living and dining space which your kitchen over looks. Very well proportioned bedroom and all tile bath. Enjoy living just minutes from Avenue of the Arts, Jefferson Hospital, Pennsylvania Hospital, and the Reading Terminal Market. Walking Score 110!\n1218 Walnut St #403","num_images":5.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '600ft2', 'available dec 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-25T10:58:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561216197.html","post_id":7561216197,"result_date":"Fri Nov 25 2022 16:24:08 GMT+0000 ","title":"LUXURY AND BEAUTIFUL, NEW CENTER CITY PHILADELPHIA APARTMENTS!!","description":"Luxury Apartments In Center City Philadelphia. Beautiful, new center city Philadelphia apartments; our building has innovative, efficiently designed spaces that take advantage of every square inch for your comfort and convenience. The modern approach allows us to make your wish list achievable not as a dream in the future but right now when you need it most. Center City apartments at its best! Offering studios, 1 bedroom, and 2 bedroom apartment homes. Conveniently located just a few blocks from Rittenhouse Square, and is near the University Of The Arts (UARTS), Peirce College, Moore College of Art and Design, and Drexel College of Nursing. Be in the center of everything! Walk outside your front door and be steps away from Dilworth Park, Rittenhouse Square, the Avenue of the Arts, and countless restaurants, cafes, bars, and shops. See why Avenir is your ideal Center City apartment. People who participate in group fitness make it to the gym 45% more often! Experience the community within your community. Take a virtual spin class when it s convenient. Plan a Friday night workout with old friends or welcome a new neighbor to the community. Work out on your schedule, not someone else's! ** Photos are of model units * Prices and availability subject to change on daily basis **\n42 S 15th St #0B1BA","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '314ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T11:09:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561210350.html","post_id":7561210350,"result_date":"Fri Nov 25 2022 16:15:58 GMT+0000 ","title":"LIVE AT PARK TOWNE PLACE APARTMENT HOMES IN CENTER CITY!!","description":"Live at Park Towne Place Apartment Homes in Center City Philadelphia, and you'll be blocks from the center of nightlife in Logan Square and Rittenhouse Square. Unit features modern kitchens, quartz countertops, stainless steel appliances, in-unit washers and dryers, breakfast bars, pendant lighting, tile backsplashes, wood plank flooring throughout, walk-in closets. Stunning city and museum views are offered in a variety of floor plans! Mainstreet Market and Caf , featuring gourmet coffee and tea and much more! Fitness center with Technogym equipment, Queenax boxing gym, yoga\/spin studio with indoor\/outdoor workout space. It boasts Philadelphia's largest pools, an art studio, fitness center with boxing gym, yoga\/spin studio, social lounge with demonstration kitchen, gourmet market and cafe, outdoor lounge with fire pit, 24-hour concierge, 24\/7 package acceptance, resident shuttle service to Center City and University City and more. Make Whole Foods as your second kitchen conveniently located just 1 block away. Our apartments are within one mile of several institutions of higher education: Drexel University, Temple University, University of Penn, CHOP, Moore college of Arts, Community College of Philadelphia. You won't find a better building to live with amenities in the Fairmount Area. Park Towne Place includes 948 apartment and penthouse homes within four high-rise towers. The community is nestled between green acres on the Benjamin Franklin Parkway in the heart of Center City Philadelphia's Museum District. Park Town. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n2200 Benjamin Franklin Pkwy #0B1BA","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['0BR \/ 1Ba', '425ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T10:55:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561214761.html","post_id":7561214761,"result_date":"Fri Nov 25 2022 16:09:56 GMT+0000 ","title":"Make This Fabulous Apartment in a Great Location Your New Home!","description":"Newer high end rehab in Fitler Square Area. This Loft Like 2 bedroom with wonderful light (Northern & Southern Exposure) has it all. Gorgeous kitchen open to living area with granite countertops, stainless appliances, gas range and built-in microwave. Central Air, recessed lighting, high ceilings and hardwood floors add beauty and convenience. The Bathroom has double sinks and stone floors and the bedrooms have Berber carpeting, one with a built in armoire. Other amenities include, free wireless internet and washer and dryer in the apartment. Make this fabulous apartment in a great location your new home! This is a Non Smoking Apartment in a Non Smoking Building. Street Parking Only. Available January 1st 2023\n2227 Kater St #3RD FL","num_images":5.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T11:05:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561214044.html","post_id":7561214044,"result_date":"Fri Nov 25 2022 16:08:25 GMT+0000 ","title":"1 Bedroom apt with Backyard and Basement","description":"A very nice 1 bedroom apartment (approximately 700 sqft). Available for rent on 11\/15\/22. The apartment includes a private backyard and basement for extra work and storage space. Laminate hardwood floors throughout. Modern kitchen with stainless steel appliances. Full size washer and dryer in the unit.\nConvenient location. 3 blocks to Tasker-Morris Subway stop. Short walk to Passyunk Walk, South Philadelphia Tap Room, American Sardine, South Street, and Rittenhouse Square. Walking distance to Center City. Free off street parking.\nCats\/Dogs are ok with a $250 non-refundable fee per pet.\nAvailable for rent on 12\/1\/22. 1st month, Last month and Security deposit required. We will be running a credit and background check.\nText or Email to schedule a showing.\nshow contact info","num_images":21.0,"lat":39.93118,"lng":-75.173778,"attrs":"['1BR \/ 1Ba', '700ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T11:04:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561212891.html","post_id":7561212891,"result_date":"Fri Nov 25 2022 16:05:58 GMT+0000 ","title":"Elevator, Controlled Access\/Gated, Hardwood Floors","description":"Bedrooms: 1Bathrooms: 1Square Feet: 711Date Available: 2022-11-25Address: 631 N Broad St\nThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past.\nAmenities Include:\nElectronic Thermostat\nEnergy-efficient, gas-powered HVAC\nClementine's Stable Cafe\nElevator\nLuxer Package Room\nPet friendly\nHardwood Floors\nGas Range\nHistoric Building\nNEST Learning Thermostats\nOn-Site Management\nLatchOS technology lock system\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/u3byon2l\/stable-loftsPricing and availability are subject to change.\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['1BR \/ 1Ba', '711ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-25T11:01:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561208326.html","post_id":7561208326,"result_date":"Fri Nov 25 2022 16:04:41 GMT+0000 ","title":"Spacious Units!","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Bocce ball fieldGame Room with Billiards Table, Shuffle Board, and moreUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsState-of-the-art fitness center overlooking the Manayunk canalMarble master baths, some with deep linen storageJogging trail right outside your doorUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingAlexa or Google Home Capable in all ApartmentsBBQ and deck areaHuge walk-in closets with ample storageFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingPet-friendly livingCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/l2yeqqm3\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1364ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-25T10:50:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561200266.html","post_id":7561200266,"result_date":"Fri Nov 25 2022 15:34:01 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561198980.html","post_id":7561198980,"result_date":"Fri Nov 25 2022 15:30:27 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null}]