[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-renovated-bdrm-on\/7490342797.html","post_id":7490342797,"result_date":"2022-05-30 22:16","title":"Recently Renovated 1 Bdrm on Front St off Lehigh Ave","description":"TEXT for a showing at  show contact info\nrefer to \"Front St Apt\".\nRecently upgraded 1 bedroom apartment on N Front ST and Lehigh Ave.\n2nd floor apartment with a large living room, private bedroom with a street view, closet space, windows for fresh air.\nFull size bathroom with shower and tub, toilet and vanity.\nSmall but full kitchen with electric stove, fridge, freezer and sink.\nNear subway on Cumberland St (Market Frankford Line).\nRequirements:\nProof employment earning 2.5 X's rent\nValid ID or license\nNo Evictions\nMax 2-3 people occupancy\nShowings by appointment only, TEXT for a showing at  show contact info\nrefer to \"Front St Apt\".\n$800 Rent and $800 security, $40 application fee required.","num_images":7.0,"lat":39.99089,"lng":-75.130898,"attrs":"['1BR \/ 1Ba', 'available now', 'application fee details: 40', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T22:12:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/summerdale-sweet-bedroom-bath-home-for\/7490307443.html","post_id":7490307443,"result_date":"2022-05-30 20:25","title":"@Sweet 2 Bedroom \/ 2 Bath Home For Rent@ Laundry on first floor!!@","description":"Sweet 2 bedroom, 2 bath home with loads of potential!2 story, with 1317+\/- square feet. Enclosed porch in front, fireplace, laundry on first floor, aluminum siding. Garage fit for storage. Mechanics include gas furnace. Lot size 5,600+\/- square feet. Property rent \"as, is\". Some but not all of the personal property in photos will convey with real estate.","num_images":4.0,"lat":40.2922,"lng":-76.9432,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T19:59:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-house-in\/7490290307.html","post_id":7490290307,"result_date":"2022-05-30 19:13","title":"Beautiful 2-Bedroom House in Great Neighborhood","description":"Very attractive, recently-renovated 2-bedroom house in the up-and-coming neighborhood of Newbold in South Philly available on July 1st or August 1st.  House features quaint living room, new kitchen with stainless refrigerator and dish-washing machine, 1st-floor utility room with washer\/dryer, one small bedroom, one larger bedroom, nice bathroom, and a backyard great for entertaining friends.\nThe house has great transportation access: 5-minute walk to Broad Street Subway, 1-minute walk to SEPTA Bus Routes #2 and #17, 10-minutes by bike to Center City, 5-minute drive to I-76 (and a few minutes more to Walt Whitman Bridge) and I-95, and 10-minute drive to Philadelphia International Airport.\nThe house is also just a few minutes walk to many great destinations:  La Llorona Cantina, Cafe Chocolate, BreweryARS, Second District Brewery, South Philly Taproom, Melrose Diner, Stina Pizzeria, Nick's Old Original Roast Beef, Phillip's Steaks, Ultimo Coffee, and V Marks the Shop (vegan) convenience store.","num_images":17.0,"lat":39.926296,"lng":-75.176886,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T19:04:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/darby-two-bedroom\/7490252919.html","post_id":7490252919,"result_date":"2022-05-30 17:25","title":"Two bedroom","description":"Recently updated KAYR two bedroom  apartment for rent just waiting for you to move right in! New renovations throughout this apartment full of natural light. Close proximity to public transportation, major roadways and blocks from the Cobbs Creek Park. First and last month rent and one month security deposit required for move in.","num_images":12.0,"lat":39.9176,"lng":-75.2696,"attrs":"['2BR \/ 1Ba', 'available now', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T17:21:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/darby-bedroom-apy\/7490252602.html","post_id":7490252602,"result_date":"2022-05-30 17:25","title":"1 bedroom apy","description":"RIPTION\nRecently updated one bedroom KAYR apartment for rent just waiting for you to move right in! New renovations throughout this apartment full of natural light. Close proximity to public transportation, major roadways and blocks from the Cobbs Creek Park. First and last month rent and one month security deposit required for move in.\n","num_images":10.0,"lat":39.9176,"lng":-75.2696,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T17:21:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-br-townhome-with-25\/7490252290.html","post_id":7490252290,"result_date":"2022-05-30 17:24","title":"2 BR Townhome with 2.5 Baths and garage on 3 Levels","description":"Townhome on a quiet cul-de-sac in desirable Colonial School District. Convenient to Conshohocken, Chestnut Hill, Philadelphia, King of Prussia, shopping, dining, rail and bus transit, and the Forbidden Drive and Schuylkill River recreational trails. Enter through a bright foyer with coat closet, and step up to the kitchen and powder room off the entrance hall. A great room with dining area and access to a rear deck complete the main floor.  A large front bedroom with attached bath share the upper level with a second large bedroom, hall bath and convenient laundry alcove. The ground level features a large extra room, ample storage areas and a garage.  A french door leads to a sandstone patio below the main floor's deck. A spiral stair connects these two outdoor spaces, which preside over wooded open space.","num_images":12.0,"lat":40.089104,"lng":-75.259438,"attrs":"['2BR \/ 2.5Ba', '1500ft2', 'available jun 18', 'air conditioning', 'application fee details: Nominal fee handled via third party application', 'townhouse', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T17:20:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/darby-studio-apartment\/7490252273.html","post_id":7490252273,"result_date":"2022-05-30 17:24","title":"Studio apartment","description":"Recently updated studio KAYR apartment for rent just waiting for you to move right in! New renovations throughout this apartment full of natural light. Close proximity to public transportation, major roadways and blocks from the Cobbs Creek Park. First and last month rent and one month security deposit required for move in.","num_images":8.0,"lat":39.9176,"lng":-75.2696,"attrs":"['0BR \/ 1Ba', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T17:20:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lawrence-st-apt-welcome-to\/7490208535.html","post_id":7490208535,"result_date":"2022-05-30 16:56","title":"N Lawrence St APT E,  Welcome to Lawrence Street Condos!!","description":"N Lawrence St APT E,  Welcome to Lawrence Street Condos, located on a sunny corner in the heart of Northern Liberties.   Enjoy the natural sunlight shining through your open living room inclusive of high ceilings and a fireplace, great for  those cold winter nights.   Head into the kitchen filled with upper and lower cabinetry, stainless appliances and great counterspace for prepping meals.  A coat closet and half bath complete the main floor.  The lower level consist of 2 spacious bedrooms, a modern bath and laundry.    Head outside your private entrance located on Brown Street to grill and entertain in the shared courtyard or take a short walk to grab a bite to eat.  Honey's Sit 'n Eat, Cafe La Maude, Yards Brewery, North 3rd, Apricot Stone and Hikari Sushi are just a few of the locals favorite restaurants just steps away.   Liberty Lands and Oriana Hill Dog Park are great for relaxing in greenery or taking your dog for a walk in this pet-friendly community.  Grocery shopping is also made easy with Acme, Giant and Target nearby.   Public transportation and access to major roadways made easy too!  If you are looking for good space in, move in ready condition, convenience and low condo fees this is the unit for you! For more information and pictures call 🏠 ☎️   show contact info","num_images":9.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T15:35:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rrenovated-bedroom-bath\/7490208842.html","post_id":7490208842,"result_date":"2022-05-30 16:18","title":"Rrenovated 2 bedroom 1 1\/2 bath with contemporary finishes throughout","description":"Welcome to 1621 S Newkirk Street!  Meticulously renovated 2 bedroom 1 1\/2 bath with contemporary finishes throughout.  First floor features an open floor plan with spacious living room, formal dining area, ultra modern kitchen with granite countertop, stainless steel appliances, and exit to private rear yard.  Second floor offers a large master bedroom with tons of natural light and sizable second bedroom.  Beautiful ceramic tile hall bath with shower sprayers.  Full finished basement with separate laundry area and full bath.  New windows and HVAC!  Excellent location! Twenty minutes to Center City.  Convenient to Lanier Dog Park, Greys Ferry Coffee, The Tasty Toast, Lids Cafe, and much more! 1621 S Newkirk St,  For more information and pictures call 🏠 ☎️   show contact info","num_images":8.0,"lat":39.9227,"lng":-75.1812,"attrs":"['2BR \/ 1.5Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T15:36:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apartment-for-rent\/7490220235.html","post_id":7490220235,"result_date":"2022-05-30 16:06","title":"apartment for rent","description":"One bedroom apartment on second floor of duplex, fully carpeted. large living room and bedroom with ceiling fan. Good size kitchen with refrigerator provided. . It is close to Broad and Olney, Einstein Hospital and public transportation if needed.  Tenant pays for gas and electricity. Total of three months required on signing lease. It is ready to move in once tenant is approved.  A good credit score would be helpful.","num_images":0.0,"lat":40.043038,"lng":-75.14171,"attrs":"['1BR \/ 1Ba', 'available jun 15', 'application fee details: 3 months on signing lease', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T16:02:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-fantastic-location\/7490199322.html","post_id":7490199322,"result_date":"2022-05-30 15:19","title":"Fantastic Location, Beautiful Amenities, Luxury Living","description":"Available: 8\/2\/22\nApt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T15:15:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-outdoor-grilling-stations\/7490197440.html","post_id":7490197440,"result_date":"2022-05-30 15:14","title":"Outdoor Grilling Stations, Leasing Now, Move In Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nSchedule a tour today at The Point at Downingtown. We'd love to help you explore our floorplans and let us help you find a new home that perfectly fits your style. Call now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, washer\/dryer, coat closet, built-in desk, walk-in closets, and a master suite!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1239ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T15:10:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-loft-like-1bdr\/7489982698.html","post_id":7489982698,"result_date":"2022-05-30 00:12","title":"Bright loft-like 1bdr. w private court yard","description":"Available August 15th  2022\nLarge bright \"loft-like\" one bedroom 2nd floor apartment in professor's home-separate entrance w courtyard.\nHardwood floors, high ceilings, central air\/heat, washer\/dryer, private backyard, shopping, eateries, parks, yoga studio within steps, trolley at corner\n$1650.00 (includes all utilities, high speed internet,  cable, netflix, washer\/dryer)\nSmall pet okay\nCall for an appointment  show contact info","num_images":13.0,"lat":39.947853,"lng":-75.216587,"attrs":"['1BR \/ 1Ba', '900ft2', 'available aug 15', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T00:08:23-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/voorhees-available-immediately-move\/7490355484.html","post_id":7490355484,"result_date":"2022-05-30 23:14","title":"Available immediately! Move right in to RAINWOOD development","description":"This house is The perfect combination of location, condition and price. Short distance to the Promenade and Voorhees Town Center with restaurants and shopping, easy access to the major roads & PATCO. Everything is redone and new: Gorgeous, spacious eat-it kitchen with top line, stainless still appliances, modern sparkle white quarts counter top and two tones cabinets. New Engineered wood floors throughout the house, new vanities and faucets in bathrooms and fresh paint. Open layout, a lot windows letting natural light in. Large Living room with bay window leads to Formal Dining room and to light and bright Family room with elevated ceilings and sliding doors to a large two-tier deck , and private fenced-in back yard.. Powder and laundry room will complete main level of this BEAUTY. Upper Level features: 3 spacious bedrooms, and 2 full bath. The Voorhees School District makes this development even more desirable. Don't delay!!","num_images":6.0,"lat":39.8504,"lng":-74.9646,"attrs":"['3BR \/ 2.5Ba', '1554ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T23:10:58-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/east-brunswick-bedroom-car-garage-patio\/7490342875.html","post_id":7490342875,"result_date":"2022-05-30 22:39","title":"3 Bedroom 2 Car Garage Patio Home East Brunswick $2500\/month","description":"3 bedroom Patio Home\nBriar Ridge Estates\nAvailable Now\nFree standing house with attached garage\n(next house Is attached to garage of this house)\n3 bedrooms\n3 bathrooms\n2 car Garage\n2 car parking in driveway\nFireplace\nUnfinished basement\nLocation : Buckthorn Road, 08816\n1 Year Lease\n","num_images":24.0,"lat":40.4284,"lng":-74.4064,"attrs":"['3BR \/ 2.5Ba', 'available now', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T22:12:34-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-br-bath-apartment-rental-green\/7490331523.html","post_id":7490331523,"result_date":"2022-05-30 21:30","title":"2 BR 2 Bath Apartment Rental -  Green Hollow Dr","description":"2 bedroom \/ 2 bathroom apartment for rent in beautiful green hollow village community, The entire apartment is very well kept with new paint, newer bathrooms, kitchen, most of the appliances are in newer or in great condition. wall to wall carpet floor. Bedroom has walk-in closet with built in shelves for organization. Pretty much every room has it's own closet\/storage. Two full big size bathrooms. Large living room with closet for storage and big balcony with a great private view. Apartment includes pretty much every appliance you may need like over the range microwave, washer, dryer, gas stove, new water heater, dishwasher and refrigerator. Recently insalled new energy efficient HVAC and water heater. Unit located in Iselin (Woodbridge township), great school district. Close to major highways, malls, and Metropark Train Station, the NJ Transit bus stop is right outside the community that loops to Metropark station, all day long. Easy commute to NYC. The community offers swimming pool, tennis court and children's play area. Rent is $2300 plus utilities. The deposit is 1.5 months of rent and lease of 1 year. Tenant responsible for all utilities like Water, Sewer, Gas, Electricity, Cable, Internet anything else that is not listed and personal utilities. text or email, to book an appointment. Available from June 06th, 2022. Flexible moving date.\nMust have a social security number with good credit\n","num_images":9.0,"lat":40.564967,"lng":-74.307393,"attrs":"['2BR \/ 2Ba', '1100ft2', 'available jun 6', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T21:26:00-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/somerville-home\/7490298257.html","post_id":7490298257,"result_date":"2022-05-30 20:14","title":"home","description":"Adorable and cozy two-bedroom, one bath home on private road in Oakley. Convenient to all interstates and ten minutes from downtown Asheville. All new siding, windows, doors, furnace, and paint. Every room offers an abundance of natural light. Hardwood floors, washer and dryer hookup, off-street parking area, large yard, and covered front porch.\nAddress : 15 Westview Ln, Asheville, NC 28803 Cellphone number :  show contact info\n2 bd1 ba650 sqft\nApplication fee : $50\nDeposit : $800\nMonthly : $1000\n","num_images":7.0,"lat":40.5941,"lng":-74.6734,"attrs":"['2BR \/ 1Ba', '650ft2', 'air conditioning', 'house', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T19:29:12-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/nottingham-country-home-on-vineyard\/7490301578.html","post_id":7490301578,"result_date":"2022-05-30 19:55","title":"Country home on a vineyard","description":"Enjoy country living on a vineyard! Beautiful views of the grapevines and sunsets. Two story house has galley kitchen, large dining room and large living room downstairs; upstairs has three rooms and one bathroom. Washer & dryer. Natural gas heat. Wrap around porch. Five minutes to route one bypass, 10 minutes to Oxford, 20 minutes to Kennett Square, 30 minutes to Newark, 40 to Wilmington and Lancaster. Lawn mowing and large snow removal included. No pets. Must have references.","num_images":11.0,"lat":39.779948,"lng":-76.035862,"attrs":"['2BR \/ 1Ba', '1400ft2', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T19:39:39-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/south-river-luxury-apartments-with-gym\/7490243668.html","post_id":7490243668,"result_date":"2022-05-30 18:06","title":"luxury apartments with gym and pool and more!","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21.0,"lat":40.457525,"lng":-74.394361,"attrs":"['1BR \/ 1Ba', '911ft2', 'available now', '\\ntuesday 2022-05-31\\n', '\\nwednesday 2022-06-01\\n', '\\nthursday 2022-06-02\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T16:58:36-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/south-river-luxury-apartments-pool-gym\/7490216616.html","post_id":7490216616,"result_date":"2022-05-30 17:52","title":"Luxury Apartments Pool, Gym and More","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21.0,"lat":40.457525,"lng":-74.394361,"attrs":"['1BR \/ 1Ba', '817ft2', 'available now', '\\ntuesday 2022-05-31\\n', '\\nwednesday 2022-06-01\\n', '\\nthursday 2022-06-02\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T15:54:44-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/rahway-apartment-for-rent-rahway-nj\/7490241589.html","post_id":7490241589,"result_date":"2022-05-30 16:57","title":"Apartment for rent ( Rahway NJ )","description":"Full two bedroom apartment with livingroom \/dinning room\/ full bathroom \/ large kitchen located in rahway nj withing 5 minute from the trian station and a couple of minutes from all  other stores. Also within minutes from the pre schools\/elementary and high schools.  GOING FOR $1825 A MONTH PLUS A MONTH AND A HALF SECURITY DEPOSIT.  It will be ready to move in by June 15th.  Please email if interested Please email or text","num_images":9.0,"lat":40.6087,"lng":-74.2819,"attrs":"['2BR \/ 1Ba', 'available jun 15', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T16:53:44-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/new-brunswick-luxury-br-1bath-with-d\/7490233307.html","post_id":7490233307,"result_date":"2022-05-30 16:46","title":"Luxury 1 BR\/1BATH with W\/D plus many more amenities","description":"Contact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIGHTS\n11 US-1, New Brunswick, NJ 08901>\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n… AND MORE!\nDESCRIPTION\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\nContact info:\nThe Edge at Raritan Heights\nEdgewood Properties\nshow contact info\nContact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIHTS\n11 US-1, New Brunswick, NJ 08901\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n…AND MORE!\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\n","num_images":14.0,"lat":40.4891,"lng":-74.4482,"attrs":"['1BR \/ 1Ba', '864ft2', 'available jul 10', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T16:33:31-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/new-brunswick-bedroom-bath-luxury\/7490231774.html","post_id":7490231774,"result_date":"2022-05-30 16:45","title":"1 BEDROOM 1 BATH LUXURY APARTMENT LOCATED NEAR RUTGERS UNIVERSITY","description":"Contact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIGHTS\n11 US-1, New Brunswick, NJ 08901>\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n… AND MORE!\nDESCRIPTION\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\nContact info:\nThe Edge at Raritan Heights\nEdgewood Properties\nshow contact info\nContact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIHTS\n11 US-1, New Brunswick, NJ 08901\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n…AND MORE!\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\n","num_images":14.0,"lat":40.4891,"lng":-74.4482,"attrs":"['1BR \/ 1Ba', '864ft2', 'available jul 10', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T16:30:00-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/atlantic-city-charlotte-2bdrm-fully\/7490218278.html","post_id":7490218278,"result_date":"2022-05-30 16:22","title":"CHARLOTTE 2bdrm fully furnished dog OK $2400","description":"Beautiful 2 bedroom, all private, fully furnished, fiber optic WI FI, util. included, dog friendly, $2400. Kitchen includes utensils and gadgets: microwave, toaster, toaster oven, coffee machine, electric kettle, and more.. Flexible terms, avail. mo. to mo., so perfect for those looking for a short term while looking for home or renovating and need a place.","num_images":0.0,"lat":39.3664,"lng":-74.4317,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T15:58:39-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-summertime-and-the-living\/7490198176.html","post_id":7490198176,"result_date":"2022-05-30 15:16","title":"Summertime and the living (here) is easy!","description":"Available: 8\/2\/22\nApt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T15:12:28-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/lumberton-townhouse-with-garage\/7490196123.html","post_id":7490196123,"result_date":"2022-05-30 15:12","title":"Townhouse with Garage","description":"This is a tastefully upgraded and professionally maintained townhouse.\nIt is spotless clean and ready for a new tenant.\nFeatures include spacious floor plan with a living room and formal dining area,\nwalk-in closets, central AC, 2nd floor laundry, an attached garage, plus plenty of outside parking.\nLocated in pristine Country Estates community of Lumberton,\njust minutes from Mount Holly and Cherry Hill within short drive to Philadelphia.\nAvailable now.\nCall  show contact info","num_images":17.0,"lat":39.9651,"lng":-74.8067,"attrs":"['3BR \/ 2.5Ba', 'available jun 30', 'air conditioning', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T15:08:03-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-beautifully-renovated-split\/7490169945.html","post_id":7490169945,"result_date":"2022-05-30 14:49","title":"Beautifully renovated split level home","description":"Beautifully renovated split level home in Cherry Hill East Point of Woods.  As you enter through the newly restored front entrance, you can relax and enjoy the nicely landscaped front yard.  This home offers naturally refinished hardwood floor though out the second floor, new kitchen with soft closed cabinets\/granite countertop\/stainless steel appliances, three new bathrooms, whole first floor has been tiled, new extra large deck with extra large rear yard compared to surrounding neighbors, new roof.........R-E_NT___2___0-WN BAD CR-ED-IT IS NO PROBLEAM . CALL US AT: show contact info\nPR0PERTY ID :-475321980","num_images":1.0,"lat":39.8805,"lng":-74.9706,"attrs":"['4BR \/ 3Ba', '2994ft2', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T14:12:03-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/east-texas-enjoy-bedrooms-and-25-baths\/7490167168.html","post_id":7490167168,"result_date":"2022-05-30 14:20","title":"Enjoy  3 bedrooms and 2.5 baths Townhouse in the Brookfield subdivisio","description":"please, Give me your phone number ...\nGreat rental in the East Penn School District! Located in the popular Brookfield subdivision, this home has 3 bedrooms and 2.5 baths. There's a family room area off the kitchen, along with a living room and dining room on the 1st floor. Enjoy your great backyard with deck, or the one car garage, and two off street parking spots. The home has been freshly painted and there is freshly shampooed carpeting throughout, newer dishwasher and stove. You'll love the convenience of the 2nd floor laundry!  Make your appointment today! Tenants responsible for all utilities, lawn care and snow removal. This unit doesn't have a basement.","num_images":21.0,"lat":40.5285,"lng":-75.5666,"attrs":"['3BR \/ 2.5Ba', '1657ft2', 'available now', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T14:06:27-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-luxurious-community-living\/7490171636.html","post_id":7490171636,"result_date":"2022-05-30 14:19","title":"Luxurious Community Living","description":"Resort like living with all the conveniences that you could ever ask for! Mere minutes from the train and The NJ turnpike, you'll find yourself right at home in this luxurious rental community. Minutes from Woodbridge mall, retail stores, Merrill park, downtown woodbridge,charming suburbs, and much much more!\nAmeneties include: Expansive Clubhouse with Fireplace and Lounge Seating,\nIdyllic Courtyard & Shared Garden, Resort Style Pool & Sundeck with Outdoor Grills & Bar, Fire pits, Juice bar, Co-working stations, in unit w\/d, Pet friendly, and more!\nText, call, or email Annie today for more details.  show contact info\n!","num_images":15.0,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T14:15:35-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-luxurious-community-living\/7490171508.html","post_id":7490171508,"result_date":"2022-05-30 14:19","title":"Luxurious Community Living","description":"Resort like living with all the conveniences that you could ever ask for! Mere minutes from the train and The NJ turnpike, you'll find yourself right at home in this luxurious rental community. Minutes from Woodbridge mall, retail stores, Merrill park, downtown woodbridge,charming suburbs, and much much more!\nAmeneties include: Expansive Clubhouse with Fireplace and Lounge Seating,\nIdyllic Courtyard & Shared Garden, Resort Style Pool & Sundeck with Outdoor Grills & Bar, Fire pits, Juice bar, Co-working stations, in unit w\/d, Pet friendly, and more!\nText, call, or email Annie today for more details.  show contact info\n!","num_images":15.0,"lat":40.556,"lng":-74.2845,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T14:15:20-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-luxury-living-in-the-heart\/7490171390.html","post_id":7490171390,"result_date":"2022-05-30 14:19","title":"Luxury living in the heart of Woodbridge","description":"NO BROKER FEE.\nUp to 2months free! make it your sanctuary now!! Downtown living in Woodbridge with tons of attractions just minutes away. Transit is nearby, NY is located less than 30 miles northeast of Woodbridge, making it an ideal location for commuters. Charming subarban town with tons of retail stores, Woodbridge mall, Merrill park and many more attractions.Rt1 , GSP, NJ Turnpike are just minutes away from this stunning building.\nAmenties include: Resort-style Pool & Landscaped Courtyard, Private BBQs & Outdoor Dining Area, Outdoor Fire Pit, Outdoor Screening Area, Resident Lounge with Fireplace, Bar & Lounge Seating, Billiards & Shuffleboard, State-of-the-art Fitness Center, Demonstration Kitchen, Full-size Laundry Rooms, Package Room with Smart Lock Entry, Bike Storage, Covered On-site Parking, 10,000 SF of On-site Retail, in unit W\/D, and much much more!\nTexcall\/email  Annie to schedule a showing today!!  show contact info\n(quratolain @awvwco.com)","num_images":18.0,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T14:15:05-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cape-may-beautiful-renovated-3bed\/7490159622.html","post_id":7490159622,"result_date":"2022-05-30 14:18","title":"Beautiful Renovated 3Bed Apartment Home Ready In June! Apply Today!","description":".....All with Central A\/C!!!\nTwin with roomy living room and freshly painted kitchen, sunroom, bathrooms and laundry room. The front deck is covered and spacious enough for all guests. There are one and a half bathrooms along with an outdoor shower. The property has a nice fenced in backyard with brick pavers, a large picnic table with an umbrella, gas grill and a small covered back porch. There are also two eating areas inside the house for your convenience. The third bedroom\/sunroom has sliding barn doors off of the kitchen with a queen size sofa bed and sliders to the back porch. The laundry room includes a full size washer and dryer. We will be happy to recommend a service for linens and towels, if needed, as we do not supply them.\nIf you need anything additional or have question please let me know:  show contact info\nHosted by Virginia DeYoung: show contact info","num_images":9.0,"lat":38.944434,"lng":-74.908227,"attrs":"['3BR \/ 2Ba', '1112ft2', 'available now', 'application fee details: N\/A', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T13:50:54-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-luxury-living-in-the-heart\/7490171289.html","post_id":7490171289,"result_date":"2022-05-30 14:18","title":"Luxury living in the heart of Woodbridge","description":"NO BROKER FEE.\nUp to 2months free! make it your sanctuary now!! Downtown living in Woodbridge with tons of attractions just minutes away. Transit is nearby, NY is located less than 30 miles northeast of Woodbridge, making it an ideal location for commuters. Charming subarban town with tons of retail stores, Woodbridge mall, Merrill park and many more attractions.Rt1 , GSP, NJ Turnpike are just minutes away from this stunning building.\nAmenties include: Resort-style Pool & Landscaped Courtyard, Private BBQs & Outdoor Dining Area, Outdoor Fire Pit, Outdoor Screening Area, Resident Lounge with Fireplace, Bar & Lounge Seating, Billiards & Shuffleboard, State-of-the-art Fitness Center, Demonstration Kitchen, Full-size Laundry Rooms, Package Room with Smart Lock Entry, Bike Storage, Covered On-site Parking, 10,000 SF of On-site Retail, in unit W\/D, and much much more!\nTexcall\/email  Annie to schedule a showing today!!  show contact info\n(quratolain @awvwco.com)","num_images":18.0,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T14:14:52-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-this-bedroom-bath-home\/7490153666.html","post_id":7490153666,"result_date":"2022-05-30 14:14","title":"This 3 bedroom, 2 bath home features hardwood floors on the first floo","description":"Brick twin inLittle Lehigh Manor, available for immediate occupancy. This 3 bedroom, 2 bath home features hardwood floors on the first floor, first floor bathroom with stand up shower, family room addition, updated kitchen, newer carpeting on the 2nd floor and a one car garage. Good credit, clean background required.","num_images":17.0,"lat":40.5891,"lng":-75.4645,"attrs":"['3BR \/ 2Ba', '1368ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T13:38:36-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/old-bridge-convenient-location-and\/7490167926.html","post_id":7490167926,"result_date":"2022-05-30 14:11","title":"Convenient location and luxury living in Old Bridge","description":"No broker fee..LEASING SPECIALS · 1 Month free on 13 month leases · 2 Months free on 26 month leases · $1000 Credit on 1st floor apartments · $1000 Credit on 1 bedrooms.\nLocated in a convenient location. Tons of retail stores, restaurants, shopping malls are just a 10 minutes drive away.\nAmenities include, in unit w\/d, 9’ ceilings, huge closet space, private outdoor space, stainless steel appliances, on-site parking, bbq places and fire pits, outside pool and so much more!\nPlease call\/text\/email Annie to schedule a showing.  show contact info\n.\n","num_images":4.0,"lat":40.398,"lng":-74.3236,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T14:07:57-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-bedroom-apartment-on-1st\/7490152011.html","post_id":7490152011,"result_date":"2022-05-30 14:03","title":"1 Bedroom apartment on a 1st floor level available for rent.","description":"Completely renovated 1 Bedroom apartment on a 1st floor level available for rent. This unit comes with a new Kitchen, new Bathroom, granite counter tops, new flooring and new painting. Walking distance of all amenities, public transportation local shopping, dining, downtown Hamilton St and PPL Center. Schedule a tour today!","num_images":6.0,"lat":40.6068,"lng":-75.4781,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T13:35:19-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-second-floor-renovated\/7490142903.html","post_id":7490142903,"result_date":"2022-05-30 14:02","title":"Second Floor\/\/Renovated 2 bedroom, 1.5 bath apartment\/\/FOR RENT","description":"Renovated 2 bedroom, 1.5 bath apartment located on the second floor of a multi-family apartment building. Features include a renovated kitchen with stainless appliances and granite counter-tops, finished hardwood floors, and central a\/c. The main bedroom is attached by an extra room that can be used as an office or large closet. There is a shared laundry room and heat, hot water, trash, and water\/sewer are included in the rent price.","num_images":1.0,"lat":39.760217,"lng":-75.522889,"attrs":"['2BR \/ 1.5Ba', 'available jul 1', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T13:17:18-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/easton-2-double-for-rent\/7490162515.html","post_id":7490162515,"result_date":"2022-05-30 14:00","title":"1\/2 DOUBLE FOR RENT","description":"3 bedroom, 1 bath 1\/2 double for rent at 2011 Ferry Street, Easton, PA. Property is behind St. Luke’s hospital. No animals. Bad credit need not apply. 2 months security deposit.\n$1,450 per month rent. Tenant pays all utility bills.\nCall or text Jerry at  show contact info\n.\n","num_images":0.0,"lat":40.688578,"lng":-75.241122,"attrs":"['3BR \/ 1Ba', 'available jun 15', 'duplex', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T13:56:58-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cape-may-bed-bath-washer-dryer-included\/7490153659.html","post_id":7490153659,"result_date":"2022-05-30 13:51","title":"3 Bed\/ 2 Bath Washer & Dryer Included, & Free Parking!!","description":".....All with Central A\/C!!!\nTwin with roomy living room and freshly painted kitchen, sunroom, bathrooms and laundry room. The front deck is covered and spacious enough for all guests. There are one and a half bathrooms along with an outdoor shower. The property has a nice fenced in backyard with brick pavers, a large picnic table with an umbrella, gas grill and a small covered back porch. There are also two eating areas inside the house for your convenience. The third bedroom\/sunroom has sliding barn doors off of the kitchen with a queen size sofa bed and sliders to the back porch. The laundry room includes a full size washer and dryer. We will be happy to recommend a service for linens and towels, if needed, as we do not supply them.\nIf you need anything additional or have question please let me know:  show contact info\nHosted by Virginia DeYoung: show contact info","num_images":11.0,"lat":38.944434,"lng":-74.908227,"attrs":"['3BR \/ 2Ba', '1112ft2', 'application fee details: N\/A', 'cats are OK - purrr', 'furnished', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T13:38:35-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/elizabethtown-studio-one-bedroom\/7490153829.html","post_id":7490153829,"result_date":"2022-05-30 13:42","title":"Studio \/ one bedroom Apartment","description":"Well thought-out, comfortable space, full 5x10 bath, 10x12 living room, 5x6 kitchen, sleeping loft, 6x15 covered porch, two closets\nNext to beautiful Elizabethtown Park and walking trails\noff-street parking provided\ncoin laundry in basement\nApartment has covered porch, private entrance on the first floor (street level),\nCorner of S Market St and College Ave\ntwo (2) blocks from downtown, Etown College, downtown restaurants, breweries, library\nShort walk to Amtrac on dedicated walkway\none block to Dove, M&;M Mars\none year lease required, application fee $35 per adult includes background check, credit and employment verification\n$625 security deposit plus first months rent full or prorated by date on move in.\n20 minute drive to Harrisburg, Lancaster, Hershey or York\nStudent housing\n","num_images":7.0,"lat":40.147094,"lng":-76.602881,"attrs":"['1BR \/ 1Ba', 'available jun 15', 'application fee details: $35 per adult', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T13:38:58-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/metuchen-stay-with-edison-this-summer\/7490152973.html","post_id":7490152973,"result_date":"2022-05-30 13:41","title":"Stay with Edison this Summer","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Or Hotel is 100% non-smoking!Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryIn-Room AmenitiesFully Equipped KitchensElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 1 Fieldcrest Ave., Edison, NJ 08837","num_images":6.0,"lat":40.5325,"lng":-74.3375,"attrs":"['1BR \/ 1Ba', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T13:37:18-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-riddle-ave-furnished-fully\/7490145286.html","post_id":7490145286,"result_date":"2022-05-30 13:35","title":"Riddle Ave\/\/Furnished fully-updated 2 bedroom house near UD Campus!!","description":"Furnished fully-updated 1905 House (twin) with backyard and deck on the Brandywine River and with interior mid-century vibe and exterior Victorian charm. Amenities include fireplace, central air and heat, 2 baths, 2 bedrooms (one now used as office and art studio on second floor and basement guest bedroom (with egress window). Combo front door lock. Internet and Cable TV included. Nice gardens front and back. 1 Parking spot always available out front. A few minutes walk to Trolley Square, Delaware Art Museum, and the Brandywine State Park. Wonderful running and biking right from home. House is super convenient to 95 (3 minutes drive) - 20 minutes to UD campus and 35 minutes to Philly with all the great art and culture that city has to offer, with ease of living here in Wilmington.","num_images":5.0,"lat":39.76418,"lng":-75.558859,"attrs":"['2BR \/ 2Ba', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T13:22:05-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-playground-cable-hookup\/7490146851.html","post_id":7490146851,"result_date":"2022-05-30 13:29","title":"Playground, Cable Hookup, Fitness Center","description":"Bedrooms: 2Bathrooms: 1Square Feet: 950Date Available: 2022-05-31Address: 2049 Barnsboro RoadWe are located in Blackwood New Jersey and close to the Philadelphia area. We offer spacious one and two bedroom apartment floor plans to choose from so you can find your perfect home for your family. Another great reason to live at Washington Way apartments is that each apartment has its own  balcony or patio overlooking our beautiful park like views.At Washington Way Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails. Our community enjoys hosting seasonal resident events for our residents with extended pool hours and DJ, food and raffles for a great way to meet your neighbors.At Washington Way Apartments consider our great location in Blackwood, NJ. Located in the top ten Washington Township School District, Your children enjoy a top rated education being one of the best school districts in the state. Our residents enjoy the convenient access to Routes I-295, and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Sicklerville, Deptford, and Turnersville, and the new Outlet Mall that just opened locally. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Washington Way Apartments today. Amenities Include:Air ConditionerDishwasherSmall Pets WelcomeCable HookupClubhousePatio’s or BalconiesFitness CenterSwimming PoolGas HeatCeiling FansDisposal24 Emergency ServiceCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/3qhq65wm\/washington-way*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.7901,"lng":-75.0367,"attrs":"['2BR \/ 1Ba', '950ft2', 'available now', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T13:25:10-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-courtyard-24-emergency\/7490138346.html","post_id":7490138346,"result_date":"2022-05-30 13:12","title":"Courtyard, 24 Emergency Service, Air Conditioner","description":"We are located in Blackwood New Jersey and close to the Philadelphia area. We offer spacious one and two bedroom apartment floor plans to choose from so you can find your perfect home for your family. Another great reason to live at Washington Way apartments is that each apartment has its own  balcony or patio overlooking our beautiful park like views.At Washington Way Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails. Our community enjoys hosting seasonal resident events for our residents with extended pool hours and DJ, food and raffles for a great way to meet your neighbors.At Washington Way Apartments consider our great location in Blackwood, NJ. Located in the top ten Washington Township School District, Your children enjoy a top rated education being one of the best school districts in the state. Our residents enjoy the convenient access to Routes I-295, and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Sicklerville, Deptford, and Turnersville, and the new Outlet Mall that just opened locally. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Washington Way Apartments today.\n-Cable Hookup\n-Ceiling Fans\n-Disposal\n-24 Emergency Service\n-Fitness Center\n-Clubhouse\n-Dishwasher\n-Gas Heat\n-Air Conditioner\n-Small Pets Welcome\n-Swimming Pool\n-Courtyard\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/alx5x2ud\/washington-way\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.7901,"lng":-75.0367,"attrs":"['1BR \/ 1Ba', '765ft2', 'available jul 7', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T13:08:00-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/lumberton-flexible-deposit-semi-private\/7490133072.html","post_id":7490133072,"result_date":"2022-05-30 13:01","title":"Flexible deposit, Semi Private Entrance, Affordable Deposit","description":"Bedrooms: 1Bathrooms: 1Square Feet: 650Date Available: 2022-05-30Address: 760 Eayrestown RoadWe offer great apartments in the Philadelphia South Jersey area. We offer spacious floor plans of one and two bedroom rental homes to choose from to find your perfect home with flexible lease terms. Select apartments offer a private entrance, upgraded kitchens with stainless steel appliances with dishwasher, and premium cabinets. Select apartments offer a patio. Private luxury with community living and a variety of amenities are included in your rent. Live where you can relax and enjoy our swimming pool, playground and picnic area.\nOur residents enjoy the convenience of bus service in walking distance, as well convenient access to Routes I-295, 95,and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Deptford and Turnersville. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!\nWe take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access. Amenities Include:Picnic AreaPatioPublic TransportationPoolPlaygroundAir ConditioningGas HeatOversized ClosetsRefrigeratorCourtyardBlindsPaid UtilitiesCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/l7zpngee\/whitehall-apartments*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":6.0,"lat":39.9651,"lng":-74.8067,"attrs":"['1BR \/ 1Ba', '650ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T12:57:43-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-spacious-and-beautifully\/7490107323.html","post_id":7490107323,"result_date":"2022-05-30 12:08","title":"Spacious and Beautifully Furnished Corporate Suite","description":"Available: 7\/12\/22\nApt. 2402 — Westminster floor plan — 1,462 sq. ft. — $5,857\nThis luxurious 4th floor, 2 bedroom\/2 bathroom fully-furnished corporate suite is available for short-term lease! This apartment boasts hardwood LVT flooring throughout the living area with plush carpeting in the bedrooms only, an open-concept living area, ample storage space, upgraded stainless steel appliances, and a private balcony just outside the living room. This beautiful apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more! Utilities included!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1462ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T12:04:00-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-move-in-ready-1bed-bath-home-in\/7490086605.html","post_id":7490086605,"result_date":"2022-05-30 11:54","title":"MOVE IN READY 1bed, 1 bath home in Newark, DE!!","description":"Welcome To Apartments At Pine Brook! This lovely 1 bed, 1 bath with all updated amenities. Find Your Comfort in Our Newark, Delaware Apartment Homes. DONT MISS OUT ON THIS AMAZING HOME.","num_images":3.0,"lat":39.7011,"lng":-75.7375,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T11:18:26-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lititz-lititz-rothsville-bedroom\/7490097407.html","post_id":7490097407,"result_date":"2022-05-30 11:52","title":"Lititz\/Rothsville 3 Bedroom Farmhouse Apartment","description":"Two story apartment located between Rothsville and Lititz in beautiful picturesque farmland. Freshly cleaned and painted unit contains an eat-in kitchen with refrigerator and stove included, living room\/family room, dining room\/office, laundry room with storage, 3 bedrooms, 1 bath, washer and dryer hookup, and detached garage. Water, sewer, and trash service is included in the rent. Call for more information. No Pets.","num_images":10.0,"lat":40.1846,"lng":-76.3015,"attrs":"['3BR \/ 1Ba', 'available jun 1', 'duplex', 'w\/d hookups', 'no smoking', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-30T11:42:41-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-parking-private-entrances\/7490093053.html","post_id":7490093053,"result_date":"2022-05-30 11:37","title":"Parking, Private Entrances, Ceiling Fan","description":"Work, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes.\n-Cable Hookup\n-Private Entrances\n-Parking\n-Pool\n-Air Conditioning\n-Playground\n-Public Transportation\n-W\/W Carpeting\n-Dishwasher\n-Large Floor Plans\n-Pets Welcome\n-Gas & Heat Included\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/a2fiksaa\/laurelton-village\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":7.0,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T11:33:03-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/easton-renovated-spacious-bed-bath-apt\/7490086797.html","post_id":7490086797,"result_date":"2022-05-30 11:22","title":"Renovated, Spacious 3 bed, 2 Bath Apt (Sec 8 ok)","description":"Washington St, Easton, PA  18042$1595.00 \/ Month---------------------------Interested in this property?Reply to this listing for more information.---------------------------Property Details:3 BEDROOMS | 2 BATHROOMSCompletely renovated spacious apartment with good size 3 bedrooms and 2 full bathrooms. All new flooring, professionally painted, new fixtures, new oven range, led lights etc. Apartment covers entire of second and third floor.\nIt is well lighted and is private. Close to shops, public transport etc.\nTenant responsible for electric and water. Owner pays for sewer and trash.\nWill accept Section 8. No pets, clear background. Thorough background and tenancy check.\nPlease do NOT call, only text for call back.***No Pets Allowed***Property Type: ApartmentLease Terms:$1595.00\/Month$2000.00 DepositLease Length: One YearAvailable:06\/22\/2022Unit Amenities:Refrigerator Microwave OvenBuilding Amenities:---------------------------Interested in this property?Reply to this listing for more information.\n","num_images":20.0,"lat":40.6516,"lng":-75.224,"attrs":"['3BR \/ 2Ba', '1500ft2', 'available jun 22', 'apartment', 'w\/d hookups', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T11:18:52-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/camden-freshly-painted-2br-15-bath\/7490076800.html","post_id":7490076800,"result_date":"2022-05-30 11:21","title":"Freshly painted 2BR, 1.5 Bath","description":"This mixed used property is in the heart of the Downtown Camden District. Just steps away from Rutgers, Leap Academy, City Hall and the waterfront. The 2nd & 3rd Floors is a 2BR, 1.5 Bath residential Apartment, freshly painted and in move-in condition, with views of the Philadelphia Skyline from the 3rd Floor!! The building offers separate utilities (Gas & Electric).","num_images":10.0,"lat":39.945414,"lng":-75.119441,"attrs":"['2BR \/ 1.5Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T10:56:34-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/millville-bed-apartment-in-millville-nj\/7490075593.html","post_id":7490075593,"result_date":"2022-05-30 10:57","title":"$900, 1 bed apartment in Millville, NJ","description":"One Bedroom Apartment FOR RENT in Millville, NJ $900 - Welcome to 519 E Broad St Unit A! This cozy one bedroom apartment has a secured front door entrance and off street parking. As you enter through the front door, you will find the open concept living room, kitchen and dining area. There is plenty of natural light, fresh paint and hard wood floors. There is a large closet in the living room for extra storage also. The bedroom is located at the back of the unit and also has outside access to the parking area. The full bath is located off the bedroom and there is also a large walk in closet for storage in the bedroom. There are appliances in the unit but they will convey to the tenant As-Is. Any repair or replacement is the responsibility of the tenant. Tenant pays all utilities . All applicants must complete an online application and background check (cost is $100 and is refundable), including providing two months of proof of income. There are a few repairs still required and then the city will inspect. Unit will be available by June 2nd.","num_images":7.0,"lat":39.4023,"lng":-75.0326,"attrs":"['1BR \/ 1Ba', 'available jun 2', 'air conditioning', 'application fee details: $100 and refundable', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T10:53:34-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/newark-large-bedroom-in-north-newark\/7490064913.html","post_id":7490064913,"result_date":"2022-05-30 10:30","title":"Large 2 bedroom in North Newark","description":"Beautiful 2 bedroom apartment located in North Newark. Great for commuters just 3 blocks to the Newark light rail station (Branch Brook Park station).\n-heat and hot water included\n-no realtor fee, no application fee\n-brand new appliances\n-2 large bedrooms\nAddress: 329 Park avenue Newark NJ 07107\nAsking: $1,575 per month\nRequirements: first month rent, one month security deposit ($3,150) to move in\nQualifications: pay stubs showing $3,200 monthly after taxes\nContact James:  show contact info\n(please text) or apply online for free and get pre approved @\nwww.SJHrealty.com\n","num_images":21.0,"lat":40.7607,"lng":-74.1882,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T10:26:25-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-where-luxury-meets\/7490058970.html","post_id":7490058970,"result_date":"2022-05-30 10:14","title":"Where Luxury Meets Convenience","description":"Available: 8\/2\/22\nApt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T10:10:56-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-cable-hookup-dishwasher\/7490047381.html","post_id":7490047381,"result_date":"2022-05-30 09:43","title":"Cable Hookup, Dishwasher, Pool","description":"601 North Black Horse Pike, Monroe Township, NJ 08094Work, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes.Apartment Features:PoolDishwasherPublic TransportationDW\/Garbage DisposalW\/W CarpetingCable HookupPlaygroundGas & Heat IncludedCeiling FanParkingPets WelcomeLaundry FacilitiesAir ConditioningPrivate EntrancesLarge Floor PlansCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/zt2on2yj\/laurelton-village*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!","num_images":7.0,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T09:39:54-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/newark-large-bedroom-in-newark\/7490043087.html","post_id":7490043087,"result_date":"2022-05-30 09:30","title":"Large 1 bedroom in Newark","description":"Beautiful 1 bedroom apartment located in Newark (near Weequahic Park). This apartment has been updated.\n-heat and hot water included\n-no realtor fee, no application fee\n-parking lot\n-brand new appliances\nAddress: 103 Chancellor avenue Newark NJ 07112\nAsking: $1,400 per month\nRequirements: first month rent, one month security deposit ($2,800) to move in\nQualifications: pay stubs showing $2,900 monthly after taxes\nContact James:  show contact info\n(please text) or apply online for free and get pre approved @\nwww.SJHrealty.com\n","num_images":20.0,"lat":40.7107,"lng":-74.2131,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T09:26:11-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-2bd-1bth-almost-932sq-ft-for\/7490034000.html","post_id":7490034000,"result_date":"2022-05-30 09:20","title":"2bd\/1bth Almost 932sq\/ft For Rent In Delaware Ave","description":"This home has everything you are looking for. Located In 1303 Delaware Ave, Wilmington, DE\n1 bay garage, detached 17' X 15' shop, 2bd\/1bth almost 932sq\/ft rancher situated on a large . This home is perfect for an established family, or young family of outdoor enthusiasts.\nCurrently taking in applications as the home won't be vacant until July 2nd, application form and references required. Please give a detailed description of yourself and any other that will be renting with you.\nAvailable starting from July 15, 2022.\nThe rent is $549.00 + utilities per month.\n6 and 12 month term minimum. Long term preferred.\nCredit check required.\nEmployment verification required.\nIncome verification required.\nOption to have a garden.\nMust be willing to maintain yard.\nNo smoking (cigarettes, weed, vaping) or drug use on the property.\nPets considered at my discretion with pet deposit.\n","num_images":1.0,"lat":39.7571,"lng":-75.5635,"attrs":"['2BR \/ 1Ba', '932ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T08:55:21-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-1br-studio-apartments-pet\/7490031114.html","post_id":7490031114,"result_date":"2022-05-30 08:47","title":"1br-Studio Apartments, Pet friendly, Monthly rates available","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 3050 Schoenersville Rd., Bethlehem, PA 18017","num_images":3.0,"lat":40.651919,"lng":-75.412778,"attrs":"['0BR \/ 1Ba', 'available now', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T08:43:39-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/milford-502b-nw-front-street-milford\/7490029277.html","post_id":7490029277,"result_date":"2022-05-30 08:39","title":"502B NW Front Street, Milford. 1 bedroom\/1 bath apartment in historic home!!","description":"Two story unit with small kitchen and living downstairs and bath and bedroom upstairs. Recently renovated to have new flooring, cabinets, appliances (including new washer\/dryer), fixtures, paint, heat, etc. text landlord  show contact info\nSeparate entrances and utilities for all 4 units. Email to request application\/info, and we will schedule showings for qualified applicants. No pets and no smokers, please. Background and credit check required before lease signing. Best for 1 person only, 1 parking space provided.","num_images":5.0,"lat":38.944,"lng":-75.398,"attrs":"['1BR \/ 1Ba', '600ft2', 'available now', '\\nmonday 2022-05-30\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T08:35:46-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/milford-502b-nw-front-street-milford\/7490027972.html","post_id":7490027972,"result_date":"2022-05-30 08:34","title":"502B NW Front Street, Milford. 1 bedroom\/1 bath apartment in historic home!!","description":"Two story unit with small kitchen and living downstairs and bath and bedroom upstairs. Recently renovated to have new flooring, cabinets, appliances (including new washer\/dryer), fixtures, paint, heat, etc. text landlord  show contact info\nSeparate entrances and utilities for all 4 units. Email to request application\/info, and we will schedule showings for qualified applicants. No pets and no smokers, please. Background and credit check required before lease signing. Best for 1 person only, 1 parking space provided.","num_images":5.0,"lat":38.944,"lng":-75.398,"attrs":"['1BR \/ 1Ba', '600ft2', 'available now', '\\nmonday 2022-05-30\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T08:30:26-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-gas-heat-included-ceiling\/7490027631.html","post_id":7490027631,"result_date":"2022-05-30 08:33","title":"Gas & Heat Included, Ceiling Fan, Public Transportation","description":"Work, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes.\n-Public Transportation\n-Laundry Facilities\n-Parking\n-W\/W Carpeting\n-Pets Welcome\n-Playground\n-Private Entrances\n-Large Floor Plans\n-Ceiling Fan\n-Dishwasher\n-Gas & Heat Included\n-Air Conditioning\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/e62m6h3u\/laurelton-village\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":7.0,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T08:29:10-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/cliffwood-one-bedroom-apartment-located\/7490017995.html","post_id":7490017995,"result_date":"2022-05-30 08:13","title":"One bedroom apartment located on 2nd floor","description":"One Bedroom available for mid August\nApartment is located on the 2nd floor and has carpet flooring.\nThe apartment has washer\/dryer\/dishwasher\/microwave in the unit.\nA\/C in unit as well.\n","num_images":4.0,"lat":40.427482,"lng":-74.240871,"attrs":"['1BR \/ 1Ba', 'available aug 12', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T07:38:25-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/ephrata-nice-bedroom-apt-great-location\/7490016481.html","post_id":7490016481,"result_date":"2022-05-30 07:32","title":"Nice 1 bedroom Apt great location","description":"Nice 1 bedroom apartment on second floor with private entrance.  Full kitchen, living room, bedroom, and large bathroom.\nTenant paid electric baseboard heat paid to Ephrata Boro so account needs opened with them.  Water, sewer, and trash included.\nLooking for qualified tenants with references.  No prior evictions.\n","num_images":4.0,"lat":40.182546,"lng":-76.174457,"attrs":"['1BR \/ 1Ba', '500ft2', 'available jun 6', 'application fee details: $25.00', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T07:28:39-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-nice-3br-twin-in-south\/7490011897.html","post_id":7490011897,"result_date":"2022-05-30 07:16","title":"Nice 3BR Twin in South Bethlehem ,to Steels tax, Casino, and Route 78","description":"Serious inquiries should text the number provided :   show contact info\n3 BR Twin in South Bethlehem convenient to Steels tax, Casino, and Route 78. Laminate floors throughout with gas heat, and bonus room in attic that can easily become a fourth bedroom. Nice back yard for garden. Furnace is very new. This one will not last!","num_images":1.0,"lat":40.6693,"lng":-75.3349,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T06:51:02-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-3127-essex-rd-allentown-pa\/7490005138.html","post_id":7490005138,"result_date":"2022-05-30 05:22","title":"3127 Essex Rd Allentown, PA","description":"his home is situated on a corner lot in a cul-de-sac. Nicely sized living room with abundant natural sunlight, Dining room for family gatherings and an Eat-in kitchen on the main level. Upstairs are 3 bedrooms all with hardwood floors and the main bath. You'll enjoy the finished lower level with recessed lighting, bar area, access to the covered patio and fenced yard. There is also a powder room and laundry area with another door to the yard. Great location, min to Rt. 78, shopping and just a few steps from the rear of the Elem\/Middle schools.\ntxt  show contact info","num_images":0.0,"lat":40.56227,"lng":-75.501438,"attrs":"['3BR \/ 2Ba', '1440ft2', 'available now', '\\ntuesday 2022-05-31\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T05:06:23-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/pennsauken-4406-camden-ave-pennsauken\/7490001097.html","post_id":7490001097,"result_date":"2022-05-30 04:51","title":"4406 Camden Ave, Pennsauken, NJ 08110","description":"2 bd1 ba-- sqft\n4406 Camden Ave, Pennsauken, NJ 08110\nApartment for rent\nSpacious and newly renovated 2 bedroom 1 bath apartment for rent. Washer and dryer hookup included. Parking included. Secured buzz-in entrance. $1475 plus gas and electric. 1.5 month security deposit plus first months rent to move in. .\n1 year lease.\n","num_images":1.0,"lat":39.9723,"lng":-75.0607,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T03:43:38-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/ventnor-city-apartment-for-rent-in\/7489986231.html","post_id":7489986231,"result_date":"2022-05-30 00:39","title":"Apartment for rent in beautiful Ventnor City","description":"This apartment is in a residential zone ONLY 1 BLOCK FROM THE BEACH. Completely Renovated Down to The Studs! Everything Brand New and Upgraded!\nIt has:\n4 bedrooms\n3 baths\nCentral Air\nWiFi\nCable\nWasher and Dryer\nAvailable:\nJune 1st to 23rd - $2,000 per week or $6,000 for the 3 weeks\nJuly - $3,500 per week or $12,000 per month\nAugust - $4,000 per week or $15,000 per month\nPLEASE CONTACT MARIA AT THE PHONE NUMBER GIVEN.","num_images":23.0,"lat":39.333969,"lng":-74.487003,"attrs":"['4BR \/ 3Ba', 'available jun 1', 'air conditioning', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: weekly']","posted_date":"2022-05-30T00:35:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-mail-room-lease-today\/7490196806.html","post_id":7490196806,"result_date":"2022-05-30 15:13","title":"Mail Room, Lease Today, Professionally Managed","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, Den, washer\/dryer, walk-in closet, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\n[#9242954]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '879ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T15:09:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wonderfully-appointed-top\/7490194556.html","post_id":7490194556,"result_date":"2022-05-30 15:08","title":"Wonderfully appointed top floor studio apt with free heat in Logan Sq!","description":"156 N 21st St unit 3R (4) – Available June 1\nFantastic location in the Logan Square section of the city just south of the Art Museum area and just north of Center city. Convenient walking distance to Whole Foods, Trader Joes, all of the World Famous local Museums, Fairmount Park, Schuylkill River Trail, highways, public transit, convenience stores and more. This location really has it all.\nThis excellent studio apt encompasses comfortable living with the perks of city living. The kitchen features a tile floor, ceiling fan, gas stove, full sized refrigerator with plenty of cabinet and countertop space. A three-piece bathroom with tub, toilet and vanity, also featuring tile floor.\nYour bedroom is spacious with bay windows bringing in plenty of natural sunlight. With ample closet space, you have plenty of room to set up comfortably. Enjoy a cool breeze with a ceiling fan in your bedroom as well.\nHEATING INCLUDED IN YOUR RENT! CALL TODAY TO BOOK YOUR SHOWING!\n– gas stove\n-ceiling fan\n-free heat\n-laundry on site\n-great natural light!\n-and MORE!\n","num_images":8.0,"lat":39.956761,"lng":-75.17444,"attrs":"['0BR \/ 1Ba', 'available jun 1', 'cats are OK - purrr', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T15:04:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-at-its-best-brand\/7490194538.html","post_id":7490194538,"result_date":"2022-05-30 15:08","title":"Luxury at its best! Brand new Brewerytown 3 bed 3 ba apt + roof deck!","description":"3108 Clifford St #2 - Immaculate 3 bed 3 bath bi-level apt with wonderful rooftop deck, W\/D, C\/A & more!\nBasking in the shimmer of natural lighting, this expansive contemporary 3 bed 3 bath bi-level apt with impeccable amenities on the outskirts of Brewerytown is the perfect opportunity to upgrade your lifestyle! Walk up into an open floor plan with hardwood flooring, delighted by a ton of natural lighting the living room and kitchen sit in synchronicity whilst a balcony sits off to the side beyond sliding glass doors. The beautifully appointed kitchen impresses with with quartz countertops, sleek white cabinetry, a breakfast bar and stainless-steel appliances including: a refrigerator, microwave, gas stove, dishwasher--which create an ideal setting for meal preparation. Just beyond the kitchen is the laundry room with an incredible stacked washer dryer combo. A full bathroom with a bathtub sits next to the first generously spacious bedroom at the front of the unit.\nTwo super spacious bedrooms sit on opposite ends of the second level, each with closets, ample natural light and more than enough space to fit a king sized bed and then some. The rear bedroom is connected to an incredible ensuite bathroom with an illuminated LED mirror and bathtub. The third full bathroom sits next to the front bedroom. And up another flight of stairs behind door number 3, is an incredible opportunity where you can watch the sunrise over the skyline or r gaze at the starlit night from your very own private & totally expansive rooftop deck.\nFeatures:\nVery spacious bedrooms\nCentral Air\/Heat\nWasher & Dryer\nBalcony\nRooftop deck\nHardwood flooring\nNew building\nThis is a truly remarkable apartment, come check it out!\n","num_images":23.0,"lat":39.982953,"lng":-75.184969,"attrs":"['3BR \/ 3Ba', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T15:04:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-art-museum-bed-ba-apt-with\/7490194476.html","post_id":7490194476,"result_date":"2022-05-30 15:08","title":"Art Museum 2 bed 1 ba apt with incredible deck, laundry onsite & more!","description":"1936 W. Girard Ave #3 – Available NOW\nThis is IT!! The apartment you have been looking for!! Unbelievable opportunity to live in a wonderful period authentic building with unbelievable finishes. Original woodwork throughout, amazingly tall ceilings, beautiful original hardwood floors, incredibly spacious rooms, extremely large windows, super dense noise resistant walls, and the idea of living like royalty.\nThis is one of those buildings you feel happy to come home to everyday. This apartment will make you feel better about yourself and the decisions you have made.\n2 Bedroom split level apartment in a great location. Spacious rooms, tall ceilings and great natural light all day long.\nLaundry on site, shared in basement.\nEmail today to schedule your showing.\n","num_images":15.0,"lat":39.972493,"lng":-75.167421,"attrs":"['2BR \/ 1Ba', 'available jun 1', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T15:04:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-upenn-area-bed-bath-apt\/7490194415.html","post_id":7490194415,"result_date":"2022-05-30 15:08","title":"UPENN area 2 bed 1 bath apt w\/free heat, open layout & historic charm!","description":"4024 Spruce St unit 6 – Available starting June 1\nGreat location in the heart of UPENN where all the students are living. Close to Campus, public transportation, South Street and much more.\nSpacious 2 bed 1 bath apartment in a great location. Hardwood floors, central heat and good natural sunlight. Walking distance to campus\nWasher Dryer in the building!\nApartment Features include:\nHardwood floors\nCentral heat\nTall ceilings\nSpacious rooms\nFull size gas stove\nLaundry on site\nGreat natural light\nContact Bryan today through www.rentals215.com to find out more and schedule your showing.\n","num_images":11.0,"lat":39.95032,"lng":-75.191689,"attrs":"['2BR \/ 1Ba', 'available jun 1', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T15:04:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/sellersville-beautiful-two-bedroom\/7490190356.html","post_id":7490190356,"result_date":"2022-05-30 14:59","title":"Beautiful two bedroom apartment with finished basement","description":"This beautiful two bedroom apartment includes a lot of upgrades. The upgrades are crown molding in the Living Room, Ceramic Tile in the bathroom, stainless steel appliances, and finish basement. This apartment is like living in the country but you were only minutes away from everything you need. It is a Quiet and beautiful area. The apartment includes off street parking, private patio, central air, trash, water, sewer, and washer and dryer hook up in the basement. This apartment is a first floor apartment. No pets, no smoking","num_images":14.0,"lat":40.338628,"lng":-75.319304,"attrs":"['2BR \/ 1Ba', 'available jun 15', 'air conditioning', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T14:55:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-bedroom-gorgeous\/7490180567.html","post_id":7490180567,"result_date":"2022-05-30 14:49","title":"Brand New- 2 Bedroom Gorgeous Apartment w. Central AC System","description":"Move In Ready\nRecently Renovated to the HIGHEST STANDARDS !\nGorgeous NEW apartment , very Convenient and safe Location!!\nOnly 7 Minutes drive to Centar City, walking distance to Train station , 2 way street with Plenty Of Parking.\n2 Bedroom apartment Located on the WEST side of germantown section in Philadelphia That Include.\n*2nd Floor apartment in a TRIPLEX setting.\n*2 Large bedrooms, with Large Closets, Large New windows For Plenty Of Natural Light.\n*Real Hardwood Floors throughout the apartment.\n*Large Kitchen with Granite countertops, windows, wood floors, Garbage disposal, Fridge, Stove, Professional in wall Microwave, plenty of REAL WOOD cabinets-drawers .\nEat In aria In the Kitchen.\n* very Large New Modern Tiled Bathroom ,window Plenty Of Light !\n* Hi efficiency central Heat system.\n* Centar AIR CONDITION system .\n*recessed Lights In the Kitchen \/ Comon arias.\n* Building Front porch And Backyard that Can Be Used By tenants for Gardening, BBQ, or anything else.\nPlease note- This is a 2 bedroom apartment- no living room - 1 room Can Be Used as a living room If needed\nthis apartment will be perfect for a single person Or a Couple.\nLandlord Pay for water.\nTenant Pay for Gas\/ Electric.\nwe are looking For Responsible Long Term Tenant to enjoy this Lovely apartment and call it Home.\nFor More Information or schedule showings Please reply to this Post with your name and Contact information, Phone # , you can request a FREE rental application with your response.\nyou can also TEXT \/ Call\nshow contact info\n- Moses\nshow contact info\n- Ayala\nMove In require , First and Last Month Payment along with the security deposit (Total 3 Month)\ndont Miss this One !\nGood Luck !:)","num_images":15.0,"lat":40.025813,"lng":-75.164943,"attrs":"['2BR \/ 1Ba', '920ft2', 'available now', 'broker fee details: 1\/2 month rent', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'listed by: Blue Square Inc', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T14:34:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-bedroom-and\/7490183414.html","post_id":7490183414,"result_date":"2022-05-30 14:44","title":"Lovely 2 bedroom and 1 bathroom apartment.","description":"Lovely 2 bedroom and 1 bathroom apartment. Tattered Cover, Twist and Shout, Starbucks and Sprouts all within walking distance of your spacious 1 bedroom apartment. This neighborhood is a great balance between peaceful, quiet living and the excitement! Free off-street parking and all utilities covered, except electricity.","num_images":0.0,"lat":39.9227,"lng":-75.1812,"attrs":"['2BR \/ 1Ba', '750ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T14:40:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wow-newly-remodeled\/7490180485.html","post_id":7490180485,"result_date":"2022-05-30 14:38","title":"***WOW! NEWLY REMODELED 3 BEDROOM HOUSE FOR RENT***","description":"* This is a beautiful remodeled home located in South Philadelphia between 8th and 9th Oregon Ave.\n* It is a very good location near shopping center and easily accessible to public transportation.\n* Features include wooden floors, a spacious kitchen, a dining room, one and half bathroom, and 3 spacious bedrooms.\n* Washer and dryer are included\nIf you are looking for a nice house in a great, safe neighborhood, with easy on-street parking, this is the place for you.\nThis house is available for rent immediately, so call me at  show contact info\nor email me (includes phone number) to set up your appointment!","num_images":8.0,"lat":39.9207,"lng":-75.1595,"attrs":"['3BR \/ 1.5Ba', '1200ft2', 'available now', 'house', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T14:34:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-dont-miss-out-on-this-very\/7490164342.html","post_id":7490164342,"result_date":"2022-05-30 14:36","title":"Don't miss out on this very modern Home all new and freshly remodeled","description":"Don't miss out on this very modern Home all new and freshly remodeled throughout. Foyer entrance with new front door, new custom tile floor and located next to 1st Floor Family Room. Formal Living Room with high ceilings, new Gas Fireplace and large Bow Window. Formal Dining Room for your entertaining pleasure. Gorgeous Eat in Kitchen has been completely Remodeled with beautiful Cherry Cabinets, Granite Countertops, Ceramic Tile Floor, Stainless Steel Appliances plus large Stainless Steel Refrigerator. Hall Bath has been completely remodeled, Rooms freshly painted. Fantastic spacious lower level Family Room with brand new ceramic tiled Powder Room, new carpeting and custom ceiling. Extras include new large rear cement patio. Extra pavers on side of home offer additional parking spaces . New Cement in front of home and driveway. The middle school is the award winning 2019 National Blue Ribbon Greenberg Elementary School. Elementary School .\nRE_NT___2___0W+N BAD CREDIT IS NO PROBLEAM\nCALL NOW ☎️📞📞📞 show contact info","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['3BR \/ 2Ba', '1614ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T14:00:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/horsham-welcome-home-in-horsham-pet\/7490167705.html","post_id":7490167705,"result_date":"2022-05-30 14:11","title":"Welcome Home in Horsham, Pet Friendly, Wifi and Laundry onsite","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryPicnic & Grilling AreaFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 114 Welsh Rd., Horsham, PA 19044","num_images":6.0,"lat":40.1821,"lng":-75.1479,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T14:07:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-upgraded-bedroom-home-on\/7490163659.html","post_id":7490163659,"result_date":"2022-05-30 14:03","title":"Upgraded 2 bedroom home on Rittenhouse Square","description":"ADDRESS: 1806-18 Rittenhouse Sq Unit 508, Philadelphia, PA 19103\nAVAILABILITY: 07\/01\/2022\nRENT: $2,795\/month\nSQUARE FOOTAGE: 892\n____________________________________________________________________\nDESCRIPTION: Rarely offered UPGRADED 2 bedroom, 1 bath condo for rent at the Rittenhouse Square. Available 07\/01\/2022. Living room and bedrooms face south and west, with great natural light all day long. This home features a gourmet kitchen with granite countertops, stainless steel appliances and beautiful hardwood floors throughout. Renovated bathroom as well. In-unit washer\/dryer, central air and plenty of closet space. Rent include all utilities, basic cable, high speed Internet and use of roof patio and deck (roof patio and deck available subject to pandemic restrictions). 24\/7 doorperson. On-site fitness center available for additional fee. No smokers, please. Cats negotiable.\nTENANT REQUIREMENTS: 1st month's rent, 12th month's rent, and one month security deposit to be paid at time of lease signing; appropriate income and credit required.\nFor appointments, contact:\nJohn Featherman\nBerkshire Hathaway HomeServices Fox & Roach, REALTORS®\nThe Harper at Rittenhouse Square\n112 S 19th St Suite 200\nPhiladelphia PA 19103\nOffice:  show contact info\nCell:  show contact info\n(Call this number!)\nLicensed in Pennsylvania, License #AB067755\n","num_images":20.0,"lat":39.948409,"lng":-75.171041,"attrs":"['2BR \/ 1Ba', '892ft2', 'available jul 1', 'cats are OK - purrr', 'condo', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-05-30T13:59:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rare-find-in-the-julietta\/7490162674.html","post_id":7490162674,"result_date":"2022-05-30 14:01","title":"A rare find in the Julietta neighborhood by the Wyoming ave corridor","description":"A rare find in the Juniata neighborhood by the Wyoming ave corridor. Completely renovated. Must see!\n3 bedrooms, 1 full bath. Finished basement, new windows. Utility room. Gorgeous. All new appliances.\nRenter responsible for gas and electric, water. Last month rent due upon signing. No smoking\n","num_images":12.0,"lat":40.0343,"lng":-75.1213,"attrs":"['3BR \/ 1Ba', '1200ft2', 'available jun 1', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T13:57:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-apartment-in-art-museum\/7490160199.html","post_id":7490160199,"result_date":"2022-05-30 13:56","title":"1 BR apartment in Art Museum Area","description":"ADDRESS: 2601 Pennsylvania Ave Unit 607, Philadelphia, PA 19130\nAVAILABILITY: 07\/05\/2022\nRENT: $1,495\/month plus utilities\nSQUARE FOOTAGE: 632\n____________________________________________________________________\nDESCRIPTION: One bedroom apartment in the Art Museum area. Available July 5, 2022. This unit has a spacious living area with wood floors throughout. The unit is 632 sq ft. This home features a modern kitchen with refrigerator, range\/oven and washer and dryer. Bonus: Additional kitchen island. Full bathroom and lots of closet space. Rental fee includes all utilities except electric, cable TV and Internet. The community has a 24\/7 hour concierge desk, fitness facility, and more! Right across the street is the Philadelphia Museum of Art and Boat House Row. Within a few blocks there is a Starbucks, Whole Foods Grocery and more. 2601 also currently offers a free bus shuttle throughout Center City for the residents. Please note there is a $400 move-in\/move-out fee, which is the tenant's responsibility. Please note that the property is owned by a company owned by two licensed PA real estate brokers. No smokers and no pets, please.\nTENANT REQUIREMENTS: 1st month's rent, last month's rent, and one month security deposit to be paid at time of lease signing; appropriate income and credit required.\nFor appointments, contact:\nJohn Featherman\nBerkshire Hathaway HomeServices Fox & Roach, REALTORS®\nThe Harper at Rittenhouse Square\n112 S 19th St Suite 200\nPhiladelphia PA 19103\nOffice:  show contact info\nCell:  show contact info\n(Call this number!)\nLicensed in Pennsylvania, License #AB067755\n","num_images":24.0,"lat":39.967793,"lng":-75.180163,"attrs":"['1BR \/ 1Ba', '632ft2', 'available jul 5', 'condo', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-05-30T13:52:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bensalem-studio-style-hotel-fully\/7490135307.html","post_id":7490135307,"result_date":"2022-05-30 13:05","title":"STUDIO STYLE HOTEL FULLY FURNISHED","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryOn-Site Fitness FacilityFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 3216 Tillman Dr., Bensalem, PA 19020","num_images":4.0,"lat":40.116742,"lng":-74.960137,"attrs":"['0BR \/ 1Ba', 'available now', '\\ntuesday 2022-05-31\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T13:01:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-design-moderen-concrete\/7490127883.html","post_id":7490127883,"result_date":"2022-05-30 12:56","title":"DESIGN MODEREN | CONCRETE FLOORING | CARDIO LAP POOL | YOGA DECK","description":"\"Conveniently located in PA just minutes from all that Austin offers. Spacious three bedroom apartment home features concrete flooring, fully-appointed kitchens, granite countertops, designer appliances, built-in bookshelf, nine-foot ceilings, garden soaking tub and more! Enjoy a wide array of amenities: including resort-style pool, cabanas, free Wi-Fi, cardio lap pool, strength and cardio-training fitness zone, business center, Billiards room, disc golf course, private walk\/jog\/bike trails, two leash less dog parks, attached\/detached garages, carport options and fenced yards available and much more!\nContact Me For This and Other Deals!\n____________________________________________________________________\nCALL ME TODAY || Call Now:-( 8 4 4 ) 9 6 1 4 4 2 7 || Real Estate Agent\nDash Realty & Locating\nNot finding what your looking for browsing online? Let me do the work, over 20 years experience working and living in PA, I will save you time and money! Call, Text or E-mail me today! I have access to anything online and much more, guaranteed to make your next move effortless! Check out my Reviews! FREE Service \/ No Fees! $50 Referrals \"\n","num_images":7.0,"lat":39.9845,"lng":-75.2282,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T12:46:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-bedroom-apartment\/7490128765.html","post_id":7490128765,"result_date":"2022-05-30 12:52","title":"$2,800 \/ 4br - 4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121\n","num_images":14.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T12:48:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovley-one-large-bedroom\/7490127898.html","post_id":7490127898,"result_date":"2022-05-30 12:50","title":"A LOVLEY ONE LARGE BEDROOM APARTMENT AT BONA VISTA","description":"LOCATION LOCATION LOCATION *A LOVELY RENOVATED APARTMENT IN BOUANA VISTA *\nNew Hardwood floors * LARGE Bedroom, a Den room can use as office, a Nice Bathroom, Upgraded Kitchen cherry wood cabinets with all Stainless Steel Appliances, Granite counter top , Large and Nice Living Room . Large and Efficient windows, Ceiling fans in the rooms. Storage closets, Washer and Dryer in the apartment.  the apartment is a few blocks from the famous ITALIAN MARKET, Accessible to Thomas Jefferson University Hospital, Graduate Hospital, Queen Village, and South Street * * 1 block away from Broad Street & Federal Line to Center City Subway, A couple blocks away from many famous restaurants, Italian Market, and the Passyunk Square cross from the new shopping center TARGET and new Supermarket * * Great location and peaceful neighborhood with street parking the Water included. * * Tenants are responsible for gas and electric Available JULY 1 .","num_images":11.0,"lat":39.937859,"lng":-75.164444,"attrs":"['1BR \/ 1Ba', '760ft2', 'available jul 1', '\\ntuesday 2022-05-31\\n', '\\nwednesday 2022-06-01\\n', '\\nthursday 2022-06-02\\n', 'application fee details: 40.00', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T12:46:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-bedroom-apartment\/7490117899.html","post_id":7490117899,"result_date":"2022-05-30 12:40","title":"$2,100 \/ 3br - 3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #2\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121\n","num_images":6.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T12:26:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-bedroom-apartment\/7490111857.html","post_id":7490111857,"result_date":"2022-05-30 12:24","title":"$2,200 \/ 3br - 3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3F\nDUPLEX\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\n","num_images":7.0,"lat":39.986583,"lng":-75.16434,"attrs":"['3BR \/ 2.5Ba', 'duplex', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T12:13:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/plymouth-meeting-studio-apartment\/7490106997.html","post_id":7490106997,"result_date":"2022-05-30 12:07","title":"Studio Apartment w\/ Kitchenette and Work Space","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryOn-Site Fitness FacilityMeeting RoomFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 437 Irwins Lane, Plymouth Meeting, PA 19462","num_images":6.0,"lat":40.1077,"lng":-75.2796,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T12:03:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-beautiful-fully-furnished\/7490106419.html","post_id":7490106419,"result_date":"2022-05-30 12:06","title":"Beautiful, Fully Furnished Corporate Suite","description":"Available: 7\/12\/22\nApt. 2402 — Westminster floor plan — 1,462 sq. ft. — $5,857\nThis luxurious 4th floor, 2 bedroom\/2 bathroom fully-furnished corporate suite is available for short-term lease! This apartment boasts hardwood LVT flooring throughout the living area with plush carpeting in the bedrooms only, an open-concept living area, ample storage space, upgraded stainless steel appliances, and a private balcony just outside the living room. This beautiful apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more! Utilities included!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1462ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T12:02:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/plymouth-meeting-showings-begin-may-31st\/7490093348.html","post_id":7490093348,"result_date":"2022-05-30 11:56","title":"Showings begin May 31st","description":"This wonderful move-in ready home in the highly sought after Whitemarsh Meadows neighborhood has much to offer, affording you the lifestyle you have long envisioned. Offering an ideal location, in a quiet yet convenient neighborhood, within walking distance to award-winning schools, parks and playing fields, with low property taxes and no HOA, you don’t want to miss this opportunity.","num_images":1.0,"lat":40.1077,"lng":-75.2796,"attrs":"['3BR \/ 3Ba', '1856ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T11:33:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-bedroom-apartment\/7490100240.html","post_id":7490100240,"result_date":"2022-05-30 11:52","title":"$1,600 \/ 2br - 2 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3F\nDUPLEX\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\n","num_images":7.0,"lat":39.9954,"lng":-75.1698,"attrs":"['2BR \/ 2Ba', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T11:48:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/this-wonderful-bedrooms-ready-for-move\/7490094599.html","post_id":7490094599,"result_date":"2022-05-30 11:51","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-bedroom-house\/7490095288.html","post_id":7490095288,"result_date":"2022-05-30 11:42","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-bedroom-house\/7490093416.html","post_id":7490093416,"result_date":"2022-05-30 11:37","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-massive-bed-bath-home-with\/7490092810.html","post_id":7490092810,"result_date":"2022-05-30 11:36","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-designed\/7490092796.html","post_id":7490092796,"result_date":"2022-05-30 11:36","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-now-available-olde\/7490092788.html","post_id":7490092788,"result_date":"2022-05-30 11:36","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-built-brewerytown-bed\/7490092766.html","post_id":7490092766,"result_date":"2022-05-30 11:36","title":"Just built! Brewerytown 3 bed 3 bath bi-level apt with parking space!","description":"3108 Clifford St #1 - Luxury 3 bed 3 bath home with parking space!\nGorgeous luxury 3 bed 3 bath bi-level apt in Brewerytown area, just a block from Fairmount Park is the perfect place to create new memories! This brand new first and sub level unit atop wonderful hardwood flooring is a one half of a 2 unit modern architectural space, curated with an eclectic mixture of contemporary fixtures amidst a ton of amenities for a higher quality of living. Now imagine you live here! The perfect spot to explore the city on foot, bicycle, or however, you choose.\nThe first bedroom (10'7\" x 9'6\") sits at the front part of the main level and while big windows are obvious at first sight, ample closet space are one of its best assets! A full bathroom with a stand up shower also sits on the main level. Discover an extravagant kitchen with quartz countertops, sleek white cabinetry, a breakfast bar and stainless-steel appliances including: a refrigerator, microwave, gas stove, dishwasher--which create an ideal setting for meal preparation. The kitchen and living room area make up a bright and open concept floorplan and just off the living room a back entrance\/exit which leads out to the driveway wherein your own parking space exists to relieve the parking woes we the citizens of Philadelphia have had bestowed upon us.\nThe sublevel includes 2 bedrooms (1 bedroom with an ensuite bathroom) located on opposite ends, closet space, a slate tiled bathroom with a large stand up shower, a stacked washer\/dryer atop hardwood flooring. 2nd bedroom (12’4”x11’8”) located on the front part of the sublevel, includes closet space. 3rd bedroom (12’3”x12’4”) located in the rear of the sublevel as an ensuite bathroom with a tiled stand up shower, as well as, tons of sunlight.\nFeatures:\nCentral Air\/Heat\nWasher Dryer\nParking space\n2 entrances\nDishwasher\nGas stove\n3 full bathrooms\nTons of natural light\n","num_images":11.0,"lat":39.982953,"lng":-75.184969,"attrs":"['3BR \/ 3Ba', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T11:32:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-850-2br-bedroom-house\/7490091366.html","post_id":7490091366,"result_date":"2022-05-30 11:33","title":"$850 \/ 2br - 2 Bedroom House (Philadelphia)","description":"2 BEDROOM HOUSE\nWOOD FLOOR\nNEW KITCHEN\nNEW BATHROOM\nCLOSE TO SCHOOL\nLOCATION: 111 E PASTORIUS ST 19144 (GERMANTOWN) $850.00\n","num_images":4.0,"lat":40.043429,"lng":-75.177652,"attrs":"['2BR \/ 1Ba', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T11:29:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-apt-available\/7490089198.html","post_id":7490089198,"result_date":"2022-05-30 11:28","title":"1 BR Apt Available","description":"$750 \/ 1br - 1 Bedroom Apartment (Philadelphia)\nApt 2\n1 BEDROOM APT\nWOOD FLOOR\nNEW KITCHEN\nNEW BATHROOM\nCLOSE TO SCHOOL CLOSE TO PARK\nLOCATION :5900 PINE ST 19143 (COBBS CREEK)\n","num_images":4.0,"lat":39.955252,"lng":-75.240137,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T11:24:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-furnished-studio-02-months\/7490079943.html","post_id":7490079943,"result_date":"2022-05-30 11:06","title":"Furnished Studio - 02 Months Minimum","description":"Furnished Studio - Only 2 Month Minimum!Take advantage of our special discounted rate! All utilities are included! show contact info\nwww.esa.com\/craigslistLooking for a place to call home for a couple months or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Furnished Studio - Only 2 Month Minimum!Take advantage of our special discounted rate! All utilities are included! show contact info\nwww.esa.com\/craigslistLooking for a place to call home for a couple months or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryPicnic & Grilling AreaIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 2 months?  We also have great nightly, weekly, and 30-night rates.  Call for details.Minimum 60-night length of stay required. Booking conditions apply, including a nonrefundable deposit. Rates and availability subject to change. Rate will vary by room type and stay dates. Rate not inclusive of taxes and fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 8880 Bartram Ave., Philadelphia, PA 19153    Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryPicnic & Grilling AreaIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 2 months?  We also have great nightly, weekly, and 30-night rates.  Call for details.Minimum 60-night length of stay required. Booking conditions apply, including a nonrefundable deposit. Rates and availability subject to change. Rate will vary by room type and stay dates. Rate not inclusive of taxes and fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 8880 Bartram Ave., Philadelphia, PA 19153","num_images":4.0,"lat":39.889516,"lng":-75.246169,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T11:02:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-redefining-luxury-at-park\/7490059584.html","post_id":7490059584,"result_date":"2022-05-30 10:16","title":"Redefining Luxury at Park Lane","description":"Available: 8\/2\/22\nApt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T10:12:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/king-of-prussia-no-credit-check-fully\/7490055728.html","post_id":7490055728,"result_date":"2022-05-30 10:05","title":"No Credit Check Fully Furnished","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 400 American Avenue, King of Prussia, PA 19406","num_images":3.0,"lat":40.095179,"lng":-75.399448,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T10:01:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fireside-lounge-move-in-now\/7490050415.html","post_id":7490050415,"result_date":"2022-05-30 09:52","title":"Fireside Lounge, Move In Now, Lease Today","description":"Discover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis studio apartment features a fully equipped kitchen, entry closet, walk-in closet, and a washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['0BR \/ 1Ba', '581ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T09:48:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-new-apartment\/7490043529.html","post_id":7490043529,"result_date":"2022-05-30 09:43","title":"Lovely New apartment , 2 Bedrooms 1 Large Bathroom for rent now","description":"Move In Ready\nRecently Renovated to the HIGHEST STANDARDS !\nGorgeous NEW apartment , very Convenient and safe Location!!\nOnly 7 Minutes drive to Centar City, walking distance to Train station , 2 way street with Plenty Of Parking.\n2 Bedroom apartment Located on the WEST side of germantown section in Philadelphia That Include.\n*2nd Floor apartment in a TRIPLEX setting.\n*2 Large bedrooms, with Large Closets, Large New windows For Plenty Of Natural Light.\n*Real Hardwood Floors throughout the apartment.\n*Large Kitchen with Granite countertops, windows, wood floors, Garbage disposal, Fridge, Stove, Professional in wall Microwave, plenty of REAL WOOD cabinets-drawers .\nEat In aria In the Kitchen.\n* very Large New Modern Tiled Bathroom ,window Plenty Of Light !\n* Hi efficiency central Heat system.\n* Centar AIR CONDITION system .\n*recessed Lights In the Kitchen \/ Comon arias.\n* Building Front porch And Backyard that Can Be Used By tenants for Gardening, BBQ, or anything else.\nPlease note- This is a 2 bedroom apartment- no living room - 1 room Can Be Used as a living room If needed\nthis apartment will be perfect for a single person Or a Couple.\nLandlord Pay for water.\nTenant Pay for Gas\/ Electric.\nwe are looking For Responsible Long Term Tenant to enjoy this Lovely apartment and call it Home.\nFor More Information or schedule showings Please reply to this Post with your name and Contact information, Phone # , you can request a FREE rental application with your response.\nyou can also TEXT \/ Call\nshow contact info\n- Moses\nshow contact info\n- Ayala\nMove In require , First and Last Month Payment along with the security deposit (Total 3 Month)\ndont Miss this One !\nGood Luck !:)","num_images":16.0,"lat":40.025813,"lng":-75.164943,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T09:27:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bristol-bedroom-bath-house-for-rent\/7490042454.html","post_id":7490042454,"result_date":"2022-05-30 09:28","title":"4 Bedroom \/ 2 Bath House For Rent","description":"4 bedroom, 2 full bath house for rent in Bristol Borough, PA. This property has just been fully renovated. Address will be provided via email.\nNo pets\nNo smoking\nApplicant must have a 700+ credit score.\nApplicant must make a gross income of 3x the rent.\nApplicant must be able to successfully complete a background check.\n","num_images":1.0,"lat":40.1159,"lng":-74.8536,"attrs":"['4BR \/ 2Ba', '1885ft2', 'available now', 'air conditioning', 'house', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T09:24:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-kentwell-hall\/7490028851.html","post_id":7490028851,"result_date":"2022-05-30 08:57","title":"@@@Welcome to Kentwell Hall! Spacious one and two bedroom apartments*+","description":"Welcome to Kentwell Hall! SPACIOUS one and two bedroom APARTMENTS located on a beautiful tree-lined street in East Mount Airy. All units have newly renovated kitchens, bathrooms and windows. Original crown moulding, crystal knobs and hardwood floors keep the historic feel of this building intact. Large living room dining room areas with great closet space make these APARTMENTS a great deal! One block from Stenton Train Station for easy access to Center City. Within walking distance to Germantown Avenue. *PHOTOS ARE OF MODEL UNIT, FINISHES AND LAYOUT MAY VARY* Call or text At:: show contact info","num_images":6.0,"lat":40.0547,"lng":-75.1866,"attrs":"['1BR \/ 1Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T08:33:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-kentwell-hall\/7490028859.html","post_id":7490028859,"result_date":"2022-05-30 08:51","title":"@@@Welcome to Kentwell Hall! Spacious one and two bedroom apartments*+","description":"Welcome to Kentwell Hall! SPACIOUS one and two bedroom APARTMENTS located on a beautiful tree-lined street in East Mount Airy. All units have newly renovated kitchens, bathrooms and windows. Original crown moulding, crystal knobs and hardwood floors keep the historic feel of this building intact. Large living room dining room areas with great closet space make these APARTMENTS a great deal! One block from Stenton Train Station for easy access to Center City. Within walking distance to Germantown Avenue. *PHOTOS ARE OF MODEL UNIT, FINISHES AND LAYOUT MAY VARY* Call or text At:: show contact info","num_images":6.0,"lat":40.0547,"lng":-75.1866,"attrs":"['1BR \/ 1Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T08:33:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/exton-br-br-pet-friendly-exton\/7490029421.html","post_id":7490029421,"result_date":"2022-05-30 08:50","title":"$2,250 \/ 2br - $2,250 \/ 1br - Pet Friendly (Exton)","description":"Furnished Studio - Great Monthly Rates!\nTake advantage of our special discounted rate! All utilities are included!\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.\nProperty Amenities\nAll Rooms Non-Smoking\nPet-Friendly Rooms Available\nWeekly Housekeeping Included\nFree Grab-and-Go Breakfast\nOn-Site Guest Laundry\nFree Off-Street Parking\nIn-Room Amenities\nFully Equipped Kitchens\nFull-Size Refrigerator\nElectric Range\nMicrowave\nFree In-Room Wi-Fi\nFlat Screen TVs\nFree Cable with Premium Channels\nIron & Ironing Board\nStaying less than 1 month? We also have great nightly and weekly rates. Call for details.\nBooking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.\nPet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.\nExtended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.\nExtended Stay America - 877 N. Pottstown Pike (Rt 100), Exton, PA 19341\n","num_images":3.0,"lat":40.0468,"lng":-75.6432,"attrs":"['2BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-30T08:36:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedrooms-bath-apt\/7490013013.html","post_id":7490013013,"result_date":"2022-05-30 07:05","title":"LARGE 2 BEDROOMS & 1 BATH APT LOCATED CLOSE TO LA SALLE UNIVERSITY!","description":"⭐⭐⭐ LARGE 2 BEDROOMS & 1 BATH APARTMENT LOCATED CLOSE TO LA SALLE UNIVERSITY! ⭐⭐⭐\nProperty Address\n5701 N 17th Street | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ LARGE 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN OGONTZ\/WEST OAK LANE! ⭐⭐⭐\n✔️ LARGE LIVING ROOM\n✔️ UPDATED DESIGNER KITCHEN W\/ BREAKFAST BAR\n✔️ STOVE, FRIDGE, & MICROWAVE\n✔️ SPACIOUS BEDROOMS\n✔️ WATER-RESISTANT LAMINATE FOR EASY CLEANING\n✔️ OPEN LAYOUT CONCEPT\n✔️ CEILING FANS\n✔️ CABLE READY\n✔️ LOCATED CLOSE TO KEMBEL PARK!\n✔️ SHORT COMMUTE FROM LA SALLE UNIVERSITY!\n✔️ EASY ACCESS TO PUBLIC TRANSPORTATION!\n✔️ CLOSE TO MAJOR ROADS!\n✔️ EASY COMMUTE TO CENTER CITY!\n✔️ WON'T LAST LONG INQUIRE TODAY!\nDETAILS\nFull background checks,\n$35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\nAMENITIES\nOpen layout\nconveniently located\ncable ready\nclose to public transportation\nSIZE\nBeds\/Baths: 2 BD\/1 BA\nSquare Feet: Apx. 850\nRENTAL TERMS\nRent: $1000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2000\nPET POLICY\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY:  WWW.REDBLOCK.COM\/APARTMENTS\ntags: 2 bedroom, two-bedroom, redblock, redblock realty inc, ogontz, west oak lane, east oak lane, logan, Germantown, East Germantown, Olney, La Salle University, central high school, spacious, Olney Transportation Center - BSL, 19141, 19144, 19138, 19126, 19120, 19119, Kemble Park, Philadelphia High School for Girls, Einstein Medical Center Philadelphia, Cristo Rey Philadelphia High School, Central High School, Belfield Recreation Center, Community College of Philadelphia - Northwest Regional.\nAvailability and pricing are subject to change.  Information Deemed Reliable But Not Guaranteed. All information is subject to errors, omissions, or withdrawal without notice. #nata\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 925\nRental Terms\nRent: $1,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,000.00\n","num_images":6.0,"lat":40.040606,"lng":-75.15035,"attrs":"['2BR \/ 1Ba', '925ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T07:01:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated\/7490012584.html","post_id":7490012584,"result_date":"2022-05-30 07:01","title":"Completely Renovated 3 bedrooms and 2 bath home in West Oak Lane!!","description":"Completely Renovated 3 bedrooms and 2 bath home in West Oak Lane!!!\nProperty Address\n2472 77th Ave | Philadelphia, PA 19150, PA 19150\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE HOUSE! ⭐⭐⭐⭐⭐\n✔️Completely Renovated 3 bedrooms and 2 bath home\n✔️Spacious living room\n✔️Large dining area\n✔️Brand New kitchen with Island\n✔️Open Concept 1st Floo\n✔️Large Master Suite with private Master Bath\n✔️Contemporary Designs\n✔️Plenty of Natural Light\n✔️Washer\/Dryer Hook Up\n✔️Brand New Central Air\n✔️Rear Deck\n✔️Attached Garage\n✔️Plenty of closet space\n✔️Unfinished basement for storage\n✔️Custom color paint\n✔️Easy access to and from the city\n✔️Easy access to public transportation\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1900\nRental Terms\nRent: $2000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n\n#nata\n","num_images":24.0,"lat":40.070381,"lng":-75.159595,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T06:57:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-15-bath-house-1200\/7490011161.html","post_id":7490011161,"result_date":"2022-05-30 06:47","title":"3 bedroom 1.5 bath house 1200 per month","description":"This is a recently remodeled 3 bedroom 1 and 1\/2 bath house! The home was painted, new floors, new bathroom, new kitchen cabinets, new counters, a dishwasher…. It’s a must see. Act quick because this one will not last on the market.\nCall Ed  show contact info\nThis is ready to go for June 1\nTotal move in is 1200 for the first months rent and a 1200 dollar deposit(depending on credit) 2400 moves you in on the first.\nCredit app required to be filled out and income verification(pay stubs or banking info).\n","num_images":16.0,"lat":40.014018,"lng":-75.139842,"attrs":"['3BR \/ 1.5Ba', 'available jun 1', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-30T06:43:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wont-last-safe-quiet-large\/7490002472.html","post_id":7490002472,"result_date":"2022-05-30 05:07","title":"Won't Last! Safe, quiet- Large 1 bedroom Apt convinient East Fall","description":"Safe, quiet and convenient shopping and transportation apt\nEast Falls area is near beautiful Fairmount Park and Schuylkill River in northwest Philly with very convenient public transportation. It near highway I-76 and US 1, only 15 minutes driving or zone 1 local train to center Philadelphia, a few minutes to Temple University or to PCOM. There are several bus lines to difference places. There is walking distance to Jefferson\/Philadelphia University and Queen Lane campus of Drexel University Medical College. This Apt is located in the center of East Falls with safe, quiet and comfortable environment.\nThis rooming1 bedroom apartment is on the neat second floor of the town house with high ceiling. There are newer ceramic bathroom floor and newer kitchen floor, refrigerator and gas stove, new washer\/dryer, storm windows with good view on back window, 7 closets and more. Wide street parking and only permitting for local residents. There are 2 window air conditioners. There are some furniture in the apt except bed.\nThere are new toilet\/sink in bathroom and new counter and sink in kitchen too.\nThis second floor of the house will be ready in 7\/1\/ 2022\nPlease send email to make an appointment to view this apartment,Please respond with a short paragraph about yourself and what you are looking for along with any questions you might have. Text me anytime will contcat you soon,, Don't miss out on this BREATHTAKING SPACE. Contact Eliza steffen for a showing today:☛ : [[ elizasteffen43 ]]*Y~☛ a~☛ H~☛ o☛ 0 ~☛\n3418 Bowman street, Philadelphia Pa 19129.\n","num_images":7.0,"lat":40.0118,"lng":-75.1861,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-30T04:08:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-you-gotta-see-this\/7489996218.html","post_id":7489996218,"result_date":"2022-05-30 03:20","title":"You gotta see this beautiful, spacious loft apartment.","description":"If you are looking to live in the middle of the Phoenixville action, you gotta see this beautiful, spacious loft apartment. The pictures are worth a thousand words, but here a few anyway. All stainless steel electric appliances (range, above range microwave and refrigerator), island\/breakfast bar, all granite counter tops & large windows provide lot's of light. Fitness center, pool table, and common area deck with grill are included. Your comfort is assured with electric heat and central air conditioning. There's no need to run to a laundry because a washer and dryer are included.","num_images":5.0,"lat":40.129625,"lng":-75.519619,"attrs":"['1BR \/ 1Ba', '714ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-30T02:19:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ventnor-city-apartment-for-rent-in\/7489992828.html","post_id":7489992828,"result_date":"2022-05-30 01:42","title":"Apartment for rent in beautiful Ventnor City","description":"This apartment is in a residential zone ONLY 1 BLOCK FROM THE BEACH. Completely Renovated Down to The Studs! Everything Brand New and Upgraded!\nIt has:\n4 bedrooms\n3 baths\nCentral Air\nWiFi\nCable\nWasher and Dryer\nAvailable:\nJune 1st to 23rd - $2,000 per week or $6,000 for the 3 weeks\nJuly - $3,500 per week or $12,000 per month\nAugust - $4,000 per week or $15,000 per month\nPLEASE CONTACT MARIA AT THE PHONE NUMBER GIVEN.","num_images":24.0,"lat":39.340099,"lng":-74.47763,"attrs":"['4BR \/ 3Ba', 'available jun 1', 'air conditioning', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: weekly']","posted_date":"2022-05-30T01:38:54-0400"}]