[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxurious-brand-new\/7495806011.html","post_id":7495806011,"result_date":"2022-06-12 22:39","title":"Luxurious Brand New Townhome In Hip Fishtown","description":"2219 N Hope Street  Philadelphia, VA  19133$2950.00 \/ Month---------------------------Interested in this property?Reply to this listing for more information.---------------------------Property Details:4 BEDROOMS | 3 BATHROOMSBrand new townhouse with Philadelphia sky line view from the amazing rooftop deck. This modern style home offers premium finishes and brand new appliances. The master bedroom suite is absolutely stunning. In addition there are 3 more bedrooms which provide you with ample space. This house also has a washer\/dryer on the second floor. The first floor living room has a cozy fireplace. The home is a few minute walking distance from the heart of Fishtown and Septa. This home is available immediately. We welcome you to come see it. ***Cats, Small Dogs Allowed***Property Type: TownhouseLease Terms:$2950.00\/Month$2950.00 DepositLease Length: One YearAvailable:06\/20\/2022Unit Amenities:Dryer Freezer Dishwasher Garbage Disposal Oven Washer Refrigerator MicrowaveBuilding Amenities:Alarm System Cable Ready Fireplace On Site Laundry Security Cameras Wired For Internet Near Parks Off Street Parking---------------------------Interested in this property?Reply to this listing for more information.\n","num_images":16.0,"lat":39.9925,"lng":-75.1415,"attrs":"['4BR \/ 3Ba', 'available jun 21', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T22:35:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stylish-1bd-private-garden\/7495804878.html","post_id":7495804878,"result_date":"2022-06-12 22:36","title":"Stylish 1BD w Private Garden (Jul 16 - Aug 13)","description":"Renting out my stylish one-bedroom apartment, available from July 15th until Aug 13rd. This is a real one-of-a-kind apartment in Philly that includes a skyline view, bohemian design, and an unexpected surprise: a private patio\/garden right off the bedroom (it’s amazing to wake up to).\nThe apartment is on South Street, situated between the Washington Square West and Italian Market neighborhoods with lots of restaurants and shopping nearby (Whole Foods and Acme are a 2-min walk).\nHere’s what you need to know:\nI am looking for a responsible person who will commit to regularly watering the patio garden, as well as the indoor plants as needed. It’s not complicated, but it’s very important to me!\nThe apartment has a dishwasher, garbage disposal, and central A\/C, but does not have a washer\/dryer. Luckily, there is a great laundromat two doors down, and they also have very reasonable prices for wash-and-fold service.\nThe place has tons of character and charm, but if you're looking for a \"modern luxury\" apartment, this is not it! It's a pre-war walkup, no doorman, old-school kind of place.\nParking: There is metered street parking right out front, and you can reliably find non-metered parking a few blocks south of the apartment.","num_images":10.0,"lat":39.942496,"lng":-75.156193,"attrs":"['1BR \/ 1Ba', '700ft2', 'available jul 16', 'air conditioning', 'furnished', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T22:30:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-and-open-space\/7495799655.html","post_id":7495799655,"result_date":"2022-06-12 22:10","title":"Updated and open space house","description":"Clean, open spacious house, skylight 2nd floor with backyard space. Hardwood flooring.  Close to I-95, Supermarket, Casino, Center city. Available immediately. Credit check required $50 non-refundable. Call for appointment  show contact info\n.","num_images":16.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2Ba', 'house', 'w\/d hookups', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T22:06:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-olde-kensington-townhouse\/7495797496.html","post_id":7495797496,"result_date":"2022-06-12 22:01","title":"Olde Kensington Townhouse - 4 Bed\/1 Bath - Available 8\/01","description":"UPDATED PICTURES TO COME.\nNew paint (all white), floors (chestnut) and light fixtures throughout!\nWelcome home to this 4 bedroom, 1 bath, corner situated, 3 story, brick front property that is 17 feet wide, offering over 1,900 square feet of living space, and includes a lovely private yard.\nThis main level's impressive size allows endless possibilities for all styles and sizes of furnishings.\nThe kitchen, located in the rear of the home has terra-cotta tiled floors and includes a gas range, stainless refrigerator, dishwasher, and access to the rear yard making grill to table cooking a year round experience.\nThe yard is an urban hide away with plenty of room for plantings in the raised garden and the side alleyway is not shared making outdoor storage very convenient.\nBack inside to the upper levels enjoy 4 extremely large bedrooms; perfect for office, den, guest bedrooms etc!\nThe 2nd floor has 2 bedrooms and a large hall bath. The front bedroom has a beautiful marble mantle and a double wide built in closet and the middle bedroom has a large built in closet as well.\nThe 3rd floor includes 2 equally spacious bedrooms. The front bedroom has a double wide wardrobe with glass slider doors that have built-in led lights.\nThe luxury of having so many rooms at your disposal creates an opportunity to craft a living space that fits your needs such as a home office, guest rooms, a studio, a den, study, etc.\nThe location is a walkers paradise as well since it is in close proximity to a variety of restaurants, cafes, shopping, and social spots in Old Kensington, Fishtown, and Northern Liberties such as Helm, Taco Riendo, Luna Cafe, Reanimator, Front St Cafe, Suraya, Streetside, Hook & Master, Punch Buggy, Laser Wolf, Etc.This home is incredibly close to SEPTA and minutes from Center City.\nAvailable August 2022\nFirst, last, and security due at lease signing\nWater included\nPets negotiable","num_images":24.0,"lat":39.972511,"lng":-75.14354,"attrs":"['4BR \/ 1Ba', '1900ft2', 'available aug 1', 'air conditioning', 'application fee details: 35', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T21:57:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/king-of-prussia-quick-move-in-rambler\/7495784551.html","post_id":7495784551,"result_date":"2022-06-12 21:40","title":"QUICK Move In! Rambler Style Home with Attached Garage and Patio!","description":"GORGEOUS...GORGEOUS...SIMPLY GORGEOUS! Welcome to the fully remodeled single home in the vibrant Swedeland neighborhood and in award winning Upper Merion schools!Gorgeous is the only word to describe this impeccable 3 Bed\/1.5 Bath home boasting fenced yard, new luxurious plank and newer tile flooring throughout, envious kitchen with newer updates. BRAND NEW STAINLESS STEEL STOVE, FRIDGE AND FRIDGE!!! Seller lovingly cared for this home by remodeling every space available! Get ready to be impressed by inviting a covered porch for relaxed summer evenings! As you enter into the bright, large family room with fan. The family room opens to the spacious dining room. The luxurious kitchen features newer wood cabinetry, newer granite countertop, tile floor, new dishwasher, fridge and gas stove. This luxurious kitchen opens to a convenient laundry and powder room addition. A large back patio is there for your outdoor entertainment. Access front bedroom from the family room. Another large bedroom with walk-in-closets is off of dining room. The hall bathroom features an upgraded tile floor, a soaking tub, sink and vanity. Cozy third bedroom is situated in the Large windows allow for more natural light throughout the first floor.Location is minutes from I-76 , King of Prussia Mall, Gulph Mills SEPTA station.","num_images":5.0,"lat":40.0956,"lng":-75.3737,"attrs":"['3BR \/ 2Ba', '1200ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T21:09:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/glenside-133-new-st-glenside-pa\/7495789106.html","post_id":7495789106,"result_date":"2022-06-12 21:29","title":"133 New St. Glenside Pa","description":"Clean and bright second and third floor unit. Freshly painted and ready for move-in. This unit is located one block off of Easton road which is the center of GLENSIDE for shopping restaurants and entertainment. It is within walking distance, less than 1 mile, from Arcadia University, 10 to 15 minutes from Salas University and the same for Westminster theological seminary. There is offstreet parking for two cars, washer and dryer in basement, and additional storage in basement no pets please. ￼","num_images":0.0,"lat":40.101,"lng":-75.177,"attrs":"['2BR \/ 1Ba', '900ft2', 'available jul 1', 'duplex', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T21:25:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bath-private\/7495785846.html","post_id":7495785846,"result_date":"2022-06-12 21:17","title":"2 1\/2 bath, Private Garage,Finished Basement,Pool&Gym Access,CC View!!","description":"What we have here is a 3 bedroom with 2 1\/2 bathrooms. It has its own one car private garage. There is a backyard where you could put a grill. The kitchen has all the regular amenities: Microwave, dishwasher, disposal etc. This apartment can be fully furnished but if you have your own stuff that is perfectly fine and we can get all the things out. What we do have is a kitchen eating table, bar seats, pantry shelves etc. Downstairs is a finished basement where technically someone could live and could be used for a 4th bedroom as it is a finished basement and has lots of windows. There is a washer and dryer in the finished basement. Back upstairs is the living room where the ceiling is very high. We have two couch's and tv tables that your more then welcome to keep or we can remove. Going up the stair there is the first Master Bedroom. This bedroom has a private bathroom and a walk in closet. Going up the stairs more, you have the last two bedrooms. Both have big closets. Another Full bathroom is on this floor. Finally you go up to the roof where you get a view of Center City. Its located in northern liberties which is such an amazing neighborhood not seen anywhere else in Philadelphia. The apartment is near a coffee shop called One Shot and a block away from The Piazza. When you live at this place you get access to a private pool called The Cove at The Piazza. You also get access to a private gym. It comes with the place which is really one of the amazing perks. As mentioned, the private car garage is amazing especially since parking is a priceless commodity in the City. The view from the private roof deck is breath taking. Come and take a look at this amazing apartment located in a great neighborhood. We are looking for someone who want to move in 1st of July or sooner if need be. Right now the monthly Lease payment is $3,256. We are looking for that for the last two months and then you would figure out lease payment with ownership. This is a sublease as you would be taking over lease for last two months and then would work with ownership for new lease contract. This is a craigslist ad for someone who wants to get in and lock up this property before it hits the market to the public. Feel free to message me and we can work a time to show you the place. PICTURES ARE ON THE WAY.","num_images":0.0,"lat":39.967594,"lng":-75.14087,"attrs":"['3BR \/ 2.5Ba', 'available jul 1', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T21:13:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom\/7495773421.html","post_id":7495773421,"result_date":"2022-06-12 20:35","title":"Renovated 1 bedroom available now now at 4800 Brown st!","description":"Experience forward-thinking urban living.\n1, 2 & 3 bedroom luxury loft-style apartments located in an affordable up-and-coming district just north of University City make up this 34-unit complex. We offer thoughtful architecture and design creating a contemporary feel in an old factory setting. Elevator access, stainless steel appliances including a dishwasher and garbage disposal, a multi-camera security system, intercom system with remote door buzzer, on-site laundry, high ceilings, custom cabinetry with self-closing hardware, granite counters, kitchen pantry, exposed brick & concrete in many units, tile flooring, central heat & air, LED lighting, extra large commercial sized windows, large closets and large bright common hallways will be more than enough to make you want to come home!\nLive the uptown urban lifestyle you crave!\nAmenities:\n-Water $35.00 per month\n-Elevator\n-Assigned gated parking available for car and scooters ($150 per space, coming Summer 2021)\n-Multi-camera security system\n-Intercom system with electronic door opener\n-On-site laundry\n-Choice of Comcast or Verizon\n-Full-size stainless steel appliances\n-Bus line at corner\n-Garbage disposal\n-High ceilings\n-Large closets\n-Custom cabinetry with self closing cabinet doors & drawers\n-Sinks with magnetic retractable faucet hose\n-Granite counters\n-Pantries\n-Exposed ductwork, brick & concrete floors\/ceilings (in some units)\n-Central air and heat\nIn addition to monthly rent, tenant is responsible for their own electricity bill, a water fee of $35 & a liability insurance fee of $9.50\nCall Alena fro showing at  show contact info\nCity wide realty\n","num_images":17.0,"lat":39.966337,"lng":-75.216657,"attrs":"['1BR \/ 1Ba', 'available now', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T20:31:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-bedroom-available-now\/7495770506.html","post_id":7495770506,"result_date":"2022-06-12 20:26","title":"Cozy 1 bedroom available now at 3412 Spring garden!","description":"Great, spacious 1 bedroom available in July at 3412 Spring garden! Gated community, laundry room in the building. 1 year lease. 3 months to move in. Pet friendly, $250 one time pet fee, $25 pet rent.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":11.0,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T20:22:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-available\/7495769287.html","post_id":7495769287,"result_date":"2022-06-12 20:21","title":"Large 2 bedroom available now at 417 N Preston st!","description":"Security deposit, first and last month to move in. Tenants responsible for all utilities. Pets friendly. New appliances. New kitchen cabinets. Spacious bedrooms. Washer and dryer in the unit. Hot tub! Good size closets. Must see! Call Alena for showing at New property On-street parking Secured entry Jacuzzi \/ Whirlpool High \/ Vaulted ceiling Tile floor Hardwood floor Stainless steel appliances Garbage disposal Microwave Dishwasher Refrigerator Range \/ Oven Porch Heating & Cooling Central A\/C Storage space Call Alena for showing at  show contact info\nCity Wide Realty\n","num_images":24.0,"lat":39.960463,"lng":-75.203737,"attrs":"['2BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T20:17:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom\/7495768069.html","post_id":7495768069,"result_date":"2022-06-12 20:18","title":"Beautiful 2 bedroom available 9\/1 at 236 S 45th st!","description":"Great 2BR\/1BA unit in Fantastic location close to UPenn. Very charming 2BR\/1BA unit with lovely yard that is shared. W\/d is in the basement. Original hardwood floors, large bedrooms, spacious bathroom. Tenants will be responsible for electric and gas. 1. First, Last and Security to move in ( three months up front ) 2. $55 application fee ( non refundable ) 3. Good credit ( no prior evictions, judgments or collections ) 4. Proof of income (co signer for students if needed ) 5. $250 non refundable pet fee. Although deemed accurate, this information is subject to change without prior notice. Rental Terms Rent: $1,600 Application Fee: $55 Security Deposit: $1,600 Available 9\/15\/22 Pet Policy Cats allowed Dogs allowed","num_images":24.0,"lat":39.95402,"lng":-75.211932,"attrs":"['2BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T20:13:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-call-this-updated\/7495764812.html","post_id":7495764812,"result_date":"2022-06-12 20:06","title":"Call this updated apartment 'home' while exploring all","description":"WALK TO (Under 1 Mile): Philadelphia's Magic Gardens, Passyunk Square, Ba Le Bakery, Geno’s Steaks, Pat’s King of Steaks, South Philly Barbacoa, Italian Market, Dickinson Square Park, Ellsworth-Federal subway station","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '750ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T20:02:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-create-your-own-at-this\/7495764753.html","post_id":7495764753,"result_date":"2022-06-12 20:06","title":"create your own at this modern studio in Philadelphia","description":"OPT OUTSIDE: Fernhill Park (0.2 miles), Wheel Fun Rentals (5.3 miles), Fairmount Water Works (5.6 miles), Love Park (6.6 miles), Dilworth Park (7.1 miles), Spruce Street Harbor Park (7.3 miles)","num_images":7.0,"lat":40.0338,"lng":-75.1731,"attrs":"['1BR \/ 1Ba', '600ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T20:02:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-21-in\/7495743239.html","post_id":7495743239,"result_date":"2022-06-12 19:00","title":"Spacious 2.1 In Philadelphia !","description":"Spacious 2 bedroom\/1 bath end unit townhome in Philadelphia! . Large kitchen w\/d bar & Separate dining room, Spacious Family room, Laundry room w\/d washer & dryer, Attached Garage, big deck w\/d fenced treed yard. $800 per month, Available now, Features beautiful hardwood and slate flooring throughout, an open kitchen with granite slab countertops and stainless steel appliances, full-sized washer\/dryer set, and spacious bedrooms that accommodate a king-size bed. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS The kitchen features tile backsplash with glass in lay, lighting above & under cabinets, breakfast bar and full pantry. Ceramic tile flooring in kitchen, stairs, foyer and part of the lower level. Dining room has sliding glass door to balcony. Double doors to 2nd bedroom\/office. Master bedroom features vaulted ceiling and a walk in closet. The shared master\/hall bath features a soaking tub, linen closet and double sinks. Lower level has family room, 2rd bedroom, full bath, laundry room and crawl space off a walk in closet. 2 car attached heated garage. Walking distance to elementary school, junior high school, high school, Eola community center and library. from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented.","num_images":3.0,"lat":39.9227,"lng":-75.1812,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T18:56:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated\/7495502389.html","post_id":7495502389,"result_date":"2022-06-12 08:55","title":"Completely Renovated 3 bedrooms and 2 bath home in West Oak Lane!","description":"Completely Renovated 3 bedrooms and 2 bath home in West Oak Lane!!!\nProperty Address\n2472 77th Ave | Philadelphia, PA 19150, PA 19150\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE HOUSE! ⭐⭐⭐⭐⭐\n✔️Completely Renovated 3 bedrooms and 2 bath home\n✔️Spacious living room\n✔️Large dining area\n✔️Brand New kitchen with Island\n✔️Open Concept 1st Floo\n✔️Large Master Suite with private Master Bath\n✔️Contemporary Designs\n✔️Plenty of Natural Light\n✔️Washer\/Dryer Hook Up\n✔️Brand New Central Air\n✔️Rear Deck\n✔️Attached Garage\n✔️Plenty of closet space\n✔️Unfinished basement for storage\n✔️Custom color paint\n✔️Easy access to and from the city\n✔️Easy access to public transportation\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1900\nRental Terms\nRent: $2000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\nLINK TO VIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=8RTtrcxrVB7\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n\n#nata\n","num_images":24.0,"lat":40.070381,"lng":-75.159595,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T08:51:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-modern-3br\/7495501255.html","post_id":7495501255,"result_date":"2022-06-12 08:50","title":"Newly Renovated MODERN 3BR in booming Brewerytown","description":"Newly Renovated MODERN 3BR in booming Brewerytown\nProperty Address\n2312 W Thompson Street | Philadelphia, PA 19121\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ NEW! BEST VALUE APARTMENT! ⭐⭐⭐\n✔️ NEW! SPACIOUS 3 BEDROOMS AND 2 BATHS HOME IN BREWERYTOWN\n✔️ NEW! GRANITE COUNTERTOP KITCHEN\n✔️ NEW! CUSTOM BACKSPLASH AND FLOOR TILES\n✔️ NEW! MODERN PARQUET FLOORING\n✔️ NEW! DESIGNER PAINTER COLORS\n✔️ NEW! CUSTOM TILED BATHROOM W\/ ALL-NEW VANITIES\n✔️ NEW! CENTRAL AIR\n✔️ WASHER\/DRYER HOOKUP\n✔️ BACKYARD\n✔️ FINISHED BASEMENT\n✔️ ALL ELECTRIC\n✔️ CLOSE TO PUBLIC TRANSPORTATION!\n✔️ EASY ACCESS TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO AND FROM THE CITY!\n✔️ APPLY TODAY!!!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- Tenant pays all own utilities\n*** Build your credit! We report rent payments to Experian! ***\n*** Please apply online at https:\/\/redblock.com ***\nVIRTUAL TOUR:  https:\/\/my.matterport.com\/show\/?m=SFUoEj4haDk\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,200\nRental Terms\nRent: $1,900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,800.00\n\n#nata\n","num_images":21.0,"lat":39.97512,"lng":-75.173886,"attrs":"['3BR \/ 2Ba', '1200ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T08:46:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-fufnishe-condo\/7495495018.html","post_id":7495495018,"result_date":"2022-06-12 08:42","title":"A LOVELY FUFNISHE CONDO!","description":"This one bedroom one bathroom ready to move-in co-op unit A11 is in an excellent location the building is well maintained. It sits above Lincoln Drive. Close to Regional train station, Germantown, East Falls, Chestnut Hill, stores, restaurants, Germantown and Chestnut Hill business corridors and more. This coop has its own internal community, which is friendly and engaging and Community room on premises, option to walk or take elevator to the unit. When you enter the unit original parquet floors are present with plenty of storage place, kitchen, trash shoot at end of hall, great lighting all throughout the unit. Walk in closets, nice size dining and living rooms also laundromat on the premises that is coin operated. The community room has access to shared computers, printer and bathroom within this room. Entrance has security at front desk. Residents will have to apply code to enter building, elevator and all areas. There is parking lot and garage under the building. This unit cannot be used as a rental. This unit doesn't accept mortgages. Applicant must apply for $50 fee. The board will review finances and credit score.","num_images":0.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T08:14:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2br-1ba-for-aug-sept-with\/7495497307.html","post_id":7495497307,"result_date":"2022-06-12 08:30","title":"2BR\/1BA for Aug\/Sept with Laundry at 2125 Walnut Street","description":"Available to lease starting August 7th or as late as September 1st!\nCall or text Annie at  show contact info\nwith any questions or to set up a showing!\nWe only require the security deposit and first month's rent to move in (no last month's rent upfront!) 640 credit score required. Other requirements apply. Cosigners accepted!\nThis 2BR\/1BA apartment is located on the 4th floor of a walkup in a historic Rittenhouse building. Features include HW floors throughout, in-unit combo washer\/dryer, dishwasher, and incredible views and natural light.\nIdeal location, easy access to Rittenhouse Square Park and the Schuylkill River Park, fine restaurants, shopping, transportation, the river, the walking and bike trails to Kelly Drive. Close to University City, Trader Joes, Rittenhouse Square Park, 30th Street Station, and the Schuylkill River. Easy access to public transportation!\nWe are pet friendly! No breed or weight restrictions - just a one-time fee of $250\/pet. Water is included in the rent. Only security deposit and first month's rent needed to move in! Credit requirements apply.\nAddress: 2125 Walnut Street #4\nThis property is professionally managed by AMC Delancey Group.\nContact Annie to schedule a showing!\nAnnie Oliver\nAMC Delancey\nshow contact info\n- text me!\n","num_images":7.0,"lat":39.950879,"lng":-75.176597,"attrs":"['2BR \/ 1Ba', 'available aug 7', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-12T08:26:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-top-floor-2br-for-sept-oct\/7495495480.html","post_id":7495495480,"result_date":"2022-06-12 08:20","title":"Top Floor 2BR for Sept\/Oct at 1126 Walnut Street","description":"Available to lease starting September 7th or as late as October 1st!\nCall or text Annie at  show contact info\nwith any questions or to set up a showing!\nWe only require the security deposit and first month's rent to move in (no last month's rent upfront!) 640 credit score required. Other requirements apply. Cosigners accepted!\nThis 2BR\/1BA apartment is located on the 4th floor of a walkup in Center City. Features include hardwood floors, in-unit laundry, central AC, and lots of natural light. Only 1 block from Thomas Jefferson and walking distance to Middle Child, Vedge, El Vez, Woodys, Starbucks, MOMs Organic Market, Jimmy Johns, and so much more!\nWe are pet friendly! No breed or weight restrictions - just a one-time fee of $250\/pet. Water is included in the rent. Only security deposit and first month's rent needed to move in! Credit requirements apply.\nAddress: 1126 Walnut Street #4F\nThis property is professionally managed by AMC Delancey Group.\nContact Annie to schedule a showing!\nAnnie Oliver\nAMC Delancey\nshow contact info\n- text me!\n","num_images":9.0,"lat":39.948795,"lng":-75.159847,"attrs":"['2BR \/ 1Ba', 'available sep 7', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-12T08:16:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-september-october-bedroom\/7495491266.html","post_id":7495491266,"result_date":"2022-06-12 07:55","title":"SEPTEMBER\/OCTOBER 1-Bedroom at 1819 Spruce Street","description":"Available to lease starting SEPTEMBER 7TH or up to OCTOBER 1ST!\nCall or text Annie at  show contact info\nwith any questions or to set up a showing!\nWe only require the security deposit and first month's rent to move in (no last month's rent upfront!) 640 credit score required. Other requirements apply. Cosigners accepted!\nThis spacious 1BR is located on the second floor of a historic walkup building in Rittenhouse Square. Features include in-unit laundry, dishwasher, large kitchen with dishwasher and garbage disposal, central AC, and a spacious layout. Conveniently located within walking distance of SEPTA bus routes, subway lines, rail lines, and trolley lines. Nearby 30th Street Station is served by SEPTA Regional Rail lines. There is easy access to University City and major roadways via the Walnut Street and South Street Bridges.\nWe are pet friendly! No breed or weight restrictions - just a one-time fee of $250\/pet. Water is included in the rent. Only security deposit and first month's rent needed to move in! Credit requirements apply.\nAddress: 1819 Spruce Street #2F\nThis property is professionally managed by AMC Delancey Group.\nContact Annie to schedule a showing!\nAnnie Oliver\nAMC Delancey\nshow contact info\n- text me!\n","num_images":8.0,"lat":39.947818,"lng":-75.171468,"attrs":"['1BR \/ 1Ba', 'available sep 7', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-12T07:51:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-redefining-luxury-at-park\/7495488417.html","post_id":7495488417,"result_date":"2022-06-12 07:34","title":"Redefining Luxury at Park Lane","description":"Available: 7\/30\/22\nApt. 1101 — Manchester floor plan — 1,149 sq. ft. — $3,188\nLocated on the 1st floor, this 2-bedroom\/2-bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full sized front-loading washer and dryer, and stainless steel appliances. The large master bedroom is equipped with a private patio, a walk-in closet and a spacious bathroom with double sink vanity and walk in shower. The second bedroom and bathroom are spacious as well!  This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T07:30:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-clean-bright-modern\/7495471283.html","post_id":7495471283,"result_date":"2022-06-12 03:24","title":"Clean, bright, modern kitchen with tons of storage","description":"ALQUILER EXCELENTE APARTAMENTO FRENTE AL PUERTITO DE BUCEO.Un pequeño puerto de yates ubicado sobre la Rambla Costanera, con una delas vistas más buscadas.Recibidor con despojador. Toilette social.\nRecepción con la mejor  vista.Estar definido muy confortable.La planta está  ambientada con luminaria, paredes revestidas en piedraCuenta con una división por una biblioteca en vidrio, de diseño de autor.Pisos de roble excelente calidad  en madera  con  colores que resaltan la calidezy armonía de la planta,  de origen austríacos.Los tres dormitorios son importantes suites con baños completos,mamparas de cristal, diseño italiano.Suite principal con vista a los yates del puerto.Hall de distribución con placares incorporados en el espacio.Cocina diseño Todeschini,  doble profusión de placares equipadacon anafe, horno empotrado y campana.Doble entrada, dependencia de servicio completa y lavadero con placaresy pileta de lavar.Calefacción por losa individual sectorizada por ambientes,\ncalienta toallas en el baño.\nPersianas eléctricas,  cortinado en lino en ventanas en impecable estado.\nSistema de domótica!\nVigilancia presencial 24 hs.\nGarage con espacio para dos coches cómodos y baulera.\nDELREY PROPIEDADES teléfonos  Ver datos *  Celulares Ver datos y 407\n***\n","num_images":1.0,"lat":40.0547,"lng":-75.1866,"attrs":"['3BR \/ 1.5Ba', '1243ft2', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-06-12T02:55:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-pennsport-queen-village\/7495466604.html","post_id":7495466604,"result_date":"2022-06-12 01:51","title":"Pennsport\/Queen Village home for rent","description":"Pennsport\/Queen Village loft style home for rent. Newly renovated bathroom with large stone shower, walk-in closet, outside yard space to dine, and basement for plenty of storage space. Why rent an apartment when you can rent a home? Ample no permit street parking with a short walk to Center City Philadelphia. Also, very lively neighborhood with plenty of restaurants\/bars within short walking distance. Walking distance to all major shopping centers (Giant, Acme, Target, Walmart...)Would not be disappointed with the location, schedule a visit!","num_images":11.0,"lat":39.931783,"lng":-75.146612,"attrs":"['1BR \/ 1Ba', '688ft2', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T01:47:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-townhouse-for-rent-off\/7495455585.html","post_id":7495455585,"result_date":"2022-06-12 00:12","title":"Townhouse for rent off Broad quiet street","description":"One bedroom one bath spacious and freshly painted townhome is now available for rent. Hardwood floor throughout, open floor living and dining room, the modern kitchen with stain steel appliances. The patio has built in barbeque station. The basement has full size washer and dryer. Upstairs is a spacious open floor one bedroom with walk-in closet. The bathroom has a claw foot tub and a shower with plenty of space for storage. Located within walking distance to Broad Street,  Sprouts, Target, CVS and many restaurants and cafes nearby. Pets upon approval.","num_images":15.0,"lat":39.933989,"lng":-75.166376,"attrs":"['1BR \/ 1Ba', '1000ft2', 'available aug 1', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T00:08:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wayne-single-family-house-is-available\/7495452955.html","post_id":7495452955,"result_date":"2022-06-11 23:54","title":"Single family house is available on Octorber","description":"3-bed, 2-full bath single house is available on 10\/1\/2022.\nRent is 2400\/month.\nThe house has 3 bedrooms, 2 bathrooms, a kitchen, a living room and a basement. Two bedrooms, a bathroom, kitchen and living room are on the first floor. The second bedroom and the second bathroom are on the second floor.\nTotal is about 1300 sq ft.\nShare driveway with neighbor. Two cars can park in the backyard.\nIt is in good school district (Tredyffrin\/Easttown). Children go to New Eagle elementary school, Valley Forge Middle school and Conestoga High school.\nClose to King of Prussia mall.\nClose to I-76, I-276, 202 and 422 highway.\nRequirements:\n-one family\n-has a job\n-don't smoke\n-no large dogs\n-Move in cost is $7200. (pay a deposit of 2400 when the lease is signed. Pay first and last month rent 4800 when moving in).\nWelcome to take a look.","num_images":12.0,"lat":40.0612,"lng":-75.3999,"attrs":"['3BR \/ 2Ba', '1300ft2', 'available oct 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-11T23:50:11-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/middlesex-bedroom-first-floor-house-for\/7495807265.html","post_id":7495807265,"result_date":"2022-06-12 22:45","title":"3 bedroom first floor house for rent","description":"First floor 3 bedroom house for rent in 2 family House on quiet street. 1 car of street parking. Hard wooden floors throughout. 2 bedrooms 12 x 10 Master bedroom 12 x 12 with plenty of closet space.","num_images":15.0,"lat":40.581298,"lng":-74.501733,"attrs":"['3BR \/ 1Ba', '1500ft2', 'available jul 1', 'cats are OK - purrr', 'duplex', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T22:41:41-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-gorgeous-bedroom-bath-ready\/7495798910.html","post_id":7495798910,"result_date":"2022-06-12 22:07","title":"Gorgeous 2 Bedroom 1 Bath ready for Apartment rent in lancaster, PA !!","description":"Gorgeous 2 Bedroom 1 Bath ready for Apartment rent in lancaster, PA !! Features beautiful hardwood and slate flooring throughout, an open kitchen with granite slab countertops and stainless steel appliances, full-sized washer\/dryer set, and spacious bedrooms that accommodate a king-size bed. The master bedroom offers double closets plus double sinks in the master bath and a shower. In the backyard,, you will find a covered patio plus 2 storage buildings, both with electricity. Plenty of room for entertaining, gardening,, raising chickens and so much more! Separate from the other bedrooms, you will find an oversized bedroom and walk-in closet that could be a game room or converted to a separate mother-in-law suite. All this and more so make this one yours today!! Handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. The association covers water, trash, association insurance, hot water, and exterior maintenance.!*!*!*!*","num_images":3.0,"lat":40.0335,"lng":-76.2844,"attrs":"['2BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T22:03:20-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/old-bridge-ranch-house-for-rent\/7495783782.html","post_id":7495783782,"result_date":"2022-06-12 21:10","title":"RANCH HOUSE FOR RENT","description":"1,700 SQ FT RANCH HOUSE ON A HALF ACRE LOT 2 OR 3 BEDROOM NICE HOUSE 12 FT CATHEDRAL CEILINGS GREAT LOCATION $2,400 A MONTH INCLUDES ELECTRIC,GAS CONTACT VINCE FOR DETAILS  show contact info","num_images":0.0,"lat":40.398,"lng":-74.3236,"attrs":"['3BR \/ 1.5Ba', '1700ft2', 'cats are OK - purrr', 'apartment', 'laundry on site', 'no smoking', 'valet parking', 'rent period: monthly']","posted_date":"2022-06-12T21:06:25-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/delaware-city-lovely-single-family-home\/7495777479.html","post_id":7495777479,"result_date":"2022-06-12 20:59","title":"Lovely single family home 2Bed with 2Bath location> Delaware!","description":"Lovely single family home 2Bed with 2Bath location> Delaware! Text me to schedule a visiting  show contact info\n.This home has an open concept with laminate wood floors throughout,Large kitchen w\/d bar & Separate dining room, Spacious Family room, Laundry room w\/d washer & dryer, Attached Garage, big deck w\/d fenced treed yard. $610 per month, Available now,The master bedroom offers double closets plus double sinks in the master bath and a shower. In the backyard,, you will find a covered patio plus 2 storage buildings, both with electricity. Plenty of room for entertaining, gardening,, raising chickens and so much more! The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door.Home is beautifully updated with NEW countertop , Kitchen cabinet, NEW stainless steel stove and refrigerator, lighting, Milgard windows, blinds, , paint. Includes central heating\/AC and washer\/dryer. From this 1st floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. Features beautiful hardwood and slate flooring throughout, an open kitchen with granite slab countertops and stainless steel appliances, full-sized washer\/dryer set, and spacious bedrooms that accommodate a king-size bed. Text me to schedule a visiting  show contact info","num_images":1.0,"lat":39.5645,"lng":-75.597,"attrs":"['2BR \/ 2Ba', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T20:45:04-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-3bedroom-322-7th-st-allentown\/7495763502.html","post_id":7495763502,"result_date":"2022-06-12 20:02","title":"3bedroom 322 n 7th st Allentown","description":"3bedroom 322 n 7th st Allentown pa 18102 1425.00 a month hardwood floors new kitchen cold water sewer and garbage included no pets please call  show contact info","num_images":17.0,"lat":40.6068,"lng":-75.4781,"attrs":"['3BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T19:58:29-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-available-now-spacious-bed\/7495753129.html","post_id":7495753129,"result_date":"2022-06-12 19:53","title":"Available Now Spacious 2 Bed - 1 Bath apt Cherry Hill, NJ","description":"Available Now Spacious 2 Bed - 1 Bath apartment  Cherry Hill, NJ  Pets welcomed. one single car garage and one outside parking stall. Rent is $850. Reserved parking in front. Near Hospital, school, Close to all major highways and transportation, and downtown. This beautiful apartment features kitchen appliances, nicely renovated bathroom, hardwood floors, laundry in building available, elevator in building, and heat and hot water included! Near public transportation, schools, local parks, shopping centers and close to major highways. Fully furnished, this beautiful unit shows like a model and was professionally designed and furnished This building was majorly renovated over recent years & is meticulously maintained.","num_images":5.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T19:25:52-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/bayonne-available-now-spacious-bed-bath\/7495725514.html","post_id":7495725514,"result_date":"2022-06-12 18:17","title":"Available Now Spacious 2 Bed - 1 Bath apartment south jersey","description":"Available Now Spacious 2 Bed - 1 Bath apartment south jersey Pets welcomed. one single car garage and one outside parking stall. Rent is $650. Reserved parking in front. Near Hospital, school, Close to all major highways and transportation, and downtown.This beautiful apartment features kitchen appliances, nicely renovated bathroom, hardwood floors, laundry in building available, elevator in building, and heat and hot water included! Near public transportation, schools, local parks, shopping centers and close to major highways. Fully furnished, this beautiful unit shows like a model and was professionally designed and furnished This building was majorly renovated over recent years & is meticulously maintained. Text for more information  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.household must earn less than 80% area median income (AMI) & meet household size requirements. All prospective rental's must be approved with DHCD. Reach out to listing agent to receive income eligibility paperwork & property disclosures. you will find a covered patio plus 2 storage buildings, both with electricity. Plenty of room for entertaining, gardening,, raising chickens and so much more! Separate from the other bedrooms, you will find an oversized bedroom and walk-in closet that could be a game room or converted to a separate mother-in-law suite. All this and more so make this one yours today!! Handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. The association covers water, trash, association insurance, hot water, and exterior maintenance. Text for more information (425) 523-171+8\n","num_images":1.0,"lat":40.6664,"lng":-74.1192,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T18:05:17-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-why-rent-when-you-can-own\/7495725938.html","post_id":7495725938,"result_date":"2022-06-12 18:10","title":"WHY rent when you can OWN?","description":"Many renters think they don’t have enough money to buy a house when in reality if you’re paying $1000 or more in rent, then you may qualify for a mortgage and buy a home.\nOwning a home has so many benefits! One of them being that your monthly payment goes toward something valuable and you gain equity in your home! When you’re renting, you’re making your landlord  richer and paying his\/her bills.\nIf you’re considering purchasing a home or want to know more about the home buying process feel free to reach out to me!\nKaylin Williams, REALTOR®\nC📲:  show contact info\nO☎️:  show contact info\nKeller Williams Realty, Washington Twp\n381 Egg Harbor Rd Suite 200 Sewell, NJ 08080\nKaylin.williams.kw.com\n","num_images":1.0,"lat":39.798649,"lng":-75.031643,"attrs":"['0BR \/ 1Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T18:06:21-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/somerset-lovely-bedroom-full-bath-ranch\/7495718250.html","post_id":7495718250,"result_date":"2022-06-12 17:49","title":"Lovely 3 Bedroom 2 full Bath Ranch","description":"Lovely 3 Bedroom 2 full Bath Ranch on quiet Road. Oak Floors throughout, Oversized 2 car Garage, Full Basement, Wood Burning Brick Fireplace in Open & Bright Living Room, 14x12 Wood Deck off of Eat In Kitchen, All Appliances Included, Newer Whole House Generator, 2 yr old Furnace, A\/C, HWH, roof 2017. Close to Shopping and Major Transportation.","num_images":6.0,"lat":40.5007,"lng":-74.5013,"attrs":"['3BR \/ 2Ba', '1533ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T17:45:34-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/jersey-city-333-fairmount-ave\/7495697201.html","post_id":7495697201,"result_date":"2022-06-12 17:09","title":"***333 Fairmount Ave***","description":"333 Fairmount is a spacious and professionally managed Art Deco style building. Convenient transportation up the block to JSQ Path, shopping, schools and more all in the area. Hardwood flooring, tiled kitchen and bath as well as newer appliances.\nApplication form apply online fee refundable and secure\nBackground check included\n* Photo may vary from the actual units\nOne Year","num_images":11.0,"lat":40.725361,"lng":-74.070986,"attrs":"['1BR \/ 1Ba', '711ft2', 'available now', 'air conditioning', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T16:52:28-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/jersey-city-333-fairmount\/7495697006.html","post_id":7495697006,"result_date":"2022-06-12 17:09","title":"***333 Fairmount***","description":"333 Fairmount is a spacious and professionally managed Art Deco style building. Convenient transportation up the block to JSQ Path, shopping, schools and more all in the area. Hardwood flooring, tiled kitchen and bath as well as newer appliances.\nApplication form apply online fee refundable and secure\nBackground check included\n* Photo may vary from the actual units\nOne Year","num_images":10.0,"lat":40.725361,"lng":-74.070986,"attrs":"['1BR \/ 1Ba', '711ft2', 'available now', 'air conditioning', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T16:52:01-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/northampton-heat-pump-central-air\/7495684331.html","post_id":7495684331,"result_date":"2022-06-12 17:02","title":"Heat pump\/central air conditioning, two bedrooms, one bath","description":"✅Contact info:  show contact info\n.\nAddress : Main Street, Northampton, PA 18067\nRent\/Mo : $950 | 2 Beds | 1 Baths | 800 sqft\n✅Requirements :\nYour monthly income should be 3 times the rent and your credit score should be more than 500.\nApartment - Northampton, PA\nRecently converted schoolhouse into upscale luxury apartment. Each unit offers a custom kitchen, granite countertops, tiled backsplash, stainless steel appliances, washer and dryer. Heat pump\/central air conditioning, two bedrooms, one bath. Luxury vinyl plank flooring, deep window sills, 9' ceilings, secured building and security camera, off-street parking. Conveniently located storage units available. One year lease required, Non-smoking and no pets allowed. Please provide a full Credit Report with Credit Score, paystubs, copy of Driver's License Required & rental application","num_images":11.0,"lat":40.6998,"lng":-75.4874,"attrs":"['2BR \/ 1Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T16:21:28-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-nice2-bedroom-bath\/7495694292.html","post_id":7495694292,"result_date":"2022-06-12 16:56","title":"Nice2 bedroom 2 bath.","description":"Nice2 bedroom 2 bath. with walk out deck. Large kitchen, full size washer\/dryer, natural gas fireplace in living room, one single car garage and one outside parking stall. Rent is $650 pets negotiable with additional rent. Tenant deposit is one month rent. Building is secure. for $650\/rent per month. No Smoking allowed in condo or building trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. Consider this affordable condo in a great location and enjoy all that Cabo Del Mar has to offer. If you are interested, please send a message::","num_images":1.0,"lat":41.8442,"lng":-84.7648,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:45:38-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/neptune-luxury-livng-join-the-waitlist\/7495691164.html","post_id":7495691164,"result_date":"2022-06-12 16:41","title":"LUXURY LIVNG -- JOIN THE WAITLIST TODAY!!!!","description":"Contact info:\nThe Pointe at Neptune | Edgewood Properties |  show contact info\nTHE POINTE AT NEPTUNE\n3425 W. Bangs Avenue, Neptune, NJ 07753\nshow contact info\nwww.pointeatneptune.com\nLOCATED NEAR POPULAR DESTINATIONS\nClose to popular destinations such as Jersey Shore points, Asbury Park Boardwalk, Belmar Boardwalk\nNear popular shopping centers such as Jersey Shore Premium Outlets, Seaview Square Shopping Center, Freehold Raceway Mall, Monmouth Mall, and more!\nNext to tons of dining destinations\nEasy access to major highways\nEasy access to Jersey Shore University Medical Center\nNear numerous colleges\/universities, such as Monmouth University, Brookdale Community College, Fairleigh Dickinson University - Eatontown, and more!\nDESCRIPTION\nWelcome to The Pointe at Neptune, Edgewood Properties’ premier garden style rental community located in the heart of Monmouth County. You are invited to experience excellence in living with our scenic views, proximity to major highways and transportation, and luxurious amenities. Your new community includes concierge service, 24-hour business and fitness center, emergency maintenance and a resort style pool. A variety of spacious floor plans that offer full size washer\/ dryers, over-sized patios, and extensive kitchens. Basements are included in selected floor plans. We are open 7 days a week, and just a call or click away. Schedule your visit with our leasing professionals and you too will find that “All Roads Lead to the Pointe.”\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/pointeatneptune.com\nContact info:\nThe Pointe at Neptune\nEdgewood Properties\nshow contact info\n","num_images":5.0,"lat":40.2096,"lng":-74.0714,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:37:50-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-charming-bedroom-15-bath-apt-for\/7495677557.html","post_id":7495677557,"result_date":"2022-06-12 16:26","title":"Charming 2 bedroom 1.5 bath apt for rent IN Newark","description":"Charming 2 bedroom 1.5 bath apt for rent IN Newark. Two bedroom apartment available now, minutes away from the highway. Quiet and safe location with garage. Spacious cabinetry with large living room and beautiful bay window to enjoy the view. On site coin operated laundry and secure access building. The association covers water, trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. Do not miss out on this must see!.Text for more information  show contact info","num_images":4.0,"lat":40.7357,"lng":-74.1724,"attrs":"['2BR \/ 1.5Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T16:05:29-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-beautiful-two-bedroom-with\/7495678891.html","post_id":7495678891,"result_date":"2022-06-12 16:25","title":"###Beautiful two bedroom with washer and dryer in Lancaster! ###","description":"Beautiful two bedroom with washer and dryer in Lancaster! Contact me to schedule a viewing  show contact info\nSpacious south facing 1 bedroom with natural light all day long!! Washer\/dryer hook-up in the unit and wood floors throughout. Large balcony perfect for relaxing after work in the warm weather. Heat, hot water, and AC included in the rent! Inquire about our new policy. The association covers water, trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. Welcome to your Move-in-ready Apartment, 1 Bedroom, 1 Bath, Beautiful kitchen, Stainless steel appliances, Spacious living room, Hardwood Floors, Dedicated home office, 5 years young architectural shingled roof, Double pane American Craftsman by Anderson replacement windows, Corner lot, Outdoor entertainment area, Fenced-in backyard, Detached garage, Security cameras and system. Contact me to schedule a viewing  show contact info","num_images":4.0,"lat":40.0091,"lng":-76.3671,"attrs":"['2BR \/ 1Ba', 'available now', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:08:30-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-beautiful-two-bedroom-with\/7495678889.html","post_id":7495678889,"result_date":"2022-06-12 16:23","title":"###Beautiful two bedroom with washer and dryer in Lancaster! ###","description":"Beautiful two bedroom with washer and dryer in Lancaster! Contact me to schedule a viewing  show contact info\nSpacious south facing 1 bedroom with natural light all day long!! Washer\/dryer hook-up in the unit and wood floors throughout. Large balcony perfect for relaxing after work in the warm weather. Heat, hot water, and AC included in the rent! Inquire about our new policy. The association covers water, trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. Welcome to your Move-in-ready Apartment, 1 Bedroom, 1 Bath, Beautiful kitchen, Stainless steel appliances, Spacious living room, Hardwood Floors, Dedicated home office, 5 years young architectural shingled roof, Double pane American Craftsman by Anderson replacement windows, Corner lot, Outdoor entertainment area, Fenced-in backyard, Detached garage, Security cameras and system. Contact me to schedule a viewing  show contact info","num_images":4.0,"lat":40.0091,"lng":-76.3671,"attrs":"['2BR \/ 1Ba', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:08:30-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/washington-3bd-25ba-beautiful-house-for\/7495659573.html","post_id":7495659573,"result_date":"2022-06-12 15:43","title":"*3BD, 2.5BA BEAUTIFUL HOUSE FOR RENT (5200 Glover Rd NW)","description":"3bedroom, 2.5 bath first floor rental unit in a 2-family home. Tenant has private access to the walk out lower-level which can easily be converted into a private office, or den. Lower level has access to powder room, plus access to the backyard for all your warm weather activities! Laundry is conveniently located in the common area and tenant has access to 1 side of the 2 car garage. Driveway parking for 1 car or street parking is available. Tenant is responsible for all utilities except water. Applicants to complete tenant application. Background check required.","num_images":5.0,"lat":38.9381,"lng":-77.086,"attrs":"['3BR \/ 2.5Ba', '2000ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T15:24:13-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/washington-4br-frenchtown-br-house-for\/7495660564.html","post_id":7495660564,"result_date":"2022-06-12 15:41","title":"*4br - Frenchtown 4-Br House for Rent or Sale, 2-car garage, wooded ac","description":"RENT: $1,400\/Mo for 2-year lease Minimum, $1,800 refundable security deposit, Background Check Required, Prefer No Pets.\nRenter pays for all utilities including Oil, Electricity, Garbage, Lawn Maintenance, Basement Dehumidifier required, etc.\nNo Smoking.\nShort drive to Clinton, Flemington and major highways.\nPeaceful safe country living w\/ closest grocery store, bank, churches, auto repair, hardware, restaurants, State Police, biking and river walking trails & 2 miles away.\nDrive up the long secluded winding asphalt driveway up to a wooded paradise. Step through the sliding glass door to a Large private wood deck in back and enjoy the Spring flowers, hydrangeas, shade, peace and quiet, a babbling creek and a variety of wildlife.\nHouse has the following: ~1500 sqft 4br 2 bath Ranch with walkout basement (sqft does not include 1\/2 finished walkout basement w\/ 1 Br). Attached 2-car garage with workbench, electric and coded garage door opener. 2.3 wooded acres (99,317 Sq Ft) with a creek running through the property with two outdoor sheds and lot's of firewood\n","num_images":6.0,"lat":38.9381,"lng":-77.086,"attrs":"['4BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T15:26:29-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mount-royal-come-look-and-lease-picnic\/7495661098.html","post_id":7495661098,"result_date":"2022-06-12 15:31","title":"Come Look and Lease, Picnic Area, Car Care Center","description":"Heather Ridge Apartments, managed by Panco Management\n454 Heather Drive\nMantua, NJ 08051\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/heatherridgeapts.net\nThe professional management team at Heather Ridge is dedicated to providing the best possible services and amenities, with the needs and comfort of our residents being a top priority. With an apartment rating of 96%, it's clear that our residents are happy to call Heather Ridge home.\nGreat one bedroom one bathroom apartment with washer dryer, large walk in closet in bedroom and off the living room and more!\nApartment Features\n* Air Conditioning\n* Refrigerator\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Pre-wired for internet and cable\n* Extra Storage\n* Electric Stove\n* Walk-in Closet\n* Private Balcony\n* Washer and Dryer in unit\n* Designer Track Lighting\n* Window Coverings\n* Disposal\n* Microwave\n* Dishwasher\n* Vertical Blinds\n* Central Heat and Air\n[#9264934]","num_images":19.0,"lat":39.807871,"lng":-75.176093,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T15:27:47-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-nice-quiet-1bdrm-on-2nd-floor\/7495628546.html","post_id":7495628546,"result_date":"2022-06-12 14:48","title":"Nice, quiet 1Bdrm on 2nd Floor - Landlord on Floor #1","description":"Beautiful, quiet and charming 2nd floor apartment, walk to 19th Street Theater District\nWell maintained, 2nd floor apartment, 850 sq ft, in single family home, situated on a manicured lot with fully fenced back yard.  Landlord lives on property in apartment #1 (first floor)\n- Hardwood flooring\n- Custom kitchen with Kraftmaid cabinets, granite countertops and stainless steel appliances\n- Lutron Maestro lighting\n- Washer\/dryer in apartment\n- one off-street parking spot\n- 2nd story deck with stairs to yard\n- Tenant pays electric (heat and hot water); landlord pays water, sewer, garbage, recycle.\n- Credit >650, references, background check\n- First, last and one month security for move in.\nOne neutered cat may be allowed with additional monthly fee and extra security deposit.\n","num_images":11.0,"lat":40.606068,"lng":-75.503857,"attrs":"['1BR \/ 1Ba', '850ft2', 'available jul 18', 'cats are OK - purrr', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T14:14:45-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/burlington-single-home-for-the-price-of\/7495628983.html","post_id":7495628983,"result_date":"2022-06-12 14:34","title":"SINGLE home for the price of a condo\/townhouse with no association fee","description":"SINGLE home for the price of a condo\/townhouse with no association fees. Charming well maintained 1 bedroom bungalow in desirable Burlington Township.Possible attic expansion with buyer getting the proper township permits. Cozy brick gas fireplace wall in the expanded living room for those cold winter nights. Large dining room for those holiday gatherings. Full dry basement with built in brick bar, cabinets galore, laundry area and a workbench. Ready to be finished into your dream home.","num_images":10.0,"lat":40.068,"lng":-74.8454,"attrs":"['1BR \/ 1Ba', '1310ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T14:15:44-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-many-people-know-mill-hill-as\/7495621569.html","post_id":7495621569,"result_date":"2022-06-12 14:20","title":"Many people know Mill Hill as a very special section of Trenton with h","description":"Many people know Mill Hill as a very special section of Trenton with historic district protection and pride. It is a charming area where brick sidewalks and historic row houses look much like the streets of Georgetown. What's more of a secret is that a handful of these renovated gems overlook the gentle waters of Assunpink Creek. This rare freestanding home hides sun-dappled gardens, stone walkways and brick patios that step down to a view that seems almost impossible. How can such natural serenity exist in the city? The interior of the house is just as intriguing with 19th century details catching the eye at every turn. A vestibule entry buffers the opened up living\/dining room with a gas fireplace and 5 large windows. The eat-in kitchen with hidden laundry joins a screened porch, so you can enjoy that magical setting in nearly any weather. A perfectly positioned skylight leads the way upstairs, where one bedroom offers amazing treetop views and the other has a lovely dressing room. The bathroom in between has exposed brick and a claw-foot tub. An office\/lounge, also brightened by skylights, comprises the top floor. This is an excellent commuter location with easy access to regional rail to New York and Philadelphia as well as Amtrak. Major highways serve the State Capital.","num_images":9.0,"lat":40.217644,"lng":-74.761161,"attrs":"['1BR \/ 1Ba', '1000ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T13:59:04-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-come-look-and-lease-cats-and\/7495629063.html","post_id":7495629063,"result_date":"2022-06-12 14:19","title":"Come Look and Lease, Cats and Dogs, Pet Friendly","description":"Top of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nYou will love living here! Call Top of the Hill today!\nThis two bedroom two bathroom apartment has plenty of space and a walk in closet. Balcony and more.\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['2BR \/ 2Ba', '1221ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T14:15:55-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-duplex-spacious-bed-15bath\/7495611689.html","post_id":7495611689,"result_date":"2022-06-12 14:01","title":"Duplex Spacious 3 Bed\/1.5Bath Apartment For Rent in Allentown","description":"Single home with 2 car Garage in Parkland School District. Pet security deposit possible.\nOwner pays for Trash and Recycling. Laundry available\nProperty owner: Carl Benner :-  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nThere is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. NO PRIOR EVICTIONS. CREDIT AND BACKGROUND CHECK REQUIRED FOR EACH PERSON OVER 18.\n$25 APPLICATION fee for each APPLICANT..As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. Text for more information (423) 427-420+0\n","num_images":4.0,"lat":40.6018,"lng":-75.5225,"attrs":"['3BR \/ 1.5Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T13:36:37-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-duplex-spacious-bed-15bath\/7495611743.html","post_id":7495611743,"result_date":"2022-06-12 13:53","title":"Duplex Spacious 3 Bed\/1.5Bath Apartment For Rent in Allentown","description":"Single home with 2 car Garage in Parkland School District. Pet security deposit possible.\nOwner pays for Trash and Recycling. Laundry available\nProperty owner: Carl Benner :-  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nThere is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. NO PRIOR EVICTIONS. CREDIT AND BACKGROUND CHECK REQUIRED FOR EACH PERSON OVER 18.\n$25 APPLICATION fee for each APPLICANT..As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. Text for more information (423) 427-420+0\n","num_images":3.0,"lat":40.6018,"lng":-75.5225,"attrs":"['3BR \/ 1.5Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T13:36:44-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/penryn-country-location\/7495611539.html","post_id":7495611539,"result_date":"2022-06-12 13:42","title":"Country location","description":"3Bd, 2Ba. Ranch close to the turnpike, 9 mi. to 283 and Rt.30. Large great room, nice kitchen with all appliances. Breakfast bar and dining area plus large pantry. Owners suite with full bath and private deck. Spacious yard that's peaceful and private. Oil tank (275 Gal.) should last the winter. Freshly painted and new flooring makes this a very nice place. Available July 1st.  No pets, no smoking.","num_images":5.0,"lat":40.209118,"lng":-76.415302,"attrs":"['3BR \/ 2Ba', 'available jun 30', 'application fee details: $45', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T13:36:15-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-call-for-details-pet\/7495612371.html","post_id":7495612371,"result_date":"2022-06-12 13:42","title":"Call for Details, Pet Friendly , Balcony","description":"Top of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nWatch the seasons change from your balcony with a spectacular view of the densely wooded banks of a beautiful creek winding through the property. For recreation enjoy two tennis courts, a playground, and swimming pool. With parks in front and behind the property, describing Top of the Hill as being in a quiet park-like setting is not an exaggeration.\nThis one bedroom one bathroom apartment has the added bonus of a den and galley kitchen and more.\nCommunity Features\n* Car Wash Area\n* Sun Deck\n* Some Utilities Included\n* Swimming Pool\n* Playground\n* Laundry Care Center\n* Professionally Managed\n* Fitness Studio\n* Renters Insurance is Required\n* Tennis Court\n* After-Hours Emergency Maintenance\n* Our prices can change daily, price listed is based on today's availability. Call for details.","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['1BR \/ 1Ba', '996ft2', 'available jul 27', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T13:38:09-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-beautifully-updated-one\/7495609102.html","post_id":7495609102,"result_date":"2022-06-12 13:36","title":"Beautifully updated one bedroom condo in Cherry Hill","description":"Come grab this gorgeous one bedroom, one bath condo before it’s gone! Great location close to Route 70 and 15 minutes to Philly! Three minute drive to Wegmans and Cheesecake Factory! New AC, new floors, new windows! Washer and dryer in unit!","num_images":5.0,"lat":39.925645,"lng":-75.01173,"attrs":"['1BR \/ 1Ba', '768ft2', 'condo', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T13:30:48-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/new-brunswick-br-1bath-with-amazing\/7495598679.html","post_id":7495598679,"result_date":"2022-06-12 13:34","title":"1 BR\/1BATH with amazing amenities","description":"Contact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIGHTS\n11 US-1, New Brunswick, NJ 08901>\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n… AND MORE!\nDESCRIPTION\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\nContact info:\nThe Edge at Raritan Heights\nEdgewood Properties\nshow contact info\nContact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIHTS\n11 US-1, New Brunswick, NJ 08901\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n…AND MORE!\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\n","num_images":14.0,"lat":40.4891,"lng":-74.4482,"attrs":"['1BR \/ 1Ba', '828ft2', 'available jul 20', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T13:07:09-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-2br-2b-apartment-near-costco\/7495605473.html","post_id":7495605473,"result_date":"2022-06-12 13:26","title":"2BR\/2B Apartment near Costco","description":"2Bed 2 Bath 2nd floor apartment for rent near all  shopping and transportation.\n* Large, clean living space and bedrooms.\n* Ample storage space\n* Fully equipped kitchen\n* In-apartment laundry room.\n1 year lease @ $1700\/mo. Immediate availability\n","num_images":8.0,"lat":40.5661,"lng":-75.5436,"attrs":"['2BR \/ 2Ba', '1250ft2', 'available jun 15', 'air conditioning', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T13:22:32-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/new-brunswick-luxury-br-2bath-with-d\/7495594931.html","post_id":7495594931,"result_date":"2022-06-12 13:26","title":"Luxury 2 BR\/2BATH with W\/D plus many more amenities","description":"Contact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIGHTS\n11 US-1, New Brunswick, NJ 08901>\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n… AND MORE!\nDESCRIPTION\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\nContact info:\nThe Edge at Raritan Heights\nEdgewood Properties\nshow contact info\nContact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIHTS\n11 US-1, New Brunswick, NJ 08901\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n…AND MORE!\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\n","num_images":14.0,"lat":40.4891,"lng":-74.4482,"attrs":"['2BR \/ 2Ba', '1303ft2', 'available jul 5', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T12:59:14-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-bed-bath-apartment-dont-wait\/7495548375.html","post_id":7495548375,"result_date":"2022-06-12 13:04","title":"3 bed & 1 bath apartment?? Don't wait!!","description":"Exeter Rd Discover this delightful split level located in Salisbury townships' Oxford Park. Highlighted by oak hardwood floors through most living areas, your next home offers some terrific features including a spacious, private yard, enclosed back patio and more. The garage has been thoughtfully transformed into what could be a den or office, adding valuable living space, and easily converted back. Within walking distance to popular Percy Ruhe park,  and convenient to all points, this lovely home is a must see. Call today for your private showing\n**Contact for showings and information at  show contact info","num_images":7.0,"lat":40.5891,"lng":-75.4645,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T11:11:12-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-move-in-now-balcony-minutes\/7495593242.html","post_id":7495593242,"result_date":"2022-06-12 12:59","title":"Move In Now, Balcony, 8 Minutes to Downtown","description":"Top of the Hill is located in the desirable Brandywine Hundred of North Wilmington. Call today!\nThis two bedroom two bathroom apartment has plenty of space and a walk in closet. Balcony and more.\nTop of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm\nCommunity Features\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* After-Hours Emergency Maintenance\n* Swimming Pool\n* Sun Deck\n* Renters Insurance is Required\n* Laundry Care Center\n* Playground\n* Fitness Studio\n* Some Utilities Included\n* Tennis Court\n* Professionally Managed\n* Car Wash Area","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['2BR \/ 2Ba', '1221ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T12:55:30-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-tennis-court-balcony-washer\/7495585203.html","post_id":7495585203,"result_date":"2022-06-12 12:41","title":"Tennis court, Balcony, Washer\/dryer in rental","description":"Welcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today.\n-Pool\n-Gas heat\n-24-hour maintenance\n-Washer\/dryer in rental\n-Air Conditioning\n-Pets welcome\n-Garage\n-Pets\n-Balcony\n-Fitness and jogging trails\n-On-site management\n-Playgrounds\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/jvw7s53r\/fox-meadow\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['1BR \/ 1Ba', '650ft2', 'available jul 11', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T12:37:32-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-playgrounds-air\/7495584453.html","post_id":7495584453,"result_date":"2022-06-12 12:39","title":"Playgrounds, Air Conditioning, Fitness and jogging trails","description":"100 Fox Meadow Drive, Maple Shade Township, NJ 08052Welcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today.Apartment Features:CorporateOnsite CVS and WAWAPoolPatioPetsBalconyDisposalFurnishedAir ConditioningPlaygroundStorageFitness centerTennis courtGarageOn-site managementPets welcomeOnsite Daycare CenterSignal 88 Courtesy PatrolGas heatLaundry facilitiesWasher\/dryer in rentalFull-size washer\/dryer availablePrivate entrancesDishwasherGarbage disposalPlaygroundsPicnic areasFitness and jogging trailsHandball\/Basketball courtShopping plaza24-hour maintenanceSwim clubCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/iqj2fan6\/fox-meadow*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['3BR \/ 1Ba', '960ft2', 'available jul 11', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T12:35:52-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mount-royal-call-for-details-car-care\/7495581260.html","post_id":7495581260,"result_date":"2022-06-12 12:32","title":"Call for Details, Car Care Center, Heather Ridge Apartments","description":"Heather Ridge Apartments, managed by Panco Management\n454 Heather Drive\nMantua, NJ 08051\nshow contact info\nView this apartment today at Heather Ridge!\nGreat one bedroom one bathroom apartment with washer dryer, large walk in closet in bedroom and off the living room and more!\nVIEW OUR WEBSITE:\nhttps:\/\/heatherridgeapts.net\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm","num_images":19.0,"lat":39.807871,"lng":-75.176093,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T12:28:38-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-full-size-washer-dryer\/7495581004.html","post_id":7495581004,"result_date":"2022-06-12 12:31","title":"Full-size washer\/dryer available, Handball\/Basketball court, Pets","description":"Bedrooms: 2Bathrooms: 1Square Feet: 950Date Available: 2022-07-18Address: 100 Fox Meadow DriveWelcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today. Amenities Include:DishwasherPatioFull-size washer\/dryer availableHandball\/Basketball courtGas heatPoolSignal 88 Courtesy PatrolBalconyPetsPets welcomeLaundry facilitiesPicnic areasCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/itlzwdae\/fox-meadow*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['2BR \/ 1Ba', '950ft2', 'available jul 18', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T12:27:57-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/philadelphia-four-bed-room-and-two-bat\/7495569670.html","post_id":7495569670,"result_date":"2022-06-12 12:29","title":"FOUR BED ROOM AND TWO BAT ROOM","description":"Even Carlton Banks would live in this house on Carlton Place! Do you need four bedrooms? Check! Do you need a master suite? Check. This house even already has the color scheme that you want. Main level - Living Room, Formal Dining Room, Kitchen (white cabinets that are all the rage), half bathroom, and first floor laundry. Upstairs - Four Bedrooms, we already covered the master. The master bath isn't just a master batch, it's a Jack & Jill bathroom. Then there's the basement... party time. Fully finished. Not drop ceiling finished, but drywall finished. If you even need any more convincing there's the outside. Huge deck right off the kitchen. If you run out of space on the deck there is an entire separate concrete patio with firepit. Backyard is lined with trees for pricacy. One carage garage. Very walkable neighborhood with sidewalks.","num_images":1.0,"lat":39.8359,"lng":-91.7538,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-06-12T12:01:58-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-tennis-court-playground\/7495578994.html","post_id":7495578994,"result_date":"2022-06-12 12:27","title":"Tennis court, Playground, Balcony","description":"Welcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today.\n-Corporate\n-Swim club\n-Storage\n-Gas heat\n-Tennis court\n-Signal 88 Courtesy Patrol\n-Furnished\n-On-site management\n-Onsite Daycare Center\n-Pets\n-Balcony\n-Private entrances\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/gqxk2bgm\/fox-meadow\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['1BR \/ 1Ba', '650ft2', 'available jul 11', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T12:23:24-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-minutes-away-from-center\/7495571789.html","post_id":7495571789,"result_date":"2022-06-12 12:10","title":"Minutes Away From Center City!!","description":"Available: 7\/30\/22\nApt. 1101 — Manchester floor plan — 1,149 sq. ft. — $3,188\nLocated on the 1st floor, this 2-bedroom\/2-bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full sized front-loading washer and dryer, and stainless steel appliances. The large master bedroom is equipped with a private patio, a walk-in closet and a spacious bathroom with double sink vanity and walk in shower. The second bedroom and bathroom are spacious as well!  This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T12:06:48-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/pottstown-west-side-home-1100sqft2-bed\/7495552814.html","post_id":7495552814,"result_date":"2022-06-12 11:31","title":"West Side Home 1100SQFT2 = 3 Bed\/2 Bath+1 Office, VERY Bright-10 ' x 1","description":"Conveniently located lower unit of a duplex on West Side of Downtown sitting next to nature preserve.\nAvailability: Starting Aug 1.\nLease: One year (goes until July 31, 2023).\nUtilities: You pay 2 1\/2 shares of 5. Includes water, gas, electric, and wifi internet.\nDeposit: 1½x price.\nFeatures:\n- This is a basement unit. Half of the living space is directly underneath upstairs, and half of it is not - it's part of an addition. So, there is some noise from upstairs but sound proofing diminishes it.\n- Living Room with picture windows overlooking backyard and Miller Woods Nature Preserve. VERY bright.\n- Master bedroom (20' x 15' with master bathroom)\n- Bedroom #2 = 13 ' x 14 ' overlooking backyard\n- Bedroom #3 = 10' x 10'\n- Potential Office (or bedroom) = 10 ' x 10'\n-hardwood-styled vinyl plank flooring throughout;\n-One dedicated driveway and parking spot;\n-MASSIVE fenced backyard;\n-Sits on the Miller Woods Nature preserve.\n-One mile from downtown.\n-Access to washer\/dryer free.\nOne dog allowed with pet fee of $20\/month.\nBackground and credit check required for serious applicants.\nIF YOU'RE INTERESTED, please email. Make sure to include a brief bio about yourself and what times\/days are best for showings.","num_images":6.0,"lat":40.1919,"lng":-75.6653,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'duplex', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T11:21:42-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-relocating-weekly-rates\/7495515792.html","post_id":7495515792,"result_date":"2022-06-12 11:25","title":"Relocating? Weekly rates starting at $620.","description":"A budget-friendly extended stay hotel in Bethlehem, PA\nWe invite you to experience the conveniences of home at WoodSpring Suites® Allentown Bethlehem. Our all-suite hotel with in-room kitchens is the perfect choice for your extended stay, whether it’s for a week, a month, or longer. We offer low nightly, weekly, and monthly hotel rates to help save you money. Plus, you'll enjoy free WiFi, guest laundry facilities and free parking at our 100% smoke-free, pet-friendly property, making your stay simple and hassle-free.\nYou'll enjoy quick access to a variety of destinations and attractions when you stay at our hotel in Bethlehem, Pennsylvania. If you’d like to take advantage of public transportation, we're right on the 108, 217, 319, and 327 local LANta bus routes, while the Amtrak Bus Station is just 6 miles away. We're about 8 miles from the Lehigh Valley International Airport\/ABE Airport. $50 to $100 Deposit.\nHotel at a Glance\n5 miles to Lehigh Valley Hospital Muhlenberg\n6 miles to St. Luke’s Hospital Anderson Campus\n6 miles to Greyhound and Amtrak stations\n8 miles to Lehigh Valley International Airport\nNightly, weekly and monthly hotel rates\nFull kitchen in every room\nGuest Rooms\nVisit our extended stay hotel and select the suite layout that meets your needs. Each layout features a combination of double-\/full-sized beds and sleeper sofas, as well as a dresser, nightstand and shelves. All suites also include a kitchen with full-size refrigerator, stovetop, microwave, cupboards and prep sink. Sit back and relax during your stay while enjoying free WiFi and a flat-screen TV with cable\/satellite and a premium movie channel. Every-other-week housekeeping services are provided for long-stay guests. Additional items—including a linen exchange, cookware, dishes, and more frequent housekeeping—are available for purchase at the front desk.\nExplore activities for all ages in Allentown Bethlehem\nYou're in the heart of it all when you stay at WoodSpring Suites in Allentown Bethlehem, where you'll find a variety of exciting attractions and destinations. History buffs will enjoy visiting the nearby Pennsbury Manor, the reconstructed estate of William Penn, who founded the Pennsylvania colony. We're also an easy drive to a number of family friendly activities, including Crayola Experience, Dorney Park and Wildwater Kingdom, and Lehigh Valley Zoo. Artists and creative types will want to check out the Banana Factory Arts Center, a collection of galleries and arts programs partly housed in a former banana distribution warehouse, about 9 miles away.\nShow Less\nPet Policy\nService animals are welcome at no additional charge, must be registered at front desk. Limit 2 dogs, under 75 lbs. per room. No cats. Non-refundable pet fees, 50 USD a pet reg fee and 10 USD a pet per night charge for the duration of the stay.\nHotel Alert: Some hotel features and amenities may be modified or unavailable due to COVID-19. For more information, please call your hotel directly.\nAmenities to help you stay awhile\nWoodSpring Suites is an extended stay hotel with clean and comfortable rooms, and a professional, friendly staff that’s available to assist you 24 hours a day, 7 days a week. Our 100% smoke-free hotel offers pet-friendly hotel rooms, free parking, guest laundry facilities and conveniently located vending machines. Daily, weekly and monthly hotel rates are available.\nHotel Amenities\n100% Smoke Free Hotel Free WiFi Kitchen Laundry* Pet-friendly Hotel* Elevator(s) Bus Parking Truck Parking Indoor Parking Strobe Lights\/Emerg. Smoke Detectors Emergency Lights, Exits Smoke Detector, Hall Sprinklers, Public Areas Visual Alarm Smoke Detector, Hardwired Smoke Alarm, Audible Fire Detectors, Public Areas Fire Detectors, Hall Smoke Detector, Battery Fire Extinguisher, Hall Sprinklers, In-Hall Autolink, firehouse Smoke Detector, Public Areas Fire Extinguisher Video Security, Public Areas Video Security, Hall Video Security, Entrance Locks, Guest Windows Evacuation Plan Windows that open Multiple Exits Per Floor Emergency Exit Map Walkways, Lighted Government Travelers: FEMA Approved High-Speed Internet - Charge* Free Wired High-Speed Internet Bi-weekly Housekeeping Local Laws, fire\/safe Late Check-Out Available Multi-Lingual Staff\nRoom Amenities\n(Amenities may vary by room type)\nNon-smoking Room Kitchen Facilities Microwave Room Air-Conditioning Free Local Calls Cable\/Satellite TV Table and Chairs Flat Screen\/Plasma TV AM\/FM Clock Radio Refrigerator 2-Burner Cooktop Bathtub\nAccessibility Amenities\nBraille Elevator(s) Braille Coded Exits Accessible Features Parking spaces for vans in self-parking facility Parking spaces in self-parking facility Free accessible parking Accessible registration desk Accessible public restrooms Accessible Hotel Hotel has TTY for guest use Public entrance is accessible Route from accessible public entrance to registration area Ramps, Accessible Roll-In Shower TV with Closed Captioning Doors have 32-inch clear width Accessible Room Wheelchair Accessible Accessible Tub\n","num_images":10.0,"lat":40.675987,"lng":-75.349195,"attrs":"['1BR \/ 1Ba', '253ft2', 'available now', 'air conditioning', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: weekly', 'wheelchair accessible']","posted_date":"2022-06-12T09:40:27-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-duplex-spacious-bed-1bath\/7495546293.html","post_id":7495546293,"result_date":"2022-06-12 11:21","title":"Duplex Spacious 2 Bed\/1Bath Apartment For Rent in Allentown.","description":"Duplex Spacious 2 Bed\/1Bath Apartment For Rent in Allentown, PA 18101! Two bedroom apartment available now, minutes away from the highway. Quiet and safe location with garage. Spacious cabinetry with large living room and beautiful bay window to enjoy the view. On site coin operated laundry and secure access building. The association covers water, trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. Text for more information  show contact info\nThere is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. NO PRIOR EVICTIONS. CREDIT AND BACKGROUND CHECK REQUIRED FOR EACH PERSON OVER 18.\n$25 APPLICATION fee for each APPLICANT..As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. Text for more information (423) 427-420+0\n","num_images":4.0,"lat":40.6026,"lng":-75.4691,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T11:05:38-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-duplex-spacious-bed-1bath\/7495546297.html","post_id":7495546297,"result_date":"2022-06-12 11:20","title":"Duplex Spacious 2 Bed\/1Bath Apartment For Rent in Allentown.","description":"Duplex Spacious 2 Bed\/1Bath Apartment For Rent in Allentown, PA 18101! Two bedroom apartment available now, minutes away from the highway. Quiet and safe location with garage. Spacious cabinetry with large living room and beautiful bay window to enjoy the view. On site coin operated laundry and secure access building. The association covers water, trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. Text for more information  show contact info\nThere is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. NO PRIOR EVICTIONS. CREDIT AND BACKGROUND CHECK REQUIRED FOR EACH PERSON OVER 18.\n$25 APPLICATION fee for each APPLICANT..As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. Text for more information (423) 427-420+0\n","num_images":4.0,"lat":40.6026,"lng":-75.4691,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T11:05:39-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/newark-updated-bedroom-in-north-newark\/7495545915.html","post_id":7495545915,"result_date":"2022-06-12 11:08","title":"Updated 1 bedroom in North Newark","description":"Beautiful 1 bedroom apartment located in North Newark (near Belleville). This apartment has been completely updated! Great for commuters just 1 block to the Newark light rail station (Branch Brook Park station).\n-granite countertops\n-stainless steel appliances\n-heat and hot water included\n-laundry room\n-parking lot\n-tennis courts\n-no realtor fee, no application fee\nAddress: 347 Grafton avenue Newark NJ 07104\nAsking: $1,700 per month\nRequirements: first month rent, one month security deposit ($3,400) to move in\nQualifications: pay stubs showing $3,600 monthly after taxes\nContact Jamie:  show contact info\n(please text) or apply online for free and get pre approved @\nwww.SJHrealty.com\n","num_images":21.0,"lat":40.7664,"lng":-74.1695,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T11:04:51-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-shop-eat-sleep-and-more-at\/7495524205.html","post_id":7495524205,"result_date":"2022-06-12 10:10","title":"Shop, Eat, Sleep and more at Park Lane","description":"Available: 8\/2\/22\nApt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T10:06:06-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/newark-bedroom-in-north-newark-section\/7495518480.html","post_id":7495518480,"result_date":"2022-06-12 09:52","title":"2 bedroom in North Newark (section 8)","description":"Beautiful 2 bedroom apartment located in North Newark. Great for commuters just a 12 minute ride to Newark Penn Station.\n-heat and hot water included\n-brand new floors\n-2 large bedrooms\n-no realtor fee, no application fee\nAddress: 76 Broad street Newark NJ 07104\nAsking: $1,695 per month\nRequirements: one month security deposit ($1,695) to move in\nQualifications: no evictions or filings\nContact James:  show contact info\n(please text) or apply online for free and get pre approved @\nwww.SJHrealty.com\n","num_images":15.0,"lat":40.7664,"lng":-74.1695,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T09:48:39-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-rent800gorgeous-br-ba\/7495509762.html","post_id":7495509762,"result_date":"2022-06-12 09:45","title":"~!!@@RENT$800.....Gorgeous 3 BR 1 BA Apartment in Thriving Lancaster!","description":"Gorgeous 3 BR 1 Bath\nApartment in Thriving Lancaster! - Welcome to this stunning, fully renovated Apartment in Lancaster City! Enter into the large family room area that spills into the dining room. You will notice new plank flooring throughout, fresh paint and crisp white trim. The kitchen features granite countertops and a deep sink with gooseneck brushed nickel faucet and extractable hose. Plenty of storage space in the basement with a washer\/dryer hook ups.\nCall\/text (973) 318-19^83 for a quicker response\nGood income+ good credit(600+)\nRoommates\/guarantors welcome\nThe rent is $800\/month with water, sewer, landscaping, lawn service and snowplowing included. The house is also furnished with appliances (fridge, microwave, stove, oven, washer\/dryer) which will be available for you.\n","num_images":6.0,"lat":40.0335,"lng":-76.2844,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T09:18:43-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-remodeled-studio-apartment-in\/7495504172.html","post_id":7495504172,"result_date":"2022-06-12 09:43","title":"remodeled Studio apartment in Bethlehem","description":"please, Give me your phone number ...\nThis is a Studio apartment that has been completely remodeled with all the current new trend materials. Coin operated washer and dryer available.","num_images":4.0,"lat":40.6622,"lng":-75.3903,"attrs":"['1BR \/ 1Ba', '500ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T08:59:17-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-rent800gorgeous-br-ba\/7495509744.html","post_id":7495509744,"result_date":"2022-06-12 09:34","title":"~!!@@RENT$800.....Gorgeous 3 BR 1 BA Apartment in Thriving Lancaster!","description":"Gorgeous 3 BR 1 Bath\nApartment in Thriving Lancaster! - Welcome to this stunning, fully renovated Apartment in Lancaster City! Enter into the large family room area that spills into the dining room. You will notice new plank flooring throughout, fresh paint and crisp white trim. The kitchen features granite countertops and a deep sink with gooseneck brushed nickel faucet and extractable hose. Plenty of storage space in the basement with a washer\/dryer hook ups.\nCall\/text (973) 318-19^83 for a quicker response\nGood income+ good credit(600+)\nRoommates\/guarantors welcome\nThe rent is $800\/month with water, sewer, landscaping, lawn service and snowplowing included. The house is also furnished with appliances (fridge, microwave, stove, oven, washer\/dryer) which will be available for you.\n","num_images":6.0,"lat":40.0335,"lng":-76.2844,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T09:18:39-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/newark-heat-and-hot-water-included\/7495509463.html","post_id":7495509463,"result_date":"2022-06-12 09:21","title":"Heat and hot water included!","description":"Beautiful 1 bedroom apartment located in North Newark (near Belleville). Great for commuters just a 12 minute ride to Newark Penn Station.\n-no realtor fee, no application fee\n-updated bathroom\n-laundry room\n-hardwood floors\nAddress: 810 Broadway Newark NJ 07104\nAsking: $1,375 per month\nRequirements: first month rent, one month security deposit ($2,750) to move in\nQualifications: pay stubs showing $2,900 monthly after taxes\nContact James:  show contact info\n(please text) or apply online for free and get pre approved @\nwww.SJHrealty.com\n","num_images":17.0,"lat":40.7664,"lng":-74.1695,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T09:17:37-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/smyrna-renting-3-bedroom-and-full-bath\/7495497188.html","post_id":7495497188,"result_date":"2022-06-12 08:51","title":"Renting a 3 bedroom and 2 full bath home in Smyrna. For rent by owner","description":"Renting a 3 bedroom and 2 full bath home in Smyrna. For rent by owner. This home offers central air and gas heating with an updated kitchen and offstreet parking and a garage with loft area. Large backyard with a small walnut tree farm in the rear which the renter has access to which offers additional privacy and a great space to relax or entertain. Monthly rent is $1,575 per month.","num_images":4.0,"lat":39.299819,"lng":-75.610852,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T08:26:02-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-where-luxury-meets\/7495488214.html","post_id":7495488214,"result_date":"2022-06-12 07:32","title":"Where Luxury Meets Convenience","description":"Available: 7\/30\/22\nApt. 1101 — Manchester floor plan — 1,149 sq. ft. — $3,188\nLocated on the 1st floor, this 2-bedroom\/2-bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full sized front-loading washer and dryer, and stainless steel appliances. The large master bedroom is equipped with a private patio, a walk-in closet and a spacious bathroom with double sink vanity and walk in shower. The second bedroom and bathroom are spacious as well!  This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T07:28:05-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-spacious-bedroom-bath-apartment\/7495486141.html","post_id":7495486141,"result_date":"2022-06-12 07:12","title":"Spacious 2 Bedroom 1 Bath apartment for rent in Newark!","description":"Spacious 2 Bedroom 1 Bath apartment for rent in Newark! Two bedroom apartment available now, minutes away from the highway. Quiet and safe location with garage. Spacious cabinetry with large living room and beautiful bay window to enjoy the view. On site coin operated laundry and secure access building. The association covers water, trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained.","num_images":3.0,"lat":39.7011,"lng":-75.7375,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T07:08:15-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/emmaus-emmaus-offers-north-st\/7495481601.html","post_id":7495481601,"result_date":"2022-06-12 06:22","title":"EMMAUS OFFERS NORTH ST","description":"Nearly everything the borough has to offer, including breweries, a distillery, movie theatre, historic sites, terrific dining options, the wildlands conservancy and so much more are all within an easy walk. North st. offers the perfect location to begin the adventure. Affordable, with gas heat and low taxes,  this terrific cape cod comes complete with a detached garage, fenced yard and inviting eat in kitchen. Within walking distance to most school.","num_images":5.0,"lat":40.5293,"lng":-75.501,"attrs":"['1BR \/ 1Ba', '703ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T06:13:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bed-bath-end-unit\/7495743203.html","post_id":7495743203,"result_date":"2022-06-12 19:00","title":"Large 1 bed\/1 bath end unit townhome in Philadelphia!","description":"Large 1 bedroom\/1 bath end unit townhome in Philadelphia! . Large kitchen w\/d bar & Separate dining room, Spacious Family room, Laundry room w\/d washer & dryer, Attached Garage, big deck w\/d fenced treed yard. $500 per month, Available now, Features beautiful hardwood and slate flooring throughout, an open kitchen with granite slab countertops and stainless steel appliances, full-sized washer\/dryer set, and spacious bedrooms that accommodate a king-size bed. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS The kitchen features tile backsplash with glass in lay, lighting above & under cabinets, breakfast bar and full pantry. Ceramic tile flooring in kitchen, stairs, foyer and part of the lower level. Dining room has sliding glass door to balcony. Double doors to 2nd bedroom\/office. Master bedroom features vaulted ceiling and a walk in closet. The shared master\/hall bath features a soaking tub, linen closet and double sinks. Lower level has family room, 2rd bedroom, full bath, laundry room and crawl space off a walk in closet. 2 car attached heated garage. Walking distance to elementary school, junior high school, high school, Eola community center and library. from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented.","num_images":3.0,"lat":39.9227,"lng":-75.1812,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T18:56:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-comfortable-2br-2ba-new\/7495742294.html","post_id":7495742294,"result_date":"2022-06-12 18:57","title":"Comfortable  2Br - 2BA w\/ New kitchen.!","description":"Comfortable two Bedroom with two Bathroom apartment in Philadelphia!. Large kitchen w\/d bar & Separate dining room, Spacious Family room, Laundry room w\/d washer & dryer, Attached Garage, big deck w\/d fenced treed yard. $750 per month, Available now, Features beautiful hardwood and slate flooring throughout, an open kitchen with granite slab countertops and stainless steel appliances, full-sized washer\/dryer set, and spacious bedrooms that accommodate a king-size bed. The master bedroom offers double closets plus double sinks in the master bath and a shower. In the backyard,, you will find a covered patio plus 2 storage buildings, both with electricity. Plenty of room for entertaining, gardening,, raising chickens and so much more! The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented.","num_images":4.0,"lat":40.0365,"lng":-75.1451,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T18:53:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bath-apt\/7495697406.html","post_id":7495697406,"result_date":"2022-06-12 18:51","title":"Beautiful 2 bedroom\/1 bath Apt Rent $900","description":"Beautiful 2 bedroom\/1 bath end unit townhome in award winning Philadelphia. 2 story foyer upon entry. A spacious kitchen opens to the dining\/living rooms with vaulted ceilings. The kitchen features tile backsplash with glass in lay, lighting above & under cabinets, breakfast bar and full pantry. Ceramic tile flooring in kitchen, stairs, foyer and part of the lower level. Dining room has sliding glass door to balcony. Double doors to 2nd bedroom\/office. Master bedroom features vaulted ceiling and a walk in closet. The shared master\/hall bath features a soaking tub, linen closet and double sinks. Lower level has family room, 2rd bedroom, full bath, laundry room and crawl space off a walk in closet. 2 car attached heated garage. Walking distance to elementary school, junior high school, high school, Eola community center and library","num_images":5.0,"lat":39.954221,"lng":-75.170013,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:52:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-now-spacious-bed\/7495727646.html","post_id":7495727646,"result_date":"2022-06-12 18:28","title":"Available Now Spacious 2 Bed - 1 Bath apartment Philadelphia","description":"Available Now Spacious 2 Bed - 1 Bath apartment Philadelphia Pets welcomed. one single car garage and one outside parking stall. Rent is $650. Reserved parking in front. Near Hospital, school, Close to all major highways and transportation, and downtown.This beautiful apartment features kitchen appliances, nicely renovated bathroom, hardwood floors, laundry in building available, elevator in building, and heat and hot water included! Near public transportation, schools, local parks, shopping centers and close to major highways. Fully furnished, this beautiful unit shows like a model and was professionally designed and furnished This building was majorly renovated over recent years & is meticulously maintained. Text for more information show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.household must earn less than 80% area median income (AMI) & meet household size requirements. All prospective rental's must be approved with DHCD. Reach out to listing agent to receive income eligibility paperwork & property disclosures. you will find a covered patio plus 2 storage buildings, both with electricity. Plenty of room for entertaining, gardening,, raising chickens and so much more! Separate from the other bedrooms, you will find an oversized bedroom and walk-in closet that could be a game room or converted to a separate mother-in-law suite. All this and more so make this one yours today!! Handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. The association covers water, trash, association insurance, hot water, and exterior maintenance. Text for more information (425) 523-171+8\n","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T18:11:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-south-philly-3rd-fl\/7495706093.html","post_id":7495706093,"result_date":"2022-06-12 17:18","title":"Modern South Philly 3rd Fl 2 Bed Apt! H\/W Fls! Beautiful place!","description":"Modern South Philly 3rd Fl. 2 Bed Apt. H\/W, beautiful tile work and more! Walk in to a large living room, dining room, and modern eat-in kitchen with hooded gas range and refrigerator. Beautiful tile work in the kitchen. Formica countertops. There are 2 nice-sized bedrooms and closets and a full 3-piece ceramic tile bathroom. Good light and window space throughout! Views of the Ballpark can be seen from the front bedroom! Sorry no laundry. Radiator Gas Heat. Tenant to supply their own AC units. Come see! Tenant pays gas, electric, cable\/internet and a flat part of the cold water\/sewer bill. Cats and small dogs OK with upfront non refundable fee. 1 year lease minimum. 1st, last and security due at lease signing. A must see! $75 application fee non refundable - two paystubs\/income verification and photo ID. We run a credit, criminal and eviction check. We look for gross monthly income of 3x the rent. Available now! Contact Mike Giordano at  show contact info\n!","num_images":14.0,"lat":39.921728,"lng":-75.158997,"attrs":"['2BR \/ 1Ba', '800ft2', 'available now', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T17:14:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cute-passyunk-square\/7495699893.html","post_id":7495699893,"result_date":"2022-06-12 17:03","title":"Cute Passyunk Square 2 Bedroom Home! Yard! Very quaint place! Come see","description":"Cute Passyunk Square 2 Bedroom House! Walk in a large living room\/dining room combo with new rugs. Freshly painted throughout. Large kitchen with good amount of cabinet and countertop space and a gas range and refrigerator. Nice-sized back yard! The basement is unfinished with dryer (no washer). The second floor has new rugs and 2 nice-sized bedrooms with closets. There is a big bathroom as well. Gas radiator heat. Tenant to supply their own AC units. Nice natural light and good window space! Available now! Tenant pays gas, electric, cold water\/sewer, and cable\/internet. 1st, last and security due at lease signing. 1 year lease minimum. $75 non refundable application fee can be completed online at www.forresterpropertymgmt.com with Two paystubs\/some income verification and photo ID with application. We run a credit, criminal and eviction check. We look for gross monthly income of 3x the rent. If approved, you will be charged a document preparation fee of $100.00. THIS FEE IS NON-REFUNDABLE. Each resident over the age of 18 must submit a separate rental application. Small dogs below 25lbs and cats OK with non-refundable pet fee. Contact Mike Giordano at  show contact info\n!","num_images":17.0,"lat":39.929987,"lng":-75.158314,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $100', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:59:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-bed-passyunk-square\/7495694175.html","post_id":7495694175,"result_date":"2022-06-12 16:49","title":"Modern 2 Bed. Passyunk Square\/Italian Market Area Home! Yard! H\/W Fls!","description":"Modern Italian Market\/Passyunk Square 2 Bedroom Home with H\/W fls, Yard and more! Walk in to a large living room\/dining room combo with new floors. Modern Kitchen with granite countertops and tile backsplash. Gas range and refrigerator are included. There is nice-sized rear yard. Large and finished basement with rear mechanical room and W\/D. The second floor has 2 nice-sized bedrooms with closets and a full 3-piece ceramic tile bathroom. Beautiful place! Gas radiator heat! Tenant to supply their own AC units. Lots of windows and good natural light throughout this house! Make your appointment today! Come see before it's gone! Gorgeous Home! Cats and Small dogs under 25 lbs. are ok. with a non-refundable Pet Fee. Tenant pays gas, electric, cold water\/sewer, and cable\/internet. 1st, last and security due at lease signing. 1 year lease minimum. $75 non-refundable application fee with two paystubs\/some income verification and photo ID - we run a credit, criminal and eviction check. We look for gross monthly income of 3x the rent. Each resident over the age of 18 must submit a separate rental application.  If approved, you will be charged a document preparation fee of $100.00. THIS FEE IS NON-REFUNDABLE. Available now! Contact Mike Giordano at  show contact info\n!","num_images":19.0,"lat":39.933525,"lng":-75.157916,"attrs":"['2BR \/ 1Ba', '1100ft2', 'available now', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $100', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:45:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-6012-market-st\/7495673746.html","post_id":7495673746,"result_date":"2022-06-12 16:46","title":"2 bedroom 6012 Market st","description":"This is a nice spacious home for anyone who wants to enjoy the city at an affordable price. Transportation is 5 mins away from center city, about 15 minutes driving.","num_images":21.0,"lat":39.962,"lng":-75.241,"attrs":"['2BR \/ 1Ba', 'available now', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T15:57:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-apt-in-south\/7495666376.html","post_id":7495666376,"result_date":"2022-06-12 16:41","title":"Large 3 Bedroom Apt. in South Philly","description":"1200 SqFt 3 Bedroom Apt. - Large family room area leading into a Kitchen. - Granite countertops, lots of kitchen storage. - Breakfast nook. Microwave, Oven, Frig., garbage disposal. - All new floors - 2 large bedrooms, and a third smaller one, could be used as a bedroom or office. - Washer and Dryer on the premises. - Great location in South Philly, short commute to either the Navy Yard or Center City. Close to public transportation, entertainment, and shopping. - Contact Kevin to take a look. Text :~ ‪‪‪(573) 32six-9387‬\nApartamento de 3 habitaciones de 1200 pies cuadrados. - Amplia área de sala familiar que conduce a una cocina. - Encimeras de granito, mucho espacio de almacenaje en la cocina. - Rincón de desayuno. Microondas, horno, frigorífico, triturador de basura. - Todos los pisos nuevos - 2 dormitorios grandes, y un tercero más pequeño, podría usarse como dormitorio u oficina. - Lavadora y secadora en las instalaciones. - Excelente ubicación en el sur de Filadelfia, a poca distancia del Navy Yard o del centro de la ciudad. Cerca del transporte público, entretenimiento y tiendas. - Póngase en contacto con Kevin para echar un vistazo. Texto :~ (573) 32six-9387\n","num_images":1.0,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T15:39:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bath-end\/7495640714.html","post_id":7495640714,"result_date":"2022-06-12 16:30","title":"Beautiful 3 bedroom\/2 bath end unit townhome in award winning Philadel","description":"Beautiful 3 bedroom\/2 bath end unit townhome in award winning Philadelphia 204 Schools. 2 story foyer upon entry. A spacious kitchen opens to the dining\/living rooms with vaulted ceilings. The kitchen features tile backsplash with glass in lay, lighting above & under cabinets, breakfast bar and full pantry. Ceramic tile flooring in kitchen, stairs, foyer and part of the lower level. Dining room has sliding glass door to balcony. Double doors to 2nd bedroom\/office. Master bedroom features vaulted ceiling and a walk in closet. The shared master\/hall bath features a soaking tub, linen closet and double sinks. Lower level has family room, 3rd bedroom, full bath, laundry room and crawl space off a walk in closet. 2 car attached heated garage. Walking distance to elementary school, junior high school, high school, Eola community center and library","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2Ba', '988ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T14:41:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bedroom-bath\/7495677584.html","post_id":7495677584,"result_date":"2022-06-12 16:30","title":"Gorgeous 2 Bedroom 1 Bath ready for Apartment rent in philadelphia !!","description":"Gorgeous 2 Bedroom 1 Bath ready for Apartment rent in philadelphia !! Features beautiful hardwood and slate flooring throughout, an open kitchen with granite slab countertops and stainless steel appliances, full-sized washer\/dryer set, and spacious bedrooms that accommodate a king-size bed. The master bedroom offers double closets plus double sinks in the master bath and a shower. In the backyard,, you will find a covered patio plus 2 storage buildings, both with electricity. Plenty of room for entertaining, gardening,, raising chickens and so much more! Separate from the other bedrooms, you will find an oversized bedroom and walk-in closet that could be a game room or converted to a separate mother-in-law suite. All this and more so make this one yours today!! Handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. The association covers water, trash, association insurance, hot water, and exterior maintenance. Text for more information  show contact info","num_images":4.0,"lat":39.9523,"lng":-75.1638,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:05:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-renovated\/7495685612.html","post_id":7495685612,"result_date":"2022-06-12 16:28","title":"Beautifully renovated apartment with roof top deck","description":"Beautifully renovated 1 bedroom apartment with large roof top deck overlooking the city.  Fresh paint, new carpets in bedroom, luxury plank floor in living room and kitchen area.  Storage closet in living room.  New tile in bathroom.  $815 + utilities","num_images":9.0,"lat":40.02533,"lng":-75.042788,"attrs":"['1BR \/ 1Ba', '600ft2', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:24:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/king-of-prussia-brs-25-baths1-car\/7495667825.html","post_id":7495667825,"result_date":"2022-06-12 16:24","title":"2 BRs, 2.5 baths,+1 car attached garage~ Tasteful finishes and neutra","description":"Highly desirable upgraded and bright end unit Rebel Hill townhome on one of the nicest cul-de-sac lots in the development. This townhome has 2 BRs, 2.5 baths, primary bedroom with private bath, two walk in closets, upstairs laundry room, a sunny private deck and finished lower level and 1 car attached garage. Updated kitchen with granite counter tops and stainless stove. Tasteful finishes and neutral colors. Clean unit- shows beautifully","num_images":0.0,"lat":40.0956,"lng":-75.3737,"attrs":"['2BR \/ 2.5Ba', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T15:42:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/king-of-prussia-spacious-first-floor\/7495668931.html","post_id":7495668931,"result_date":"2022-06-12 16:18","title":"SPACIOUS FIRST FLOOR ONE BEDROOM AND ONE BATHROOM APARTMENT","description":"SPACIOUS FIRST FLOOR ONE BEDROOM AND ONE BATHROOM APARTMENT\nSPACIOUS FIRST FLOOR APARTMENT LOCATED WITHIN THE EAGLES NEST APARTMENT BUILDING ON EASTERN MICHIGAN CAMPUS AREA. THIS APARTMENT HAS ONE BEDROOM AND ONE BATHROOM WITH FRESH PAINT AND NEW FLOORING. ONE OFF STREET PARKING SPOT IS INCLUDED IN THE MONTHLY RENT AMOUNT. ON SITE LAUNDRY FACILITIES ARE LOCATED IN THE THE BUILDING. THIS IS A PET AND SMOKE FREE BUILDING.\nYOU WILL NOT FIND A LARGER ONE BEDROOM APARTMENT FOR THE PRICE!\n","num_images":0.0,"lat":40.0956,"lng":-75.3737,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T15:45:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-home-is-well-built\/7495654495.html","post_id":7495654495,"result_date":"2022-06-12 16:18","title":"This home is well-built home for rent!!!","description":"Welcome to Griffith Street, a move-in ready Rhawnhurst stunner! This home is well-built with quality craftsmanship and has been meticulously maintained through the years. Perfectly situated on a corner lot, this home is on a quiet, tree-lined street with proximity to shopping and dining and is steps away from Rhawnhurst Elementary Public School. You will feel right at home as soon as you step through the front door into the bright and welcoming living room, which is a wonderful place to relax, watch television, read or spend time with family and friends. The dining room is perfect for entertaining and features large windows that allow warm, natural light to brighten the space. A cozy den is also found on the main floor and could be utilized in many ways such as an office, playroom, or additional living space. Gorgeous original hardwood floors are found throughout the home, creating a nice flow from room to room. If you interested send me your phone number or email!!\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nThere is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. NO PRIOR EVICTIONS. CREDIT AND BACKGROUND CHECK REQUIRED FOR EACH PERSON OVER 18.\n$25 APPLICATION fee for each APPLICANT..As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. Text for more information","num_images":8.0,"lat":40.0606,"lng":-75.0471,"attrs":"['4BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T15:12:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-hardwood-flooring-ice\/7495680545.html","post_id":7495680545,"result_date":"2022-06-12 16:16","title":"Hardwood Flooring, Ice Maker, Courtyard","description":"Thank you for your interest in leasing an Apartment Home at Lincoln Square!\n\nOur community features Studio through Three Bedroom apartment homes to be leased for terms between 5-months and 15-months.\n\nIn addition to our beautiful apartment homes, our community features an abundance of amenities including our Fitness Center and Yoga Room, Community Lounge Area, Private Movie Theater, a state-of-the-art Golf Simulator and including but not limited to our 50,000 Square Foot Rooftop Deck, which houses a Dog Park, Running Track, remarkable city views and so much more! Bedrooms: 0Bathrooms: 1Square Feet: 394Date Available: 2022-06-12Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Copy and Fax ServicesIn-Unit LaundryWindow CoveringsClose to Public TransportationBBQ\/Picnic AreaOpen-ConceptRooftop DeckSecurity CameraOn-Site MaintenanceGuest RoomAir ConditioningWired for TechnologyCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/7vqeeohc\/lincoln-square\nI am available for both Virtual and In-Person Tours from Sunday through Thursday within our office hours and we are currently offering some amazing deals I would love to assist you in securing.\nFeel free to reach out to our team at your convenience to let us know how you'd like to proceed. We'll be standing by!\nKindest Regards,\n\nStephen Fortune-Stewart\nLeasing Professional\nshow contact info\n\n","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['0BR \/ 1Ba', '394ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: 75', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: APG Living | Alterra Property Group,', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T16:12:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-two-bedroom-with\/7495676298.html","post_id":7495676298,"result_date":"2022-06-12 16:14","title":"@@+++Beautiful two bedroom with washer and dryer in Philadelphia! @@++","description":"Beautiful two bedroom with washer and dryer in Philadelphia! Contact me to schedule a viewing  show contact info\nSpacious south facing 1 bedroom with natural light all day long!! Washer\/dryer hook-up in the unit and wood floors throughout. Large balcony perfect for relaxing after work in the warm weather. Heat, hot water, and AC included in the rent! Inquire about our new policy. The association covers water, trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. Welcome to your Move-in-ready Apartment, 1 Bedroom, 1 Bath, Beautiful kitchen, Stainless steel appliances, Spacious living room, Hardwood Floors, Dedicated home office, 5 years young architectural shingled roof, Double pane American Craftsman by Anderson replacement windows, Corner lot, Outdoor entertainment area, Fenced-in backyard, Detached garage, Security cameras and system. Contact me to schedule a viewing  show contact info","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:02:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/berwyn-furnished-1bed-1bath-apartment\/7495676267.html","post_id":7495676267,"result_date":"2022-06-12 16:12","title":"furnished 1bed\/1bath apartment for rent","description":"A furnished 1 bed\/1 bath in-law suite at Mainline (Berwyn, PA) to rent starting August 1, 2022. Very good privacy. In a safe neighborhood and convenient location: walking distance to the Upper Main Line YMCA and R5 train station. The in-law suite:\n-\tHas two private outside entrances\n-\tHas a private nice back deck nestled in trees\n-\tIs separated from the main house by two double doors from both sides\n-\tHas a living-dinning room, a bedroom, a full bathroom and a kitchen.\n-\tHardwood floors in the living\/dinning room and the kitchen; Carpet in the bedroom.\n-\tThe bedroom has a large closet; the living room also has a closet.\n-\tRefrigerator, dishwasher, micro oven and private laundry (washer and dryer) are provided.\n-\tRent: 1150$\/month covering all unities, wireless high speed and trash. One year lease.\n-\tPlease text  show contact info\nif interested.","num_images":7.0,"lat":40.036387,"lng":-75.457557,"attrs":"['1BR \/ 1Ba', 'available aug 1', 'air conditioning', 'furnished', 'in-law', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:02:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-two-bedroom-with\/7495676293.html","post_id":7495676293,"result_date":"2022-06-12 16:11","title":"@@+++Beautiful two bedroom with washer and dryer in Philadelphia! @@++","description":"Beautiful two bedroom with washer and dryer in Philadelphia! Contact me to schedule a viewing  show contact info\nSpacious south facing 1 bedroom with natural light all day long!! Washer\/dryer hook-up in the unit and wood floors throughout. Large balcony perfect for relaxing after work in the warm weather. Heat, hot water, and AC included in the rent! Inquire about our new policy. The association covers water, trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile backsplash. There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. Welcome to your Move-in-ready Apartment, 1 Bedroom, 1 Bath, Beautiful kitchen, Stainless steel appliances, Spacious living room, Hardwood Floors, Dedicated home office, 5 years young architectural shingled roof, Double pane American Craftsman by Anderson replacement windows, Corner lot, Outdoor entertainment area, Fenced-in backyard, Detached garage, Security cameras and system. Contact me to schedule a viewing  show contact info","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T16:02:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/king-of-prussia-bed-bath-condoking-of\/7495668470.html","post_id":7495668470,"result_date":"2022-06-12 16:10","title":"2 BED\/2 BATH CONDO+King of Prussia Mall,~ALL utilities~","description":"Welcome to Valley Forge Towers! This 10th floor condo includes ALL utilities in the rent (except internet) and features an open-concept living area, large kitchen, in-unit washer and dryer, and two full bathrooms and bedrooms. The building has an elevator, gym, and a doorperson. Located within easy distance to the King of Prussia Mall, Wegmans, and the Town Center, you have everything you need to make this condo home.","num_images":0.0,"lat":40.0956,"lng":-75.3737,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T15:44:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bath-end\/7495640779.html","post_id":7495640779,"result_date":"2022-06-12 16:04","title":"Beautiful 2 bedroom\/1 bath end unit townhome in award winning Philadel","description":"Beautiful 2 bedroom\/1 bath end unit townhome in award winning Philadelphia. 2 story foyer upon entry. A spacious kitchen opens to the dining\/living rooms with vaulted ceilings. The kitchen features tile backsplash with glass in lay, lighting above & under cabinets, breakfast bar and full pantry. Ceramic tile flooring in kitchen, stairs, foyer and part of the lower level. Dining room has sliding glass door to balcony. Double doors to 2nd bedroom\/office. Master bedroom features vaulted ceiling and a walk in closet. The shared master\/hall bath features a soaking tub, linen closet and double sinks. Lower level has family room, 2rd bedroom, full bath, laundry room and crawl space off a walk in closet. 2 car attached heated garage. Walking distance to elementary school, junior high school, high school, Eola community center and library","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', '988ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T14:41:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lovely-home-in-the-philadelphia-area\/7495656922.html","post_id":7495656922,"result_date":"2022-06-12 15:57","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this\/7495654589.html","post_id":7495654589,"result_date":"2022-06-12 15:50","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/chester-bedroom\/7495668190.html","post_id":7495668190,"result_date":"2022-06-12 15:47","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fitness-center-dog-park\/7495667192.html","post_id":7495667192,"result_date":"2022-06-12 15:45","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-very-well-maintained-3bd\/7495653985.html","post_id":7495653985,"result_date":"2022-06-12 15:31","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-more-question\/7495629981.html","post_id":7495629981,"result_date":"2022-06-12 14:47","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-putting-green-pet-spa\/7495635536.html","post_id":7495635536,"result_date":"2022-06-12 14:34","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-professionally-managed\/7495635359.html","post_id":7495635359,"result_date":"2022-06-12 14:34","title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nWhen you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closets, washer\/dryer, master suite, and spacious walk-in closets!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['3BR \/ 2Ba', '1202ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T14:30:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-come-look-and-lease-package\/7495635001.html","post_id":7495635001,"result_date":"2022-06-12 14:33","title":"Come Look and Lease, Package Acceptance, Resort Style Pool","description":"Lease today at The Point at Pennbrook Station in Lansdale, PA. Come home to convenience. With a modern, open-plan kitchen and meticulous stainless steel appliances, making dinner is easier (and more exciting) than ever. Call for details!\nThis second floor three bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, linen closet, walk-in closet, laundry room with washer\/dryer, an attached garage downstairs with direct access and a private porch!\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nThe Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nApartment Features\n* Refrigerator\n* Microwave\n* Granite Countertops\n* Stainless Steel Appliances\n* Dishwasher\n* Central Heat and Air\n* Full sized Washer and Dryer in unit\n* Disposal\n* Wood-Like Floors\n[#9264839]","num_images":11.0,"lat":40.226234,"lng":-75.283466,"attrs":"['2BR \/ 2Ba', '1027ft2', 'available jul 23', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T14:29:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2bed-1bath-home-available\/7495629015.html","post_id":7495629015,"result_date":"2022-06-12 14:28","title":"2Bed\/1Bath Home Available Now!","description":"2Bed\/1Bath Home Available Now! – 1.2 miles from Park Plaza! This -2 bedroom\/1-bath Living in Philadelphia. Screened-in back porch, private backyard, central heat & air, hardwood floor son site coin operated laundry and secure access building. The association covers water, trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled bright white kitchen with shaker cabinets, new appliances and white tile. Thank you so much. There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. REPLY EMAIL TEXT::There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained. REPLY EMAIL TEXT::There is a dining area with a ceiling fan, a living room, an entry area with space for an open office, a fireplace with gas logs, sliders out to the good-sized balcony with a storage shed, a nice bedroom, and two closets make up the hallway into a spacious bathroom with 2 sinks. As you walk into the condo you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. THIS EXCEPTIONAL OCEANFRONT STUDIO FEATURES MILLION-DOLLAR VIEWS from every window and balcony and is one of the most desirable locations in the building. From this 7th floor corner condo you can enjoy spectacular sunrises over the ocean, serene sunsets over Lake Gerar and endless views of the coastline. Being sold fully furnished, this beautiful unit shows like a model and was professionally designed and furnished by J. Conn Scott with designer finishes and furniture, an all-new kitchen, marble countertops and backsplash, new cabinetry and appliances, new windows and sliding door. The outstanding condition of this studio shows that it has been rarely occupied & never rented. This building was majorly renovated over recent years & is meticulously maintained.","num_images":3.0,"lat":40.0343,"lng":-75.1213,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T14:15:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-custom-cabinetry-spacious\/7495630321.html","post_id":7495630321,"result_date":"2022-06-12 14:22","title":"Custom Cabinetry, Spacious Floorplans, Close to Shopping","description":"Thank you for your interest in leasing an Apartment Home at Lincoln Square!\n\nOur community features Studio through Three Bedroom apartment homes to be leased for terms between 5-months and 15-months.\n\nIn addition to our beautiful apartment homes, our community features an abundance of amenities including our Fitness Center and Yoga Room, Community Lounge Area, Private Movie Theater, a state-of-the-art Golf Simulator and including but not limited to our 50,000 Square Foot Rooftop Deck, which houses a Dog Park, Running Track, remarkable city views and so much more! Bedrooms: 2Bathrooms: 2Square Feet: 1050Date Available: 2022-06-12Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Energy Efficient AppliancesKitchen IslandRooftop DeckRefrigerator with Ice MakerOn-Site MaintenanceWired for TechnologyWindow CoveringsFitness CenterDishwasherElevatorNight PatrolYoga StudioCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/s4dhaqvx\/lincoln-square\nI am available for both Virtual and In-Person Tours from Sunday through Thursday within our office hours and we are currently offering some amazing deals I would love to assist you in securing.\nFeel free to reach out to our team at your convenience to let us know how you'd like to proceed. We'll be standing by!\nKindest Regards,\n\nStephen Fortune-Stewart\nLeasing Professional\nshow contact info\n\n","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '1050ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: 75', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: APG Living | Alterra Property Group,', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T14:18:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-quiet-and-safe-bed-bath\/7495629004.html","post_id":7495629004,"result_date":"2022-06-12 14:19","title":"Quiet and safe : 1 Bed \/ 1 Bath","description":"Rochester Available June 15th - 1 bedroom 1 bath. Large kitchen, full size washer\/dryer, natural gas fireplace in living room, one single car garage and one outside parking stall. Rent is $670. Renovated apartment with parking, Washer\/dryer, Central AC, stainless steel appliances, backyard balcony, skylights and backyard access conveniently located to public transportation. Minutes away from the highway. Quiet and safe location with garage. Spacious cabinetry with large living room and beautiful bay window to enjoy the view. The association covers water, trash, association insurance, hot water, and exterior maintenance. Ready to move in. Bedroom large enough for a king size bed and furniture. Big enough for a king size bed and furniture. Sunroom or office with a Fiber connection. Kitchen includes stove, refrigerator, dish washer, disposal, and microwave. Reserved parking in front. As you walk into the apartment you will notice a bright entry and a closet for your stackable washer\/dryer unit. The unit section is handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. Consider this affordable apt in a great location and enjoy all that. Handicapped (confirm to code) accessible with a ramp going all the way from handicapped parking spaces to the front door. The association covers water, trash, association insurance, hot water, and exterior maintenance.","num_images":3.0,"lat":40.0343,"lng":-75.1213,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T14:15:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-stainless-steel-appliances\/7495624397.html","post_id":7495624397,"result_date":"2022-06-12 14:09","title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"The Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T14:05:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/trenton-bed-bath-utilities-included-on\/7495619149.html","post_id":7495619149,"result_date":"2022-06-12 13:57","title":"$1900 2 BED, 2 BATH, UTILITIES INCLUDED! On the CANAL!!!","description":"Condo located in beautiful Yardley Borough in Bucks County.  Access to the canal path and walking distance to Yardley Train Station, Macclesfield Park, restaurants and stores. Award winning Pennsbury School district.\nElectric and water included.\nW\/D in unit\nSmartMove Background\/Credit check applies for all applicants","num_images":4.0,"lat":40.235205,"lng":-74.826543,"attrs":"['2BR \/ 2Ba', 'available jul 1', 'application fee details: Credit Check Fee', 'dogs are OK - wooof', 'condo', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T13:53:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-laundry-in-unit-central\/7495595883.html","post_id":7495595883,"result_date":"2022-06-12 13:05","title":"Laundry in Unit, Central Location, Ideal Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nCommunity Features\n* Bark Park\n* Community Lounge\n* Professionally Managed\n* Billiards\n* Yoga Lounge\n* Easy Freeway Access\n* Sun Deck\n* Spa\n* Pet Salon\n* Minutes from Restaurants, Shopping, and Much More\n* TV Lounge\n* Swimming Pool\n* Outdoor Grill Area\n* Fitness Studio\n[#9264669]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1186ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T13:01:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fitness-center-incredible\/7495595608.html","post_id":7495595608,"result_date":"2022-06-12 13:04","title":"Fitness Center, Incredible Features, Central Location","description":"Be the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nCommunity Features\n* Fitness Studio\n* Professionally Managed\n* Outdoor Grill Area\n* Swimming Pool\n* TV Lounge\n* Yoga Lounge\n* Billiards\n* Minutes from Restaurants, Shopping, and Much More\n* Spa\n* Community Lounge\n* Pet Salon\n* Sun Deck\n* Bark Park\n* Easy Freeway Access\n[#9264547]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '815ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T13:00:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-yoga-and-ballet-studio\/7495584672.html","post_id":7495584672,"result_date":"2022-06-12 12:40","title":"Yoga and Ballet Studio, Visit Your New Home, Leasing Now","description":"The Point at Glen Mills offers all of the amenities your looking for and some you didn't even know you wanted. Check out our two-story clubhouse-complete with flat screen TVs, a 24-hour fitness center and a pool table. Enjoy our on-site yoga studio or our outdoor putting green. Visit us today!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nApartment Features\n* Granite Countertops\n* Full sized Washer and Dryer in unit\n* Extra Storage\n* Private Patio or Private Balcony (on select apartments)\n* Wood-Like Floors\n[#9264724]","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-12T12:36:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-package-receiving-carpeted\/7495582653.html","post_id":7495582653,"result_date":"2022-06-12 12:35","title":"Package Receiving, Carpeted, Disability Access","description":"Thank you for your interest in leasing an Apartment Home at Lincoln Square!\n\nOur community features Studio through Three Bedroom apartment homes to be leased for terms between 5-months and 15-months.\n\nIn addition to our beautiful apartment homes, our community features an abundance of amenities including our Fitness Center and Yoga Room, Community Lounge Area, Private Movie Theater, a state-of-the-art Golf Simulator and including but not limited to our 50,000 Square Foot Rooftop Deck, which houses a Dog Park, Running Track, remarkable city views and so much more! Bedrooms: 3Bathrooms: 2Square Feet: 1155Date Available: 2022-06-12Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:PantryOnline Service RequestsLarge ClosetAir ConditioningBBQ\/Picnic AreaSundeck and Lounge AreaFire PitWired for TechnologyRooftop DeckElevatorPrivate BalconySoaker TubCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/gtuv5m2e\/lincoln-square\nI am available for both Virtual and In-Person Tours from Sunday through Thursday within our office hours and we are currently offering some amazing deals I would love to assist you in securing.\nFeel free to reach out to our team at your convenience to let us know how you'd like to proceed. We'll be standing by!\nKindest Regards,\n\nStephen Fortune-Stewart\nLeasing Professional\nshow contact info\n\n","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '1155ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: 75', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: APG Living | Alterra Property Group,', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T12:31:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-move-in-now-near-train-station\/7495582513.html","post_id":7495582513,"result_date":"2022-06-12 12:35","title":"Move In Now, Near Train Station, Pet Friendly","description":"VIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nThe Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nLease today at The Point at Pennbrook Station in Lansdale, PA. Come home to convenience. With a modern, open-plan kitchen and meticulous stainless steel appliances, making dinner is easier (and more exciting) than ever. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, entry closet, walk-in closets, laundry room with washer\/dryer, and a private porch!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm","num_images":12.0,"lat":40.226234,"lng":-75.283466,"attrs":"['2BR \/ 2Ba', '1206ft2', 'available aug 6', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T12:31:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-center-city\/7495582334.html","post_id":7495582334,"result_date":"2022-06-12 12:35","title":"Beautiful Center City Studio with central air! W\/D in unit","description":"This beautifully renovated apt has in-unit w\/d, central air, a breathtaking working gas fireplace, and off-street parking for $250 a month. It's located in the heart of Center City just a block away from the broad street line subway stop, the Kimmel Center, and the Rittenhouse Market. Updated kitchen features new appliances including a dishwasher, microwave, garbage disposal and a gorgeous backsplash. The high ceilings are decorated with a stunning chandelier, and are nicely complemented by the huge floor to ceiling windows that let in a ton of natural light. Decorative gold trim adorns the chandelier and floor to ceiling mirror. Apartment has access to a lovely shared courtyard. Please Include your phone and email when you reply.","num_images":5.0,"lat":39.947229,"lng":-75.166747,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T12:31:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-summertime-and-the-living\/7495572799.html","post_id":7495572799,"result_date":"2022-06-12 12:13","title":"Summertime and the living (here) is easy!","description":"Available: 7\/30\/22\nApt. 1101 — Manchester floor plan — 1,149 sq. ft. — $3,188\nLocated on the 1st floor, this 2-bedroom\/2-bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full sized front-loading washer and dryer, and stainless steel appliances. The large master bedroom is equipped with a private patio, a walk-in closet and a spacious bathroom with double sink vanity and walk in shower. The second bedroom and bathroom are spacious as well!  This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T12:09:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cafe-cable-ready-recycling\/7495568303.html","post_id":7495568303,"result_date":"2022-06-12 12:02","title":"Cafe, Cable Ready, Recycling","description":"Thank you for your interest in leasing an Apartment Home at Lincoln Square!\n\nOur community features Studio through Three Bedroom apartment homes to be leased for terms between 5-months and 15-months.\n\nIn addition to our beautiful apartment homes, our community features an abundance of amenities including our Fitness Center and Yoga Room, Community Lounge Area, Private Movie Theater, a state-of-the-art Golf Simulator and including but not limited to our 50,000 Square Foot Rooftop Deck, which houses a Dog Park, Running Track, remarkable city views and so much more! Bedrooms: 3Bathrooms: 2Square Feet: 1427Date Available: 2022-06-12Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Conference RoomMicrowaveYoga StudioClose to ShoppingGuest RoomDog ParkFlexible Lease Terms AvailableHardwood FlooringFire PitElectric Car Charging StationsSoaker TubWalk-In ShowerCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/gkghorg7\/lincoln-square\nI am available for both Virtual and In-Person Tours from Sunday through Thursday within our office hours and we are currently offering some amazing deals I would love to assist you in securing.\nFeel free to reach out to our team at your convenience to let us know how you'd like to proceed. We'll be standing by!\nKindest Regards,\n\nStephen Fortune-Stewart\nLeasing Professional\nshow contact info\n\n","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '1427ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: 75', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: APG Living | Alterra Property Group,', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T11:58:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-oversized-bed-bath-apt-with\/7495556093.html","post_id":7495556093,"result_date":"2022-06-12 11:54","title":"Oversized 2 bed\/2 bath apt with 1160 sq ft, Refrigerator,in Upper Darb","description":"Oversized 2 bedroom 2 bath apt with 1160 sq ft lager room plus breakfast nook, in Upper Darby ,a security corner building, 2 blocks to Ocean Ave. Attractive landscaping and trees are found throughout. The association covers water, trash, association insurance, hot water, and exterior maintenance. The first level condo includes a newly remodeled. Reach me anytime","num_images":3.0,"lat":39.9579,"lng":-75.2681,"attrs":"['2BR \/ 2Ba', '1160ft2', 'available jul 1', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T11:29:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-2000sq-ft-bedroom\/7495557725.html","post_id":7495557725,"result_date":"2022-06-12 11:40","title":"Large 2000sq ft. 4 Bedroom Home","description":"Large 4 bedroom home in Ride & Allegheny Area. 1.5 baths. Modern steel appliances. Washer and Dryer, dishwasher. Front yard and patio. Stone countertops. New cabinets and carpeting. Available July 1st.","num_images":4.0,"lat":39.9954,"lng":-75.1698,"attrs":"['4BR \/ 1.5Ba', '2000ft2', 'available jul 1', 'application fee details: 35$ application fee', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T11:33:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-four-bed-room-and-two-bat\/7495547920.html","post_id":7495547920,"result_date":"2022-06-12 11:38","title":"FOUR BED ROOM AND TWO BAT ROOM","description":"Even Carlton Banks would live in this house on Carlton Place! Do you need four bedrooms? Check! Do you need a master suite? Check. This house even already has the color scheme that you want. Main level - Living Room, Formal Dining Room, Kitchen (white cabinets that are all the rage), half bathroom, and first floor laundry. Upstairs - Four Bedrooms, we already covered the master. The master bath isn't just a master batch, it's a Jack & Jill bathroom. Then there's the basement... party time. Fully finished. Not drop ceiling finished, but drywall finished. If you even need any more convincing there's the outside. Huge deck right off the kitchen. If you run out of space on the deck there is an entire separate concrete patio with firepit. Backyard is lined with trees for pricacy. One carage garage. Very walkable neighborhood with sidewalks.","num_images":17.0,"lat":40.0018,"lng":-75.1179,"attrs":"['4BR \/ 2Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T11:09:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/paoli-large-bedroom-malvern\/7495552586.html","post_id":7495552586,"result_date":"2022-06-12 11:25","title":"Large 1 Bedroom - Malvern","description":"Completely renovated one bedroom apartment a few blocks from downtown Malvern. Renovation will be complete between June 25th. This unit has it's own washer and dryer in the basement. SS appliances, garbage disposal, dishwasher in unit.  The basement can be used for additional storage. Heat and water are charged as a flat rate of $75\/month. Must have good credit 700+ and no pets.","num_images":3.0,"lat":40.038728,"lng":-75.503101,"attrs":"['1BR \/ 1Ba', '850ft2', 'available jul 1', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T11:21:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-25-bath-drexel\/7495551765.html","post_id":7495551765,"result_date":"2022-06-12 11:23","title":"5 Bedroom \/ 2.5 Bath Drexel House for Rent (Avail. Sept 1)","description":"Terrific college house for rent — current renters will be out before Sept 1st 2022.\n5 Bedrooms, 2.5 bath with, Large kitchen with granite counters and oversized patio out back.\nPlease contact me via text if interested!\nRented by Drexel Alumni.","num_images":0.0,"lat":39.9622,"lng":-75.1872,"attrs":"['5BR \/ 2.5Ba', '2500ft2', 'available sep 1', '\\nsaturday 2022-06-18\\n', 'air conditioning', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T11:19:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-neat-and-clean-renovated\/7495542683.html","post_id":7495542683,"result_date":"2022-06-12 11:20","title":"Neat and clean renovated apartment 2bed + 2 minutes to Market","description":"Neat and clean renovated apartment, Two Bed rooms, living room, Large kitchen room, full bath, and dining area with hallway. Very much friendly neighborhood, crime free borough, 30 seconds waking distance to Millbourne train station, 10 minutes walking distance to 69 or 63rd train station, 2 minutes to Market street bus station.\nRequirements:\n1. 1st, last months rents and $1800 deposit.\n2. Minimum Credit score 550 and Credit report.\n3. Proof of income minimum ($4400\/month) or $53000\/year.\n4. Copy of ID\/DL and SSN\n5. No pet allow.\n6. No section 8.\n7. No more than 4 people including kids.\n","num_images":0.0,"lat":39.9579,"lng":-75.2681,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T10:57:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-call-for-details-resort-style\/7495549972.html","post_id":7495549972,"result_date":"2022-06-12 11:19","title":"Call for Details, Resort Style Pool, Near Train Station","description":"The Point at Pennbrook Station has all the modern amenities in a great location. You will enjoy complimentary coffee, WiFi, and printing services in our clubhouse. or you can use our social hub, complete with computers and individual or communal workspaces, to work on your passion project. We have everything you need! Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar and pantry,  walk-in closet, laundry room with washer\/dryer, and a private porch!\nThe Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm\nCommunity Features\n* Fitness Studio\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Sun Deck\n* Short Term Lease Available\n* Easy Access to Public Transportation\n* Bark Park\n* Easy Freeway Access\n* Outdoor Grill Area\n* Swimming Pool\n* WiFi Access\n* Minutes from Restaurants, Shopping, and Much More\n* Community Kitchen\n* Package Acceptance\n* After-Hours Emergency Maintenance\n* Garage Parking\n* Community Lounge","num_images":12.0,"lat":40.226234,"lng":-75.283466,"attrs":"['1BR \/ 1Ba', '852ft2', 'available aug 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-12T11:15:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/darby-thorndale-upper-st-aldan\/7495534434.html","post_id":7495534434,"result_date":"2022-06-12 11:15","title":"THORNDALE UPPER ST ALDAN","description":"The home then flows to the dining room which is open to the highly efficient kitchen with loads of counter space, cabinetry and breakfast bar. The kitchen has access to the beautiful fenced in backyard offering lots of privacy and space to stretch out.  With its newer vinyl fencing and large storage shed with electric, this backyard has so many possibilities. Also in the kitchen is access to the first floor laundry area and your utilities. Though there is no basement in this home, there is a crawl space with a new sump pump","num_images":9.0,"lat":39.925273,"lng":-75.278307,"attrs":"['1BR \/ 1Ba', '1001ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-12T10:35:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-call-for-details-clubhouse\/7495541066.html","post_id":7495541066,"result_date":"2022-06-12 10:56","title":"Call for Details, Clubhouse with Game Room, Visit Your New Home","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nPrepare to fall in love with The Point at Glen Mills! Kick back in our community lounge. Watch your furry friend frolic with his furry friends in our dog park. Challenge your friends to a game of golf on our outdoor putting green. Life is good at The Point at Glen Mills. Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-12T10:52:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-fantastic-location\/7495523029.html","post_id":7495523029,"result_date":"2022-06-12 10:06","title":"Fantastic Location, Beautiful Amenities, Luxury Living","description":"Available: 8\/2\/22\nApt. 2415 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 4th floor apartment has so much to offer! This apartment comes with LVT flooring, central heat and air, a laundry room with washer and dryer, upgraded stainless steel appliances, a private balcony, and LVT hardwood flooring throughout the living area with plush carpeting in the bedrooms only. The master bedroom is equipped with a walk-in closet and generously-sized bathroom lined with granite countertops. The guest bathroom is equally as spacious! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-12T10:02:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated-bd-ba\/7495506133.html","post_id":7495506133,"result_date":"2022-06-12 09:09","title":"Completely Renovated 3 Bd 2 Ba Home, Central Air, Private Rear Deck","description":"Completely Renovated 3 Bedroom 2 Bath Home, Central Air, Private Rear Deck, brand new rehab in Elmwood Park\/Kingsessing\nProperty Address\n6345 Kingsessing Ave | Philadelphia, PA 19142\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Stunning renovation in Elmwood Park\/Kingsessing! ⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 2 Bath\n✔️Updated Kitchen w\/ custom designer backsplash\n✔️Master Bedroom has a Private brand new full bath\n✔️Located just minutes to schools, parks, and University City\n✔️All New Appliances\n✔️Hardwood flooring throughout\n✔️Recessed Lighting\n✔️Spacious bedrooms\n✔️Open layout, plenty of closet space.\n✔️Large basement perfect for storage\n✔️Central Air\n✔️Private Rear Deck\n✔️Washer\/Dryer Hookup\n✔️Located just minutes to schools, parks, and University City\n✔️Easy commute to and from the city\n✔️This property won't last long, inquire now!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1330\nRental Terms\nRent: $1900\nApplication Fee: $35\nSecurity Deposit: $3800\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nVirtual Tour: https:\/\/my.matterport.com\/show\/?m=xG8QmjAkkCh\nStunning renovation in Elmwood Park\/Kingsessing! This immaculate home has been completely renovated from top to bottom! Located just minutes to schools, parks, and University City. Brand new renovation! Steps to UPENN, Drexel, USciences, Center City CHOP, and Hospital of the University of Pennsylvania. Home features 3 bedrooms, 2 baths! Central air! Private Rear Deck! Washer\/dryer hookup! Absolutely everything here is brand new! #nata\nFor security purposes, all of our properties are under live video and audio surveillance. All access and showings are recorded and monitored remotely\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,332\nRental Terms\nRent: $1,900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,800.00\n\nPet Policy\nCats allowed\nDogs not allowed","num_images":24.0,"lat":39.928403,"lng":-75.236155,"attrs":"['3BR \/ 2Ba', '1332ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T09:05:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-townhouse-in-east\/7495499251.html","post_id":7495499251,"result_date":"2022-06-12 09:01","title":"3-Bedroom Townhouse In East Mount Airy","description":"Pride of ownership are clearly shown in this beautiful end of row home located in East Mount Airy. As you arrive home, you will be delighted with the exterior space perfect for relaxing. As you enter the home, you will be pleased with your open concept floor plan. There is a spacious living room; a space that your furniture will comfortably fit. The formal dining room is a great room for entertaining your family and friends. You will adore the hardwood floors with the custom in-lay on the first floor. Breakfast bar for easy & quick meals. The Kitchen is equipped with Range, Dishwasher, Microwave & Refrigerator. You will be pleased with the natural sunlight throughout this home with all of the extra windows . The second floor offers 3 nicely sized bedrooms with ample closet space & more hardwood floors. The hallway bathroom offers vanity, tub\/shower combination. The lower level of the home features a finished basement which can be utilized as a home office, gym or family room. There is a workshop area with a dividing curtain which is included. Added bonus of laundry room & includes the washer& dryer. Added convenience of a powder room. The basement door provides access to the rear driveway with 1 Car Garage in the fenced in rear yard. Ductless mini split system has been installed throughout with air conditioning & addition heat source for reduced energy costs. 13 Month Home Warranty with Home Warranty of America being offered. Walk Score 70. In close proximity to the Stenton Train Station, Awbury Arboretum, shopping, restaurants & dining along Germantown Ave, Cheltenham Ave & Rt 309.","num_images":11.0,"lat":40.05923,"lng":-75.179223,"attrs":"['3BR \/ 2Ba', '1688ft2', 'available jun 18', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'detached garage', 'rent period: monthly']","posted_date":"2022-06-12T08:36:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedrooms-bath-apt\/7495503476.html","post_id":7495503476,"result_date":"2022-06-12 09:00","title":"LARGE 2 BEDROOMS & 1 BATH APT LOCATED CLOSE TO LA SALLE UNIVERSITY!","description":"⭐⭐⭐ LARGE 2 BEDROOMS & 1 BATH APARTMENT LOCATED CLOSE TO LA SALLE UNIVERSITY! ⭐⭐⭐\nProperty Address\n5701 N 17th Street | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ LARGE 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN OGONTZ\/WEST OAK LANE! ⭐⭐⭐\n✔️ LARGE LIVING ROOM\n✔️ UPDATED DESIGNER KITCHEN W\/ BREAKFAST BAR\n✔️ STOVE, FRIDGE, & MICROWAVE\n✔️ SPACIOUS BEDROOMS\n✔️ WATER-RESISTANT LAMINATE FOR EASY CLEANING\n✔️ OPEN LAYOUT CONCEPT\n✔️ CEILING FANS\n✔️ CABLE READY\n✔️ LOCATED CLOSE TO KEMBEL PARK!\n✔️ SHORT COMMUTE FROM LA SALLE UNIVERSITY!\n✔️ EASY ACCESS TO PUBLIC TRANSPORTATION!\n✔️ CLOSE TO MAJOR ROADS!\n✔️ EASY COMMUTE TO CENTER CITY!\n✔️ WON'T LAST LONG INQUIRE TODAY!\nDETAILS\nFull background checks,\n$35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\nAMENITIES\nOpen layout\nconveniently located\ncable ready\nclose to public transportation\nSIZE\nBeds\/Baths: 2 BD\/1 BA\nSquare Feet: Apx. 850\nRENTAL TERMS\nRent: $1000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2000\nPET POLICY\nCats allowed\nDogs not allowed\nLINK TO VIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=cKSAmNUcbDi\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY:  WWW.REDBLOCK.COM\/APARTMENTS\ntags: 2 bedroom, two-bedroom, redblock, redblock realty inc, ogontz, west oak lane, east oak lane, logan, Germantown, East Germantown, Olney, La Salle University, central high school, spacious, Olney Transportation Center - BSL, 19141, 19144, 19138, 19126, 19120, 19119, Kemble Park, Philadelphia High School for Girls, Einstein Medical Center Philadelphia, Cristo Rey Philadelphia High School, Central High School, Belfield Recreation Center, Community College of Philadelphia - Northwest Regional. #nata\nAvailability and pricing are subject to change.  Information Deemed Reliable But Not Guaranteed. All information is subject to errors, omissions, or withdrawal without notice.\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 925\nRental Terms\nRent: $1,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,000.00\n","num_images":6.0,"lat":40.040606,"lng":-75.15035,"attrs":"['2BR \/ 1Ba', '925ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-12T08:56:32-0400"}]