[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cumbola-welcome-home-to-this-custom\/7518667688.html","post_id":7518667688,"result_date":"2022-08-07 23:38","title":"Welcome home to this custom-curated modern luxury townhouse","description":"This property is 2 homes on one bundle. Inside photographs not accessible because of occupants protection. The inside condition is normal. 17 Macomb is a 3 bed 1 shower half twofold with a closed in back yard. 19 Macomb is a 3 bed 2 shower with a closed in back yard. The enclosed carport is right now leased to the occupant at 17 Macomb. The two occupants are month to month. Call for data.","num_images":8.0,"lat":40.7195,"lng":-76.1158,"attrs":"['1BR \/ 1Ba', '3060ft2', 'available now', 'application fee details: An application fee of $10 is required', 'broker fee details: 6% of the Renting price of a house.', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'listed by: Realty Mark', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T23:15:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/clifton-heights-townhouse-for-rent\/7518666646.html","post_id":7518666646,"result_date":"2022-08-07 23:13","title":"Townhouse for Rent (Drexel Hill, PA)","description":"** Showings by appointment only on August 13. Please contact us soon to request an appointment.\nComfortable 3 Bedroom, 1.5 bath townhouse for rent on friendly street in Drexel Hill, PA.\nFenced in shaded front yard, sunny back deck, hardwood floors on first and second floors. Finished basement with plenty of storage space, a bar area, and washer and dryer in-unit. Convenient off-street parking in back, and street parking in front. Close to SEPTA Media\/Elwyn line, trolleys, and buses. Nearby parks, playground, dog run, and the Darby Creek Trail. Recent paint (brighter colors!) and bathroom vanity not shown in pictures.\nAppliances included: refrigerator, dishwasher, washer\/drier, gas stove\/oven, Central A\/C and heat.\n$1800\/month plus utilities and municipal fees.\n$1800 deposit required. Pets OK with additional pet deposit\nAvailable September 1, 2022\n","num_images":15.0,"lat":39.937858,"lng":-75.291431,"attrs":"['3BR \/ 1.5Ba', '1400ft2', 'available sep 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly']","posted_date":"2022-08-07T23:09:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3br-house-for-rent\/7518663181.html","post_id":7518663181,"result_date":"2022-08-07 22:55","title":"3BR House For Rent","description":"3BR House For Rent in a quiet Neighborhood in West Philly. Near Transportation. You need 3 Months Rent for a Move-in and Proof of Income and Verifiable Rental History.  Available 8\/13\/22.  Call  show contact info\n.","num_images":0.0,"lat":39.955579,"lng":-75.233984,"attrs":"['3BR \/ 1.5Ba', '1500ft2', 'house', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T22:51:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-for-rent\/7518650207.html","post_id":7518650207,"result_date":"2022-08-07 22:45","title":"For Rent","description":"3rd floor, 900 sq ft, 2 Bedrooms, 1 Bathroom Apartment with balcony and dedicated parking lot.\nWasher and dryer in unit. Central HVAC. All electric. (no gas)\nAccess to pool, quite neighborhood.\nTenant responsible for all utilities. Deposit $2800.","num_images":17.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 1Ba', '900ft2', 'available aug 15', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T21:51:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bd-35-br-townhouse-for\/7518660772.html","post_id":7518660772,"result_date":"2022-08-07 22:42","title":"3 bd\/ 3.5 br townhouse for rent immendiately","description":"Available for rent immediately. Beautifully furnished, modern 3 bed, 3 and a half bath home, with attached garage, for rent in Graduate Neighborhood!\n6-month lease rent: $4300\n12-month lease rent: $4100\nLocated on a quiet block in Graduate Hospital, this 7 year old luxury townhome features 1-car garage parking, a full skyline view from two roof decks, and recessed lights throughout. Enter into the light filled foyer, with hardwood oak flooring that continues throughout the home. In addition to garage access, the first level features a spacious den\/office, a powder room, and a sliding glass door which leads to the back patio. Take the open staircase, with beautiful wrought iron bannisters, up to the main floor where the oversized gourmet kitchen is adorned with ample cabinetry, granite counters, stainless steel appliances, and wine refrigerator. The main living area, with ample natural light from oversized south facing windows, is the perfect space for entertaining and relaxing. On the third level, you'll find the primary suite and second bedroom, both of which have spacious closets and en-suite baths. The primary suite bathroom features a double vanity, beautifully tiled shower, and a linen closet. The second bedroom with en-suite has a stall shower making it perfect for guests. Take the stairs up to the top level and exit onto your dueling roof decks with breathtaking Center City and stadium views both of which are perfect for entertaining and watching the sunset. The full finished basement features hardwood floors, a third bedroom, full bath with tub shower, and an additional bonus room which is perfect for a playroom or additional home office. This home is truly in the perfect location for anyone looking to be within close proximity to everything that Graduate Hospital has to offer!\nOpen House: Saturday Aug 6, 12 noon - 4pm\nTenant pays for utilities - electric, water, security and wifi\nNo smoking allowed. Up to small pets permitted.\nRenter insurance required.\n6-month lease possible at the suggested price.\n","num_images":24.0,"lat":39.939351,"lng":-75.175067,"attrs":"['3BR \/ 3.5Ba', 'available now', '\\nmonday 2022-08-08\\n', '\\ntuesday 2022-08-09\\n', '\\nwednesday 2022-08-10\\n', 'furnished', 'townhouse', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T22:38:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1100-mo-with-2-year-lease\/7518656020.html","post_id":7518656020,"result_date":"2022-08-07 22:35","title":"$1100\/MO WITH A 2 YEAR LEASE!!","description":"2017 home in very good condition located in Philadelphia Ridge, one of the most desired locations in Philadelphia.\nThe neighborhood is zoned for highly rated schools (Central Park Elementary School, Philadelphia High School) and just a few minutes off of Walton Blvd. The neighborhood features a walking trail, gated community pool, large playground, kids play area and a park-like common area surrounding the lake.\nThe home has 4 bedrooms - all on one level, 2 baths, a large living with a gas fireplace.\nKitchen and bathrooms feature 3 CM granite and appliances include Refrigerator, Microwave Oven, Washer and Dryer.\nMaster bathroom has a jetted bath tub and also features a separate He and She closets. Garage features Remote opening through Wi-Fi and also has hooks and shelving for easy storage. Energy efficient air-conditioning and heating. Backyard has an extended covered patio and a vegetable garden.\nIf interested, send me your name and number. Must have a approved application to schedule a showing.","num_images":5.0,"lat":40.0568,"lng":-75.1379,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'no smoking', 'detached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T22:16:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-duplex-bedroom\/7518647750.html","post_id":7518647750,"result_date":"2022-08-07 21:44","title":"SpaciouS\/ Duplex 2 bedroom 1 bath apartment rent in Philadelphia. Twp","description":"SpaciouS\/ Duplex 2 bedroom 1 bath apartment rent in Philadelphia. Twp. The landlady pays for heat (oil hot water), electricity, and cable. with washer dryer hookups and cabinets lower level has a large bedroom, Ideal for college students or those seeking short term housing. electric and cable. New slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!!Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. Close to NC Turnpike, Skippack, KOP, and MCCC. Rent- $760\/month,\n..........--------------------------------In need of a three bedroom before Sept.Currently homeless in a hotel. Have children so need to find housing can afford up to 1200 a month in rent please if anyone can help let me know.Single banking professional looking for apartment or condo near the North end of Auburn in proximity to Lake Auburn. Do not smoke, have no pets but do have an 800+ credit score. Inventory is low and I'd prefer not to live near city center. Hoping to find someone on the fence about leasing their apartment but was waiting for the perfect tenant!We are looking for a winter rental for my father and his fiancé. They are an older couple who are planning to live in Maine in the off season to be closer to family. They are quiet, financially stable, non-smokers, and have no pets. They are looking for a furnished space in the Kennebunk area. Either first or second floor is fine, with laundry onsite.Hi! We're a family of two looking for a rental (house or apartment) with one or possibly 2 bedrooms no more than 30-40 min from Portland. We are being forced out of our lovely apartment and away from our friends and neighbors of 13 yrs. by the sale of the building. Our credit is excellent and our relationship with our current landlord is as well. Portland prices are giving us no choice and we are not interested in buying. We both have professional jobs and live a quiet life. Of course, we have a couple of pets because that’s what empty nesters have (1 dog under 25lb and 2 indoor cats). We’ve always gardened, shoveled, and generally kept up our building in Portland if that is needed. We walk our dog off property, a lot. (ie spoiled)We can provide rental references, pet references, proof of employment, and our firstborn who does not live with us (in a final spin at college and unlikely to agree to the deal unless you have a pool). Please don’t reply if over $2300 one of us is in social work. We are great tenants. thanksHello, my name is Hanna and I’m needing to find a studio or 1Br place to rent and will also allow my dog. I’ll be relocating from Kentucky, and I don’t want to miss this great opportunity to advance in my career in healthcare. I was offered a job with Maine Health at the medical center in Portland. I won’t be able to afford much starting out, and im coming from nothing but busting ass to make a good life for myself. Im 28, clean, I don’t smoke\/drink\/or do drugs, I love to Hike and Knit, I work hard and I’m trusting and reliable. Please feel free to pass this along to someone you know and please reach out. Any help is greatly appreciated. I’m needing to be in the area by the end of September. I know it’s expensive in portland so I’m okay with a 20min drive from work. Honorably discharged veteran and Ukrainian immigrant new to Conway looking for a quiet 1-2 bedroom with stable internet connection. She manages night shift, and I will be developing websites. no smoking, no criminal history. 2 vehicles.I am 61 year old writer, looking for a peaceful place to live. I consider myself to be kind, compassionate, supportive, organized quiet. I am using a voucher which pays rent on time every time. Please consider my inquiry without judgment. Thank you AdelleOlder looking to start over , came home after being gone sometime and it's not what I thought it would be . Will explain more to you .I want to relocate anywhere but here. Once I get there will look for a job . I don't have a vehicle and if I can get around without one that's fine . I dont drink , smoke , prefer a smoke free home . Love animals , an do housekeeping if needed, great with laudry. I am only looking for a place to live , not any kind of relationship AT ALL. Now a friendship ok but anything else no way. ThanksMy name is Eric, I'm a 38 year old man who teaches high school in Manchester. My interests include reading, exercise (yoga, cycling, running), meditation, cooking, sports (mostly soccer). I generally live a healthy lifestyle and enjoy walking, especially in wooded areas, and try to bike to work when possible. I have excellent credit and am most likely one of the quieter housemates you'll find. I don't drink alcohol or use drugs.27 year old and 23 year old both working professionals looking for a roommate or apartment. We do have one 1 year old cat who is very well behaved. We are clean, quiet and spend a lot of time outside of the house, working or spending time with friends. We are currently looking for a room or apartment for 1000-1500\/month or if we have a roommate, we could go to $2000\/month for the apartment as the cost would be split between all of us. Feel free to text or email me to figure something out! We are flexible on where we live, ideally the hooksett\/manchester\/concord\/salem\/nashua area but very flexible! We are working with a realtor to find apartments to rent so we will gladly include a couple or 1 other person in our search.I'm living with my Mother, Who is 80 , and i am 62, I have a foot injury and have been fending for myself, Walking a lot on Foot, doesn't help healing! Just want to kick back , work online , stay inside and HEAL, I have a appointment every 10 days in Hyannis Podiatrist, Don't mind driving also Podiatrists has office outside Boston, so i can move anywhere really!\"\n","num_images":3.0,"lat":40.0369,"lng":-75.0664,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T21:40:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-duplex-bedroom\/7518647726.html","post_id":7518647726,"result_date":"2022-08-07 21:44","title":"SpaciouS\/ Duplex 2 bedroom 1 bath apartment rent in Philadelphia. Twp","description":"SpaciouS\/ Duplex 2 bedroom 1 bath apartment rent in Philadelphia. Twp. The landlady pays for heat (oil hot water), electricity, and cable. with washer dryer hookups and cabinets lower level has a large bedroom, Ideal for college students or those seeking short term housing. electric and cable. New slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!!Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. Close to NC Turnpike, Skippack, KOP, and MCCC. Rent- $760\/month,\n..........--------------------------------In need of a three bedroom before Sept.Currently homeless in a hotel. Have children so need to find housing can afford up to 1200 a month in rent please if anyone can help let me know.Single banking professional looking for apartment or condo near the North end of Auburn in proximity to Lake Auburn. Do not smoke, have no pets but do have an 800+ credit score. Inventory is low and I'd prefer not to live near city center. Hoping to find someone on the fence about leasing their apartment but was waiting for the perfect tenant!We are looking for a winter rental for my father and his fiancé. They are an older couple who are planning to live in Maine in the off season to be closer to family. They are quiet, financially stable, non-smokers, and have no pets. They are looking for a furnished space in the Kennebunk area. Either first or second floor is fine, with laundry onsite.Hi! We're a family of two looking for a rental (house or apartment) with one or possibly 2 bedrooms no more than 30-40 min from Portland. We are being forced out of our lovely apartment and away from our friends and neighbors of 13 yrs. by the sale of the building. Our credit is excellent and our relationship with our current landlord is as well. Portland prices are giving us no choice and we are not interested in buying. We both have professional jobs and live a quiet life. Of course, we have a couple of pets because that’s what empty nesters have (1 dog under 25lb and 2 indoor cats). We’ve always gardened, shoveled, and generally kept up our building in Portland if that is needed. We walk our dog off property, a lot. (ie spoiled)We can provide rental references, pet references, proof of employment, and our firstborn who does not live with us (in a final spin at college and unlikely to agree to the deal unless you have a pool). Please don’t reply if over $2300 one of us is in social work. We are great tenants. thanksHello, my name is Hanna and I’m needing to find a studio or 1Br place to rent and will also allow my dog. I’ll be relocating from Kentucky, and I don’t want to miss this great opportunity to advance in my career in healthcare. I was offered a job with Maine Health at the medical center in Portland. I won’t be able to afford much starting out, and im coming from nothing but busting ass to make a good life for myself. Im 28, clean, I don’t smoke\/drink\/or do drugs, I love to Hike and Knit, I work hard and I’m trusting and reliable. Please feel free to pass this along to someone you know and please reach out. Any help is greatly appreciated. I’m needing to be in the area by the end of September. I know it’s expensive in portland so I’m okay with a 20min drive from work. Honorably discharged veteran and Ukrainian immigrant new to Conway looking for a quiet 1-2 bedroom with stable internet connection. She manages night shift, and I will be developing websites. no smoking, no criminal history. 2 vehicles.I am 61 year old writer, looking for a peaceful place to live. I consider myself to be kind, compassionate, supportive, organized quiet. I am using a voucher which pays rent on time every time. Please consider my inquiry without judgment. Thank you AdelleOlder looking to start over , came home after being gone sometime and it's not what I thought it would be . Will explain more to you .I want to relocate anywhere but here. Once I get there will look for a job . I don't have a vehicle and if I can get around without one that's fine . I dont drink , smoke , prefer a smoke free home . Love animals , an do housekeeping if needed, great with laudry. I am only looking for a place to live , not any kind of relationship AT ALL. Now a friendship ok but anything else no way. ThanksMy name is Eric, I'm a 38 year old man who teaches high school in Manchester. My interests include reading, exercise (yoga, cycling, running), meditation, cooking, sports (mostly soccer). I generally live a healthy lifestyle and enjoy walking, especially in wooded areas, and try to bike to work when possible. I have excellent credit and am most likely one of the quieter housemates you'll find. I don't drink alcohol or use drugs.27 year old and 23 year old both working professionals looking for a roommate or apartment. We do have one 1 year old cat who is very well behaved. We are clean, quiet and spend a lot of time outside of the house, working or spending time with friends. We are currently looking for a room or apartment for 1000-1500\/month or if we have a roommate, we could go to $2000\/month for the apartment as the cost would be split between all of us. Feel free to text or email me to figure something out! We are flexible on where we live, ideally the hooksett\/manchester\/concord\/salem\/nashua area but very flexible! We are working with a realtor to find apartments to rent so we will gladly include a couple or 1 other person in our search.I'm living with my Mother, Who is 80 , and i am 62, I have a foot injury and have been fending for myself, Walking a lot on Foot, doesn't help healing! Just want to kick back , work online , stay inside and HEAL, I have a appointment every 10 days in Hyannis Podiatrist, Don't mind driving also Podiatrists has office outside Boston, so i can move anywhere really!\"\n","num_images":3.0,"lat":40.0369,"lng":-75.0664,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T21:40:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-duplex-bedroom-bath\/7518634216.html","post_id":7518634216,"result_date":"2022-08-07 20:59","title":"Duplex 1 bedroom 1 bath apartment rent in Philadelphia","description":"Duplex 1 bedroom 1 bath apartment rent in Philadelphia . Twp. The landlady pays for heat (oil hot water), electricity, and cable. with washer dryer hookups and cabinets lower level has a large bedroom, Ideal for college students or those seeking short term housing. electric and cable. New slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!!Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. Close to NC Turnpike, Skippack, KOP, and MCCC. Rent- $750\/month. If you're interested reach me at: (201) 579-10 24","num_images":3.0,"lat":40.0422,"lng":-75.0244,"attrs":"['1BR \/ 1Ba', 'duplex', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-08-07T20:48:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1br-point-breeze-apt\/7518628622.html","post_id":7518628622,"result_date":"2022-08-07 20:31","title":"1br Point Breeze Apt. - September","description":"Beautiful 1br apartment in point breeze available to rent starting September 1st. This amazing unit is the bottom apartment of a duplex which was fully rehabbed in 2016. The unit has a modern kitchen with granite counter tops, well sized bathroom with sliding glass doors and a spacious bedroom. The unit is perfect for a single tenant or couple to share. The rear patio makes for an enjoyable outdoor space and the basement is perfect for extra storage. The unit has central air plus it's own washer\/dryer. The neighborhood is vibrant and has only attracted more and more young residents as the years have gone on. With plenty of restaurants and bars in the Washington Ave and local area this apartment is a great find. Lease terms are 1 year with 1st, last, and security ($1000) required to move in. Please call or text with serious inquiries only in order to schedule a visit.","num_images":13.0,"lat":39.933385,"lng":-75.181162,"attrs":"['1BR \/ 1Ba', '600ft2', 'available sep 1', 'air conditioning', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T20:27:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-3bd-2ba\/7518625406.html","post_id":7518625406,"result_date":"2022-08-07 20:20","title":"Brand new 3BD\/2BA available now at 2207 N Broad st!","description":"Great Location. New Construction. W\/D. Walk to Temple.\nLocation, location, location. Huge bi-level 3 bedroom with washer\/dryer is waiting for you.\nBeautiful kitchen with an island, SS appliances, granite countertops and tons of cabinet space. Hardwood flooring throughout, updated tiled bathroom, large bedroom with full bathroom and ample closet space.\nThe unit offers open space layout and tons of natural light.\nTenant is responsible for electric and water ( flat water fee is $25 per person per month) .\nRental Terms\nRent: $1,800\nApplication Fee: $55\nSecurity Deposit: $1,800\nAvailable Now\nPet Policy\nCats allowed\nDogs allowed\nCall Alena for showing at  show contact info\nCity Wide Realty\n","num_images":20.0,"lat":39.986381,"lng":-75.156254,"attrs":"['3BR \/ 2Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T20:16:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1654ft2-main-house-bed\/7518601714.html","post_id":7518601714,"result_date":"2022-08-07 19:45","title":"1654ft2 - Main house: 3 bed, 2 full bath apt w\/d  2-car attached gaRaE","description":"Main house w\/ income apartment. Main house: 3 bed, 2 full bath. Main level primary bedroom & full bath. Open, updated kitchen. Private screened-in porch updated w\/ new ceiling, screens and roof. Separate income producing apartment w\/ 1 bed, 1 bath, living room and kitchen. Can be used for short or long term leases. Don't miss the 36'x12' workshop in back of 2-car attached garage. Recent Improvements: roof, (2) furnaces both w\/ A\/C condenser units, hardwood flooring, appliances, owned water system, driveway recoated. If you like my home then definitely contact me on my personal gm__ail:khloefloridaa9gmailcom","num_images":5.0,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T18:59:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bd-ba-garden-condo-in-the\/7518612633.html","post_id":7518612633,"result_date":"2022-08-07 19:37","title":"$1,300 – 1 BD \/ 1 BA Garden Condo in the heart of Midtown Village!","description":"238 S 13th St Grdn Philadelphia, PA  19107$1300.00 \/ Month---------------------------Interested in this property?Reply to this listing for more information.---------------------------Property Details:1 BEDROOMS | 1 BATHROOMSRight in the heart of Midtown Village, check out this updated 1 BR, 1 BA apartment. The unit has been updated with a new kitchen and bathroom and is move-in ready. Private garden entrance with shared outdoor patio featuring market lights and new wicker furniture. Close to the best nightlife and food that Philly has to offer on 13th street including El Vez, Sampan, and many more! The building is pet-friendly with heat included. Free on site laundry with a large storage area, which is perfect for bikes. The front door has a new intercom system that you can unlock from your phone. Come check out the best that Midtown has to offer!\nUnit will be available October 1st. Updated pictures of final renovations to follow soon. Security deposit of $1,300 required at signing in addition to first and last month's rent.***Cats, Small Dogs Allowed***Property Type: CondoLease Terms:$1300.00\/Month$1300.00 DepositLease Length: One YearAvailable:10\/01\/2022Unit Amenities:Dishwasher Refrigerator Washer Dryer Oven FreezerBuilding Amenities:Bicycle Parking Intercom Alarm System On Site Laundry Secure Building Fenced Yard---------------------------Interested in this property?Reply to this listing for more information.\n","num_images":6.0,"lat":39.947414,"lng":-75.162474,"attrs":"['1BR \/ 1Ba', '468ft2', 'available oct 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T19:33:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/broomall-studio-apartment-for-rent\/7518608074.html","post_id":7518608074,"result_date":"2022-08-07 19:24","title":"studio apartment for rent","description":"Cozy studio apartment with kitchenette available for rent\nConvenient location on Rt 3\nNear Giant, Starbucks, Dunkin’, gas’s stations, and more! 7 minutes from Delco!\nClean well maintained hard wood floors\nBrand new kitchenette\nIncludes full bathroom with shower\/tub combo\nElectricity and water included\nFirst and last month and security deposit required upon signing. $30 application fee\nPlease contact Abraham  show contact info","num_images":5.0,"lat":39.9706,"lng":-75.3603,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T19:18:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-ft2-beautiful-3bedroom\/7518583573.html","post_id":7518583573,"result_date":"2022-08-07 19:13","title":"$1050\/ 3br - 1154ft2 - *+*Beautiful 3bedroom 2bath House IN Philadel","description":"Beautiful 3bedroom 2bath House IN Philadelphia. Houses feature upgraded kitchens and baths, large windows, ceiling fans in most units,hardwood floors, A large living room space, and large windows! Each bedroom can easily accommodate a queen size bed with extra furnishings! High Speed Wireless internet included.Enjoy living District with easy\/walkable access to downtown,restaurants & bars, grocery stores,shops, hiking trails. It's also located above massage services, Frenchie’s Floral Studio, next to The Gym, and one block away from coffee shop & ice cream parlor!Heat, water and garbage included, on street parking.Tenant is responsible for electric and cable\/internet. No smoking. Pets allowed.Rent $1050month, Laundry on site!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles,will consider pets but need to be approved in advance. References and.Washer and dyer hook ups in the basement. Access to large attic space for storage. Access to Greenlight Network services!This home has a fully fenced back yard with a great patio space for hanging out and lounging around.Driveway parking!*Tenant will be responsible for utilities, water bill, lawn care, and snow removal, owner will pay for refuse.*CALL OR TEXT FOR QUICKEST RESPONSE.. show contact info","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '1154ft2', 'available now', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T18:07:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-ft2-beautiful-3bedroom\/7518583587.html","post_id":7518583587,"result_date":"2022-08-07 18:42","title":"$1050\/ 3br - 1154ft2 - *+*Beautiful 3bedroom 2bath House IN Philadel","description":"Beautiful 3bedroom 2bath House IN Philadelphia. Houses feature upgraded kitchens and baths, large windows, ceiling fans in most units,hardwood floors, A large living room space, and large windows! Each bedroom can easily accommodate a queen size bed with extra furnishings! High Speed Wireless internet included.Enjoy living District with easy\/walkable access to downtown,restaurants & bars, grocery stores,shops, hiking trails. It's also located above massage services, Frenchie’s Floral Studio, next to The Gym, and one block away from coffee shop & ice cream parlor!Heat, water and garbage included, on street parking.Tenant is responsible for electric and cable\/internet. No smoking. Pets allowed.Rent $1050month, Laundry on site!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles,will consider pets but need to be approved in advance. References and.Washer and dyer hook ups in the basement. Access to large attic space for storage. Access to Greenlight Network services!This home has a fully fenced back yard with a great patio space for hanging out and lounging around.Driveway parking!*Tenant will be responsible for utilities, water bill, lawn care, and snow removal, owner will pay for refuse.*CALL OR TEXT FOR QUICKEST RESPONSE.. show contact info","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '1154ft2', 'available now', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T18:07:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-and-spacious\/7518593477.html","post_id":7518593477,"result_date":"2022-08-07 18:38","title":"Beautiful and Spacious 2Bedrppm Home in Nicetown","description":"1. Rent is $1000.00 a Month and Tenants pays Electric, Gas and Water.\n2. This Home has a large living room,  Large Dining Room, Kitchen, Fenced in Rear Yard, 2 Bedrooms and a large Bathroom.\n3. This home is located closed to Septa buses even the Subway.\n4. If interested call or text Mike at  show contact info\n5. Feel free to call, Good luck in your search.\n","num_images":19.0,"lat":40.01893,"lng":-75.152723,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available now', '\\nmonday 2022-08-08\\n', 'cats are OK - purrr', 'house', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T18:34:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-everything-3br\/7518585013.html","post_id":7518585013,"result_date":"2022-08-07 18:15","title":"Brand new everything, 3BR\/1.5BA + W\/D, A\/C","description":"*Brand new everything! Be the first to live in this beautiful, newly renovated 3 bedroom, 1.5 bath home with new kitchen\/appliances, bath and powder room, floors and more!\n*Open living and dining room with new floors\n*New 1\/2 bath on the first floor\n*New upstairs bathroom with subway tile\n*All new plumbing and electrical throughout property\n*Fresh paint top to bottom\n*Full, unfinished basement with washer\/dryer and room for storage.\n*Porch + large backyard\nPlus:\n*Responsive landlords.\n*Convenient location--steps to Broad Street line (5 min walk), multiple bus lines (3-min walk); 10-15 minutes to Center City, 76 and 95.\nWhy rent an apartment when you can have a whole gorgeous house!?\nAvailable Sept 1.\n$1400\/month.\n$75 non-refundable application fee per person to cover background check\/admin costs.\n$4,200 to move in: First month's rent and two month's security to move in.\nTenants pay gas, electric and water.\nAbsolutely, positively NON-smoking house.\nText (or email) now to make an appt\nshow contact info","num_images":3.0,"lat":39.9954,"lng":-75.1698,"attrs":"['3BR \/ 1.5Ba', '1400ft2', 'available sep 1', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T18:11:02-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-awesome-duplex-bedroom-apartment\/7518593055.html","post_id":7518593055,"result_date":"2022-08-07 19:05","title":"Awesome Duplex 2 bedroom Apartment Taken care of by owner!!!","description":"Awesome Duplex 2 bedroom 2 bath apartment rent in Bear. The landlady pays for heat (oil hot water), electricity, and cable. with washer dryer hookups and cabinets lower level has a large bedroom. Landlord provides and installs window air conditioners in the summer. Good size living room with separate large dining area and walk-in pantry. One bedroom is very large, the other is smaller. Recently installed shower\/tub combo in bathroom with all new plumbing throughout the building. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Plowing and lawn mowing taken care of by owner!!!","num_images":3.0,"lat":39.6102,"lng":-75.6747,"attrs":"['2BR \/ 2Ba', 'application fee details: No Application Fee!!!', 'broker fee details: No Brokers Fee!!!', 'apartment', 'w\/d in unit', 'listed by: Bayside Realty', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T18:33:48-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-free-bedroom-plus-small-den\/7518592328.html","post_id":7518592328,"result_date":"2022-08-07 18:41","title":"Free $425, 2 bedroom, plus small den\/office space!!!!","description":"Spacious 2 bedroom 2nd floor apartment available soon. In town location of Bear, DE. 2 bedroom, plus small den\/office space. Includes stove and fridge. Heat included. Hot water is on your electric. Has washer\/dryer connection, storage shed, yard off street parking. $850\/mo.","num_images":3.0,"lat":39.6102,"lng":-75.6747,"attrs":"['2BR \/ 1Ba', 'application fee details: No Application Fee!!!', 'broker fee details: No Brokers Fee!!!', 'apartment', 'w\/d in unit', 'listed by: Bayside Realty', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T18:31:56-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-2868-rhonda-lane\/7518559149.html","post_id":7518559149,"result_date":"2022-08-07 18:00","title":"2868 Rhonda lane","description":"2868 Rhonda lane allentown pa\n3 bedroom $2000 need first month and two security deposits call or text David at  show contact info\n$50 pet fee\n","num_images":11.0,"lat":40.5577,"lng":-75.4724,"attrs":"['3BR \/ 1Ba', 'available now', '\\nmonday 2022-08-08\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T17:01:51-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-dont-miss-bed-full-bath-only\/7518563966.html","post_id":7518563966,"result_date":"2022-08-07 17:59","title":"Don't miss!!! 3 bed, 2 full bath. Only@!!! $970.00","description":"Main house w\/ income apartment. Main house: 3 bed, 2 full bath. Main level primary bedroom & full bath. Open, updated kitchen. Private screened-in porch updated w\/ new ceiling, screens and roof. Separate income producing apartment w\/ 1 bed, 1 bath, living room and kitchen. Can be used for short or long term leases. Don't miss the 36'x12' workshop in back of 2-car attached garage. Recent Improvements: roof, (2) furnaces both w\/ A\/C condenser units, hardwood flooring, appliances, owned water system, driveway recoated.","num_images":5.0,"lat":40.0091,"lng":-76.3671,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T17:14:09-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/milford-care-of-by-owner-two-bedroom\/7518579296.html","post_id":7518579296,"result_date":"2022-08-07 17:59","title":"Care of by owner, Two bedroom apartment IN Milford $1000 month!!!!!!!","description":"Beautiful 2 bedroom 2 bath apartment IN Milford. Apartments feature upgraded kitchens and baths, large windows, ceiling fans in most units, hardwood floors, A large living room space, and large windows! Each bedroom can easily accommodate a queen size bed with extra furnishings! High Speed Wireless internet included. Enjoy living District with easy\/walkable access to downtown, restaurants & bars, grocery stores, shops, hiking trails. It's also located above massage services, Frenchie’s Floral Studio, next to The Gym, and one block away from Coppa coffee shop & ice cream parlor! Heat, water and garbage included, on street parking. Tenant is responsible for electric and cable\/internet. No smoking. Pets allowed. Rent $1000 month, Laundry on site!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles. To view this apartment or for any questions: hunteroeric65@gmail_com","num_images":1.0,"lat":38.9218,"lng":-75.4299,"attrs":"['2BR \/ 2Ba', 'application fee details: No Application Fee!!!', 'broker fee details: No Brokers Fee!!!', 'apartment', 'w\/d in unit', 'listed by: Bayside Realty', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T17:55:03-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/milford-just-beautiful-bedroom\/7518578627.html","post_id":7518578627,"result_date":"2022-08-07 17:57","title":"just Beautiful!!! 2 Bedroom Apartment in Milford quite neighborhood.@@","description":"Spacious 2 Bedroom Apartment in Milford quite neighborhood. UTILITIES INCLUDED (Gas, Electric, water, and Garbage) $800\/month. Butcher block countertops, new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!! Laundry on site!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long\/short term tenant. Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. Looking for a quite and responsible long term tenant. Parking for 2 vehicles,will consider pets. Get more information directly contact landlord: hadleypotts94@gmail_com","num_images":1.0,"lat":38.9218,"lng":-75.4299,"attrs":"['2BR \/ 1Ba', 'application fee details: No Application Fee!!!', 'broker fee details: No Brokers Fee!!!', 'apartment', 'w\/d in unit', 'listed by: Bayside Realty', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T17:53:09-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/old-bridge-for-rent-desirable-3br-35\/7518549095.html","post_id":7518549095,"result_date":"2022-08-07 17:36","title":"For Rent desirable 3Br, 3.5 Bath, 2 car garage townhouse##","description":"For Rent desirable 3Br, 3.5Bath, 2 car garage, move in condition townhouse. All hard wood floors on the main level, large master suite on 2nd level. Vaulted ceiling in family room with stone wood burning fireplace. Large deck of kitchen & much more. Townhouse is in pristine condition.","num_images":0.0,"lat":40.398,"lng":-74.3236,"attrs":"['3BR \/ 3.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-08-07T16:36:51-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-completely-remodeled-bd-15-ba\/7518570594.html","post_id":7518570594,"result_date":"2022-08-07 17:35","title":"####Completely remodeled 2 bd 1.5 ba home @@####","description":"Completely remodeled home in a great area of Reading!\nThis house features all new flooring, kitchen, bathrooms.\nEnter the house into the spacious living room with plenty of light. The main floor also boasts a gorgeous kitchen with all new cabinets, appliances, granite countertops and more. The back room on the main floor has a brand new half bathroom and the laundry area as well as private fenced in yard.\nCONTRACT MARIA LISA AT:::    show contact info\n;\n;\n;\n;\n;\n;\n;\n;\n;\n;\n;\nCompletely upgraded, 2-bedroom cape with additional room for an office\/media room. Fully fenced, gated large yard with shed. Home includes central air conditioning, no carpeting throughout and a new washer\/dryer..LUXARIOUS !!Three-bedroom house, in Richmond, setting, on a 2 acre lot, offers idyllic living in Worcester Twp. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short term housing. Close to PA Turnpike, Skippack, KOP, and MCCC. Rent- $650\/month.🏠\nstunning 2 bedroom 1 Bathroom Apartment Located in the heart of the Fox Point neighborhood on the Historic East Side of Providence, Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. offers idyllic living in Worcester Twp. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Applicants must have satisfactory credit and solid work or student status history. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Landlord provides and installs window air conditioners in the summer. if you are interested for more information at: send your phone number. Text me:    show contact info","num_images":4.0,"lat":40.3466,"lng":-75.9351,"attrs":"['2BR \/ 1.5Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T17:31:33-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-completely-remodeled-bd-15-ba\/7518570590.html","post_id":7518570590,"result_date":"2022-08-07 17:35","title":"####Completely remodeled 2 bd 1.5 ba home @@####","description":"Completely remodeled home in a great area of Reading!\nThis house features all new flooring, kitchen, bathrooms.\nEnter the house into the spacious living room with plenty of light. The main floor also boasts a gorgeous kitchen with all new cabinets, appliances, granite countertops and more. The back room on the main floor has a brand new half bathroom and the laundry area as well as private fenced in yard.\nCONTRACT MARIA LISA AT:::    show contact info\n;\n;\n;\n;\n;\n;\n;\n;\n;\n;\n;\nCompletely upgraded, 2-bedroom cape with additional room for an office\/media room. Fully fenced, gated large yard with shed. Home includes central air conditioning, no carpeting throughout and a new washer\/dryer..LUXARIOUS !!Three-bedroom house, in Richmond, setting, on a 2 acre lot, offers idyllic living in Worcester Twp. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short term housing. Close to PA Turnpike, Skippack, KOP, and MCCC. Rent- $650\/month.🏠\nstunning 2 bedroom 1 Bathroom Apartment Located in the heart of the Fox Point neighborhood on the Historic East Side of Providence, Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. offers idyllic living in Worcester Twp. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Applicants must have satisfactory credit and solid work or student status history. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Landlord provides and installs window air conditioners in the summer. if you are interested for more information at: send your phone number. Text me:    show contact info","num_images":4.0,"lat":40.3466,"lng":-75.9351,"attrs":"['2BR \/ 1.5Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T17:31:33-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/ocean-city-ocean-city-nj-winter-rental\/7518556308.html","post_id":7518556308,"result_date":"2022-08-07 16:58","title":"Ocean City, NJ - WINTER RENTAL","description":"Winter Rental - Furnished Duplex 1st Floor\nThree bedrooms \/ two bath\nHardwood floors throughout\n$1125 per month plus utilities\nNo Pets\nAvailable mid-Sept 2022 thru May 2023\nIf interested, contact  show contact info","num_images":7.0,"lat":39.269881,"lng":-74.589966,"attrs":"['3BR \/ 2Ba', '950ft2', 'available sep 11', 'duplex', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T16:54:50-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-outdoor-seating-tot-lot\/7518554526.html","post_id":7518554526,"result_date":"2022-08-07 16:54","title":"Outdoor Seating, Tot Lot, Children's Play Area","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Pet WashParking GarageClimate Controlled StorageBusiness CenterRetailMusic RoomBike StorageGrillsChildren's Play AreaThe HubDog ParkLocker RoomCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/au4tjgfr\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10.0,"lat":40.5716,"lng":-74.3167,"attrs":"['2BR \/ 2Ba', '1179ft2', 'available aug 23', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-08-07T16:50:18-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-furnishings-bedroom-bath\/7518547363.html","post_id":7518547363,"result_date":"2022-08-07 16:47","title":"Furnishings 2 bedroom 2 bath apartment IN Wilmington@@@","description":"Beautiful 2 bedroom 2 bath apartment IN Wilmington. Apartments feature upgraded kitchens and baths, large windows, ceiling fans in most units,hardwood floors, A large living room space, and large windows! Each bedroom can easily accommodate a queen size bed with extra furnishings! High Speed Wireless internet included.Enjoy living District with easy\/walkable access to downtown,restaurants & bars, grocery stores,shops, hiking trails. It's also located above massage services, Frenchie’s Floral Studio, next to The Gym, and one block away from Coppa coffee shop & ice cream parlor!Heat, water and garbage included, on street parking.Tenant is responsible for electric and cable\/internet. No smoking. Pets allowed.Rent $1000 month, Laundry on site!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles,will consider pets but need to be approved in advance. References and.Washer and dyer hook ups in the basement. Access to large attic space for storage. Access to Greenlight Network services!This home has a fully fenced back yard with a great patio space for hanging out and lounging around.Driveway parking!*Tenant will be responsible for utilities, water bill, lawn care, and snow removal, owner will pay for refuse.","num_images":4.0,"lat":39.7378,"lng":-75.5497,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'listed by: Winzone realty home inc', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T16:32:37-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-2116-rivers-drive\/7518549805.html","post_id":7518549805,"result_date":"2022-08-07 16:42","title":"2116 Rivers Drive","description":"New Home  3 bedroom 2.5 bath townhouse, newly built central air gas hot air, Christiana school district, close to christiana mall, minutes to highway 95, 1 csr sttached garrage for more information call Dom st  show contact info\n.  availabe  Jan. 1 2023.  Rent  2200\/month","num_images":0.0,"lat":39.7994,"lng":-75.5317,"attrs":"['3BR \/ 2.5Ba', 'available jan 1, 2023', 'air conditioning', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T16:38:31-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-nice-bedroom-on-the-2nd-floor\/7518522219.html","post_id":7518522219,"result_date":"2022-08-07 16:21","title":"Nice 2 bedroom on the 2nd floor apartment in Very nice location!!!","description":"Nice 2 bedroom apartment in Very nice location. Nice renovations, actual living room with natural light and exposed brick. Apartment is on the 2nd floor. Credit and background check. Right by several train lines, buses, bars, and restaurants! See availability and to schedule a tour, please text at: christielloyd898@gmail_com","num_images":1.0,"lat":39.6349,"lng":-75.6993,"attrs":"['2BR \/ 1Ba', 'application fee details: No Application Fee!!!', 'broker fee details: No Brokers Fee!!!', 'apartment', 'w\/d in unit', 'listed by: Bayside Realty', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T15:30:31-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mount-royal-come-look-and-lease-picnic\/7518541174.html","post_id":7518541174,"result_date":"2022-08-07 16:20","title":"Come Look and Lease, Picnic Area, Car Care Center","description":"Heather Ridge Apartments, managed by Panco Management\n454 Heather Drive\nMantua, NJ 08051\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/heatherridgeapts.net\nThe professional management team at Heather Ridge is dedicated to providing the best possible services and amenities, with the needs and comfort of our residents being a top priority. With an apartment rating of 96%, it's clear that our residents are happy to call Heather Ridge home.\nGreat one bedroom one bathroom apartment with washer dryer, large walk in closet in bedroom and off the living room and more!","num_images":18.0,"lat":39.807871,"lng":-75.176093,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T16:16:56-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/sicklerville-welcome-home-to-this\/7518485319.html","post_id":7518485319,"result_date":"2022-08-07 16:04","title":"Welcome home to this beautiful newly renovated 2bed 2bath","description":"Large End Unit Two bedroom, 1.5 bath townhouse plus 10x10 den\/study on upper level which could be used as a bonus bedroom. Enter through foyer and in to open living room and updated kitchen with stainless steel appliances. Powder room and laundry completes the first floor with inside entry from the garage.  Upstairs you will find a large master bedroom with walk in closet and access to full bathroom. Bathroom access from both bedrooms. Upstairs includes Den\/Study\/Loft area which can easily be converted to 3rd bedroom if needed. This home is in move in condition. Open floor plan with two sliding glass doors to backyard. Situated on the end for privacy. Ample parking and one car garage. Close to AC Xway & Rt. 42. Nice neighborhood. Text \/call  show contact info\n) to schedule move in date","num_images":8.0,"lat":39.7354,"lng":-74.9864,"attrs":"['2BR \/ 2Ba', '1408ft2', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T14:07:52-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-duplex-two-bedroom-two-bathroom\/7518523814.html","post_id":7518523814,"result_date":"2022-08-07 15:50","title":"Duplex Two Bedroom, Two Bathroom Pets allowed. Rent $1000  pr month!!!","description":"Beautifully Duplex 2 bedroom 2 bath apartment IN Newark,. Apartments feature upgraded kitchens and baths, large windows, ceiling fans in most units,hardwood floors, A large living room space, and large windows! Each bedroom can easily accommodate a queen size bed with extra furnishings! High Speed Wireless internet included.Enjoy living District with easy\/walkable access to downtown,restaurants & bars, grocery stores,shops, hiking trails. It's also located above massage services, Frenchie’s Floral Studio, next to The Gym, and one block away from Coppa coffee shop & ice cream parlor!Heat, water and garbage included, on street parking.Tenant is responsible for electric and cable\/internet. No smoking. Pets allowed.Rent $1000 month, Laundry on site!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles. Text us today for current move in special information: joannephillips896@gmail_com","num_images":6.0,"lat":39.6349,"lng":-75.6993,"attrs":"['2BR \/ 2Ba', 'application fee details: No Application Fee!!!', 'broker fee details: No Brokers Fee!!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Bayside Realty', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T15:34:08-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/dover-cozy-bedroom-gas-electric-water\/7518526264.html","post_id":7518526264,"result_date":"2022-08-07 15:44","title":"Cozy *\/* 2 Bedroom, Gas, Electric, water, and Garbage) $950\/mon.!!","description":"UTILITIES INCLUDED (Gas, Electric, water, and Garbage) $950\/month. Large Remodeled 2 Bedroom Apartment in Dover quite neighborhood. Butcher block countertops, new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!! Laundry on site!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec along with Lease required prior to renting. Serious inquiries only and application fee of $15.00 for background check. Text : burnsarturo636@gmail_com","num_images":3.0,"lat":39.1564,"lng":-75.4955,"attrs":"['2BR \/ 1Ba', 'application fee details: $15.00', 'broker fee details: No Brokers Fee!!!!!!', 'apartment', 'w\/d in unit', 'listed by: Bayside Realty', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T15:40:16-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/short-hills-duplex-rehabbed-bedroom\/7518525117.html","post_id":7518525117,"result_date":"2022-08-07 15:41","title":"Duplex,, Rehabbed 2 Bedroom 2 Bathroom Apt for rent in South jersey!!","description":"Duplex,, Rehabbed 2 Bedroom 2 Bathroom Apt for rent in South jersey!! Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. Limited term lease from mid-September 2022- through May 2023 only. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. offers idyllic living in Worcester Twp. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. LUXARIOUS !!Two-bedroom apartment, in Allentown setting, on a 2 acre lot, offers idyllic living in Worcester Twp. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Applicants must have satisfactory credit and solid work or student status history. UTILITIES INCLUDED (Gas, Electric, water, and Garbage) $700\/month. Large Remodeled 2 Bedroom Apartment in quite neighborhood. Butcher block countertops, new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!! Laundry on site!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles, will consider pets but need to be approved in advance .Landlord provides and installs window air conditioners in the summer. Ideal for college students or those seeking short term housing. Close to PA Turnpike, Skippack, KOP, and MCCC. Rent- $700\/month. No smoking and ALLOW pets- firm. Applicants must have satisfactory credit and solid work or student status history. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Landlord provides and installs window air conditioners in the summer. if you are interested for more information Please text me your phone number for quick response.\nCALL ME.( 6 4 6 )5 4 7- 31 44\n","num_images":4.0,"lat":40.7368,"lng":-74.3271,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T15:37:20-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/metuchen-bed-bath-and-car-garage-condo\/7518516148.html","post_id":7518516148,"result_date":"2022-08-07 15:39","title":"***3 bed 2 bath and 1 Car Garage Condo for Rent.***","description":"3 bed 2 bath and 1 Car Garage Condo for Rent. Great Community, closer to Train stations, closer to Costco\/Walmart\/Sams Club etc.\n❤️Contact me directly: show contact info\nMore Info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nUTILITIES INCLUDED (Gas, Electric, water, and Garbage) $700\/month. Large Remodeled 2 Bedroom Apartment in quite neighborhood. Butcher block countertops, new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!! LAUNDRY ON SITE!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting.\n","num_images":4.0,"lat":40.5325,"lng":-74.3375,"attrs":"['3BR \/ 2Ba', '1283ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T15:16:14-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-freshly-painted-bath-1full-bath\/7518506039.html","post_id":7518506039,"result_date":"2022-08-07 15:36","title":"Freshly painted, 1 bath, 1full bath apt, with washer\/dryer","description":"Welcome to 1 bathroom house is located in Bear, and boasts beautiful 9ft ceilings, laminate and Lino flooring, newer finishing's throughout and air conditioning for those hot summer days! Finished basement has additional room and full bathroom with a tub, along with laundry. The private backyard is fenced and has a large, 2-car detached heated garage available for parking and storage. Close to many amenities such as downtown, Was Cana Lake, schools, tennis courts, and parks.","num_images":3.0,"lat":39.655697,"lng":-75.664512,"attrs":"['1BR \/ 1Ba', 'available aug 30', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-08-07T14:54:10-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/ocean-view-lovely-1bd-1ba-house-for-rent\/7518515585.html","post_id":7518515585,"result_date":"2022-08-07 15:35","title":"Lovely 1bd\/1ba house for rent","description":"Newly Remodeled with Precision!  Move In Ready, in Highly Sought Upper Twp with it's Excellent School District and Family Oriented Neighborhood!  Only 7 Miles to either Ocean City or Sea Isle!  - Brand New Septic! Public Water, New Kitchen Cabinets and Appliances!  New Flooring and Bathrooms. New Water Heater. Newer Vinyl Siding. Newer Roof with Active Warranty. Recent Passed Termite Inspection. Recently Cleaned and Inspected Fireplace.","num_images":1.0,"lat":39.2154,"lng":-74.7075,"attrs":"['1BR \/ 1Ba', '1320ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-08-07T15:14:55-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/metuchen-bed-bath-and-car-garage-condo\/7518516190.html","post_id":7518516190,"result_date":"2022-08-07 15:30","title":"***3 bed 2 bath and 1 Car Garage Condo for Rent.***","description":"3 bed 2 bath and 1 Car Garage Condo for Rent. Great Community, closer to Train stations, closer to Costco\/Walmart\/Sams Club etc.\n❤️Contact me directly: show contact info\nMore Info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nUTILITIES INCLUDED (Gas, Electric, water, and Garbage) $700\/month. Large Remodeled 2 Bedroom Apartment in quite neighborhood. Butcher block countertops, new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!! LAUNDRY ON SITE!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting.\n","num_images":4.0,"lat":40.5325,"lng":-74.3375,"attrs":"['3BR \/ 2Ba', '1283ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T15:16:20-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-come-look-and-lease-cats-and\/7518499418.html","post_id":7518499418,"result_date":"2022-08-07 14:43","title":"Come Look and Lease, Cats and Dogs, Pet Friendly","description":"Top of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nYou will love living here! Call Top of the Hill today!\nThis two bedroom two bathroom apartment has plenty of space and a walk in closet. Balcony and more.\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm\nCommunity Features\n* Tennis Court\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Professionally Managed\n* Laundry Care Center\n* Car Wash Area\n* Sun Deck\n* Swimming Pool\n* Fitness Studio\n* Renters Insurance is Required\n* Playground\n* After-Hours Emergency Maintenance\n* Some Utilities Included","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['2BR \/ 2Ba', '1221ft2', 'available aug 9', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T14:39:21-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-lovely-duplex-bedroom-bath\/7518465697.html","post_id":7518465697,"result_date":"2022-08-07 14:02","title":"++++Lovely duplex 3 bedroom 1 bath house for rent with located on  Lan","description":"Lovely duplex 3 bedroom 1 bath house for rent with located on  Lancaster, PA. Apartments feature upgraded kitchens and baths, large windows, ceiling fans in most units, hardwood floors, A large living room space, and large windows! Each bedroom can easily accommodate a queen size bed with extra furnishings! Plenty of closet space, and central A\/C and heating! Property owner pays for water, sewer and trash pick-up. OK smoking and no pets- firm. Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short term housing. This open and inviting space was recently remodeled and features new Vinyl flooring throughout, carpet in bedrooms, granite counter tops, stainless steel appliances. Seasonal off-street parking available at no additional cost. High Speed Wireless internet included. Enjoy living District with easy\/walkable access to downtown, restaurants & bars, grocery stores,shops, hiking trails . It's also located above massage services, Frenchie’s Floral Studio, next to The Gym, and one block away from Coppa coffee shop & ice cream parlor! Welcome home to South View Apartments in Ames, Iowa! Our pet-friendly, two-bedroom floor plans feature fully-equipped kitchens, large walk-in closets, as well as private patios or balconies. Ball fields, tennis courts, basketball courts, bocce courts, horseshoe pits, and a running track are featured throughout the park for exercise and for play. If you are interested please TEXT: show contact info","num_images":3.0,"lat":40.0766,"lng":-76.3107,"attrs":"['3BR \/ 1Ba', '1120ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T13:22:17-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mount-royal-call-for-details-car-care\/7518480126.html","post_id":7518480126,"result_date":"2022-08-07 14:00","title":"Call for Details, Car Care Center, Heather Ridge Apartments","description":"View this apartment today at Heather Ridge!\nGreat one bedroom one bathroom apartment with washer dryer, large walk in closet in bedroom and off the living room and more!\nVIEW OUR WEBSITE:\nhttps:\/\/heatherridgeapts.net\nHeather Ridge Apartments, managed by Panco Management\n454 Heather Drive\nMantua, NJ 08051\nshow contact info\nCommunity Features\n* Swimming Pool\n* Professionally Managed\n* Extra Storage\n* Renters Insurance is Required\n* Short or Long Term Lease Available\n* Special offers and pricing available to new leases only, not renewals, transfers or current residents\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Car Wash Area\n* Credit Cards Accepted\n* Tennis Court\n* Fitness Studio\n* Some Utilities Included\n* Outdoor Grill Area\n* Minutes from Restaurants, Shopping, and Much More\n* Bark Park\n* Easy Freeway Access\n* Playground\n* Short Term Lease Available\n* After-Hours Emergency Maintenance\n* Liability Insurance is Required","num_images":18.0,"lat":39.806488,"lng":-75.177315,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T13:56:27-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-lovely-duplex-bedroom-bath\/7518465710.html","post_id":7518465710,"result_date":"2022-08-07 13:50","title":"++++Lovely duplex 3 bedroom 1 bath house for rent with located on  Lan","description":"++++Lovely duplex 3 bedroom 1 bath house for rent with located on  Lancaster, PA. Apartments feature upgraded kitchens and baths, large windows, ceiling fans in most units, hardwood floors, A large living room space, and large windows! Each bedroom can easily accommodate a queen size bed with extra furnishings! Plenty of closet space, and central A\/C and heating! Property owner pays for water, sewer and trash pick-up. OK smoking and no pets- firm. Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short term housing. This open and inviting space was recently remodeled and features new Vinyl flooring throughout, carpet in bedrooms, granite counter tops, stainless steel appliances. Seasonal off-street parking available at no additional cost. High Speed Wireless internet included. Enjoy living District with easy\/walkable access to downtown, restaurants & bars, grocery stores,shops, hiking trails . It's also located above massage services, Frenchie’s Floral Studio, next to The Gym, and one block away from Coppa coffee shop & ice cream parlor! Welcome home to South View Apartments in Ames, Iowa! Our pet-friendly, two-bedroom floor plans feature fully-equipped kitchens, large walk-in closets, as well as private patios or balconies. Ball fields, tennis courts, basketball courts, bocce courts, horseshoe pits, and a running track are featured throughout the park for exercise and for play. If you are interested please TEXT: show contact info","num_images":3.0,"lat":40.0766,"lng":-76.3107,"attrs":"['3BR \/ 1Ba', '1120ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T13:22:19-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/redding-utilities-included-gas-electric\/7518456294.html","post_id":7518456294,"result_date":"2022-08-07 13:40","title":"UTILITIES INCLUDED (Gas, Electric,","description":"UTILITIES INCLUDED (Gas, Electric, water, and Garbage) $600\/month. Large Remodeled 1 Bedroom Apartment in Nashua quite neighborhood. Butcher block countertops, new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!! Laundry on site!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles, will consider pets but need to be approved in advance. References and. please contact my personal email ::lucy85828gmail.com","num_images":4.0,"lat":40.547,"lng":-122.34,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'apartment', 'w\/d hookups', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T13:00:10-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/east-brunswick-luxury-apartment-with\/7518423212.html","post_id":7518423212,"result_date":"2022-08-07 13:34","title":"Luxury apartment with gym, pool and more!!","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21.0,"lat":40.4284,"lng":-74.4064,"attrs":"['1BR \/ 1Ba', '817ft2', 'available now', '\\nsunday 2022-08-07\\n', '\\nmonday 2022-08-08\\n', '\\ntuesday 2022-08-09\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T11:39:44-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-beautiful-fully-furnished\/7518463422.html","post_id":7518463422,"result_date":"2022-08-07 13:28","title":"Beautiful Fully Furnished Corporate Suite","description":"Apt. 1305 — Royal floor plan —1,293 sq. ft. — $5,496\nThis 3rd floor Royal is a fully-furnished corporate suite. It has a spacious living room, a dining set, and bar stools. This apartment features LTV hardwood flooring and upgraded stainless steel appliances. The master suite comes with an enormous walk-in closet and double sinks with a luminous shower. The guest bedroom is spacious as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more! Available for short-term lease, utilities included!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1293ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T13:17:10-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/medford-exquisite-rental-in-medford\/7518458505.html","post_id":7518458505,"result_date":"2022-08-07 13:11","title":"Exquisite Rental in Medford Lakes!!","description":"Beautiful rental in Medford Lakes!!  Bring your Kayak & Canoes!!\nCall Phyllis  show contact info","num_images":8.0,"lat":39.831948,"lng":-74.851146,"attrs":"['4BR \/ 2.5Ba', '4078ft2', 'available aug 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-08-07T13:05:21-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-will-welcome-you-as-you-enter\/7518448480.html","post_id":7518448480,"result_date":"2022-08-07 13:05","title":"will welcome you as you enter this lower level, well-appointed townhom","description":"Ground level, updated 2 bed\/2 bath condo with parking and close to major amenities! Brand new paint throughout the entire condo- along with updated flooring- will welcome you as you enter this lower level, well-appointed townhome in desirable Wyomissing and Wilson School district. Tucked away in your private condo community yet close to everything including a plethora of shopping and dining options. Send me your phone number and I will contact you as soon as possible.The master bedroom connects to the full bathroom and features a walk-in closet. Central air conditioning compressor recently replaced in 2018. Designated Parking spot is included on bottom road near the patio and door to the unit, so no stairs! If driving by, be sure to follow the parking lot to the one-way roadway which goes by the bottom level to see the entrance and parking spots. Additional spots available to buyer thru the association. In-unit laundry doubles up with a kitchen pantry in the walk-in room off the kitchen area. Master bath complete renovation, upgraded lighting fixtures throughout, new range and refrigerator, upgraded cabinets and countertops, upgraded vinyl flooring in entry and kitchen and ceramic tile master bath. Dining area flows to living area for a nice open floor plan. A second half-bathroom is located between the living room and kitchen.","num_images":5.0,"lat":40.338,"lng":-75.978,"attrs":"['2BR \/ 2Ba', '1184ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T12:41:23-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/east-brunswick-luxury-apartment-with\/7518422387.html","post_id":7518422387,"result_date":"2022-08-07 12:53","title":"Luxury apartment with gym, pool and more!!","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21.0,"lat":40.4284,"lng":-74.4064,"attrs":"['1BR \/ 1Ba', '911ft2', 'available now', '\\nsunday 2022-08-07\\n', '\\nmonday 2022-08-08\\n', '\\ntuesday 2022-08-09\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T11:37:22-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-washer-dryer-in-rental-pets\/7518451344.html","post_id":7518451344,"result_date":"2022-08-07 12:52","title":"Washer\/dryer in rental, Pets welcome, Balcony","description":"Bedrooms: 2Bathrooms: 1Square Feet: 960Date Available: 2022-08-29Address: 100 Fox Meadow DriveWelcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today. Amenities Include:24-hour maintenanceFitness centerLaundry facilitiesCorporatePets welcomeFurnishedFull-size washer\/dryer availableStorageTennis courtSignal 88 Courtesy PatrolPrivate entrancesPlaygroundsCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/4as64dcf\/fox-meadow*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['2BR \/ 1Ba', '960ft2', 'available aug 29', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:48:14-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/neptune-luxury-apartment-for-rent\/7518449726.html","post_id":7518449726,"result_date":"2022-08-07 12:48","title":"LUXURY APARTMENT FOR RENT","description":"Contact info:\nThe Pointe at Neptune | Edgewood Properties |  show contact info\nTHE POINTE AT NEPTUNE\n3425 W. Bangs Avenue, Neptune, NJ 07753\nshow contact info\nwww.pointeatneptune.com\nKEY FEATURES\n1 and 2 Bedroom Garden Homes\nPrivate Patios or Balconies\nCentral Air Conditioning\nIntrusion Alarm System\nSpacious Master Suites with Large Walk-In Closets and Double Vanities\nLuxurious tile in entry, gourmet kitchen and in all baths **Select models feature hardwood floors, granite counter tops, stainless steel appliances and premium bedroom carpet **Select models feature fully finished basements with large laundry rooms, additional storage and\/or an additional ½ bathroom Gourmet Kitchen\nDESCRIPTION\nWelcome to The Pointe at Neptune, Edgewood Properties’ premier garden style rental community located in the heart of Monmouth County. You are invited to experience excellence in living with our scenic views, proximity to major highways and transportation, and luxurious amenities. Your new community includes concierge service, 24-hour business and fitness center, emergency maintenance and a resort style pool. A variety of spacious floor plans that offer full size washer\/ dryers, over-sized patios, and extensive kitchens. Basements are included in selected floor plans. We are open 7 days a week, and just a call or click away. Schedule your visit with our leasing professionals and you too will find that “All Roads Lead to the Pointe.”\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/pointeatneptune.com\nContact info:\nThe Pointe at Neptune\nEdgewood Properties\nshow contact info\n","num_images":12.0,"lat":40.2096,"lng":-74.0714,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:44:20-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/east-brunswick-luxury-apartment-with\/7518421386.html","post_id":7518421386,"result_date":"2022-08-07 12:46","title":"Luxury apartment with gym, pool and more!!","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21.0,"lat":40.4284,"lng":-74.4064,"attrs":"['1BR \/ 1Ba', '1021ft2', 'available now', '\\nsunday 2022-08-07\\n', '\\nmonday 2022-08-08\\n', '\\ntuesday 2022-08-09\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T11:34:44-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-bedroom-house-300-block-street\/7518442386.html","post_id":7518442386,"result_date":"2022-08-07 12:31","title":"3 Bedroom house, 300 block S. 17 1\/2 street- $850\/month","description":"I have a 3 bedroom house available September 1st in the 300 block of south 17 1\/2 street in Reading. No pets, no smoking. One bedroom is small, suitable for a child. Gas heat, hot water, and stove. Stove, refrigerator, washer, and dryer provided. First floor has living room, middle room, and eat-in kitchen. Second floor has full bathroom and 3 bedrooms. Full, unfinished attic. Dry basement with washer and dryer, and a second shower stall. Fenced grass backyard. Covered porch in front. $850\/month, $1200 security deposit. The whole house was remodeled and new floors installed before current tenant moved in. Current tenant is in the process of moving to another of my properties so I do not have any pictures at this time.","num_images":0.0,"lat":40.3306,"lng":-75.9192,"attrs":"['3BR \/ 1Ba', 'available sep 1', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:27:16-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/myerstown-updated-bedroom-bathroom\/7518423386.html","post_id":7518423386,"result_date":"2022-08-07 12:31","title":"Updated 3 bedroom 2 bathroom townhouse","description":"Rental finding suitable housing. Bedroom 3 is currently utilized as a walk-in closet. Attic area could be improved as another bedroom. Oversize 1 Car Garage currently utilized as workshop - can easily be converted back to garage with overhead door intact. Garage has separate electric service & meter. Heated & cooled by mini split system, installed November 2015. Roofs replaced in 2016. Kitchen updated September 2014. Bathroom updated with Walk-in Shower with glass doors September 2021. Off Street Parking for 1 vehicle. Corner Lot with small garden area. Deck & Balcony. Don't Miss this One! EMAILS MUST HAVE A CONTACT NUMBER TO GET A RESPONSE.","num_images":4.0,"lat":40.351307,"lng":-76.377343,"attrs":"['3BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T11:40:12-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-move-in-now-balcony-minutes\/7518440829.html","post_id":7518440829,"result_date":"2022-08-07 12:27","title":"Move In Now, Balcony, 8 Minutes to Downtown","description":"Top of the Hill is located in the desirable Brandywine Hundred of North Wilmington. Call today!\nThis two bedroom two bathroom apartment has plenty of space and a walk in closet. Balcony and more.\nTop of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['2BR \/ 2Ba', '1221ft2', 'available aug 9', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:23:31-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-pool-shower-tot-lot-amazon\/7518439010.html","post_id":7518439010,"result_date":"2022-08-07 12:22","title":"Pool Shower, Tot Lot, Amazon Lockers","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Fire PitConference CenterCoffee ShopEvent SpacePool ShowerParking GarageCatering KitchenClimate Controlled StorageThe HubBusiness CenterOutdoor SeatingMusic RoomCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/43toitzt\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10.0,"lat":40.5716,"lng":-74.3167,"attrs":"['1BR \/ 1.5Ba', '740ft2', 'available oct 29', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-08-07T12:18:48-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-bike-storage-lounge-retail\/7518438351.html","post_id":7518438351,"result_date":"2022-08-07 12:21","title":"Bike Storage, Lounge, Retail","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Catering KitchenGame RoomGrillsPoolLocker RoomOutdoor SeatingConference CenterRetailPet WashLeasing OfficeLoungeDog ParkCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/c3gbhfbg\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10.0,"lat":40.5716,"lng":-74.3167,"attrs":"['0BR \/ 1Ba', '545ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-08-07T12:17:15-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-bedroom-apartment-luxury\/7518434053.html","post_id":7518434053,"result_date":"2022-08-07 12:10","title":"1 Bedroom Apartment - Luxury Living","description":"Apt. 1109 — Buckingham floor plan — 810 sq. ft. — $2,335\nLocated on the 1st floor, this 1-bed\/1-bath apartment has an open floor plan with the kitchen looking into an abundant living\/dining room. The bedroom is spacious, well-lit, and has ample closet space. It boasts central air and heat, a front-loading washer and dryer, and the bathroom is full-sized with a tub. The bedroom is also large with access to the balcony, and has a large walk-in closet! This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool and more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":16.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '810ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T12:06:45-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-call-for-details-pet\/7518431763.html","post_id":7518431763,"result_date":"2022-08-07 12:05","title":"Call for Details, Pet Friendly , Balcony","description":"VIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nWatch the seasons change from your balcony with a spectacular view of the densely wooded banks of a beautiful creek winding through the property. For recreation enjoy two tennis courts, a playground, and swimming pool. With parks in front and behind the property, describing Top of the Hill as being in a quiet park-like setting is not an exaggeration.\nThis one bedroom one bathroom apartment has the added bonus of a den and galley kitchen and more.\nTop of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm\nApartment Features\n* Microwave\n* Private Patio or Private Balcony (on select apartments)\n* Central Heat and Air\n* Gas Stove\n* Dishwasher\n* Pre-wired for internet and cable\n* Refrigerator\n* Walk-in Closet\n* Vertical Blinds","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['1BR \/ 1Ba', '996ft2', 'available aug 9', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:01:27-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-large-remodeled-3br-2ba\/7518429625.html","post_id":7518429625,"result_date":"2022-08-07 12:05","title":"+ Large Remodeled ~ 3BR \/ 2Ba Apartment in Wilmington !!","description":"UTILITIES INCLUDED (Gas, Electric, water, and Garbage) $1020\/month. Large Remodeled + 3 Bedr00m Apartment in Wilmington quite neighborhood. Butcher block countertops, new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!! Laundry on site!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 1 or 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. Serious inquiries only please.Text to know all the details including facilities ~ Email=>>sophiarebieri4gmailcom","num_images":4.0,"lat":39.7168,"lng":-75.6184,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T11:56:11-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-duplex-11-in-allentown\/7518425209.html","post_id":7518425209,"result_date":"2022-08-07 11:59","title":"Duplex 1.1 In Allentown !","description":"Duplex 1 bedroom 1 bath apartment rent in Allentown. Twp. The landlady pays for heat (oil hot water), electricity, and cable. with washer dryer hookups and cabinets lower level has a large bedroom, Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short-term housing. Landlord provides and installs window air conditioners in the summer. The property owner pays for water, sewer, and trash pick-up. Ideal for college students or those seeking short term housing. electric and cable. fifers idyllic living in Worcester Twp. new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!!Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. If you are interested please send me your number. I will contact you soon. Large apartment on the 2nd floor at . Good size living room with separate large dining area and walk-in pantry. One bedroom is very large, the other is smaller. Recently installed shower\/tub combo in bathroom with all new plumbing throughout the building. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Plowing and lawn mowing taken care of by owner!!! Laundry on site!! Rento casa en colonia Libertad patio muy grande todo enrejada con barda 4 recamaras y 2 baños con teraza piso nuevo y baño nuevo en la planta de abajo en $500 mas deposito. Property owner pays for water, sewer and trash pick-up. Ideal for college students or those seeking short term housing. Close to Turnpike, , KOP, and MCCC. Rent- $500 \/month. if you are interested text number .","num_images":3.0,"lat":40.5891,"lng":-75.4645,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T11:44:50-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-duplex-bed-bath-apt-rent-in\/7518424735.html","post_id":7518424735,"result_date":"2022-08-07 11:58","title":"Duplex 2 bed \/ 2 bath apt rent in Allentown !","description":"Duplex 2 bedroom 2 bath apartment rent in Allentown. Twp. The landlady pays for heat (oil hot water), electricity, and cable. with washer dryer hookups and cabinets lower level has a large bedroom, Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short-term housing. Landlord provides and installs window air conditioners in the summer. The property owner pays for water, sewer, and trash pick-up. Ideal for college students or those seeking short term housing. electric and cable. fifers idyllic living in Worcester Twp. new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!!Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. If you are interested please send me your number. I will contact you soon. Large apartment on the 2nd floor at . Good size living room with separate large dining area and walk-in pantry. One bedroom is very large, the other is smaller. Recently installed shower\/tub combo in bathroom with all new plumbing throughout the building. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Plowing and lawn mowing taken care of by owner!!! Laundry on site!! Rento casa en colonia Libertad patio muy grande todo enrejada con barda 4 recamaras y 2 baños con teraza piso nuevo y baño nuevo en la planta de abajo en $800 mas deposito. Property owner pays for water, sewer and trash pick-up. Ideal for college students or those seeking short term housing. Close to Turnpike, , KOP, and MCCC. Rent- $800 \/month. if you are interested text number .","num_images":3.0,"lat":40.5891,"lng":-75.4645,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T11:43:40-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-3br-ft2-be4x6-large-home-yard\/7518405869.html","post_id":7518405869,"result_date":"2022-08-07 11:51","title":"*3br - 1,200ft2 - 3 be\"4x6 \"large home Yard garage a\/c { NJ }","description":"Large 3 bedroom double living room hardwood flooring hi efficient insert fireplace large kitchen dinning room has a 6 ft 2 bay ranch sink back door exits to deck and covered porch next to back door for the bbq hallway has a coat closet 4x6 walking pantry also has built in drawers and linen closet full bath with a heater that will warm next to tub large master with walking closet also has a sink with counter top and moors nice view of backyard cider grove bed 2 has closet cider grove view utility room with washer dryer hookups and cabinets lower level has a large bedroom and a hobby room with a workbench and storage shelving this home has a central heat ump a\/c system with a allergy filter in the ceiling each room has a zoned heater if separate comfort is preferred this home is well insulated r-49 to save on energy costs no carpet hardwoods Pergo tile floors.","num_images":6.0,"lat":40.2336,"lng":-74.6576,"attrs":"['3BR \/ 2Ba', '1200ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T10:53:47-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-fitness-center-pet-wash-parking\/7518425504.html","post_id":7518425504,"result_date":"2022-08-07 11:49","title":"Fitness Center, Pet Wash, Parking Garage","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Children's Play AreaMusic RoomGrillsConference CenterRetailThe HubRooftop CourtyardPoolLocker RoomBusiness CenterFire PitFitness CenterCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/tpjiebny\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10.0,"lat":40.5716,"lng":-74.3167,"attrs":"['2BR \/ 2Ba', '1190ft2', 'available oct 2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-08-07T11:45:37-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-dog-park-fire-pit-grills\/7518424506.html","post_id":7518424506,"result_date":"2022-08-07 11:47","title":"Dog Park, Fire Pit, Grills","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: PoolFitness CenterPet WashChildren's Play AreaFire PitCatering KitchenGame RoomThe HubJuice BarTheaterConference CenterRetailCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/hkhbw3jy\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10.0,"lat":40.5716,"lng":-74.3167,"attrs":"['2BR \/ 2Ba', '1179ft2', 'available oct 2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-08-07T11:43:07-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-lounge-juice-bar-metropark\/7518423872.html","post_id":7518423872,"result_date":"2022-08-07 11:45","title":"Lounge, Juice Bar, Metropark Shuttle Pickup","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: LoungeBike StorageJuice BarBusiness CenterMusic RoomLeasing OfficeChildren's Play AreaCoffee ShopGrillsAmazon LockersThe HubMetropark Shuttle PickupCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/267niw5k\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10.0,"lat":40.5716,"lng":-74.3167,"attrs":"['2BR \/ 2Ba', '1112ft2', 'available oct 2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-08-07T11:41:30-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-pet-wash-bike-storage-catering\/7518423291.html","post_id":7518423291,"result_date":"2022-08-07 11:43","title":"Pet Wash, Bike Storage, Catering Kitchen","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Fire PitAmazon LockersJuice BarTheaterLoungeOutdoor SeatingGrillsMetropark Shuttle PickupDog ParkFitness CenterBike StoragePoolCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/eeuwznww\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10.0,"lat":40.5716,"lng":-74.3167,"attrs":"['1BR \/ 1Ba', '880ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-08-07T11:39:59-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-childrens-play-area-parking\/7518422818.html","post_id":7518422818,"result_date":"2022-08-07 11:42","title":"Children's Play Area, Parking Garage, Tot Lot","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Leasing OfficeFitness CenterDog ParkJuice BarMetropark Shuttle PickupParking GarageChildren's Play AreaMusic RoomLocker RoomCoffee ShopThe HubOutdoor SeatingCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/zkhbfby2\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10.0,"lat":40.5716,"lng":-74.3167,"attrs":"['2BR \/ 2Ba', '1070ft2', 'available sep 19', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-08-07T11:38:33-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/princeton-renovated-downtown-princeton\/7518422222.html","post_id":7518422222,"result_date":"2022-08-07 11:40","title":"Renovated Downtown Princeton House (3bd 1.5bath)","description":"Newly renovated home blocks from downtown Princeton for rent available immediately. New floors, fixtures, appliances, air conditioning, and paint await a new tenant. Located a short walk away from community park pool, green space, and tennis courts, as well as around the corner from Mary Moss park, this house is ideal for young families or Princeton students or faculty.\nRelax in the quiet, close-knit community on John St, catching evening light on the porch. Walk to the corner for dinner at Tortugas, Local Greek, or the Meeting House if you're feeling fancy.\n12-month lease term.\nTenants responsible for all utilities (water, gas, electric, internet).\nPets are generally discouraged, although exceptions are possible for small, hypoallergenic pets upon request and additional information.\nOne off-street parking spot included in the lease.\n","num_images":13.0,"lat":40.355459,"lng":-74.66455,"attrs":"['3BR \/ 1.5Ba', '1450ft2', 'available now', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T11:36:56-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/new-york-1200ft2-sunny-spacious\/7518401174.html","post_id":7518401174,"result_date":"2022-08-07 11:23","title":"*1,200ft2 - Sunny, Spacious, Apartment in  Essex Market \/\/\/ N\/\/\/Y|||","description":"Beautiful, spacious two bedroom 3rd floor apartment available for rent September 1st. The apartment features hard wood floors, double parlor, large kitchen with black walnut cabinets, gas stove and heat, dining area, bath with shower, two bedrooms, and plenty of closet space. The apartment also features stunning views of the State Capital and Downtown Providence. There is additional storage space available in the basement.\nFor an additional $100 per month you can rent the driveway, which will fit up to 3 of your automobiles. There is also plenty of street parking available. The apartment also features coin-operated laundry facilities in the basement.","num_images":5.0,"lat":40.8019,"lng":-73.9531,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T10:40:21-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/browns-mills-bedrooms-available-now-call\/7518404818.html","post_id":7518404818,"result_date":"2022-08-07 11:08","title":"1,2, & 3 Bedrooms Available NOW! Call!","description":"Located in Browns Mills, New Jersey, Browns Woods is an apartment community offering one, two, and three bedroom apartments for rent. Professionally managed by Housing Management Resources, Inc., Browns Woods offers residents a variety of amenities, including community laundry facilities, a fun filled playground, a computer center where children of all ages can surf the internet in a safe environment, kitchens equipped with energy efficient appliances, and 24 hour emergency maintenance service. Contact our on site staff to schedule a tour of your new home at Browns Woods today!\nUnits starting at $1,140\nCall us today –  show contact info","num_images":13.0,"lat":39.9597,"lng":-74.5655,"attrs":"['3BR \/ 1Ba', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T10:50:52-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-on-site-management-laundry\/7518409612.html","post_id":7518409612,"result_date":"2022-08-07 11:07","title":"On-site management, Laundry facilities, Air Conditioning","description":"Welcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today.\n-24-hour maintenance\n-Shopping plaza\n-Signal 88 Courtesy Patrol\n-Playground\n-Pool\n-Fitness and jogging trails\n-Pets\n-Balcony\n-Onsite CVS and WAWA\n-Tennis court\n-Playgrounds\n-Air Conditioning\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/hpjfyfz5\/fox-meadow\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['2BR \/ 1.5Ba', '1000ft2', 'available aug 15', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T11:03:38-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-onsite-daycare-center-pool\/7518407344.html","post_id":7518407344,"result_date":"2022-08-07 11:01","title":"Onsite Daycare Center, Pool, Pets","description":"Bedrooms: 2Bathrooms: 1Square Feet: 960Date Available: 2022-08-22Address: 100 Fox Meadow DriveWelcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today. Amenities Include:FurnishedFull-size washer\/dryer availableAir ConditioningOn-site managementOnsite Daycare CenterPatioCorporateSwim clubFitness and jogging trailsWasher\/dryer in rentalShopping plazaDisposalCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/r5xdprw3\/fox-meadow*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['2BR \/ 1Ba', '960ft2', 'available aug 22', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T10:57:50-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-furnished-tennis-court\/7518406045.html","post_id":7518406045,"result_date":"2022-08-07 10:58","title":"Furnished, Tennis court, Playground","description":"Welcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today.\n-Shopping plaza\n-Onsite Daycare Center\n-Tennis court\n-Corporate\n-Onsite CVS and WAWA\n-Private entrances\n-Storage\n-Air Conditioning\n-Fitness center\n-Washer\/dryer in rental\n-Patio\n-Disposal\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/ftkjnxv3\/fox-meadow\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['1BR \/ 1Ba', '650ft2', 'available aug 15', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T10:54:19-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-very-nice-clean-one-bedroom\/7518389534.html","post_id":7518389534,"result_date":"2022-08-07 10:39","title":"Very nice, clean one bedroom daylight basement apartment- $595 mo.","description":"Available 10 Sep 2022. Very nice, clean one bedroom daylight basement apartment in private home, quiet neighborhood. All utilities, including internet included. Natural gas heat. Unfurnished, but table, chairs, sofa, area rug and queen bed may be available. Bedroom has a large closet and room for a a queen bed and dresser. Kitchen\/dining room has full-size refrige. and dishwasher. Renter has use of laundry facilities. Attached garage parking in winter months. One person only, non-smoker\/non-vaping. No pets preferred, but one, well behaved spayed cat considered. Rent is reduced to only $595\/month in exchange for light yardwork when owners are gone, and an occasional pet sitting (2 small, well behaved spayed cats). $595 deposit plus rental application (no fee) with references. Feel free to text or email with any questions or give your number to set up a time to see it.","num_images":3.0,"lat":39.7378,"lng":-75.5497,"attrs":"['1BR \/ 1Ba', 'available sep 10', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T10:05:33-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/south-plainfield-apartment-for-rent\/7518386971.html","post_id":7518386971,"result_date":"2022-08-07 10:22","title":"Apartment for rent","description":"One bedroom apartment for rent. Kitchen, bathroom, small living area off of kitchen, 1 bedroom loft upstairs. Utilities included.\nContact: Vinny.  show contact info","num_images":0.0,"lat":40.5839,"lng":-74.4147,"attrs":"['1BR \/ 1Ba', 'available sep 1', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T09:57:43-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-affordable-brand-new-br-ba\/7518389599.html","post_id":7518389599,"result_date":"2022-08-07 10:18","title":"Affordable brand new 2 BR, 1 BA apartment for rent w\/ $725 deposit","description":"Affordable brand new 2 BR, 1 BA apartment for rent in convenient country setting in excellent neighborhood Delaware. Features all new appliances, private backyard, peaceful patio, and all one level entrances with private parking. This must see apartment includes washer and dryer, dishwasher, lawn care service, and WiFi. On site management care. Central A\/C and gas heat. $725\/ month plus utilities.","num_images":4.0,"lat":39.7378,"lng":-75.5497,"attrs":"['2BR \/ 1Ba', 'available sep 8', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T10:05:46-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/new-brunswick-bedroom-bath-luxury\/7518387219.html","post_id":7518387219,"result_date":"2022-08-07 10:17","title":"2 Bedroom, 2 Bath, Luxury Rental near Rutgers University!","description":"Contact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIGHTS\n11 US-1, New Brunswick, NJ 08901>\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n… AND MORE!\nDESCRIPTION\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\nContact info:\nThe Edge at Raritan Heights\nEdgewood Properties\nshow contact info\nContact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIHTS\n11 US-1, New Brunswick, NJ 08901\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n…AND MORE!\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\n","num_images":14.0,"lat":40.4891,"lng":-74.4482,"attrs":"['2BR \/ 2Ba', '1253ft2', 'available aug 14', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T09:58:37-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-mon-to-mon-rental-agreement\/7518387072.html","post_id":7518387072,"result_date":"2022-08-07 10:16","title":"Mon to Mon rental agreement 30-day**  Furnished 2 Bed, 3rd Floor","description":"Fully Furnished 2 Bedroom 3rd Floor Apartment. Includes all utilities, appliances, Heat, Electric Gas. Month to Month rental agreement 30-day notice required when ready to vacate. $640 per month $640 security deposit. Available September 13th, 2022. Email me at)))  faraninkamlisagmail.com","num_images":7.0,"lat":40.6622,"lng":-75.3903,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T09:58:03-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/new-brunswick-bedroom-bath-luxury-rental\/7518384531.html","post_id":7518384531,"result_date":"2022-08-07 10:07","title":"2 Bedroom, 2 Bath, Luxury Rental","description":"Contact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIGHTS\n11 US-1, New Brunswick, NJ 08901>\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n… AND MORE!\nDESCRIPTION\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\nContact info:\nThe Edge at Raritan Heights\nEdgewood Properties\nshow contact info\nContact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIHTS\n11 US-1, New Brunswick, NJ 08901\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n…AND MORE!\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\n","num_images":14.0,"lat":40.4891,"lng":-74.4482,"attrs":"['2BR \/ 2Ba', '1253ft2', 'available sep 14', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T09:49:11-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/oaklyn-large-bedroom-bath-for-rent\/7518377165.html","post_id":7518377165,"result_date":"2022-08-07 10:04","title":"Large 3 Bedroom 2 Bath For Rent","description":"Fantastic, large first floor apartment with living room, dining room, kitchen with pass through to dining room, 3 bedrooms and 2 full baths. Hardwood floors throughout with ceramic tile in kitchen and baths. Off street parking. Front and side entrances. Common laundry in basement. Tenant pays electric and cooking gas. Owner pays heat, hot water, cold water and sewer. Walk to park, schools, shopping and dining in downtown Collingswood. Convenient to major highways and bridges.","num_images":14.0,"lat":39.910626,"lng":-75.085395,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-08-07T09:22:57-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-no-lease-weekly-rates\/7518370661.html","post_id":7518370661,"result_date":"2022-08-07 10:02","title":"No lease. Weekly rates starting at $590.","description":"A budget-friendly extended stay hotel in Bethlehem, PA\nWe invite you to experience the conveniences of home at WoodSpring Suites® Allentown Bethlehem. Our all-suite hotel with in-room kitchens is the perfect choice for your extended stay, whether it’s for a week, a month, or longer. We offer low nightly, weekly, and monthly hotel rates to help save you money. Plus, you'll enjoy free WiFi, guest laundry facilities and free parking at our 100% smoke-free, pet-friendly property, making your stay simple and hassle-free.\nYou'll enjoy quick access to a variety of destinations and attractions when you stay at our hotel in Bethlehem, Pennsylvania. If you’d like to take advantage of public transportation, we're right on the 108, 217, 319, and 327 local LANta bus routes, while the Amtrak Bus Station is just 6 miles away. We're about 8 miles from the Lehigh Valley International Airport\/ABE Airport. $50 to $100 Deposit.\nHotel at a Glance\n5 miles to Lehigh Valley Hospital Muhlenberg\n6 miles to St. Luke’s Hospital Anderson Campus\n6 miles to Greyhound and Amtrak stations\n8 miles to Lehigh Valley International Airport\nNightly, weekly and monthly hotel rates\nFull kitchen in every room\nGuest Rooms\nVisit our extended stay hotel and select the suite layout that meets your needs. Each layout features a combination of double-\/full-sized beds and sleeper sofas, as well as a dresser, nightstand and shelves. All suites also include a kitchen with full-size refrigerator, stovetop, microwave, cupboards and prep sink. Sit back and relax during your stay while enjoying free WiFi and a flat-screen TV with cable\/satellite and a premium movie channel. Every-other-week housekeeping services are provided for long-stay guests. Additional items—including a linen exchange, cookware, dishes, and more frequent housekeeping—are available for purchase at the front desk.\nExplore activities for all ages in Allentown Bethlehem\nYou're in the heart of it all when you stay at WoodSpring Suites in Allentown Bethlehem, where you'll find a variety of exciting attractions and destinations. History buffs will enjoy visiting the nearby Pennsbury Manor, the reconstructed estate of William Penn, who founded the Pennsylvania colony. We're also an easy drive to a number of family friendly activities, including Crayola Experience, Dorney Park and Wildwater Kingdom, and Lehigh Valley Zoo. Artists and creative types will want to check out the Banana Factory Arts Center, a collection of galleries and arts programs partly housed in a former banana distribution warehouse, about 9 miles away.\nShow Less\nPet Policy\nService animals are welcome at no additional charge, must be registered at front desk. Limit 2 dogs, under 75 lbs. per room. No cats. Non-refundable pet fees, 50 USD a pet reg fee and 10 USD a pet per night charge for the duration of the stay.\nHotel Alert: Some hotel features and amenities may be modified or unavailable due to COVID-19. For more information, please call your hotel directly.\nAmenities to help you stay awhile\nWoodSpring Suites is an extended stay hotel with clean and comfortable rooms, and a professional, friendly staff that’s available to assist you 24 hours a day, 7 days a week. Our 100% smoke-free hotel offers pet-friendly hotel rooms, free parking, guest laundry facilities and conveniently located vending machines. Daily, weekly and monthly hotel rates are available.\nHotel Amenities\n100% Smoke Free Hotel Free WiFi Kitchen Laundry* Pet-friendly Hotel* Elevator(s) Bus Parking Truck Parking Indoor Parking Strobe Lights\/Emerg. Smoke Detectors Emergency Lights, Exits Smoke Detector, Hall Sprinklers, Public Areas Visual Alarm Smoke Detector, Hardwired Smoke Alarm, Audible Fire Detectors, Public Areas Fire Detectors, Hall Smoke Detector, Battery Fire Extinguisher, Hall Sprinklers, In-Hall Autolink, firehouse Smoke Detector, Public Areas Fire Extinguisher Video Security, Public Areas Video Security, Hall Video Security, Entrance Locks, Guest Windows Evacuation Plan Windows that open Multiple Exits Per Floor Emergency Exit Map Walkways, Lighted Government Travelers: FEMA Approved High-Speed Internet - Charge* Free Wired High-Speed Internet Bi-weekly Housekeeping Local Laws, fire\/safe Late Check-Out Available Multi-Lingual Staff\nRoom Amenities\n(Amenities may vary by room type)\nNon-smoking Room Kitchen Facilities Microwave Room Air-Conditioning Free Local Calls Cable\/Satellite TV Table and Chairs Flat Screen\/Plasma TV AM\/FM Clock Radio Refrigerator 2-Burner Cooktop Bathtub\nAccessibility Amenities\nBraille Elevator(s) Braille Coded Exits Accessible Features Parking spaces for vans in self-parking facility Parking spaces in self-parking facility Free accessible parking Accessible registration desk Accessible public restrooms Accessible Hotel Hotel has TTY for guest use Public entrance is accessible Route from accessible public entrance to registration area Ramps, Accessible Roll-In Shower TV with Closed Captioning Doors have 32-inch clear width Accessible Room Wheelchair Accessible Accessible Tub\n","num_images":10.0,"lat":40.675987,"lng":-75.349195,"attrs":"['1BR \/ 1Ba', '253ft2', 'available now', 'air conditioning', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: weekly', 'wheelchair accessible']","posted_date":"2022-08-07T08:55:35-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/millersville-millersville-student\/7518383190.html","post_id":7518383190,"result_date":"2022-08-07 09:48","title":"Millersville Student\/College Student Housing","description":"Small basement apartment with private access and NO kitchen for rent at secluded wooded property.\nThis apartment is located in the basement of our home which is closed off from our living area. It has its own exterior entrance and has two rooms and a bathroom. There is no kitchen, but previous tenants have used a dorm refrigerator, hot plate and or microwave for meals. We have rented to Millersville students in the past and it has worked out well. We would prefer a student but are open to other options.  Absolutely no smoking or drug use is permitted. This space is for one person and one person only, please do not send an email telling us how you and your child or partner could make it work we will rent to one person only.  The apartment is located below our living room so there is normal household noise.\nThe property is located approximately 2 miles from the Millersville campus. We are then located back a half mile stone driveway in the woods.\nRent is $500 monthly and a $500 security deposit is required prior to move-in. All utilities are paid for and Wi-Fi is included also.\nApplicants should send an email giving their background and housing interest.  Applicants must provide references and proof of income. We have two children and are extremely picky with who we would allow at the property. If you have a questionable background or lifestyle please do not apply.\n","num_images":6.0,"lat":39.9868,"lng":-76.3813,"attrs":"['1BR \/ 1Ba', '250ft2', 'available now', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T09:44:48-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-bedroom-apartment-luxury\/7518381096.html","post_id":7518381096,"result_date":"2022-08-07 09:41","title":"1 Bedroom Apartment - Luxury Living","description":"Apt. 1109 — Buckingham floor plan — 810 sq. ft. — $2,335\nLocated on the 1st floor, this 1-bed\/1-bath apartment has an open floor plan with the kitchen looking into an abundant living\/dining room. The bedroom is spacious, well-lit, and has ample closet space. It boasts central air and heat, a front-loading washer and dryer, and the bathroom is full-sized with a tub. The bedroom is also large with access to the balcony, and has a large walk-in closet! This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool and more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":16.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '810ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T09:37:36-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/monroe-township-beautifully-luxurious\/7518358715.html","post_id":7518358715,"result_date":"2022-08-07 09:40","title":"Beautifully Luxurious 2Bed 2Bath with Amazing Amenities","description":"Contact info:\nThe Lofts at Monroe Parke |  show contact info\nTHE LOFTS AT MONROE PARKE\n623 Spotswood Englishtown Rd, Monroe Township, NJ 08831\nshow contact info\nwww.theloftsatmonroeparke.com>\nResidential Community with Luxurious Services and Amenities\nResident Lounge\nBusiness Center\nFitness Center\nConference Room\nElevators\nGame Room with Billiards\nDESCRIPTION\nLive the lifestyle you deserve at The Lofts at Monroe Parke, a brand new luxurious apartment community offering spacious one and two bedroom apartment homes. The community features an amazing array of amenities, including a spectacular residents’ lounge, premium fitness center, co-working space and conference rooms.\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theloftsatmonroeparke.com\nContact info:\nThe Lofts at Monroe Parke\nshow contact info\n","num_images":6.0,"lat":40.3192,"lng":-74.4285,"attrs":"['2BR \/ 2Ba', '855ft2', 'available sep 30', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T07:52:24-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/harrisburg-pool-access-gym-access\/7518372646.html","post_id":7518372646,"result_date":"2022-08-07 09:27","title":"Pool Access \/ Gym Access included..! Water Included in the rent.!@!@","description":"Freshly painted 1 bed and a den\/office room home with new Appliances and carpeting. Easy walk to restaurants and dog park. Public Transport is very close by. Water Included in the rent. Gas and Electricity should be paid by renter (Tenant Responsible)\nPool Access \/ Gym Access included.\n","num_images":0.0,"lat":40.2927,"lng":-76.8501,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T09:04:07-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/harrisburg-one-bedroom-farm-loft\/7518372392.html","post_id":7518372392,"result_date":"2022-08-07 09:23","title":"One bedroom farm Loft apartment","description":"One bedroom Loft apartment. 1 miles west of Millersville on route 999 ( Penn St. ) Water , sewer, trash, parking and laundry room included. per month , security deposit \/ plus heat and electric. Central AC\/propane heat. Very nice , clean and quite apartment. Looking for clean and stable SINGLE PERSON for long term tenant. (1 year lease) Call or tex jeff for appointment","num_images":0.0,"lat":40.2927,"lng":-76.8501,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T09:03:05-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/monroe-township-beautifully-luxurious\/7518362220.html","post_id":7518362220,"result_date":"2022-08-07 09:22","title":"Beautifully Luxurious 2Bed 2Bath with Amazing Amenities","description":"Contact info:\nThe Lofts at Monroe Parke |  show contact info\nTHE LOFTS AT MONROE PARKE\n623 Spotswood Englishtown Rd, Monroe Township, NJ 08831\nshow contact info\nwww.theloftsatmonroeparke.com>\nResidential Community with Luxurious Services and Amenities\nResident Lounge\nBusiness Center\nFitness Center\nConference Room\nElevators\nGame Room with Billiards\nDESCRIPTION\nLive the lifestyle you deserve at The Lofts at Monroe Parke, a brand new luxurious apartment community offering spacious one and two bedroom apartment homes. The community features an amazing array of amenities, including a spectacular residents’ lounge, premium fitness center, co-working space and conference rooms.\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theloftsatmonroeparke.com\nContact info:\nThe Lofts at Monroe Parke\nshow contact info\n","num_images":6.0,"lat":40.3192,"lng":-74.4285,"attrs":"['2BR \/ 2Ba', '855ft2', 'available sep 30', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T08:13:12-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/lumberton-cheap-deposit-onsite\/7518374956.html","post_id":7518374956,"result_date":"2022-08-07 09:18","title":"Cheap deposit!, Onsite Maintenance, 24hr emergency maintenance","description":"We offer great apartments in the Philadelphia South Jersey area. We offer spacious floor plans of one and two bedroom rental homes to choose from to find your perfect home with flexible lease terms. Select apartments offer a private entrance, upgraded kitchens with stainless steel appliances with dishwasher, and premium cabinets. Select apartments offer a patio. Private luxury with community living and a variety of amenities are included in your rent. Live where you can relax and enjoy our swimming pool, playground and picnic area.\nOur residents enjoy the convenience of bus service in walking distance, as well convenient access to Routes I-295, 95,and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Deptford and Turnersville. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!\nWe take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.\n-Gas Range\n-Public Transportation\n-Air Conditioning\n-Large Closets\n-Picnic Area\n-Cable Hookup\n-Playground\n-Patio\n-Blinds\n-Laundry Facilities\n-Courtyard\n-Pets\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/q42t5rrg\/whitehall-apartments\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":9.0,"lat":39.9651,"lng":-74.8067,"attrs":"['1BR \/ 1Ba', '650ft2', 'available aug 31', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T09:14:15-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/hoboken-1-3braptnearby-hos-elementary\/7518365589.html","post_id":7518365589,"result_date":"2022-08-07 09:14","title":"9-1-3BR,apt,Nearby Hos Elementary Schools,High Schools &Universities","description":"This newly renovated 3 bedroom apartment is ready for the right tenant. The kitchen comes with a new refrigerator, Range and Microwave. 13 x 13 carpeted bedroom, (2) 8 x 11 carpeted bedrooms, 13 x 13 living-room, 14 x 11 dining-room,\n13 x 13 eat-in kitchen, 5 x 8 newly renovated bathroom. Nearby Hos Elementary Schools, High Schools and Universities. Nearby bus lines are 6, 10, 80, 81, 87, and 119. Easy access to Parks, Hudson Mall, New Port Mall, Restaurants, Turnpike, 1&9, Light-Rail, Path Train and New York City. Tenant is responsible for Heat and Hot Water, Gas and Electric. Street parking only, tenant must have 1 1\/2 month security deposit, 12 month Lease, no pets allowed, Section 8 welcomed. Apartment will be ready September 1, 2022 .\n","num_images":3.0,"lat":40.7445,"lng":-74.0329,"attrs":"['3BR \/ 1Ba', 'available sep 1', 'apartment', 'no laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2022-08-07T08:30:37-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-move-in-now-beautiful-remodeled\/7518370620.html","post_id":7518370620,"result_date":"2022-08-07 09:06","title":"Move In Now!! Beautiful Remodeled 2 Bedroom Apartment","description":"UTILITIES INCLUDED (Gas, Electric, water, and Garbage) $650\/month. Large Remodeled 2 Bedroom Apartment in quite neighborhood. Butcher block countertops, new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!! LAUNDRY ON SITE!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. If you are interested please text me.","num_images":3.0,"lat":41.8442,"lng":-84.7648,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T08:55:28-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-gorgeous-newly-renovated-bed\/7518356258.html","post_id":7518356258,"result_date":"2022-08-07 08:21","title":"Gorgeous Newly Renovated 1 bed 1 bath Home - New Kitchen!","description":"This 1 large Bedroom (4 if large office room converted) 1 bathroom home has been completely renovated with new flooring, finishes, paint, appliances and kitchen. Large backyard and front patio for enjoying the outdoors. 5 minute walk to restaurants, shops, bars and gas station. 10 minute drive to multiple trail heads on the Appalachian Trail. 15-20 minute drive to Bethlehem and Stroudsburg\/Delaware Water gap for night life, more outdoors activities and late night dining. One and a half hour drive to the heart of NYC. Enjoy being the first ones to live in this new, conveniently located home! Posting on here first to avoid charging realtor fees, Because everything is new we are charging 2 months security. Asking rent is $750\/Month\n*As of 7\/31 the house still needs some trim work, some final minor tasks completed and the remaining tool and material cleared out. House will be 100% complete and ready for the open house 8\/7\/21.\n","num_images":0.0,"lat":40.6068,"lng":-75.4781,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T07:33:53-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/jersey-city-luxarious-two-bedroom\/7518360618.html","post_id":7518360618,"result_date":"2022-08-07 08:08","title":"LUXARIOUS !!Two-bedroom apartment, in Central","description":"LUXARIOUS !!Two-bedroom apartment, in Central, on a 2 acre lot, offers idyllic living in Bayonne Twp. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short term housing. Close to Bayonne, Skippack, KOP, and MCCC. Rent- $680\/month. Proof of income and credit score required. Text me:: show contact info","num_images":3.0,"lat":40.7328,"lng":-74.0755,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T08:04:10-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-bedroom-apartment-for-rent-in\/7518356385.html","post_id":7518356385,"result_date":"2022-08-07 08:06","title":"1 Bedroom Apartment for rent in (south side) downtown area of Bethle","description":"1 Bedroom Apartment for rent in (south side) downtown area of Bethlehem. Laminate and tile floors throughout. Updated bathroom. Apartment is sole apartment located in free standing building above business. Owner will accept a cat for pet. Application fee $750 per applicant to be done online.","num_images":0.0,"lat":40.6068,"lng":-75.4781,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T07:34:59-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/wildwood-beautifully-landscaped\/7518338805.html","post_id":7518338805,"result_date":"2022-08-07 03:24","title":"Beautifully Landscaped Courtyard Dog Park, Pet Friendly, Refrigerator","description":"Single family house , newly renovated. New Kitchen, appliances and bathroom. In a center of Wildwood , close to everything and 3 blocks to the beach. Private parking on a property with lots of parking on a street.\nThere is big back yard with seating. There are 2 bedrooms in a house. One bedroom with queen size bed, second bedroom has bunkbeds ( top -single, lower- double with memory foam mattress).\nRental does include pillows, linen and towels, dish soaps, hand soaps, laundry detergent, toilet paper, paper towels and many more. Kitchen is fully equipped.\nCentral air and heat.\nResidential neighborhood with no big bars or restaurants around.\nThis property just went through renovation and now is ready for your enjoyment. If you looking for specific dates and do not see them available, please email me, sometime people cancel their reservations for various reason. Thank you! $1,300 MONTHLY\nHosted by Tatsiana Kislaya: show contact info","num_images":17.0,"lat":38.9949,"lng":-74.838,"attrs":"['2BR \/ 1Ba', '770ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T02:24:18-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/wildwood-fully-furnished-beautifl\/7518336365.html","post_id":7518336365,"result_date":"2022-08-07 02:55","title":"FULLY FURNISHED BEAUTIFL 2 BEDROOM IN WILDWOOD!!!","description":"Single family house , newly renovated. New Kitchen, appliances and bathroom. In a center of Wildwood , close to everything and 3 blocks to the beach. Private parking on a property with lots of parking on a street.\nThere is big back yard with seating. There are 2 bedrooms in a house. One bedroom with queen size bed, second bedroom has bunkbeds ( top -single, lower- double with memory foam mattress).\nRental does include pillows, linen and towels, dish soaps, hand soaps, laundry detergent, toilet paper, paper towels and many more. Kitchen is fully equipped.\nCentral air and heat.\nResidential neighborhood with no big bars or restaurants around.\nThis property just went through renovation and now is ready for your enjoyment. If you looking for specific dates and do not see them available, please email me, sometime people cancel their reservations for various reason. Thank you! $1,300 MONTHLY\nHosted by Tatsiana Kislaya: show contact info","num_images":16.0,"lat":38.9949,"lng":-74.838,"attrs":"['2BR \/ 1Ba', '770ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T01:51:13-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-luxurious-two-br-unit\/7518320231.html","post_id":7518320231,"result_date":"2022-08-06 23:52","title":"Luxurious Two BR unit available in Wilmington","description":"Spacious 2BR unit available in Wilmington. Unit boasts hardwood floors throughout living and dining rooms, with nearly floor to ceiling windows allowing for great natural light. Bedroom is very large with luxurious carpet, en-suite bathroom, and walk-in closet. Galley kitchen features modern appliances with gas cooking range, granite countertops, and breakfast bar. Common laundry on site. One Garage Parking Space Included. Tenant pays electricity. Get more information directly contact landlord: jovanygaya54@gmail_com","num_images":5.0,"lat":39.7378,"lng":-75.5497,"attrs":"['2BR \/ 1Ba', 'application fee details: No Application Fee!!!', 'broker fee details: No Brokers Fee!!!', 'apartment', 'laundry on site', 'listed by: Bayside Realty', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-06T23:28:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this-beautiful\/7518582970.html","post_id":7518582970,"result_date":"2022-08-07 18:09","title":"@@@Welcome to this beautiful home for rent in East Mt Airy@@@","description":"Welcome to this beautiful home for rent in East Mt Airy! This property is listed as a 2 bedroom 1 bath. This home is bright and spacious with an open concept feel and updated kitchen. The unit comes complete with new flooring throughout, carpet bedrooms new appliances. Easy accessibility to public transit and major roadways.\nIF YOU ARE INTERESTED PLEASE TEX\/CALL:   show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nNewly 2 Bedroom 1 Bathroom Apartment Available Now. Butcher block countertops, new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Contact me to schedule a viewing ;; - offers idyllic living in Poughkeepsie. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Two-bedroom apartment, offers idyllic living in Worcester Twp. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short term housing. Skippack, KOP, and MCCC. Rent- $800 \/month. electric and cable. fifers idyllic living in Worcester Twp. new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!!Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. If you are interested please send me your number. I will contact you soon. Large apartment on the 2nd floor at . Good size living room with separate large dining area and walk-in pantry. One bedroom is very large, the other is smaller. Recently installed shower\/tub combo in bathroom with all new plumbing throughout the building. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Plowing and lawn mowing taken care of by owner!!! Laundry on site!! Rento casa en colonia Libertad patio muy grande todo enrejada con barda 4 recamaras y 2 baños con teraza piso nuevo y baño nuevo en la planta de abajo en $800 mas deposito. Property owner pays for water, sewer and trash pick-up. Ideal for college students or those seeking short term housing. Close to PA Turnpike, Skippack, KOP, and MCCC. Rent- $800 \/month.Text Now:   show contact info","num_images":3.0,"lat":40.0338,"lng":-75.1731,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T18:05:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this-beautiful\/7518582973.html","post_id":7518582973,"result_date":"2022-08-07 18:09","title":"@@@Welcome to this beautiful home for rent in East Mt Airy@@@","description":"Welcome to this beautiful home for rent in East Mt Airy! This property is listed as a 2 bedroom 1 bath. This home is bright and spacious with an open concept feel and updated kitchen. The unit comes complete with new flooring throughout, carpet bedrooms new appliances. Easy accessibility to public transit and major roadways.\nIF YOU ARE INTERESTED PLEASE TEX\/CALL:   show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nNewly 2 Bedroom 1 Bathroom Apartment Available Now. Butcher block countertops, new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Contact me to schedule a viewing ;; - offers idyllic living in Poughkeepsie. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Two-bedroom apartment, offers idyllic living in Worcester Twp. Limited term lease from mid-September 2022- through May 2023 only. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. No smoking and ALLOW pets- firm. Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short term housing. Skippack, KOP, and MCCC. Rent- $800 \/month. electric and cable. fifers idyllic living in Worcester Twp. new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!!Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. If you are interested please send me your number. I will contact you soon. Large apartment on the 2nd floor at . Good size living room with separate large dining area and walk-in pantry. One bedroom is very large, the other is smaller. Recently installed shower\/tub combo in bathroom with all new plumbing throughout the building. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Plowing and lawn mowing taken care of by owner!!! Laundry on site!! Rento casa en colonia Libertad patio muy grande todo enrejada con barda 4 recamaras y 2 baños con teraza piso nuevo y baño nuevo en la planta de abajo en $800 mas deposito. Property owner pays for water, sewer and trash pick-up. Ideal for college students or those seeking short term housing. Close to PA Turnpike, Skippack, KOP, and MCCC. Rent- $800 \/month.Text Now:   show contact info","num_images":3.0,"lat":40.0338,"lng":-75.1731,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T18:05:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nicely-renovated-bedroom\/7518578653.html","post_id":7518578653,"result_date":"2022-08-07 18:09","title":"Nicely Renovated 2 bedroom 2 bath apartment for rent in Philadelphia","description":"Nicely Renovated 2 bedroom 2 bath apartment for rent in Philadelphia. Landlord pays for heat (oil hot water), electricity and cable. Lower level has a large bedroom with washer dryer hookups and cabinets, Applicants must have satisfactory credit and solid work history or student status. Ideal for college students or those looking for short-term accommodation. Landlord supplies and installs window air conditioners in summer. Property owner pays for water, sewer, and trash pickup Rent for college students or those looking for short-term housing- $750\/month. Please text  show contact info","num_images":3.0,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T17:53:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-duplex-bedroom-bath\/7518570909.html","post_id":7518570909,"result_date":"2022-08-07 17:50","title":"Lovely duplex 2 bedroom 2 bath apartment for rent philadelphia","description":"Lovely duplex 2 bedroom 2 bath UTILITIES INCLUDED (Gas, Electric, water, and Garbage) $640\/month. Large Remodeled 2 Bedroom Apartment in quite neighborhood. bath\/shower, refinished hardwoods… just Beautiful!!! LAUNDRY ON SITE!! Plowing and lawn mowing taken care of by owner!!! Looking for a quite and responsible long term tenant. Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested..If you are interested, please send a TEXT:: show contact info","num_images":4.0,"lat":44.1589,"lng":-75.7099,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T17:32:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-on-site-maintenance\/7518540642.html","post_id":7518540642,"result_date":"2022-08-07 16:19","title":"On-Site Maintenance, Billiards Table, Walk-In Shower","description":"Bedrooms: 2Bathrooms: 2Square Feet: 928Date Available: 2022-08-07Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Private BalconyLaundry FacilityIce MakerCafeStainless Steel AppliancesNight PatrolPutting GreenDog ParkPostal ServicesSoaker TubClose to AirportClose to SchoolsCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/rdigppy6\/lincoln-square\n","num_images":24.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '928ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T16:15:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-close-to-schools-dog-park\/7518533623.html","post_id":7518533623,"result_date":"2022-08-07 16:02","title":"Close to Schools, Dog Park, Night Patrol","description":"Bedrooms: 3Bathrooms: 2Square Feet: 1383Date Available: 2022-08-07Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Media RoomBusiness CenterSecurity CameraKitchen IslandBilliards TableOn-Site ManagementPostal ServicesYoga StudioMicrowaveFlexible Lease Terms AvailableIce MakerClose to AirportCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/s3rh5igc\/lincoln-square\n","num_images":24.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '1383ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T15:58:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/newly-renovated-apartment-in-the-heart\/7518533549.html","post_id":7518533549,"result_date":"2022-08-07 16:02","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-apartment\/7518533209.html","post_id":7518533209,"result_date":"2022-08-07 16:01","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cute-remodeled-bedroom\/7518503822.html","post_id":7518503822,"result_date":"2022-08-07 15:06","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-duplex-bedroom-bath\/7518504658.html","post_id":7518504658,"result_date":"2022-08-07 15:01","title":"Duplex 2 bedroom 2 bath apartment","description":"Awesome Duplex 2 bedroom 2 bath apartment rent in philadelphia. The landlady pays for heat (oil hot water), electricity, and cable. with washer dryer hookups and cabinets lower level has a large bedroom, Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short-term housing. Landlord provides and installs window air conditioners in the summer.Good size living room with separate large dining area and walk-in pantry.If you are interested E-mail: Click :- christylendechy23@gmail_com For Quick Reply**\nLandlord provides and installs window air conditioners in the summer. The property owner pays for water, sewer, and trash pick-up. Ideal for college students or those seeking short term housing. electric and cable. fifers idyllic living in Worcester Twp. new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!!Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. If you are interested please send me your number. I will contact you soon. Large apartment on the 2nd floor at . Good size living room with separate large dining area and walk-in pantry. One bedroom is very large, the other is smaller. Recently installed shower\/tub combo in bathroom with all new plumbing throughout the building. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Plowing and lawn mowing taken care of by owner!!! Laundry on site!! Rento casa en colonia Libertad patio muy grande todo enrejada con barda 4 recamaras y 2 baños con teraza piso nuevo y baño nuevo en la planta de abajo en $550 mas deposito. Property owner pays for water, sewer and trash pick-up. Ideal for college students or those seeking short term housing. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. Landlord provides and installs window air conditioners in the summer. The property owner pays for water, sewer, and trash pick-up. Ideal for college students or those seeking short term housing. electric and cable. No smoking and ALLOW pets- firm. Applicants must have satisfactory credit and solid work or student status history. Ideal for college students or those seeking short term housing. Lower level has a large bedroom with washer dryer hookups and cabinets, Applicants must have satisfactory credit and solid work history or student status. Ideal for college students or those looking for short term accommodation. Landlord supplies and installs window air conditioners in summer. Property owner pays for water, sewer, and trash pickup Rent for college students or those looking for short term housing Close to PA Turnpike, Skippack, KOP, and MCCC. Rent- $550 \/month...If you are interested, please send your contact--olivia75982@gmail_com","num_images":1.0,"lat":39.9207,"lng":-75.1595,"attrs":"['2BR \/ 1Ba', '1750ft2', 'available aug 19', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T14:51:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/moorestown-standard-shopping-center\/7518460959.html","post_id":7518460959,"result_date":"2022-08-07 14:50","title":"Standard shopping center  -  Updated lighting and fixtures","description":"Towne Housing is featuring a beautiful, fully remodeled 3 bedroom, 1 bathroom upper apartment in  familiar merchants,  you will have access to an array of shops, restaurants, groceries, public transportation, etc. Everything in this unit is BRAND NEW! This unit will go fast so visit our website today to apply!!\n* Completely remodeled\n* Freshly painted\n* Brand new carpets\n* Brand new appliances\n* Eat-in Kitchen\n* Updated lighting and fixtures\n* Spacious living areas\n* Central Air\n* 1 Garage Space included\n* Washer and dryer hookups in basement","num_images":8.0,"lat":39.9683,"lng":-74.9533,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-08-07T13:11:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-studio-apartment-for-rent\/7518499445.html","post_id":7518499445,"result_date":"2022-08-07 14:43","title":"Studio Apartment for rent near 69th street and millbourne","description":"No emails please call only for all information about the apartment at  show contact info\n. It's a one-bedroom apartment for rent at 47 Marion ct. Just half a block away from the millbourne train station! Walking distance to 69th street shopping center. One bedroom, one bathroom, kitchen, and a large living room. The apartment is just renovated. The landlord pays all utilities.","num_images":4.0,"lat":39.9579,"lng":-75.2681,"attrs":"['1BR \/ 1Ba', 'furnished', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T14:39:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recycling-bbq-picnic-area\/7518497098.html","post_id":7518497098,"result_date":"2022-08-07 14:38","title":"Recycling, BBQ\/Picnic Area, Walk-In Shower","description":"Bedrooms: 2Bathrooms: 2Square Feet: 928Date Available: 2022-08-07Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Tile BacksplashRooftop DeckJogging TrailFire SprinklersPutting GreenClose to SchoolsOnline Payments AvailablePostal ServicesOn-Site ManagementMedia RoomSecurity CameraBike StorageCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/qlnjpvos\/lincoln-square\n","num_images":24.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '928ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T14:34:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-old-city-pet-friendly-bed\/7518495623.html","post_id":7518495623,"result_date":"2022-08-07 14:35","title":"Old City Pet Friendly 1 Bed 1 Bath Apartment (Rent)","description":"Charming and bright 1 bed and 1 bath apartment in the heart of Old City Philadelphia. In unit washer and dryer. Walking distance to all Old City attractions. This first floor apartment includes a gated courtyard with a dog run (all breeds welcome) and a gym coming soon!","num_images":9.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '750ft2', 'available oct 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T14:31:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-bedroom-full-bath\/7518491801.html","post_id":7518491801,"result_date":"2022-08-07 14:32","title":"Cozy 2 Bedroom 1 Full Bath Duplex Apartment in Philadelphia","description":"This Cozy 2 Bedroom 1 Full Bath Duplex Apartment in Philadelphia . Location is Ready to Move in!! All New Kitchen Appliances, Freshly Painted, New Plank Flooring, Fenced Back Yard, Shed. Limited term lease from mid-September 2022- through May 2023 only. freshly Painted, New Plank Flooring, Fenced Back Yard, Shed. Laundry Room with washer and dryer Included. Approximately 1020 square feet of living space. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up.ALLOW pets- firm.If you are interested E-mail: Click :martinlamb694gmail.com For Quick Reply**\nGood size living room with separate large dining area and walk-in pantry. One bedroom is very large, the other is smaller. Recently installed shower\/tub combo in bathroom with all new plumbing throughout the building. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Plowing and lawn mowing taken care of by owner!!! Laundry on site!! Rento casa en colonia Libertad patio muy grande todo enrejada con barda 4 recamaras y 2 baños con teraza piso nuevo y baño nuevo en la planta de abajo en $1550 mas deposito. Property owner pays for water, sewer and trash pick-up. Ideal for college students or those seeking short term housing. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. Landlord provides and installs window air conditioners in the summer. The property owner pays for water, sewer, and trash pick-up. Ideal for college students or those seeking short term housing. electric and cable. new slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!!Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. If you are interested please send me your number. I will contact you soon. Large apartment on the 2nd floor at . Good size living room with separate large dining area and walk-in pantry. One bedroom is very large, the other is smaller. Recently installed shower\/tub combo in bathroom with all new plumbing throughout the building. There is also 15’ x 15’ outdoor porch that is shared with one other unit. Plowing and lawn mowing taken care of by owner!!! Laundry on site!! Rento casa en colonia Libertad patio muy grande todo enrejada con barda 4 recamaras y 2 baños con teraza piso nuevo y baño nuevo en la planta de abajo en $1550 mas deposito. Property owner pays for water, sewer and trash pick-up. Ideal for college students or those seeking short term housing. Tenant pays heat (oil hot water), electric and cable. Property owner pays for water, sewer and trash pick-up. Landlord provides and installs window air conditioners in the summer. The property owner pays for water, sewer, and trash pick-up. Ideal for college students or those seeking short term housing. electric and cable. Ideal for college students or those seeking short term housing. Lower level has a large bedroom with washer dryer hookups and cabinets, Applicants must have satisfactory credit and solid work history or student status. Ideal for college students or those looking for short term accommodation. Landlord supplies and installs window air conditioners in summer. Property owner pays for water, sewer, and trash pickup Rent for college students or those looking for short term housing Close to PA Turnpike, Skippack, KOP, and MCCC. Rent- $1550 \/month...If y\n","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T14:22:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/conshohocken-roommate-wanted\/7518493519.html","post_id":7518493519,"result_date":"2022-08-07 14:30","title":"Roommate Wanted","description":"28 y\/o M looking for a roommate to share a 2BR townhouse minutes from all Fayette Street has to offer and the Conshohocken train station. The house is completely furnished with the exception of the second bedroom. Laundry and dryer in basement. Parking spot included out back in addition to reliably available street parking. Rent is $900 per month (per person), plus utilities. Looking for a M roommate, preferably in his mid to late 20s, to move in early September. Serious inquiries only please.","num_images":10.0,"lat":40.0825,"lng":-75.3044,"attrs":"['2BR \/ sharedBa', 'available sep 1', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T14:26:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-putting-green-pet-spa\/7518491795.html","post_id":7518491795,"result_date":"2022-08-07 14:26","title":"Putting Green , Pet Spa, Clubhouse with Game Room","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nHome is where the heart is, and here at The Point at Glen Mills, it's never been easier to love where you live. Contact us today to schedule your tour. You'll be glad you did!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with granite countertops, stainless steel appliances and a breakfast bar. this unit also features a large entry closet, full sized washer\/dryer, linen closets, and a private balcony. The bedrooms features walk-in closets, and ensuite bathrooms.\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1095ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-08-07T14:22:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/springfield-the-perfect-place-for-all\/7518465636.html","post_id":7518465636,"result_date":"2022-08-07 14:23","title":"The perfect place for all of your family gatherings.","description":"Walk up the walkway to a covered front porch, a perfect place to enjoy your morning coffee or relax at the end of the day. Once inside, to the right of the entrance you will find the living room with a wood burning fire place and to the left you will see the open concept dining room\/kitchen. The perfect place for all of your family gatherings. Upstairs there are 3 nice size bedrooms, hall bath & a full master bath. The basement is fully finished with a bar, art & craft area, laundry room and half bath. Oh wait how can we forget about the awesome fenced in back yard with plenty of space for entertaining. Rounding out the house is a detached garage with plenty of storage space & off street parking. Close to township parks, the Springfield library, schools, shopping, dining & public transportation.","num_images":13.0,"lat":39.935,"lng":-75.339,"attrs":"['3BR \/ 2.5Ba', '1750ft2', 'available aug 17', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T13:22:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-professionally-managed\/7518490031.html","post_id":7518490031,"result_date":"2022-08-07 14:22","title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nWhen you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathroom, walk-in closet, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nApartment Features\n* Roommate Friendly Floor Plan\n* High Efficiency Lighting Fixtures\n* Breakfast Bar\n* Stainless Steel Appliances\n* Central Heat and Air\n* Window Coverings\n* Granite Countertops\n* Disposal\n* Linen Closet\n* Ceiling Fan\n* Full sized Washer and Dryer in unit\n* Pre-wired for internet and cable\n* Private Patio or Private Balcony (on select apartments)\n* Lofty Vaulted Ceilings\n* Garden Tub\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Pantry\n* Walk-in Closet\nCommunity Features\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Gaming Area\n* Easy Freeway Access\n* Extra Storage\n* Short or Long Term Lease Available\n* After-Hours Emergency Maintenance\n* Credit Cards Accepted\n* Elevator\n* Garage Parking\n* EV Charging\n* Playground\n* Outdoor Grill Area\n* Movie Theatre\n* Community Kitchen\n* Sun Deck\n* Renters Insurance is Required\n* WiFi Access\n* Fitness Studio\n* Pet Salon\n* Professionally Managed\n* Non Smoking Community\n* Controlled Access\n* Minutes from Restaurants, Shopping, and Much More\n* Long Term Lease Available\n* Bark Park\n* Billiards\n* Community Lounge\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Swimming Pool\n* Landscaped Courtyards\n* Bike Racks\n* TV Lounge\n* Package Acceptance\n* Dry Cleaning and Laundry Service","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '833ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T14:18:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-stainless-steel-appliances\/7518487386.html","post_id":7518487386,"result_date":"2022-08-07 14:16","title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"The Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Linen Closet\n* Walk-in Closet\n* Kitchen Island\n* Stainless Steel Appliances\n* Garden Tub\n* Washer and Dryer in unit\n* Private Patio or Private Balcony (on select apartments)\nCommunity Features\n* Minutes from Restaurants, Shopping, and Much More\n* Spa\n* Outdoor Grill Area\n* Billiards\n* TV Lounge\n* Sun Deck\n* Easy Freeway Access\n* Community Lounge\n* Yoga Lounge\n* Swimming Pool\n* Fitness Studio\n* Pet Salon\n* Bark Park\n* Professionally Managed","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T14:12:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-soaker-tub-fitness-center\/7518486157.html","post_id":7518486157,"result_date":"2022-08-07 14:13","title":"Soaker Tub, Fitness Center, On-Site Management","description":"Bedrooms: 1Bathrooms: 1Square Feet: 762Date Available: 2022-08-07Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Stainless Steel AppliancesCarpetedSpacious FloorplansIce MakerClose to RestaurantsTile BacksplashYoga StudioFire PitExtra StorageBilliards TableRecyclingFire SprinklersCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/a6jqgvj7\/lincoln-square\n","num_images":24.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '762ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T14:09:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/newtown-square-25ba-luxury-townhome\/7518475238.html","post_id":7518475238,"result_date":"2022-08-07 13:48","title":"2.5ba Luxury Townhome - Springton Pointe Woods","description":"304 Arthur Court  Newtown Square, PA  19073$null \/ Month---------------------------Interested in this property?Reply to this listing for more information.---------------------------Property Details:3 BEDROOMS | 2.5 BATHROOMSBeautiful and spacious end-unit townhouse in the sought-after Gold Star Community of Springton Pointe Woods.  Two-story foyer leads to a spacious natural-lit living room and dining room.  First floor includes an office\/den, large laundry room with brand new GE Profile W\/D, 2-car garage and powder room, as well as a family room (gas fireplace), kitchen and breakfast room with large windows. Tree-lined deck is private and overlooks common green space. Kitchen has a large island, Corian counters and stainless steel double oven, fridge, microwave and gas range.  Hardwood floors and millwork throughout.  Finished basement offers ample room for additional living space, a second office, or just for lounging.  Primary bedroom w\/luxurious bath, and 2 additional bedrooms with a connecting bath. Approx. 15 miles from Phila., easy access to airport and minutes from great shopping and restaurants. Convenient to King of Prussia, only a 10 minute drive or less to shopping and restaurants in Wayne.***No Pets Allowed***Property Type: Single FamilyLease Terms:$4795\/MonthFirst, Last and 1-month Security Deposit due at signingLease Length: Contact For DetailsAvailable:08\/07\/2022Unit Amenities:Dishwasher Garbage Disposal Refrigerator Dryer Washer Microwave Oven FreezerBuilding Amenities:Cable Ready Lawn On Site Laundry Vaulted Ceiling Garage Washer Dryer Hookups Off Street Parking---------------------------Interested in this property?Reply to this listing for more information.\n","num_images":24.0,"lat":39.9863,"lng":-75.407,"attrs":"['3BR \/ 2.5Ba', 'available now', 'air conditioning', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T13:44:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-charming-bed-bath\/7518468886.html","post_id":7518468886,"result_date":"2022-08-07 13:42","title":"This charming 3 bed\/2 bath home RENT**","description":"College Park gem! This charming 3 bed\/2 bath home exudes character with original arched doorways, built-ins, loads of windows and original oak floors. IDEALLY LOCATED across from the 14th fairway of Dubsdread golf-course and one block off Edgewater Drive with all its restaurants, cafes, and shops. Super convenient to downtown Philadelphia and I-4, and only 5 miles to Advent  Hospital.\nPlease text: show contact info\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\nProfessional Health & Fitness Coach looking to trade services for rent and utilities.\nMy name is Brandon and I have a deep understanding of the mind and body, including diet and exercise routines needed to address a wide variety of unique challenges. I have helped many people (including myself) overcome the mental and physical aspects of weight loss and fitness improvement.\nIn an ideal situation, I would provide routine physical fitness training sessions, coupled with diet & nutrition advisement, and cook fresh meals (at least one daily) in return for paid rent and utilities. That said, I can provide a full range of services, just ask!\nHello I am a current student at Cal State La! Majoring in Sociology i’m looking for a room for rent!! I have a small poodle she’s 7 pounds.\nI am willing to pay $750 for room!! I have two jobs :) Chipotle is my full time and Jamba Juice is my part time.\nMy number isI’m a single in her 30’s from LA who works near Pepperdine looking to move to Malibu. I have excellent credit, I’m very quiet and clean, I don’t wear shoes in the house, I don’t host large groups, and I love gardening\/planting. I currently live in West Hollywood but have been driving out for the last 2 years, and the 2 hour roundtrip drive 2-4x\/week is destroying my soul.\nMy budget is $2100 and I’m looking 1-8 miles from Pepperdine. I’ve spent A LOT of time in Paradise Cove over the last 7 years, so ideally somewhere around there, Kanan, Pt Dume, Ramirez, by Spruzzo or in that general area would be great but open to a bigger diameter.Reliable, quiet, stable feale (non smoker\/drinker) looking for long term (preferably furnished) accommodations in exchange for property care and management.\nSMALL private studio, cottage, detached unit w\/bath\/kitchen, converted garage, etc... in a tranquil, smoke free, positive, professional environment sought, where a strong work ethic, consistency, mutual respect and loyalty are valued.\nAll aspects and experiences of property management offered, including but not limited to:\nsupervising of home improvements, personal assistance, errands, pet care (great with all animals\/breeds\/livestock), home care: expert professional cleaning, organizing, decluttering, (highly detail oriented\/good at transforming properties in various conditions), event planning and assistance, airbnb\/sublet, office\/filing, etc....\nThis would be ideal for someone who travels a lot and needs their property supervised and taken care of.\nI prefer small rooms\/quarters, as long as I have access to a full kitchen. I am resourceful, eco-conscious and as mentioned enjoy transforming properties in various conditions.\nExcellent references and credit.\nPlease feel free to include your contact information and the best time to reach you.\nThank you.\nThis is a professional exchange. I have been at my current exchange position for 6 years and the owner sold the property and moved.\n(this is an exchange for legitimate work ONLY arrangement, any none related replies and\/or links will be promptly deleted) (looking for the right fit ONLY. I'll be renting in the meantime)Hi - I'm looking to swap my beautiful, clean, safe, luxury 2BR WeHo condo apartment, steps from Melrose Place, for your clean, air conditioned, 1 or 2BR luxury apartment in or near the West Village (open to other areas) from September 15-Nov 1 (flexible).\nLet me know if you want to discuss further!My husband and I are seeking a room for rent, studio, or guest house ranging anywhere from 700-1000. Month to month preferably or lease for up to six months to a year or more. Anywhere in Los Angeles, Burbank, Glendale, Pasadena, or San Fernando Valley. Move in date near the end of August or September 1st.\nWe’re 31 and 23 years young, drug free, Covid vaccinated, we have no pets, and We’re easy going, keep busy, active, kind friendly, clean people. He’s a personal trainer, and I work for a hotel as a live in associate, so I would only be at the room for rent 2 days out of each month for a 9 month contract beginning late August.\nPlease serious inquiries only, no odd requests, and please be straight forward with your response. Let’s not waste each other’s time. We’ve come across way too many scams. Also, we won’t send you any money before seeing the room in person.\nWe’re available to meet right away!I'm a senior\n, looking for a compatible roommate in same age range to look for and share a 2bd\/2ba apt. in the Los Angeles County area. I have to move from the apt. I’m in because the rent is being consistently raised and is now out of my range. I would prefer my half of the rent to be between $600 - $700\/mo.\nI am friendly and have a great sense of humor. I keep the apt. neat and clean and am looking for a roommate who will do the same. I do volunteer work for a non-profit org. I meditate and I'm somewhat of a writer. I have a friendly, adorable kitty and would prefer a kitty friendly roommate.\nWould love to hear from you if you think this is a situation that might work for you and discuss more details by phone or by personal email.\nPLEASE DO NOT REPLY WITH LINKS TO OTHER SITES. I don’t put my personal information on “roommate” sites or any other sites.Hi I am a looking for a room to rent in the Los Angeles County area. Looking to pay around $500-550. Not looking to live in Palmdale etc or SFV area. Looking to move in by beginning of Sept 1st. I work and usually at the gym most nights. I like to keep my space clean. I don’t cook much. Also stop asking for pics. It’s just weird. I’m as normal as they come ..\nResponsible, trustworthy, experienced pet sitter, cat sitter, and house sitter available to care for your pets and plants in August or September while you are away.\nI have excellent pet sitting and house sitting references that I will provide to you, so you can look up my recent references on social media and contact them directly.\nReply with your best phone number, your dates, and details. Feel free to include information about your space and pets. I will get in touch and reply with my details as well.\nLook forward to hearing from you. Will consider Westside, Marina del Rey, Venice, Santa Monica, West LA, West Hollywood, Hollywood, Glendale, Echo Park, Eagle Rock, Atwater Village, and a few other areas.\nI have extensive experience house sitting and caring for pets and plants! Available for short-term pet sitting and house sitting and will consider longer stays for the right situation. I am very tidy and have exceptional household and mindful living skills. I prefer high vibe, clean, bright interiors and supporting likeminded people with their homes and pets.Tired of Renting? Can you afford 3% to 5% down($17,550-$29,250) on a $585,000 Studio in one of Downtowns most Prestigious new buildings.. Please contact your new home specialist\nDevelopment is giving up to $20,000 towards closing costs or to buy down the interest rate until September 30th!\nThere may be additional incentives as well! Please contact me your new home specialist for other new projects with similar incentives! Owning a home could be as easy as replying to this adOutside of house work I do have a mobile recording studio if you sing or write, as well as a mobile tattoo station, but i offer complete house cleaning and personal assistant errand running \/ organizing as well, im good company and working so incan move back home to cali from Oregon (after October) message me with any questions\nI have a room for rent in the heart of irvine\nclose to 405, 55 freeway business area\nbrand new condo, the room had queen size\nbed available September 1st rent is $1200\n94\none month for deposit so total to move in is\n$2400, it's share bathroom with one\n21 years old, please no pets no drinking or\nsmoking or any kind of drugs and also no\nover night quests if this is sound fits you\nTEXT\/CALL ONLY🚨\nPlease send me a picture of the room and your name :,) And i will do the same! And tell you about myself :)\nI won’t be replying to numbers that seem to be a scam.","num_images":1.0,"lat":40.0903,"lng":-75.041,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-08-07T13:29:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-story-bedroom\/7518469736.html","post_id":7518469736,"result_date":"2022-08-07 13:40","title":"BEAUTIFUL 3-story, 3 bedroom, 2 full bathrooms in the the heart of Fishtown!","description":"Available September 2022!\nThis beautiful three-story home is located in the heart of Fishtown, which Forbes Magazine described as one of the best neighborhoods to live in the U.S.!\nThe home has a recently remodeled kitchen with a ton of natural lighting, stainless steel appliances, a built in dishwasher and a wrap around counter for eating, working or hanging out.\nThere is hard wood flooring throughout the home with a smart Nest thermostat which operates the gas heat and electric central air conditioning. Water is included in your rent. There is full semi-finished basement for storage and laundry.\nThe patio is also in the process of an update, with a new Moroccan style, tiled wall being built. Included are older and recent pictures of the yard to give you a sense of the space.\nThere are a total of three bedrooms and two full bathrooms. The second floor has one large bedroom and one smaller bedroom, as well as a full bathroom.  The third floor master bedroom runs the entire length of the house and also has it's own newly renovated full bathroom with a large soaking bathtub.\nThis listing is furnished, but if you prefer unfurnished, let us know!\nParking:\nThere's street parking available with no time limit and no permit required.\nWe are walking distance to the Market-Frankford line, which will quickly take you to Center City, University City, Old City, South Philly, and more ($2.25 token fee). Lyft and Uber are always nearby and typically arrive in ~3 minutes. We are also close to I 95 as well.\nPopular nearby:\nFishtown is one of the best neighborhoods in Philly! We are walking distance to some of the greatest cafes, bars and restaurants in both Fishtown and Northern Liberties:\nFrankford Hall Beer Garden\nSuraya Restaurant\nThe Fillmore: Concert Venue\nPunch Line Comedy Club\nJohnny Brendas (pub, restaurant and music venue, as seen in Creed)\nFette Sau: Best BBQ in the city!\nLoco Pez: Tacos!\nWm. Mulherin's Sons: Italian in Fishtown\nKensington Quarters: The Butcher Shop \/Restaurant\nFront Street Cafe\nWeckerky’s Ice Cream\nNuNu\nCheu Fishtown Ramen\nLa Colombe Global Headquarters\nCedar Point Kitchen\nPhilly Style Bagels\nPizza Brain\nLittle Baby's Ice Cream\nAx Throwing Gym\nFloat Tanks\nBottle Bar East | Best Bottle Shop in Philadelphia\nNorth Bowl Bowling in Northern Liberties\nThe Piazza\nJinxed Antiques\nAcme in Northern Liberties\nStarbucks\nCVS Pharmacy\nPlanet Fitness\nAmrita Yoga\nBoutiques\nPenn Treaty Park\nPalmer Park\nPlayground\nDog Parks\nGroove Hound Doggy Daycare\n...and so much more.","num_images":17.0,"lat":39.976,"lng":-75.122,"attrs":"['3BR \/ 2Ba', '1500ft2', 'available sep 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T13:31:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-charming-bed-bath\/7518468849.html","post_id":7518468849,"result_date":"2022-08-07 13:39","title":"This charming 3 bed\/2 bath home RENT**","description":"College Park gem! This charming 3 bed\/2 bath home exudes character with original arched doorways, built-ins, loads of windows and original oak floors. IDEALLY LOCATED across from the 14th fairway of Dubsdread golf-course and one block off Edgewater Drive with all its restaurants, cafes, and shops. Super convenient to downtown Philadelphia and I-4, and only 5 miles to Advent  Hospital.\nPlease text: show contact info\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\nProfessional Health & Fitness Coach looking to trade services for rent and utilities.\nMy name is Brandon and I have a deep understanding of the mind and body, including diet and exercise routines needed to address a wide variety of unique challenges. I have helped many people (including myself) overcome the mental and physical aspects of weight loss and fitness improvement.\nIn an ideal situation, I would provide routine physical fitness training sessions, coupled with diet & nutrition advisement, and cook fresh meals (at least one daily) in return for paid rent and utilities. That said, I can provide a full range of services, just ask!\nHello I am a current student at Cal State La! Majoring in Sociology i’m looking for a room for rent!! I have a small poodle she’s 7 pounds.\nI am willing to pay $750 for room!! I have two jobs :) Chipotle is my full time and Jamba Juice is my part time.\nMy number isI’m a single in her 30’s from LA who works near Pepperdine looking to move to Malibu. I have excellent credit, I’m very quiet and clean, I don’t wear shoes in the house, I don’t host large groups, and I love gardening\/planting. I currently live in West Hollywood but have been driving out for the last 2 years, and the 2 hour roundtrip drive 2-4x\/week is destroying my soul.\nMy budget is $2100 and I’m looking 1-8 miles from Pepperdine. I’ve spent A LOT of time in Paradise Cove over the last 7 years, so ideally somewhere around there, Kanan, Pt Dume, Ramirez, by Spruzzo or in that general area would be great but open to a bigger diameter.Reliable, quiet, stable feale (non smoker\/drinker) looking for long term (preferably furnished) accommodations in exchange for property care and management.\nSMALL private studio, cottage, detached unit w\/bath\/kitchen, converted garage, etc... in a tranquil, smoke free, positive, professional environment sought, where a strong work ethic, consistency, mutual respect and loyalty are valued.\nAll aspects and experiences of property management offered, including but not limited to:\nsupervising of home improvements, personal assistance, errands, pet care (great with all animals\/breeds\/livestock), home care: expert professional cleaning, organizing, decluttering, (highly detail oriented\/good at transforming properties in various conditions), event planning and assistance, airbnb\/sublet, office\/filing, etc....\nThis would be ideal for someone who travels a lot and needs their property supervised and taken care of.\nI prefer small rooms\/quarters, as long as I have access to a full kitchen. I am resourceful, eco-conscious and as mentioned enjoy transforming properties in various conditions.\nExcellent references and credit.\nPlease feel free to include your contact information and the best time to reach you.\nThank you.\nThis is a professional exchange. I have been at my current exchange position for 6 years and the owner sold the property and moved.\n(this is an exchange for legitimate work ONLY arrangement, any none related replies and\/or links will be promptly deleted) (looking for the right fit ONLY. I'll be renting in the meantime)Hi - I'm looking to swap my beautiful, clean, safe, luxury 2BR WeHo condo apartment, steps from Melrose Place, for your clean, air conditioned, 1 or 2BR luxury apartment in or near the West Village (open to other areas) from September 15-Nov 1 (flexible).\nLet me know if you want to discuss further!My husband and I are seeking a room for rent, studio, or guest house ranging anywhere from 700-1000. Month to month preferably or lease for up to six months to a year or more. Anywhere in Los Angeles, Burbank, Glendale, Pasadena, or San Fernando Valley. Move in date near the end of August or September 1st.\nWe’re 31 and 23 years young, drug free, Covid vaccinated, we have no pets, and We’re easy going, keep busy, active, kind friendly, clean people. He’s a personal trainer, and I work for a hotel as a live in associate, so I would only be at the room for rent 2 days out of each month for a 9 month contract beginning late August.\nPlease serious inquiries only, no odd requests, and please be straight forward with your response. Let’s not waste each other’s time. We’ve come across way too many scams. Also, we won’t send you any money before seeing the room in person.\nWe’re available to meet right away!I'm a senior\n, looking for a compatible roommate in same age range to look for and share a 2bd\/2ba apt. in the Los Angeles County area. I have to move from the apt. I’m in because the rent is being consistently raised and is now out of my range. I would prefer my half of the rent to be between $600 - $700\/mo.\nI am friendly and have a great sense of humor. I keep the apt. neat and clean and am looking for a roommate who will do the same. I do volunteer work for a non-profit org. I meditate and I'm somewhat of a writer. I have a friendly, adorable kitty and would prefer a kitty friendly roommate.\nWould love to hear from you if you think this is a situation that might work for you and discuss more details by phone or by personal email.\nPLEASE DO NOT REPLY WITH LINKS TO OTHER SITES. I don’t put my personal information on “roommate” sites or any other sites.Hi I am a looking for a room to rent in the Los Angeles County area. Looking to pay around $500-550. Not looking to live in Palmdale etc or SFV area. Looking to move in by beginning of Sept 1st. I work and usually at the gym most nights. I like to keep my space clean. I don’t cook much. Also stop asking for pics. It’s just weird. I’m as normal as they come ..\nResponsible, trustworthy, experienced pet sitter, cat sitter, and house sitter available to care for your pets and plants in August or September while you are away.\nI have excellent pet sitting and house sitting references that I will provide to you, so you can look up my recent references on social media and contact them directly.\nReply with your best phone number, your dates, and details. Feel free to include information about your space and pets. I will get in touch and reply with my details as well.\nLook forward to hearing from you. Will consider Westside, Marina del Rey, Venice, Santa Monica, West LA, West Hollywood, Hollywood, Glendale, Echo Park, Eagle Rock, Atwater Village, and a few other areas.\nI have extensive experience house sitting and caring for pets and plants! Available for short-term pet sitting and house sitting and will consider longer stays for the right situation. I am very tidy and have exceptional household and mindful living skills. I prefer high vibe, clean, bright interiors and supporting likeminded people with their homes and pets.Tired of Renting? Can you afford 3% to 5% down($17,550-$29,250) on a $585,000 Studio in one of Downtowns most Prestigious new buildings.. Please contact your new home specialist\nDevelopment is giving up to $20,000 towards closing costs or to buy down the interest rate until September 30th!\nThere may be additional incentives as well! Please contact me your new home specialist for other new projects with similar incentives! Owning a home could be as easy as replying to this adOutside of house work I do have a mobile recording studio if you sing or write, as well as a mobile tattoo station, but i offer complete house cleaning and personal assistant errand running \/ organizing as well, im good company and working so incan move back home to cali from Oregon (after October) message me with any questions\nI have a room for rent in the heart of irvine\nclose to 405, 55 freeway business area\nbrand new condo, the room had queen size\nbed available September 1st rent is $1200\n94\none month for deposit so total to move in is\n$2400, it's share bathroom with one\n21 years old, please no pets no drinking or\nsmoking or any kind of drugs and also no\nover night quests if this is sound fits you\nTEXT\/CALL ONLY🚨\nPlease send me a picture of the room and your name :,) And i will do the same! And tell you about myself :)\nI won’t be replying to numbers that seem to be a scam.","num_images":1.0,"lat":40.0903,"lng":-75.041,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-08-07T13:29:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-beautiful-fully-furnished\/7518463383.html","post_id":7518463383,"result_date":"2022-08-07 13:32","title":"Beautiful Fully Furnished Corporate Suite","description":"Apt. 1305 — Royal floor plan —1,293 sq. ft. — $5,496\nThis 3rd floor Royal is a fully-furnished corporate suite. It has a spacious living room, a dining set, and bar stools. This apartment features LTV hardwood flooring and upgraded stainless steel appliances. The master suite comes with an enormous walk-in closet and double sinks with a luminous shower. The guest bedroom is spacious as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more! Available for short-term lease, utilities included!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1293ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T13:17:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-bedroom-bath-single-family\/7518448879.html","post_id":7518448879,"result_date":"2022-08-07 13:11","title":"@3 Bedroom 1 Bath single family home in the heart of the SOUTH WEDGE@","description":"Beautiful and recently renovated 3 Bedroom 1 Bath single family home in the heart of the South Wedge; close to Highland Hospital, U of R, shopping, dining and major expressways!!Recently renovated and freshly painted interior with dark refinished hardwood flooring throughout, new kitchen amenities stainless steel appliances, new tile flooring in the kitchen and bathroom, new bathroom amenities. Washer and dyer hook ups in the basement. Access to large attic space for storage. Access to Greenlight Network services!This home has a fully fenced back yard with a great patio space for hanging out and lounging around.\nDriveway parking!*Tenant will be responsible for utilities, water bill, lawn care, and snow removal, owner will pay for refuse.*CALL OR TEXT FOR QUICKEST RESPONSE.....  show contact info","num_images":4.0,"lat":39.9375,"lng":-75.2637,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T12:42:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-duplex\/7518452810.html","post_id":7518452810,"result_date":"2022-08-07 12:55","title":"Beautiful 2 Bedroom Duplex Duplex","description":"Beautifully renovated 2 bedroom duplex!!  Available immediately!!","num_images":4.0,"lat":39.9612,"lng":-75.2303,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available aug 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:51:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-central-location-upgraded\/7518449051.html","post_id":7518449051,"result_date":"2022-08-07 12:46","title":"Central Location, Upgraded Finishes Available, Pet Park","description":"The Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nApartment Features\n* Disposal\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Ceiling Fan\n* Window Coverings\n* Roommate Friendly Floor Plan\n* Private Patio or Private Balcony (on select apartments)\n* Stainless Steel Appliances\n* Pre-wired for internet and cable\n* High Efficiency Lighting Fixtures\n* Full sized Washer and Dryer in unit\n* Linen Closet\n* Breakfast Bar\n* Garden Tub\n* Central Heat and Air\n* Lofty Vaulted Ceilings\n* Walk-in Closet\n* Granite Countertops\n* Pantry\nCommunity Features\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Short or Long Term Lease Available\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* TV Lounge\n* Community Kitchen\n* Renters Insurance is Required\n* Extra Storage\n* Easy Freeway Access\n* EV Charging\n* Gaming Area\n* Sun Deck\n* WiFi Access\n* Community Lounge\n* After-Hours Emergency Maintenance\n* Movie Theatre\n* Credit Cards Accepted\n* Dry Cleaning and Laundry Service\n* Bark Park\n* Long Term Lease Available\n* Non Smoking Community\n* Pet Salon\n* Garage Parking\n* Landscaped Courtyards\n* Outdoor Grill Area\n* Controlled Access\n* Swimming Pool\n* Professionally Managed\n* Playground\n* Billiards\n* Package Acceptance\n* Bike Racks\n* Fitness Studio\n* Minutes from Restaurants, Shopping, and Much More\n* Elevator\n[#9350605]","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1126ft2', 'available sep 28', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:42:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-incredible-features-resort\/7518448315.html","post_id":7518448315,"result_date":"2022-08-07 12:44","title":"Incredible Features, Resort Style Pool, Upgraded Finishes Available","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester is the perfect location for your new home. Explore our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nApartment Features\n* Granite Countertops\n* Private Patio or Private Balcony (on select apartments)\n* Disposal\n* Central Heat and Air\n* Stainless Steel Appliances\n* Breakfast Bar\n* Pantry\n* Lofty Vaulted Ceilings\n* Window Coverings\n* Pre-wired for internet and cable\n* Ceiling Fan\n* Garden Tub\n* Full sized Washer and Dryer in unit\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Walk-in Closet\n* Linen Closet\n* High Efficiency Lighting Fixtures\n* Roommate Friendly Floor Plan","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '833ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:40:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-package-room-central-location\/7518441477.html","post_id":7518441477,"result_date":"2022-08-07 12:29","title":"Package Room, Central Location, Ideal Location","description":"Our pet-friendly studio, one, two and three bedroom apartments in Exton deliver distinctive living in one of the area's most desired locations. The Point at Exton is the perfect community for your new home!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, ensuite bathrooms, walk-in closets, and a washer\/dryer!\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nCommunity Features\n* Sun Deck\n* Community Kitchen\n* Fitness Studio\n* Garage Parking\n* Package Acceptance\n* Pet Salon\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access\n* Swimming Pool\n* Controlled Access Parking\n* TV Lounge\n* Bike Racks\n* Extra Storage\n* Professionally Managed\n* Outdoor Grill Area","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['2BR \/ 2Ba', '1248ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T12:25:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-yoga-and-ballet-studio\/7518440447.html","post_id":7518440447,"result_date":"2022-08-07 12:26","title":"Yoga and Ballet Studio, Visit Your New Home, Leasing Now","description":"The Point at Glen Mills offers all of the amenities your looking for and some you didn't even know you wanted. Check out our two-story clubhouse-complete with flat screen TVs, a 24-hour fitness center and a pool table. Enjoy our on-site yoga studio or our outdoor putting green. Visit us today!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Putting Green\n* Minutes from Restaurants, Shopping, and Much More\n* Outdoor Grill Area\n* Swimming Pool\n* Bocce Ball\n* Sun Deck\n* Community Lounge\n* Pet Salon\n* Fitness Studio\n* Professionally Managed\n* TV Lounge\n* Bark Park\n* Yoga Lounge\n* Easy Freeway Access","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-08-07T12:22:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-for-rent\/7518429035.html","post_id":7518429035,"result_date":"2022-08-07 12:23","title":"👉1 Bedroom Apartment For Rent in Philadelphia ..!!!","description":"▶Very Nice 1 Bedroom Apartment For Rent. $700\/Month. Plus Utilities. Just Remodeled, Everything New. Hardwood Floors. Central Air and Furnace. 😺 🐕NO PETS ALLOWED! Washer and Dryer Hookups. Ready to Move In Immediately. First Months Rent and Security Deposit Due at Move In. Call Eva For More Information.  📞 show contact info","num_images":8.0,"lat":39.9925,"lng":-75.1415,"attrs":"['1BR \/ 1Ba', 'application fee details: $28 per person, credit, eviction and employment checks', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T11:54:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fitness-center-incredible\/7518437731.html","post_id":7518437731,"result_date":"2022-08-07 12:19","title":"Fitness Center, Incredible Features, Central Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nBe the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '815ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:15:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-laundry-in-unit-central\/7518437108.html","post_id":7518437108,"result_date":"2022-08-07 12:18","title":"Laundry in Unit, Central Location, Ideal Location","description":"The Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nApartment Features\n* Kitchen Island\n* Walk-in Closet\n* Garden Tub\n* Washer and Dryer in unit\n* Stainless Steel Appliances\n* Private Patio or Private Balcony (on select apartments)\n* Linen Closet","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1186ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:14:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxurious-brand-new\/7518436941.html","post_id":7518436941,"result_date":"2022-08-07 12:17","title":"Luxurious brand new construction 3 br\/2bath in Manayunk","description":"Luxurious, Brand New 3 BR + 2 Bath, just steps from Main Street, Manayunk ! The unit is a bi-level three bedroom two full bath with a rear deck and backyard for entertainment, full with natural light . Tastefully renovated with high end kitchen, stainless steel appliances, luxurious full baths, Central AC\/ Heat, Pella windows, ceiling fans, recessed lighting , new washer & dryer, high end wood floors throughout, with deck, front and rear entrances. Conveniently located close to the train station, bus, I-76, parks, trails, restaurants, main Street, and best shopping in Philly. Perefect for working professional, family or PCOM. Walkers Paradise. Schedule your tour today for move in ready.","num_images":14.0,"lat":40.028605,"lng":-75.22475,"attrs":"['3BR \/ 2Ba', '1600ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T12:13:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-bedroom-apartment-luxury\/7518433992.html","post_id":7518433992,"result_date":"2022-08-07 12:10","title":"1 Bedroom Apartment - Luxury Living","description":"Apt. 1109 — Buckingham floor plan — 810 sq. ft. — $2,335\nLocated on the 1st floor, this 1-bed\/1-bath apartment has an open floor plan with the kitchen looking into an abundant living\/dining room. The bedroom is spacious, well-lit, and has ample closet space. It boasts central air and heat, a front-loading washer and dryer, and the bathroom is full-sized with a tub. The bedroom is also large with access to the balcony, and has a large walk-in closet! This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool and more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":16.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '810ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T12:06:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-large-apartment\/7518430260.html","post_id":7518430260,"result_date":"2022-08-07 12:01","title":"Beautiful, Large Apartment","description":"A unique apartment in a boutique building with elevator and intercom access. Walk into a large living and dining space with hardwood floors, floor to ceiling windows with three Juliet balconies overlooking 3rd street.  Kitchen features granite counter tops, stainless steel appliances and a generous amount of cabinets. There is also a separate laundry area with washer\/dryer and additional cabinetry. The lower level has an exposed brick wall hallway that continues into a large bedroom, along with a good sized bathroom with a marble vanity. This unit has great closet space and lovely natural light. Full service gym in the building and pets are welcome. Amazing location in the heart of Old City near the subway, I-95, 676, great bars and restaurants.\nYou would take over a lease that expires April 30, 2023 with the right to renew.  Tenant pays all utilities except water.  First and last months rent due upon signing along with a security deposit of $2,225.\n","num_images":17.0,"lat":39.952175,"lng":-75.14523,"attrs":"['1BR \/ 1Ba', '950ft2', 'available sep 26', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-08-07T11:57:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-townhouse-bed-bath\/7518429729.html","post_id":7518429729,"result_date":"2022-08-07 12:00","title":"*** TOWNHOUSE 3 BED \/ 2 BATH ***","description":"The century old grandeur of the original gothic\/industrial West Philadelphia High School building is preserved in brick and steel detailing, soaring concrete ceilings and oversized windows. The dramatic loft apartments, restored 1911 gym with suspended running track, the brick \"plenum\" (truly one of the most extraordinary event spaces in Philadelphia) comprise the West Lofts' lifestyle.","num_images":4.0,"lat":39.9612,"lng":-75.2303,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-08-07T11:56:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-tv-lounge-incredible-features\/7518421315.html","post_id":7518421315,"result_date":"2022-08-07 11:38","title":"TV Lounge, Incredible Features, Central Location","description":"VIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nJust minutes from the Exton Train Station and area highways, The Point at Exton gives you easy access to King of Prussia and Center City Philadelphia while also keeping you close to the area's top outdoor trails and nature destinations. Lease now!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, coat closet, walk-in closet, and a washer\/dryer!\nApartment Features\n* Granite Countertops\n* Stainless Steel Appliances\n* Quartz Countertops\n* Wood-Like Floors\n* Washer and Dryer in unit\n* Garden Tub\n* Kitchen Island","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '876ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T11:34:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-hardwood-flooring-close-to\/7518418656.html","post_id":7518418656,"result_date":"2022-08-07 11:31","title":"Hardwood Flooring, Close to Shopping, Media Room","description":"Bedrooms: 1Bathrooms: 1Square Feet: 796Date Available: 2022-08-07Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Refrigerator with Ice MakerPet FriendlyPrivate BalconyLarge ClosetFire SprinklersIn-Unit LaundryRecyclingAir ConditioningClose to FreewayFire PitYoga StudioSpacious FloorplansCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/zdx27wvy\/lincoln-square\n","num_images":24.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '796ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T11:27:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-downtown-living-at-its-best\/7518395848.html","post_id":7518395848,"result_date":"2022-08-07 11:03","title":"Downtown Living at its Best.","description":"This one bedroom, 1 bath condo is located right in downtown Phoenixville. Within feet of all the restaurants and shops. Features include: stainless steel appliances, open living room\/kitchen concept, garage parking for 1 vehicle, plus a storage room\/area on same floor. Convenient to major roadways - Rt 23, Rt. 422, Rt. 724 and Rt. 202. Enjoy the biking and walking trails, Reeves Park, and more. Schedule your appointment today.","num_images":0.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T10:25:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-call-for-details-clubhouse\/7518404631.html","post_id":7518404631,"result_date":"2022-08-07 10:54","title":"Call for Details, Clubhouse with Game Room, Visit Your New Home","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nPrepare to fall in love with The Point at Glen Mills! Kick back in our community lounge. Watch your furry friend frolic with his furry friends in our dog park. Challenge your friends to a game of golf on our outdoor putting green. Life is good at The Point at Glen Mills. Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nCommunity Features\n* TV Lounge\n* Swimming Pool\n* Pet Salon\n* Fitness Studio\n* Putting Green\n* Sun Deck\n* Easy Freeway Access\n* Bocce Ball\n* Professionally Managed\n* Yoga Lounge\n* Community Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Bark Park\n* Outdoor Grill Area\n[#9350448]","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-08-07T10:50:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-648ft2-comfort-1bed-1bath\/7518393069.html","post_id":7518393069,"result_date":"2022-08-07 10:53","title":"648ft2 - COMFORT = 1bed\/1bath ] 112 Dickinson St!!!","description":"Set up your appointment to view this quaint 1 bedroom and 1 bath home with many recent updates over the last 2 years. Updated eat-in kitchen with new cabinetry, countertops, flooring and stainless steel appliances. Large bedroom with spacious closet and plenty of room in the living room. New FHA furnace by propane, electric hot water heater and new 100 amp electric panel installed in 2019. Lifetime metal roof. Plenty of off street parking and private yard.","num_images":8.0,"lat":39.93162,"lng":-75.167441,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly']","posted_date":"2022-08-07T10:16:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-affordable-1br-across-from\/7518396260.html","post_id":7518396260,"result_date":"2022-08-07 10:41","title":"Affordable 1BR across from Fairmount Park on 33rd Street","description":"Great 1BR in historic building, recent upgrades, across the street from Fairmount Park.\nHardwood floors.\nBalcony oversees 33rd Street and Fairmount Park.\nNew kitchen sink, bathroom vanity.\n3rd floor apartment.\nEasy driving access to Rte. 76 and all park amenities.\nMove-in costs: 1st, last, 1 month security ($1000).\nMust be employed for at least 2 years (can be different employers) or fixed income or student.\n$35 application fee for each adult who will live in apartment (credit and background -- we are very fair; very difficult to rent to you if you've been evicted).\n","num_images":0.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T10:26:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-bedroom-apartment-luxury\/7518381086.html","post_id":7518381086,"result_date":"2022-08-07 09:41","title":"1 Bedroom Apartment - Luxury Living","description":"Apt. 1109 — Buckingham floor plan — 810 sq. ft. — $2,335\nLocated on the 1st floor, this 1-bed\/1-bath apartment has an open floor plan with the kitchen looking into an abundant living\/dining room. The bedroom is spacious, well-lit, and has ample closet space. It boasts central air and heat, a front-loading washer and dryer, and the bathroom is full-sized with a tub. The bedroom is also large with access to the balcony, and has a large walk-in closet! This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool and more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":16.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '810ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T09:37:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-furnished-studio-must-see\/7518377005.html","post_id":7518377005,"result_date":"2022-08-07 09:26","title":"Furnished studio Must See","description":"Cozy boutique studio, perfect for anyone that does not want to get locked into a 1 year lease.  Right across the street from a park, close to public transportation, laundry and supermarket. Flat fee of $149 each month for utilities. Everything included.   WiFi , heating, cooling, water and electric.\nWhen responding please include contact info and current employment details.  Thank you.\n","num_images":17.0,"lat":39.965067,"lng":-75.223882,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'furnished', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T09:22:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/kennett-square-newly-renovated-bed-apt\/7518368259.html","post_id":7518368259,"result_date":"2022-08-07 09:26","title":"Newly renovated 2 bed Apt + central air conditioning~~!!","description":"Newly renovated 2 bedroom apartment in short walking distance to downtown Kennett Square's shops, restaurants and brew pubs with new heating and central air conditioning, new kitchen including gas range, dishwasher, garbage disposal and all stainless appliances. Wood floors. Newly tiled bathroom, large vanity, and full sized tub\/shower. Living room is prewired for TV and internet. Washer and dryer in the apartment. Second floor walkup with porch.","num_images":0.0,"lat":39.84477,"lng":-75.718453,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-08-07T08:44:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-university-city-apartment\/7518369307.html","post_id":7518369307,"result_date":"2022-08-07 08:53","title":"University City Apartment for rent","description":"Large and clean, on the entire second floor, one bedroom apartment for rent. Hardwood floor, tiled bathroom and kitchen, granite countertops. Close to public transportation, walk to UPENN and Drexel. Best price in the area. First, last and one month security deposit to move in. Tenant is responsible for gas, electric and trash collection fee.  No pets, credit check. $50 application fee.","num_images":10.0,"lat":39.960111,"lng":-75.205312,"attrs":"['1BR \/ 1Ba', '785ft2', 'available sep 1', 'application fee details: $50', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T08:49:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-new-specials-at-green-forest\/7518363009.html","post_id":7518363009,"result_date":"2022-08-07 08:43","title":"New Specials at Green Forest Apartments!","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T08:17:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-apt-36xx-baring-walk-to\/7518366187.html","post_id":7518366187,"result_date":"2022-08-07 08:37","title":"1 Br Apt @ 36xx Baring, walk to Penn, Drexel and Art Museum","description":"One bedroom Apt. in elegant Queen Anne style house. One of the best blocks in University City. Quiet house. 5 minutes walk to Drexel, Science Center or Presbyterian Hospital, 10 minutes to U Penn.  The house has elaborate original curving staircase, stained glass windows and Porch. The apartment has hardwood floors, A\/C, and access to free laundry facility.\nSingle occupancy only. Sorry, No pets, No smoking.\nAvailable: 9\/1\/22\nRent :$900 per month, 1 year lease\nUtilities: electric, water, gas (including heat).\nApplication fee: $35\nSecurity deposit: $1800","num_images":9.0,"lat":39.961086,"lng":-75.195086,"attrs":"['1BR \/ 1Ba', '700ft2', 'available sep 1', 'air conditioning', 'application fee details: $35 tenant screening service fee', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T08:33:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-contemporary-kitchen-frost-free\/7518362728.html","post_id":7518362728,"result_date":"2022-08-07 08:32","title":"Contemporary kitchen, Frost-free refrigerator, Formica countertops","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1.5Ba', '1050ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T08:15:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-gorgeous-bedroom-available-today\/7518363082.html","post_id":7518363082,"result_date":"2022-08-07 08:32","title":"Gorgeous 2 Bedroom Available Today","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T08:17:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-amazing-amenities-at-green\/7518362823.html","post_id":7518362823,"result_date":"2022-08-07 08:29","title":"Amazing Amenities at Green Forest Apartments","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1.5Ba', '1050ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T08:16:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-tour-today-move-in-tomorrow\/7518362903.html","post_id":7518362903,"result_date":"2022-08-07 08:26","title":"Tour Today, Move In Tomorrow!","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T08:16:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-ad-for-550-studio-apt-in\/7518356774.html","post_id":7518356774,"result_date":"2022-08-07 07:49","title":"AD FOR $550 STUDIO APT IN UPPER DARBY IS A SCAM!!! DO NOT RESPOND TO POST DETAIL","description":"The post that I’m posting below is A SCAM!! There is a man pretending to be a landlord (or work for his uncles rental company) and he is actually scamming out of money. We meant in person (after him constantly trying to get\nMe to send money to him prior to viewing the space) I could tell from the outside that the apt wasn’t the same from the pics I still toured it. The inside was nice so I sent the first half of the deposit for exchange for keys Sunday 6\/31 while at the apt. Weds we were supposed to meet to get the remaining of the deposit and lease I sent the second half via cashapp as I sent the first half and after he received the second payment he stopped responding. I went back to the apt the key didn’t work and somebody clearly lived there and was ignoring me via the ring doorbell I was ringing. The address is 529 Timberlake Road in Upper Darby, Pa. The phone number he is using to scam is  show contact info\n. The cash app he used to scam is also posted below with the cash tag name $rashawn6155. FLAG POST WHEN YOU SEE IT!!! Ok\n","num_images":11.0,"lat":39.9613,"lng":-75.2616,"attrs":"['1BR \/ 1Ba', '800ft2', 'apartment', 'no laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2022-08-07T07:38:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-gorgeous-apartment\/7518341600.html","post_id":7518341600,"result_date":"2022-08-07 04:37","title":"NEW GORGEOUS APARTMENT AVAILABLE FOR MOVE IN.","description":"Gorgeous renovation on this one bedroom one bath with that amazing south facing SKYLINE VIEW from high up in the tower ! Dedicated , covered PARKING space #360 included in sale! Beautiful OPEN granite kitchen will make cooking a real pleasure. Large sliding windows bring in that beautiful light and breeze. Nice bath and large master bedroom with deep walk in closet! This unit has it all! City-view has a wonderful location off the Parkway with plenty of green space all around. Convenient shopping includes Whole Foods, Target, CVS and more. Heated POOL, professional GYM.\nYou can send your email address and phone number if interested and i will get back to you at my earliest convenience.\n","num_images":21.0,"lat":39.962256,"lng":-75.171263,"attrs":"['1BR \/ 1Ba', '674ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T03:12:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-apt-with-garage-laundry\/7518335023.html","post_id":7518335023,"result_date":"2022-08-07 01:39","title":"2 BR apt with Garage, Laundry, and Storage","description":"Welcome to Morell Park where you'll find a 2 bed 1 bath apt near Holy Family University with fresh painted walls and new carpet all throughout. Apartment boasts living room, dining room, kitchen, 2 bedrooms, 1 bath. 1 car garage (potential 2 spaces) for unit along with storage room in basement and individual laundry area (wash and dry). Background check, credit check, and employment verification required. 3 months rent to move in (first month, last month, and security deposit $5,700). Apartment readily available. 2 minutes drive to plaza where you'll find many business such as grocery, gas, etc. 5 minutes drive to hospital. Peaceful neighborhood.\nOccupant responsible for electricity and gas. No smoking allowed in apartment.","num_images":17.0,"lat":40.0634,"lng":-74.999,"attrs":"['2BR \/ 1Ba', '1012ft2', 'available aug 15', 'EV charging', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T01:35:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-aramingo-area\/7518332254.html","post_id":7518332254,"result_date":"2022-08-07 01:25","title":"1 Bedroom!!! Aramingo Area","description":"1 Bedroom, Living Room, Kitchen and Bathroom.\nFresh paint, cleaned all thru. Close to Public Trasportation. $950 month \/3 months to move in. Water included....\nTenant pays Electric and gas.\nCredit\/Eviction check done.\nBackground check.\nQuiet tenant...No Drugs.\n(2nd floor apartment)\nPrivate parking available.\nFree wifi\nLaundryroom(coming soon)","num_images":0.0,"lat":40.0178,"lng":-75.0895,"attrs":"['1BR \/ 1Ba', 'available now', 'application fee details: $75', 'apartment', 'laundry in bldg', 'detached garage', 'rent period: monthly']","posted_date":"2022-08-07T01:05:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-latchos-technology-lock\/7518322797.html","post_id":7518322797,"result_date":"2022-08-06 23:50","title":"LatchOS technology lock system, Peloton Room, Luxer Package Room","description":"Bedrooms: 1Bathrooms: 1.5Square Feet: 743Date Available: 2022-08-06Address: 631 N Broad StThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past. Amenities Include:Historic BuildingElevatorPet friendlyExposed Brick & Spiral DuctworkPeloton RoomNEST Learning ThermostatsRecyclingBike RoomHardwood FloorsControlled Access\/GatedOn-Site ManagementGas RangeCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/lnbacolk\/stable-lofts\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['1BR \/ 1.5Ba', '743ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: daily']","posted_date":"2022-08-06T23:46:48-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/scotch-plains-spacious-bedroom-apt-rent\/7518656341.html","post_id":7518656341,"result_date":"2022-08-07 22:22","title":"Spacious 1 Bedroom Apt 4 RENT!!!!","description":"Spacious 1 bedroom, living room, kitchen, bath, and office.  Apartment features hardwood floors and central a\/c.  The home is nestled in a picturesque country setting with over 10 acres around the home.  Only minutes away from downtown stores and shops.  Call today to schedule a showing.","num_images":1.0,"lat":40.624507,"lng":-74.366798,"attrs":"['1BR \/ 1Ba', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T22:18:23-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/milton-milton-br-duplex\/7518653688.html","post_id":7518653688,"result_date":"2022-08-07 22:09","title":"Milton--1 BR Duplex","description":"1 BR Duplex available Sept.  3.    Upstairs is BR and Bath.  Downstairs has Kitchen, Living room, and  half bath.  Small screen porch downstairs.   Monthly rent is $850 + utilities and security deposit is $850.    Rental is limited to a maximum of 2 people.   Sorry, No Pets.","num_images":0.0,"lat":38.7687,"lng":-75.2953,"attrs":"['1BR \/ 1.5Ba', 'available sep 3', 'duplex', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T22:05:48-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/kremmling-for-rent\/7518653519.html","post_id":7518653519,"result_date":"2022-08-07 22:09","title":"For rent","description":"I have a two bedroom house for rent. Hunting season is approaching and if you are looking for a place to rest, unpack it wait in town before heading to the mountains this could be your place.\n$170 per day, all utilities included. WiFi, the basic furniture necessaries. Pictures upon request.\nThank you for reading.\n","num_images":0.0,"lat":40.086902,"lng":-106.379757,"attrs":"['2BR \/ 1Ba', 'available aug 15', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: daily']","posted_date":"2022-08-07T22:05:01-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/burlington-bright-and-airy-bed-in\/7518643238.html","post_id":7518643238,"result_date":"2022-08-07 21:26","title":"Bright and airy 3 bed in Burlington Township","description":"A two-story apartment in a brick house shared with one other apartment.  Close to historic downtown Burlington as well as easy access to 295 and the Burlington-Bristol Bridge.\nNewer kitchen and bathrooms\nOriginal hardwood floors through bottom floor\nCarpeted bedrooms\nWalk-in closets!\nDishwasher\nWasher \/ Dryer in unit\nCentral Air \/ Forced Heat\nEnormous windows with deep window sills\nSpacious backyard\nFront porch\nOff-street parking\nClose to parks, lakes, highways, and shopping!\n**Note that all of our homes are deep-cleaned and re-painted before you move in. Pictures are recent, but all wall colors will be returned to neutral. Landlord takes pride of ownership seriously and is easy to communicate with.\nApplicant must have current photo identification and a valid social security number.\nApplicant's monthly household income must exceed three times the monthly rent. All income must be from a verifiable source. Unverifiable income will not be considered.\nApplicants must receive positive references from all previous landlords for the previous 5 years.\nApplicant may not have any evictions or unpaid judgments from previous landlords.\nApplicant must have credit score of 620 or higher.\nA background check will be conducted on all applicants over 18. Applicant's background must exhibit a pattern of responsibility.\nApplication subject to $40 fee per person in order to run background and credit checks.\nOccupancy is limited to 2 people per bedroom.\n","num_images":14.0,"lat":40.063019,"lng":-74.856677,"attrs":"['3BR \/ 1.5Ba', '1200ft2', 'available sep 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T21:22:16-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/princeton-share-big-house-in-beautiful\/7518632435.html","post_id":7518632435,"result_date":"2022-08-07 21:12","title":"Share big house in beautiful wooded area w\/professionals & PUpost-docs","description":"Unique house share in beautiful area of Princeton: Large house shared by mid-20s to mid-30s academics and professionals, all of whom are vaccinated and follow CDC guidelines for staying safe. Backyard trail through 5+ private acres of woods and wildlife, walkable\/bikable to PU, Bristol-Meyers Squibb and Educational Testing Service.\nAvail Aug. 15 is a furnished (or unfurnished, if preferred) 17' x 12' room w\/additional sleeping nook that fits a queen size bed and a 7'x7' walk-in closet with a window and built-ins, for $1175\/month, plus the $200\/month common fee -- which covers utilities, weekly maid service (including bedroom if desired), grounds care, house supplies (incl laundry and dish detergent, paper products, cooking and cleaning supplies, etc), fastest wifi and media, wine and snack subscriptions detailed below -- a total of $1175\/month.\nNew housemates are chosen by consensus of existing housemates after a 15-minute interview, ensuring a warm, compatible environment with good boundaries. We will be interviewing on Tuesday evening, Aug. 9. Housemates tend to be attracted to the house by the privacy, easy sense of community, carefully selected housemates, and the convenience of having weekly housekeeping service, fastest wifi, house supplies (paper towels, toilet paper, cleaning and cleaning supplies), groundskeeping and all utilities taken care of in the common fee. Also included in the common fee are monthly wine and artisanal snack subscriptions, and subscriptions to YouTube TV, Netflix, Disney +, HBOMax, etc.\nThe house has an unusual floor plan that divides bedrooms into four separate \"wings,\" affording greater privacy than in a typical house. The kitchen is great, with a separate large cabinet for each housemate plus common plates, glasses, utensils, pro-grade pots and pans, etc. It has two refrigerators, stainless steel appliances (gas stove), oak floors. The house has three full baths, each shared by two.\nFlexible lease term, though we typically sign leases through Aug of the following year (in accord w\/ the academic schedule), with the option of leaving early or renewing with 60 days notice. If you have your own bed, ours can be put into storage here. Washer\/dryer. Please, no cats or couples. 2.8 miles to campus, w\/well-maintained walkway and sidewalk the full way. Easily walkable or bikable to the campuses of Princeton University, Bristol-Meyers Squibb and ETS.","num_images":6.0,"lat":40.343247,"lng":-74.703941,"attrs":"['1BR \/ 3Ba', 'available aug 15', 'EV charging', 'air conditioning', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T20:42:15-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/spotswood-free-heat-water-available-now\/7518636165.html","post_id":7518636165,"result_date":"2022-08-07 20:59","title":"Free Heat & Water - Available NOW!","description":"CALL or TEXT ‪ show contact info\n‬  Heather\nSpacious Top Floor End Unit With Beautiful Natural Light\nFreshly Painted, Ceiling Fans, Galley Kitchen With Dishwasher\nFull Size Washer & Dryer In The Unit.\n***Free heat And Water Included In Rent***\nAvailable Immediately, Call For Your Tour Today!\nThis Is A Must See. Don't Let This One Get Away.\nNo Pets & No Smoking\nCALL or TEXT ‪ show contact info\n‬  Heather","num_images":17.0,"lat":40.397493,"lng":-74.38358,"attrs":"['1BR \/ 1Ba', 'available now', 'condo', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-08-07T20:55:45-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/absecon-need-roommate\/7518630424.html","post_id":7518630424,"result_date":"2022-08-07 20:38","title":"Need a roommate","description":"I have a two bedroom apartment in Mi-place in Absecon. I’m looking for a clean quite roommate. Preferably a Stockton student.","num_images":0.0,"lat":39.4218,"lng":-74.4949,"attrs":"['2BR \/ 2.5Ba', 'available aug 20', 'air conditioning', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T20:34:41-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-extremely-spacious-family-great\/7518622224.html","post_id":7518622224,"result_date":"2022-08-07 20:30","title":"Extremely spacious family\/great room with a view to the beautiful lake","description":"WOW! Beautiful End-Unit Side Entryway home sitting on the most immaculate view in Traditions! Spectacular Lake View, next to a serene Garden! This immaculate kept home features a two car garage and driveway big enough to accommodate two cars outside plus garage space! Beautiful foyer adorned with hardwood floors and Wainscoting walls! Columns separate the entryway, and extremely spacious family\/great room with a view to the beautiful lake! Custom Hunter Douglas privacy window treatments are sure to please anyone! Sunny \"Sunroom\" just off Great Room, featuring Custom Plantation Shutters as well as entryway to back patio. Meet new Friends who walk by the lake walking path while enjoying the amazing tranquil view, listen to the calming sounds of the water fountain while having coffee or a glass of wine on your custom built back patio! The Master Bedroom also includes beautiful Custom Plantation Shutters, plenty of room for accommodating large furniture. Off the Master is your On-Suite with shower, double vanity, and don't forget about the large walk-in closet! This home has a third bonus room, that may be used as a extra Den, office, Music room, Library or \"Man-Cave\", or just more room for overnight guests. Beyond the bonus Den is a great Second Bedroom. The Eat-in Kitchen features NEW LG Stainless steel high end matching appliances! Enjoy meals overlooking your walkway to main entrance. The Eat In Kitchen offers nice pantry space as well! Laundry room features lovely white upper wall Cabinets, for even more storage. Meet new Friends here in Traditions. Play Tennis, Bocce Ball, Shuffleboard, Horseshoe, or utilize all of the walking\/ biking paths around this neighborhood, Workout in the Fitness Center, or relax outside on a lounge chair this Covid-free summer at the Outdoor Swimming Pool. Reserve the 7,000 sq ft Clubhouse for entertaining larger parties equipped with a catering Kitchen, Card room, and Library! Outdoors not your thing? Join one of the many Social Clubs this amazing neighborhood has to offer! Plenty of parking on and off street, plus driveway parking. 4 miles from Train Station, Short Scooter ride and walking distance to Shopping Centers, Restaurants, and grocery stores. Hurry this home will not last","num_images":17.0,"lat":40.2336,"lng":-74.6576,"attrs":"['2BR \/ 2Ba', '1749ft2', 'available aug 20', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-08-07T20:05:21-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/cranbury-welcome-home-to-windsor-mill\/7518602712.html","post_id":7518602712,"result_date":"2022-08-07 20:00","title":"Welcome home to Windsor Mill in the highly sought-after location","description":"Welcome home to Windsor Mill in the highly sought-after location of East Windsor. This spacious one bedroom, one bathroom end unit condo has been lovingly maintained over the years. Wood burning fireplace, in unit laundry, oversized closet in bedroom, wooded view from private balcony and gas cooking are just a few of the perks you will get to enjoy when you call this home yours.","num_images":14.0,"lat":40.287518,"lng":-74.549132,"attrs":"['1BR \/ 1Ba', '865ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T19:02:15-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-duplex-bedroom-bath-apartment\/7518612814.html","post_id":7518612814,"result_date":"2022-08-07 19:38","title":"Duplex 1 bedroom 1 bath apartment rent in allentown","description":"Duplex 1 bedroom 1 bath apartment rent in allentown. Twp. The landlady pays for heat (oil hot water), electricity, and cable. with washer dryer hookups and cabinets lower level has a large bedroom, Ideal for college students or those seeking short term housing. electric and cable. New slow closing cabinets, subway tiled bath\/shower, refinished hardwoods… just Beautiful!!!Parking for 2 vehicles, will consider pets but need to be approved in advance. References and proof of employment may be requested. 1st\/ Last and Sec Deposit along with Lease required prior to renting. Close to CA Turnpike, Skippack, KOP, and MCCC. Rent- $753\/month...If you are interested, please send your contact number-- show contact info","num_images":3.0,"lat":40.6068,"lng":-75.4781,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'valet parking', 'rent period: monthly']","posted_date":"2022-08-07T19:34:00-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/egg-harbor-township-beautiful-2bed\/7518598247.html","post_id":7518598247,"result_date":"2022-08-07 19:24","title":"Beautiful 2Bed\/1Bath Available","description":"Well maintained 3 bedroom 1.5 cape for rent in Egg harbor township.\nFresh paint and newer kitchen and bath.\nAvailable immediately.\nAvoid Rental Scams! will never ask you to wire money or request funds through a payment app on your phone.\nTenant is responsible for all utilities.\n","num_images":15.0,"lat":39.3741,"lng":-74.6118,"attrs":"['3BR \/ 1Ba', '1318ft2', 'available now', 'application fee details: 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-08-07T18:48:44-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/edison-newly-renovated-2bd-2bth-family\/7518594968.html","post_id":7518594968,"result_date":"2022-08-07 19:18","title":"Newly renovated 2bd\/2bth family home for rent","description":"Freshly painted 2 Bed 1.5 bath single family house available for rent immediately.\nHouse less than a mile from Walmart, Costco , route 27, route 1 and edison train station\n","num_images":6.0,"lat":40.529705,"lng":-74.39161,"attrs":"['2BR \/ 2Ba', '980ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-08-07T18:39:10-0400"}]