[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546176216.html","post_id":7546176216,"result_date":"2022-10-16T03:43:25.000Z","title":"New 1 BD | 1 BA , residence with Delaware River views","description":"New 1 BD | 1 BA , residence with Delaware River views! Located in the Society Hill neighborhood comes with all the top of the line finishes and details you have been looking for. Hardwood flooring and large windows throughout, a spacious living and dining area. Beautiful kitchen features electric cooking, granite counters, stainless steel appliances as well as modern cabinetry. This bright unit features plenty of closet space and central air. For your convenience there is a washer\/dryer in the unit as well. Walking distance from some of the city's favorite spots to dine, drink, and relax! You'll be steps from South Street attractions as well as local favorites like Wawa, Whole Foods, and Spruce Harbor Park, and close proximity to Washington Square and Independence Hall. Public transportation is just steps away. First month's rent, last month's rent, 1month security deposit, rental application due at signing. Available for 10\/31","num_images":15,"lat":39.941578,"lng":-75.14393,"attrs":"['1BR \/ 1Ba', '600ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T22:40:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546170106.html","post_id":7546170106,"result_date":"2022-10-16T02:09:22.000Z","title":"1 Bdr Apt in West Philly","description":"*if you are interested please include your phone number and\/or email address in your message*\n3rd Fl, water included, no gas bill, cooking and heat is electric\nCan NOT accept Section 8 Vouchers\n","num_images":6,"lat":39.9845,"lng":-75.2282,"attrs":"['1BR \/ 1Ba', '800ft2', 'available now', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T22:05:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546166909.html","post_id":7546166909,"result_date":"2022-10-16T01:52:54.000Z","title":"Temple Hospital Area - 3 bedroom house","description":"3 bedroom   row house-\nlarge full basement\nback yard and front porch\ngood neighborhood\nConvenient 5 block walk from Temple Medical Sciences Center","num_images":4,"lat":40.011245,"lng":-75.154107,"attrs":"['3BR \/ 1.5Ba', 'available oct 17', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T21:48:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546163640.html","post_id":7546163640,"result_date":"2022-10-16T01:36:49.000Z","title":"completely renovated 3 bdr  2.5 ba home w deck","description":"*If you are interested please include your phone number and\/or email address in your message*\nNew renovation, all new electric, plumbing, HVAC, roof, flooring, lighting etc. Features a faux fireplace, exposed brick, half bath and laundry on the first floor, private back deck, finished basement, private bathroom in the master. ready asap\n","num_images":10,"lat":40.055,"lng":-75.158759,"attrs":"['3BR \/ 2.5Ba', '1260ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d hookups', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T21:32:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546133417.html","post_id":7546133417,"result_date":"2022-10-16T01:13:07.000Z","title":"Newly renovated 1 bedroom & 1.5 bathroom","description":"Newly renovated 1 bedroom & 1.5 bathroom apartment for rent IN Philadelphia . NO TEXT ABOUT THIS PROPERTY. WE WILL NO RESPOND TO ANY TEXT!!! Available until NOV 3rd. Suitable for single person or single person with small child or couple, there is very cute storage in this unit. This is a quiet property, great for those that work remotely. Non-Smoking of any kind. References and Security Deposit required. Plenty of street parking in front of the property. Green Space. Kitchen has a walk-in pantry, lots of cabinetry and space for an island or a table. If you are interested please Text me your number.","num_images":3,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T19:30:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546147574.html","post_id":7546147574,"result_date":"2022-10-16T00:28:10.000Z","title":"BI-LEVEL 2 BEDROOM in FAIRMOUNT","description":"This beautifully designed two bedroom apartment is located on the tree lined 1700 block of Green Street. The kitchen has gas cooking, granite counters, dish washer and more. A large open living room with polished oak flooring extends to a ceramic tiled sitting area\/office space. Central air conditioning and energy efficient gas heat insure year round tenant controlled comfort. A private south facing deck offers a quiet retreat. Just steps from public transport and a short walk to Philadelphia's cultural institutions. Close to gyms, restaurants, shopping and trails along the Schuylkill River.","num_images":17,"lat":39.964359,"lng":-75.166397,"attrs":"['2BR \/ 1Ba', 'available nov 1', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T20:24:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546141115.html","post_id":7546141115,"result_date":"2022-10-16T00:12:27.000Z","title":"Very cute 1 bed \/ 1 bath apt for rent in Philadelphia !","description":"Very cute 1 bedroom 1 bath apartment for rent in Philadelphia. NO CALL ABOUT THIS PROPERTY. WE WILL NO RESPOND TO ANY CALL!!! Available until NOV 3rd. Suitable for single person or single person with small child or couple, there is very cute storage in this unit. Hardwood floors throughout. minutes from Philadelphia and Philadelphia , windows on three sides. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application and meet the qualifying criteria; minimum requirement is a gross monthly income equivalent to 3x the rent. Parking is limited, no storage of campers, trailers, boats, RVs, utility vehicles. This is a non-smoking property; animals considered. Original pine wood floors, thermal windows, free laundry in basement, pets okay. It is close to all amenities, shops, grocery stores. ABSOLUTELY NO PETS!! location with sizable deck looking out over the river, quick commute to Center City, minutes from Manayunk and Roxborough, windows on three sides. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Newer gas range and fridge. Eat in kitchen, living room, bedroom, bath and 12 by 14 deck off of bedroom. Available shor tly, before end of the month. Rent is $700 plus utilities; first, last and month's security to move in. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application and meet the qualifying criteria; minimum requirement is a gross monthly income equivalent to 3x the rent. Parking is limited, no storage of campers, trailers, boats, RVs, utility vehicles.. Kitchen is fully equipped with all German made stainless Miele appliances, Quartz countertops with beautiful glass backsplash, under-mount cabinet lighting and deep under mounted sink. Kohler plumbing fixtures, wall mounted frameless medicine cabinets, marble bathroom vanity and the rich dark-colored stone flooring. All this in the most walkable score address. Sorry Pets ok and No-Smoking. Brand new renovation!!! 2 BR \/ 1 BA available Newly salem 2 bedroom & 1 bathroom apartment for rent. WE WILL NO RESPOND TO ANY TEXT!!! Available. Suitable for single person or single person with small child or couple, there is very cute storage in this unit. It is close to all amenities, shops, grocery stores. PETS OK!! The location affords ample extra parking on Bamboo light flooring unifies the space, there is no carpet, and the outdoor patio is perfect for plants, pets, and storage as there are dual sliders to the large patio, one in the main living area & another into the primary bedroom. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application. and meet the qualifying criteria. Parking is limited, no storage of campers, trailers, boats, RVs, or utility vehicles. . Kitchen is fully equipped with all German made stainless Miele appliances, Quartz countertops with beautiful glass backsplash, under-mount cabinet lighting and deep under mounted sink. Kohler plumbing fixtures, wall mounted frameless medicine cabinets, marble bathroom vanity and the rich dark-colored stone flooring. All this in the most walkable score address. Sorry Pets ok and No-Smoking. This is a non-smoking property.","num_images":3,"lat":40.0402,"lng":-75.2231,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T19:59:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546132370.html","post_id":7546132370,"result_date":"2022-10-16T00:09:31.000Z","title":"2 BR \/ 1 BA ~Newly renovated Apt","description":"Brand new renovation!!! 2 BR \/ 1 BA available Newly renovated 2 bedroom & 1 bathroom apartment for rent. WE WILL NO RESPOND TO ANY TEXT!!! Available. Suitable for single person or single person with small child or couple, there is very cute storage in this unit. It is close to all amenities, shops, grocery stores. PETS OK!! The location affords ample extra parking on Bamboo light flooring unifies the space, there is no carpet, and the outdoor patio is perfect for plants, pets, and storage as there are dual sliders to the large patio, one in the main living area & another into the primary bedroom. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application. and meet the qualifying criteria. Parking is limited, no storage of campers, trailers, boats, RVs, or utility vehicles. . Kitchen is fully equipped with all German made stainless Miele appliances, Quartz countertops with beautiful glass backsplash, under-mount cabinet lighting and deep under mounted sink. Kohler plumbing fixtures, wall mounted frameless medicine cabinets, marble bathroom vanity and the rich dark-colored stone flooring. All this in the most walkable score address. Sorry Pets ok and No-Smoking. This is a non-smoking property; If you interested please contact","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T19:26:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546131784.html","post_id":7546131784,"result_date":"2022-10-15T23:43:40.000Z","title":"Ample 1 BD ! 1 BA","description":"Very cute 1 bedroom 1 bath apartment for rent in Philadelphia . NO CALL ABOUT THIS PROPERTY. WE WILL NO RESPOND TO ANY CALL!!! Available until NOV 3rd. Suitable for single person or single person with small child or couple, there is very cute storage in this unit. Hardwood floors throughout. minutes from Nashua and Nashua, windows on three sides. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application and meet the qualifying criteria; minimum requirement is a gross monthly income equivalent to 3x the rent. Parking is limited, no storage of campers, trailers, boats, RVs, utility vehicles. This is a non-smoking property; animals considered. Original pine wood floors, thermal windows, free laundry in basement, pets okay. It is close to all amenities, shops, grocery stores. ABSOLUTELY NO PETS!! location with sizable deck looking out over the river, quick commute to Center City, minutes from Manayunk and Roxborough, windows on three sides. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Newer gas range and fridge. Eat in kitchen, living room, bedroom, bath and 12 by 14 deck off of bedroom. Available shor tly, before end of the month. Rent is $900 plus utilities; first, last and month's security to move in. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application and meet the qualifying criteria; minimum requirement is a gross monthly income equivalent to 3x the rent. Parking is limited, no storage of campers, trailers, boats, RVs, utility vehicles.. Kitchen is fully equipped with all German made stainless Miele appliances, Quartz countertops with beautiful glass backsplash, under-mount cabinet lighting and deep under mounted sink. Kohler plumbing fixtures, wall mounted frameless medicine cabinets, marble bathroom vanity and the rich dark-colored stone flooring. All this in the most walkable score address. Sorry Pets ok and No-Smoking.","num_images":3,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T19:24:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546132957.html","post_id":7546132957,"result_date":"2022-10-15T23:41:31.000Z","title":"High end Remodeled 3 bedroom 2 bath","description":"Very cute 3 bedroom 2 bath apartment for rent in Philadelphia. NO CALL ABOUT THIS PROPERTY. WE WILL NO RESPOND TO ANY CALL!!! Available until NOV 3rd. Suitable for single person or single person with small child or couple, there is very cute storage in this unit. Hardwood floors throughout. minutes from Nashua and Nashua, windows on three sides. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application and meet the qualifying criteria; minimum requirement is a gross monthly income equivalent to 3x the rent. Parking is limited, no storage of campers, trailers, boats, RVs, utility vehicles. This is a non-smoking property; animals considered. Original pine wood floors, thermal windows, free laundry in basement, pets okay. It is close to all amenities, shops, grocery stores. ABSOLUTELY NO PETS!! location with sizable deck looking out over the river, quick commute to Center City, minutes from Manayunk and Roxborough, windows on three sides. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Newer gas range and fridge. Eat in kitchen, living room, bedroom, bath and 12 by 14 deck off of bedroom. Available shor tly, before end of the month. Rent is $900 plus utilities; first, last and month's security to move in. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application and meet the qualifying criteria; minimum requirement is a gross monthly income equivalent to 3x the rent. Parking is limited, no storage of campers, trailers, boats, RVs, utility vehicles.. Kitchen is fully equipped with all German made stainless Miele appliances, Quartz countertops with beautiful glass backsplash, under-mount cabinet lighting and deep under mounted sink. Kohler plumbing fixtures, wall mounted frameless medicine cabinets, marble bathroom vanity and the rich dark-colored stone flooring. All this in the most walkable score address. Sorry Pets ok and No-Smoking. Feel free to ask questions contact","num_images":3,"lat":39.9487,"lng":-75.1593,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-10-15T19:28:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546101687.html","post_id":7546101687,"result_date":"2022-10-15T23:19:22.000Z","title":"Welcome Home! You'll fall in love the moment! spacious 3 bed 2 bath","description":"Welcome Home! You'll fall in love the moment you step inside this delightful 3 bedroom, 2 bath expanded ranch in Kimberly Knoll! Lovingly maintained, features include a spacious Living room with crown molding, a bright and sunny Kitchen and Dining\/Breakfast room!   Kitchen upgrades include granite countertops, smooth top range, built in microwave, pantry and stainless steel appliances. The perfect spot to prepare your favorite meals. The Dining room Pella slider has built-in blinds and opens to a beautiful paver patio! Nice size laundry room and a bonus three season sunroom. The expanded main bedroom suite features another Pella slider that opens to the patio, a walk-in closet and a wonderful private bath with walk in shower and oversized vanity with custom built in shelving and cabinetry for extra storage! There are two additional bedrooms and a beautifully updated hall bath!  Attention to detail is what makes this home so special.  Additional features include a New Roof (2021), Vinyl Siding & Gutters replaced in 2019, mostly newer Windows and newer heat and central air! One Car Garage w\/newer door and the Shed has electric.  This pretty tree lined neighborhood is just minutes to nearby shopping and dining, Whole Foods and several parks!   Easy access to all major highways. Send a number for more data or to plan a survey.","num_images":6,"lat":40.1245,"lng":-75.3304,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T17:52:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546115211.html","post_id":7546115211,"result_date":"2022-10-15T23:17:12.000Z","title":"Cozy(2x1) -  400 NJ-38, Moorestown, N*J (08057)","description":"Amazing!! Spectacular large two bedroom duplex for rent, with HEAT INCLUDED! Central air conditioning, all new LED Lighting in the home. Plenty of blacktop parking. Lots of storage space in the attic and in the basement. Washer\/Dryer Hookups existing in the basement. All new kitchen and bathrooms. All new stainless steel appliances. All new flooring. Solid core wood doors. Absolutely gorgeous!\nHeat, Trash, Water, Sewer, Lawn Mowing Included in rent. You pay electric, cable and internet.400 NJ-38, Moorestown, NJ\n**No pets allowed in the home.**\nNo smoking on the property. Credit check will be performed. One year lease required. First and security due upon signing lease.\n","num_images":6,"lat":39.9683,"lng":-74.9533,"attrs":"['2BR \/ 1Ba', 'available dec 1', 'air conditioning', 'application fee details: @@$11.50 Application Fee for Credit Check and Criminal Background Screening', 'broker fee details: !! Free Broker fee!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', \"listed by: !@!EALTOR FEE EQUAL TO ONE MONTH'S RENT!!!\", 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T18:32:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546103303.html","post_id":7546103303,"result_date":"2022-10-15T22:41:20.000Z","title":"Welcome to 2537 Hillside Lane Eagleville Pa 19403! 3 bed home","description":"Welcome to 2537 Hillside Lane, Eagleville, Pa 19403.  This lovingly cared for 3  bedroom 1 bath ranch home is located  on a quiet street just minutes from Valley Forge Park.  Level, well manicured lot with screened-in porch and yard has a separate fenced in dog yard.  You will love the privacy and one-floor living.  There's a separate building in the rear yard w\/electricity currently being used as a workshop w\/electricity inside and out.  Newer roof, heater and central air, gas heat and it will be so easy to add a zero clearance gas fireplace in the living room in the brick wall where the former fireplace was. Send a phone number if you'd like further information or to arrange a showing.","num_images":6,"lat":40.117718,"lng":-75.409375,"attrs":"['3BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T17:57:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546105767.html","post_id":7546105767,"result_date":"2022-10-15T22:18:32.000Z","title":"Very cute 2 bedroom 2 bath apartment for rent in philadelphia.","description":"Very cute 2 bedroom 2 bath apartment for rent in philadelphia. NO CALL ABOUT THIS PROPERTY. WE WILL NO RESPOND TO ANY CALL!!! Available until NOV 3rd. Suitable for single person or single person with small child or couple, there is very cute storage in this unit. Hardwood floors throughout. minutes from Nashua and Nashua, windows on three sides. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application and meet the qualifying criteria; minimum requirement is a gross monthly income equivalent to 3x the rent. Parking is limited, no storage of campers, trailers, boats, RVs, utility vehicles. This is a non-smoking property; animals considered. Original pine wood floors, thermal windows, free laundry in basement, pets okay. It is close to all amenities, shops, grocery stores. ABSOLUTELY NO PETS!! location with sizable deck looking out over the river, quick commute to Center City, minutes from Manayunk and Roxborough, windows on three sides. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Newer gas range and fridge. Eat in kitchen, living room, bedroom, bath and 12 by 14 deck off of bedroom. Available shor tly, before end of the month. Rent is $900 plus utilities; first, last and month's security to move in. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application and meet the qualifying criteria; minimum requirement is a gross monthly income equivalent to 3x the rent. Parking is limited, no storage of campers, trailers, boats, RVs, utility vehicles.. Kitchen is fully equipped with all German made stainless Miele appliances, Quartz countertops with beautiful glass backsplash, under-mount cabinet lighting and deep under mounted sink. Kohler plumbing fixtures, wall mounted frameless medicine cabinets, marble bathroom vanity and the rich dark-colored stone flooring. All this in the most walkable score address. Sorry Pets ok and No-Smoking. Feel free to ask questions contact me at::::::  show contact info","num_images":3,"lat":44.1589,"lng":-75.7099,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'valet parking', 'rent period: monthly']","posted_date":"2022-10-15T18:04:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546100289.html","post_id":7546100289,"result_date":"2022-10-15T22:15:28.000Z","title":"@2br - Cozy 2 Bed, 1 Bath Apartment- Camden VA Clinic","description":"2 bedroom, 1 bath apartment on 2nd floor of a 4 unit apartment building. This apartment offers a beautiful sun room with sky lights and a cozy rock front gas fireplace in the living room for those cold nights. Washer & dryer hookups available in unit. One parking space available under covered car port. Small storage unit also included. Additional parking available on street. Water and sewer is paid for by landlord. Stairs at both front and back entrance to unit. Looking for a long term tenant. $750.00\/month rent plus $750.00 Security Deposit. Available Now! No smoking.Managed by Leading Edge Property Management.","num_images":7,"lat":39.9186,"lng":-75.1078,"attrs":"['2BR \/ 1Ba', 'available nov 15', 'EV charging', 'air conditioning', 'broker fee details: NO BROKER FEE!', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'listed by: ANGEL', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-15T17:48:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546097997.html","post_id":7546097997,"result_date":"2022-10-15T21:46:11.000Z","title":"Moorestown, N*J Cozy=2BR \/ 1Ba","description":"!!!@Newly renovated 2 bedroom\/1bath apartment in 400 NJ-38, Moorestown, NJ, . Rent includes water, sewer and garbage. Tenant pays for Nipsco (gas and electric). Coin operated laundry on site. Beautiful spacious seven bedroom apartment, living room, full bathroom, and kitchen with large dinette. Premier location across from the400 NJ-38, . Located on the top floor in the front of a 7-unit 2 story building. Hardwood floors throughout. minutes from Moorestown, NJ-- , windows on three sides. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Parking is limited, no storage of campers, trailers, boats, RVs, utility vehicles. This is a non-smoking property; animals considered","num_images":7,"lat":39.9683,"lng":-74.9533,"attrs":"['2BR \/ 1Ba', 'application fee details: $11.50 Application Fee for Credit Check and Criminal Background Screening', 'broker fee details: Free Broker fee', 'apartment', 'w\/d in unit', \"listed by: EALTOR FEE EQUAL TO ONE MONTH'S RENT!!!\", 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T17:42:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545895272.html","post_id":7545895272,"result_date":"2022-10-15T14:18:24.000Z","title":"Welcome to the Greenfair!","description":"Welcome to the Greenfair! An historic building that has been converted into residential units. This Spacious bi-level 1 bedroom 1 full bathroom is located in the Art Museum district in Philadelphia. Enter through the front door of this unit into a spacious living area which is open to the kitchen. The large bedroom is on the lower level for privacy and has a full bathroom attached. Recently updated with hardwood floors, a new kitchen with new appliances and cabinets, this rental features plenty of character with high ceilings, a stained-glass window and a decorative marble fireplace with mantel. Close to the city, parks, museums, public transportation, shopping and restaurants, this unit is situated in an ideal location. Available immediately, schedule a showing today as this rental won't last long!\n1738 Green St #10","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '838ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:14:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545893630.html","post_id":7545893630,"result_date":"2022-10-15T14:14:11.000Z","title":"Just 1st month's rent and $500 security deposit to move-in!!","description":"Just 1st month's rent and $500 security deposit to move-in!!! The Gratz Building- With nearly a hundred years of History, this newly renovated apartment building has just the perfect amount old world charm combined with the latest design of high-end finishes, in a premier location in Society Hill. Modern kitchens with stainless steel appliances, Wooden cabinetry and Granite stone counters. Lovely baths, complete with beautiful bath fixtures. Washer and dryer in the apartment. Pet-Friendly building. Lovely shared courtyard. Parking onsite $300mth. Pictures are of a similar unit.\n532 Spruce St #7","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:10:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545892793.html","post_id":7545892793,"result_date":"2022-10-15T14:12:00.000Z","title":"Laundry in Unit, Lease Today, Convenient Location","description":"Looking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\n[#9442281]","num_images":18,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T10:08:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545890108.html","post_id":7545890108,"result_date":"2022-10-15T14:05:16.000Z","title":"Brand new spacious apartment available now!","description":"Location! Location! Location! Come and take a stroll through this sparkling brand new , tri level apartment. Oh the space it has!! 3 large bedrooms and 2 full bathrooms, one with double vanity sink. This open floor unit has recessed lighting, a full stainless steel kitchen with granite counters, washer and dryer, lots of large windows, intercom security to name a few of the wonderful amenities this fab unit has! Live right in the middle of bustling Baltimore Ave, where you can walk to the Mariposa co op to shop for groceries, enjoy Bookers restaurant down the street, get your walk on at Clark Park! Minutes from University of Penn and Drexel, great public transportation to everywhere nearby!! A must see!!Book your appointment today! Ask me about the October move in special!","num_images":18,"lat":39.94784,"lng":-75.224217,"attrs":"['3BR \/ 2Ba', 'available now', 'air conditioning', 'application fee details: $30 credit check, eviction check, background check', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:01:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545889412.html","post_id":7545889412,"result_date":"2022-10-15T14:03:38.000Z","title":"Stunning 3 bedroom\/3 bath with GARAGE!","description":"Stunning 3 bedroom\/3 bath with GARAGE in the heart of the Art Museum Area! Marble entranceway leads to the the first floor bedroom suite. Second Floor: Gorgeous open renovated kitchen with SS appliances, granite counter tops & lots of cabinets and counter top space. Spacious living room features hardwood floors, a fireplace & high ceilings. Dramatic staircase reminiscent of an Italian villa leads to the third floor boasting the master suite with a beautiful white marble bathroom and an oversized shower; 2nd bedroom with exposed wood beams which opens to the deck; and a luxurious hall bathroom with oversized tub. Washer\/dryer. The square footage in public records is incorrect. This home has approximately 2200 square feet. First, last and one month's security deposit due at lease signing. $50 application fee per applicant.\n822 N Ringgold St","num_images":5,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 3Ba', '1360ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T09:59:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545888412.html","post_id":7545888412,"result_date":"2022-10-15T14:00:57.000Z","title":"2nd bedroom style unit with a South facing view!","description":"P1303 is a large one plus den or 2nd bedroom style unit with a South facing view of the Ben Franklin Bridge and The City skyline. This unit has an open floor plan with walls of windows and stunning unobstructed views. The kitchen has a beautiful Island Bar with granite countertop, new wide plank flooring through out the living area and a large balcony. Lite ceiling fans in dining room area and bedroom for added lighting . A reverse osmosis drinking water system has been installed for added convenience . Waterfront Square offers a 3- level parking garage, with Philadelphia's largest green roof situated on top, inclusive of putting green! Waterfront Square resides on a 9.5-acre riverfront enclave, with lush manicured outdoor common parks and gardens right on the river's edge. Management is on site, and Waterfront boasts an advanced security system . For your convenience, The river deck is oversized, encompassing a 25-meter heated lap pool (junior Olympic). Waterfront Square has an excellent location, due to it's proximity to area highways & airports (676,95, all bridges).\n901 N Penn St #P1303","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1.5Ba', '1178ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T09:56:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545882433.html","post_id":7545882433,"result_date":"2022-10-15T13:59:34.000Z","title":"** PROMOTION: 14month lease\/2 months free**","description":"** PROMOTION: 14month lease\/2 months free** Applies for AND Moves in by or before 10\/31\/22. Assigned Parking Available At $125\/mo Lofts 640 offers you the \"most bang for your buck\" in Philadelphia! Included with your monthly rental price is extended cable TV service, fitness center, indoor\/heated pool and hot tub with attached outdoor roof deck, yoga\/fitness studio, cyber lounge, 24\/7 front desk attendant, and more!! Walk off the busy street into 640 North Broad and enter an urban space that combines the old with the new. Feel the past mix with a refreshing dose of hip, understated sophistication. The original character of the building is not lost but enhanced by modern accents and furnishings. A thriving community dwells within our walls -- a state-of-the-art fitness center, cyber cafe, and yoga studio serve to nurture body, mind, and spirit. Setting the night sky aglow, our glass-domed pool house is the perfect place to unwind. Go for a swim in the warm salt water, relax your muscles in the Jacuzzi, or meet and socialize on the roof deck lounge. Enter the lobby, your public space. Experience orange as it bursts in the artwork and pours from geometric ceiling lights that warm the mocha-colored floors. Accented with a healthy dose of pure white and stainless steel, contrast brings together the energizing elements of your entrance. A thriving community dwells within our walls -- a state-of-the-art fitness center, cyber cafe, and yoga studio serve to nurture body, mind, and spirit. Setting the night sky aglow, our glass-domed pool house is the perfect place to unwind. Go for a swim in the warm salt water, relax your muscles in the Jacuzzi, or meet and socialize on the roof deck lounge. Lofts 640 is just six (6) blocks north of City Hall on Broad Street. Lofts 640 is centrally located to Philadelphia shoppes, restaurants, hospitals, and the thriving community of Fairmount. Minutes from Reading Terminal Market and the Pennsylvania Convention Center, Lofts 640 combines commuter convenience of center city living with spectacular urban spaciousness of true loft living.*Property amenities-Cable included in rent Reconnect at the Cyber Lounge. Reenergize at the gym. Rejuvenate at the pool. Relax at the yoga studio. Reward yourself with a new lifestyle. Unit amenities12 Foot CeilingsBalconies Available w\/select loftsBeautifully Landscaped CourtyardCentral Heat \/ AirCovered Garage ParkingDesigner Wall to Wall CarpetEuro-Luxe Stainless KitchenExposed BrickHigh Speed Internet available industrial Size Windows Lavish Closet Space Unspoiled Skyline ViewsWasher \/ Dryer in each loft *Availability subject to change on a daily basis.\n640 N Broad St #805","num_images":5,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '917ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:40:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545886486.html","post_id":7545886486,"result_date":"2022-10-15T13:55:45.000Z","title":"Location! Location! Location!","description":"Wow! Cedar Park's finest is ready! This very unique tri level apartment has all the bells and whistles you can imagine! Check out the full stainless steel kitchen, with granite counters, island, and pantry. 3 large bedrooms, 2 full bathrooms with the upstairs primary bedroom having its own bath. Privacy awaits you! This beautiful unit also has recessed lighting, washer and dryer, intercom security, huge closets! Close to everything fantastic that is University City! Call me to schedule your tour today! Ask me about the October special!","num_images":14,"lat":39.94784,"lng":-75.224217,"attrs":"['3BR \/ 2Ba', 'available now', 'air conditioning', 'application fee details: $30 credit check, eviction check, background check', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:51:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545880772.html","post_id":7545880772,"result_date":"2022-10-15T13:50:28.000Z","title":"Spacious bi-level 2 bed unit with spiral stairs in a great area!","description":"ONE MONTH FREE FOR APPLICATIONS BEFORE 9\/30!!! $500 Security Deposit - Limited Time Move In Special!!! Spacious bi-level 2 bed unit with spiral stairs in a great area. Urban charm and spacious floorplans with hardwood flooring throughout! Located just one block from scenic Washington Square Park, our properties along Spruce Street are the perfect place to call home. These affordably priced properties are located close to shopping, dining, and entertainment venues, as well as all forms of public transportation. Parking available for $225\/month. Laundry on site. Pictures are of a similar unit.\n721 Spruce St #1F","num_images":5,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T09:35:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545884251.html","post_id":7545884251,"result_date":"2022-10-15T13:49:44.000Z","title":"Live at 101 Arch St #1K a spacious bi-level Old City condo!","description":"Live at 101 Arch St #1K a spacious bi-level Old City condo with exposed beams and amazing \"Classic Philly\" touches. Enter the private entrance via Front St into the open living room\/dining space, with a cafeteria-style kitchen. This level includes a large living room, dining room, kitchen, and a convenient half-bathroom. An extra wide staircase leads down to the bedroom with tons of closet space and an in-unit washer and dryer. The lower level is very spacious and could easily accommodate an office or den area The full bathroom is also located on this floor with double vanity and a linen closet. Recent updates include the kitchen, half bath, Renewal by Andersen windows, central air, water heater, and new upstairs flooring. Unit is conveniently located to Old City's many shops and restaurants as well as being a 2-block walk to the 2nd street stop on The El. You won’t want to miss this opportunity.\n101-111 Arch St #1K","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1.5Ba', '1027ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:45:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545883328.html","post_id":7545883328,"result_date":"2022-10-15T13:47:09.000Z","title":"Brand new 2 bedroom bi level available now!","description":"Wow! Another fabulous rental awaits you!! Step into this brand new, beautiful bi level unit and fall in love!! HUGE kitchen!!!! A chef's dream!! Look through the patio doors at the cute little yard out back. Perfect for summer grilling and enjoying your morning coffee. Walk down to the main level where your living space is. 2 large bedrooms with big closets, 2 full bathrooms, washer and dryer, security intercom, recessed lighting throughout. Great location , close to everything fantastic! Ask me about the October move in special!","num_images":12,"lat":39.94784,"lng":-75.224217,"attrs":"['2BR \/ 2Ba', 'available now', 'application fee details: $30 credit check, eviction check, background check', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:43:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545882425.html","post_id":7545882425,"result_date":"2022-10-15T13:44:32.000Z","title":"Sunny Bi-level in Northern Liberties","description":"Top floor bi-level apartment in a triple unit building. The 4th and Fairmount location is nearby to local shops, markets and fine restaurants along with easy access for transportation to Center City. Third floor apartment, carpeted living room, coat closet, galley kitchen, D\/W. Up is a large bedroom, carpeted, wide closet and a tiled bath w\/Tub-shower. Utilities; Gas, cooking, forced air heat and hot water. Electric; Washer\/Dryer, Window A\/C.\nAvailable December;  $975. monthly plus utilities.  1 Year lease.   Sorry, No pets, This is a no pet building.\nMore details and appointments;  Please call the owner at  show contact info\n.\n","num_images":7,"lat":39.96278,"lng":-75.144949,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:40:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545882260.html","post_id":7545882260,"result_date":"2022-10-15T13:43:56.000Z","title":"Pets Welcome, Lease Today, Quiet Community","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nApartment Features\n* Stainless Steel Appliances\n* Garden Tub\n* Linen Closet\n* Kitchen Island\n* Walk-in Closet\n* Washer and Dryer in unit\n* Private Patio or Private Balcony (on select apartments)\nCommunity Features\n* Fitness Studio\n* Pet Salon\n* Community Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Billiards\n* Easy Freeway Access\n* Outdoor Grill Area\n* Professionally Managed\n* Bark Park\n* Swimming Pool\n* TV Lounge\n* Sun Deck\n* Spa\n* Yoga Lounge","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '733ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:39:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545881717.html","post_id":7545881717,"result_date":"2022-10-15T13:42:19.000Z","title":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!","description":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!!!!!!!! LET the SUNSETS be your permanent back drop!!!!!!!!! This ONE BEDROOM residence, at FRANKLIN TOWER, located at 16TH and RACE STREET is a must see!!! All open and spacious living and dining area, kitchen with STAINLESS steel appliances, breakfast bar, and CUSTOM cabinetry. The Bedroom is VERY spacious, with an all tile EUROPEAN style bathroom. There is nothing like FRANKLIN TOWER apartments, in all of Philadelphia!!! With amenities on EVERY FLOOR, Peloton Rooms, Yoga studios, Screening Rooms, Game Rooms, Lounges, and Gyms, as well as the ROOF TOP LOUNGE , with flat screen, grills, and fire place. A BASKETBALL COURT, and GARAGE PARKING. Parking available for additional cost. Photo's are of model unit.\n200 N 16th St #418","num_images":5,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '656ft2', 'available oct 24', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:38:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545877855.html","post_id":7545877855,"result_date":"2022-10-15T13:30:49.000Z","title":"Great 2 bedroom\/2 bathroom rental in Graduate Hospital!","description":"Great 2 bedroom\/2 bathroom rental in Graduate Hospital! This newer construction unit has a well-designed kitchen with stainless steel appliances including a dishwasher and built-in microwave and is open to the living room for easy entertaining and convenience. The spacious living room is large enough to accommodate a seating area and dining set, or add some bar stools for dining at the ample counter space dividing the two rooms. In-unit laundry and central air conditioning add additional comfort and convenience. There are two large bedrooms, each with significant closet space. The larger bedroom has an en suite bathroom, walk-in closet and opens to a private balcony. The 2nd bedroom has a double-wide closet and easy use of the hallway bath. A roof deck shared with the other two units provides additional outdoor space and great views of the skyline. Close to local universities, hospitals and downtown businesses as well as great restaurants, fitness centers, coffee shops, public trans and I-76. With Lincoln Square less than 3 blocks away (Sprouts, Target, Wine & Spirits, etc.) everything you need is just a few steps away! Come see this great unit today.\n1542 Christian St #C","num_images":4,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '997ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:26:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545876551.html","post_id":7545876551,"result_date":"2022-10-15T13:26:37.000Z","title":"Recently remodeled home with 3 bedrooms and 2 baths!","description":"Live at 1132 Webster St a recently remodeled home with 3 bedrooms and 2 baths. The first floor has an amazing kitchen that is open to the living room with hardwood flooring, high ceilings, and fantastic natural light from south-facing glass doors that lead to a large back patio, great for grilling and entertaining. The second floor has 2 bedrooms and a full bath with a shower. The 3rd floor is a large primary suite with a huge full bathroom. This home has wonderful closet space and plenty of storage in the basement. Enjoy the amazing location, close to the Italian Market, great restaurants, South Street, Whole Foods, Passyunk Square, the Broad Street line, and public transportation.\n1132 Webster St","num_images":8,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', '1176ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:22:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545872100.html","post_id":7545872100,"result_date":"2022-10-15T13:23:01.000Z","title":"Amazing View Spacious 2BR 1.5BA Open floor plan Townhouse! TEXT TODAY!","description":"Amazing View Spacious 2 BR 1.5 BA Open floor plan Townhouse! TEXT TODAY! on the third floor of a well-maintained, vintage building with an elevator, conveniently located two The kitchen has abundant maple cabinetry and granite counter tops. There is a built-in, a full gas stove, and a large refrigerator. A large private rear deck for relaxing & entertaining, quiet corner overlooking yard, lots of windows for natural light, OPEN FLOOR PLAN, FRESHLY PAINTED INTERIOR, IN-UNIT LAUNDRY. ONE ASSIGNED PARKING IN THE GATED PARKING AREA. COMPLEX AMENITIES INCLUDE A POOL AND SPA, CLUBHOUSE AND DEDICATED STORAGE SPACE. AND JUST PAINTED. NEW DECKS, AND PLENTY OF STORAGE IN THE ATTIC, THE HOUSE, AND A SHED OUTSIDE. ESIG GONER PAINT, STYLISH CEILING FAN, CUSTOM TILE IN MASTER BATH, bath light timers, sap laundry room w\/ Kenmore Elite Washer& Dryer, security alarm, auto sprinklers\/iris. Landscaped front\/back. Great corner view Lota Spacious Kitchen with brand new counter top, cabinets, and a bar to look onto the Family room. Brand new beautiful laminate floor throughout the house and fresh paint make you feel melt after coming home from a hard working day. House is on process of remodeling and will be done in few days. Pictures will be post soon. Please text Olivia at (720) 6 2 3-8982 for more details","num_images":4,"lat":40.0247,"lng":-75.0518,"attrs":"['2BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T09:08:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545874879.html","post_id":7545874879,"result_date":"2022-10-15T13:21:23.000Z","title":"Gorgeous bi-level condominium in Center City!","description":"Gorgeous bi-level condominium in Center City! The home features a contemporary eat-in kitchen (granite countertops, stainless steel appliances) on the main level, along with a bedroom and full bathroom. Downstairs, you'll find the living room, as well as another bedroom and a full bathroom with a tub. Enjoy central air, in-unit laundry, walk-in closets, a dishwasher, and hardwood floors throughout. The south-facing windows provide lots of light. Short walk to Rittenhouse Square, Broad Street Subway, and dozens of restaurants\/shops.\n1343 Lombard St #A","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '982ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:17:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545870736.html","post_id":7545870736,"result_date":"2022-10-15T13:18:47.000Z","title":"Enter This Charming 2-bed Unit and Find an Entryway Closet","description":"Welcome to 159 N 21st Street Unit 1R! Enter this charming two-bedroom unit and find an entryway closet, decorative original fireplace, and exposed brick in the kitchen and living areas. The bright bathroom off the kitchen boasts a porcelain tub and shower. The first bedroom is adjacent to the living area with the second bedroom on the lower level, making this comfortable for roommates. There is a private patio to the back of the unit and laundry in the basement of this secure, well-maintained building. Enjoy all Logan Square has to offer like museums, restaurants, Whole Foods, Trader Joe's, and an easy point from which to commute! Nearby schools include Science Leadership Academy, Russell Byers Cs, John W. Hallahan Catholic Girls' High School and Albert M Greenfield Elementary School. The City of Philadelphia has completed a real estate tax reassessment, effective January 1, 2023. If you have any questions or concerns about the impact of this reassessment on future real estate taxes, please contact the City of Philadelphia. Compass RE is not involved in the City of Philadelphia’s tax reassessment and does not have any input or control in the results.\n159 N 21st St #1R","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '664ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T09:03:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545873982.html","post_id":7545873982,"result_date":"2022-10-15T13:18:31.000Z","title":"Lease Today, Playground, Luxurious Bathrooms","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nSchedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available oct 19', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:14:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545873878.html","post_id":7545873878,"result_date":"2022-10-15T13:18:10.000Z","title":"MUST SEE 2 bedroom, 1 bath apartment at 1300 Chestnut!","description":"MUST SEE 2 bedroom, 1 bath apartment at 1300 Chestnut! All open living and dining space. Kitchen has plenty of cabinet and counter space. Spacious and gracious bedroom with all tile bath. Enjoy living in this elevator, doorman building (from 12pm to 8pm) in the heart of MIDTOWN. Just minutes from Avenue of the Arts, Jefferson Hospital, and The Reading Terminal Market. Walking score 110! Great space and value and yes a fantastic gym at your disposal as well to use.\n1300-6 Chestnut St #304","num_images":6,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T09:14:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545873341.html","post_id":7545873341,"result_date":"2022-10-15T13:16:18.000Z","title":"Spacious 2-bedroom corner apartment in Fairmount!","description":"Spacious 2-bedroom corner apartment in Fairmount! Enjoy lots of natural light, big bedrooms, and updated kitchen with living area and breakfast nook in the bay window. There is a nice-sized outdoor patio space for the tenants to use, as well. Central air provides forced air heating and cooling. Hardwood floors are pet friendly! Enjoy this incredible location!\n754 N 25th St #2","num_images":5,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', '750ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T09:12:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545868296.html","post_id":7545868296,"result_date":"2022-10-15T13:13:26.000Z","title":"Beautiful Corner Unit - 2 bed + 1 den","description":"Available NOW | Leasing Special: $1,325\/month for a 18 month lease; or $1,375\/month for a 12 month lease.\nThis 2 bedroom \/ 1 bathroom apartment welcomes you into the main living space with exposed brick, large windows for sunlight, & exposed ductwork. The kitchen area is at the back and is fully equipped with white shaker cabinets, subway tile back splash, and sleek stainless steel appliances including a microwave, dishwasher, electric range, and refrigerator. Continue to your stunning bathroom boasting a modern gray vanity and gorgeous shower stall with detailed floor-to-ceiling tiling and a glass door. On the other side of the unit you will find your 2 bedrooms with spacious closets. The corner bedroom is a bit larger and receives a ton of natural light! Unit features hardwood floors, central air, washer \/ dryer, and recessed lighting throughout! show contact info\nAbout The Neighborhood:\nLocated in Norris Square and walkable to tons of great shopping, eating, and entertainment options. You’ll be surrounded by public transportation bus routes for a quick commute throughout the city. Close proximity to Norris Square Park, Towey Playground, and La Placita Park. Just blocks from fantastic spots including Sunflower Philly, Human Robot, Cousins Supermarket, Luna Cafe, Original 13 Ciderworks, Halftime Goodtimes, Sidekicks Sports Bar & Grill, and countless more!\nLease Terms: show contact info\nGenerally, first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord. $55 application fee per applicant. Strictly, no pets. Tenants responsible for: electricity, cable\/internet, and water. Landlord Requirements: Applicants to make a minimum of 3x the monthly rent in verifiable net income, no landlord filings or evictions within the past 4 years, and must have a verifiable rental history.\n","num_images":8,"lat":39.9227,"lng":-75.1812,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T08:55:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545872462.html","post_id":7545872462,"result_date":"2022-10-15T13:13:12.000Z","title":"A Wonderful opportunity to rent a gorgeous 2 Bedroom Apt","description":"Wonderful 2 Bedroom Apt. w\/ Hardwood Floors and Stainless Steel Appliances -w\/ Beautiful Hardwood Floors, Central Air and Stainless Steel Appliances. Walk Out Of Your Door and You Are Steps From Great Restaurants and Shopping and The Excitement of Living In The Heart of Center City! Drexel University School of Medicine is Directly Across The Street. Close to Suburban Station!\n1522-24 Race St #5","num_images":5,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', '692ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:09:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545871727.html","post_id":7545871727,"result_date":"2022-10-15T13:10:48.000Z","title":"MUST SEE 1 bedroom, 1 bath apartment at 1300 Chestnut!","description":"MUST SEE 1 bedroom, 1 bath apartment at 1300 Chestnut! All open living and dining space. Kitchen has plenty of cabinet and counter space. Spacious and gracious bedroom with all tile bath. Enjoy living in this elevator, doorman building (from 12pm to 8pm) in the heart of MIDTOWN. Just minutes from Avenue of the Arts, Jefferson Hospital, and The Reading Terminal Market. Walking score 110! Great space and value and yes a fantastic gym at your disposal as well to use.\n1300-6 Chestnut St #1001","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'available nov 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T09:06:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545869677.html","post_id":7545869677,"result_date":"2022-10-15T13:04:45.000Z","title":"Modern bi-level condo in booming Fishtown!","description":"Modern bi-level condo in booming Fishtown! This spacious 3 bed 3 & 1\/2 bath 1st-floor condo features an open floor plan, plenty of natural light, contemporary appliances, beautiful flooring, and a private backyard that is ideal for entertaining or relaxing outdoors. The main floors host your living. dining, 1\/2 bath, and gourmet kitchen. The lower level comprises of 3 bedrooms each conveniently having its own private full bath. This home is just steps away from Surya, Evil Genius, Frankford Hall, Johnny Brendaâ€™s, Wm. Mulherinâ€™s Sons, and many more of Philadelphiaâ€™s hottest bars and restaurants!\n1514 Frankford Ave #1","num_images":4,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 3.5Ba', '2261ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T09:00:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545869566.html","post_id":7545869566,"result_date":"2022-10-15T13:04:28.000Z","title":"Truly unique, stunning Fishtown townhouse w\/ PARKING for lease!","description":"Truly unique, stunning Fishtown townhouse w\/ PARKING for lease! The first level of the home is the garage that spans the length of the home followed by the rear yard that can be used for gardening, relaxing and entertaining. Up the stairs you have the main level of the home that is completely open with massively tall ceilings and incredible natural light. The tiered level has the living and dining space on the lower level and full kitchen with eat in nook on the upper level. The kitchen has been recently remodeled with new countertops and fixtures. The top level features three bedrooms, stackable laundry closet, hall bathroom and a brand new primary bathroom. The primary bathroom is jawdropping with accented barn door, wall to wall mirrors, gorgeous tiling, waterfall shower and free standing tub. Through the primary bedroom is access to the green roof deck. The roof deck is lined with succulents to make it a true \"green\" roof, has panoramic views of the city, and tons of space for get togethers. Lastly, but perhaps the biggest selling point is the prime location in fishtown right off of Frankford ave and next to Palmer park. The home is just steps away from some of the best dining\/restaurants in the city such as Suraya, Wm Mulherin's & sons, Pizzeria Beddia and La Colombe. This is a rare rental in a perfect location. **Owner would like to keep the back parking spot for his wood work space but could be leased for an additional $200 per month. Home can be rented furnished for an additional $200 per month.\n401 Memphis St","num_images":5,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2Ba', '1895ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T09:00:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545868994.html","post_id":7545868994,"result_date":"2022-10-15T13:02:17.000Z","title":"1 bedroom","description":"Pictures below it clean and like it to stay that way.  One month rent and 1 month security to move in.","num_images":10,"lat":39.9218,"lng":-75.2876,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'application fee details: 50.00', 'furnished', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T08:58:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545860245.html","post_id":7545860245,"result_date":"2022-10-15T12:54:52.000Z","title":"ONE MONTH FREE ON APPLICATIONS BEFORE 10\/15!!!","description":"ONE MONTH FREE ON APPLICATIONS BEFORE 10\/15!!! $500 SECURITY DEPOSIT - Limited Time Move In Special! Welcome home! Spacious 1 bedroom+ Den \/1 bath. Carpet in bedrooms, vinyl flooring downstairs. Washer and dryer in unit! Whether CHOP, HUP, Penn, or Drexel, Liberty View is the ideal location. Spectacular city views! Within blocks of prestigious Rittenhouse Square and Philadelphia public transportation, Liberty View is situated along vibrant, tree-lined South Street. Spacious apartment homes available in bi-level, patio, and balcony unit formats offer Center City living with comfortable outdoor space! Pictures are of a similar unit!\n2031 South St #200","num_images":6,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T08:19:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545862247.html","post_id":7545862247,"result_date":"2022-10-15T12:52:10.000Z","title":"Spacious 2 bedroom \/ 2 bath unit at the pet-friendly Metro Club","description":"ONE MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!! Spacious 2 bedroom \/ 2 bath unit at the pet-friendly Metro Club with a washer\/dryer in unit and 1 secured gated parking spot included. Great natural lighting, expansive windows, open layout, modern stainless steel appliances, beautiful hardwood floors, pendant lights above the breakfast bar. Closet galore, double bathroom sinks! Metro Club in an elevator high-rise with a heated outdoor pool, Boutique hotel-style lobby, fireplace, and lounge seating. Secured entry and controlled building access with a full gym. Easy access to Market East SEPTA station and SEPTA bus routes and many area local attractions including Reading Terminal Market, Maggiano's Italy, The Melting Pot etc. Pictures are of a similar unit!\n201 N 8th St #902","num_images":5,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1792ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T08:29:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545861403.html","post_id":7545861403,"result_date":"2022-10-15T12:50:17.000Z","title":"1bedroom\/1bath Apartment in the Heart of Logan Square Area","description":"FRESH to the market, enormous 1Bedroom\/1Bath apartment in the Heart of Logan Square area. Kitchen features plenty of GRANITE counter space\/bar, STAINLESS Steel appliances...combination kitchen\/breakfast nook\/dining area. Loft like feeling with hardwood floors and tile throughout. The bedroom his HUGE with ample closet space...large bathroom. Washer\/Dryer, Fitness Center, and Secured entry all for you! Check it out its a MUST SEE! Photo's are of model unit.\n2130 Arch St #205","num_images":6,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '864ft2', 'available dec 28', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T08:25:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545858374.html","post_id":7545858374,"result_date":"2022-10-15T12:36:16.000Z","title":"You Will Find Pure Luxury at the Residences of Dockside","description":"You will find Pure Luxury at The Residences of Dockside right on the waterfront with this amazing Corner unit, NORTH FACING condo with center city views, 2 Garage Parking spots, and storage. This TOTALLY RENOVATED 3 Bedroom, 3 Bathroom condo of nearly 2000 sq ft offers some of the finest elements starting with the highly sought-after open floorplan, pristine hardwood floors throughout, a gourmet kitchen, custom fitted California walk-in closet and is book-ended by terraces and breathtaking views. The expansive Main Bedroom Suite features beautiful hardwood floors, LED lighting, custom sconces, large walk-in his\/her California Closet, and a terrace just off the main sleeping area. The Main Bathroom Suite features a tiled shower with angular body sprays & glass doors, a full-length mirror, LED lighting & sconces over the vanity, granite countertops, a tiled vanity wall, and decorative basket weave floor tile. Bedroom #2 is presently being used as a guest room and office space with great natural light and amazing water views with access to a terrace to step away from work for an outdoor breather or just to take in the beautiful days or starlit nights. Bedroom #3 is large in scale, has hardwood floors, large windows overlooking the city, window seating with excellent natural light, and custom overhead lighting, and is just across the hall from full bathroom #2 which also houses a brand new stackable full-sized washer and dryer. The guest Powder Room does not disappoint with its modern design featuring a glass bowl sink, sleek vanity, and decorative tile flooring. The gourmet kitchen features granite counters, marble subway backsplash, under-cabinet lighting, a bar nook, wine rack, brand new sto,ve and a private terrace. The Main Living area is the true definition of a free-flowing, open-floor concept. With continued uniformed hardwood flooring, the combo living area features an in-wall electric fireplace, crown molding with cove lighting, overhead LED lighting, window seating and breathtaking wrap-around views of the waterfront, PA, NJ and the famous Philadelphia skyline. Exit the main living area via sliding glass doors to a large terrace where you can entertain friends and family with views that cannot be replicated elsewhere in the city. Dockside has 24 hour gated security and concierge plus VISITOR PARKING when you need it, a totally renovated clubroom with full kitchen and seating for personal use (can be rented for an event) or to just to change up your scenery. The indoor pool and hot tub is a dream, not to mention the state of the art gym and wrap around outdoor patio with tables and chairs that overlook the water and Center City. With three elevators, dedicated bike room storage, separate owners' storage, shuttle service and walkable to everything waterfront including Spruce Street Harbour Park, Liberty Pointe, Bluecross Riverrink, Independence Seaport Museum, the Chart House, Moshulu, Zahav, Old City, Society Hill and much more you will love city living at its finest. You will also appreciate being close to all major highways and bridges to get in and out of the city and to NJ as well as Philadelphia International Airport. Set up a private tour today.\n717 S Columbus Blvd #1201","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2.5Ba', '1907ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T08:10:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545859771.html","post_id":7545859771,"result_date":"2022-10-15T12:34:23.000Z","title":"Spacious 1 Bed Apt in a Landmark Building With a Newly Renovated Lobby","description":"ONE MONTH FREE SPECIAL FOR APPLICATIONS SUBMITTED BY 9\/30!!! $500 Security Deposit and 1st Month's Rent to move-in!! Spacious 1 Bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block away from Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit.\n1411 Walnut St #206","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T08:17:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545861858.html","post_id":7545861858,"result_date":"2022-10-15T12:31:23.000Z","title":"Experience city living in this charming & sun-filled Townhome","description":"Available Now for rent in Queen Village. Experience city living in this charming & sun-filled Townhome located in Queen Village featuring 3 bedrooms & 1 1\/2 bathrooms. Arrive home to an open floor plan ideal for entertaining family & friends. You will be delighted with the open floor plan for the living room and dining, recessed lighting & hardwood floors on the first & second floor. The beautiful eat-in kitchen is equipped with Refrigerator, Microwave Oven, Range, Hood & Dishwasher with plenty of cabinetry for storage & countertops for creating your culinary delights. Added bonus of first floor 1\/2 bathroom. Access provided to the spacious rear yard from the kitchen. The patio is a wonderful space for grilling and relaxing. The first floor is graced with original hardwood flooring and the second floor of the home is naturally filled with sunlight. Second floor features 3 spacious bedrooms plus 1 full bathroom. The bathroom is beautifully updated & offers a tub\/shower combination and vanity. Access to the basement provides plenty of storage. There is a laundry which includes washer and dryer. The home was recently renovated in the last 2 years and offers newer plumbing, electric, HVAC to include Central Air Conditioning. Prime location in desirable Queen Village neighborhood. Daily errands do not require a car as this is a walker’s paradise. With an amazing Walk Score of 98, Transit Score of 70 & Bike Score of 81. You will enjoy living in this home & will appreciate all of amenities that that neighborhood has to offer. Just moments to Meredith, venture to nearby Shots Tower coffee, Weccacoe playground, Mario Lanza park, restaurants along E Passyunk Ave & South St Super easy access to Delaware Ave, Old City, Ben Franklin Bridge & I-95. Easy access to nearby shopping; Target, Home Depot, TJ Maxx & Home Goods, Acme Market all along Delaware Ave. First month rent, last month rent and security deposit is required. Tenant is responsible for all utilities.\n511 Christian St","num_images":6,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1.5Ba', '1272ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T08:27:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545859334.html","post_id":7545859334,"result_date":"2022-10-15T12:31:18.000Z","title":"$500 security deposit to move-in!!! 1 Bed 1 bath","description":"1\/2 MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!! Just 1st month's rent and $500 security deposit to move-in!!! 1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. Hardwood floors in the living area and the bedroom is carpeted. The Warehouse Property is located in a highly walkable area with access to all forms of public transportation. Secured entry, gated property, gym\/fitness center and on-site parking- add'l $200 mo. with full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a similar unit.\n9-1 N 9th St #608","num_images":6,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '635ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T08:15:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545860952.html","post_id":7545860952,"result_date":"2022-10-15T12:27:07.000Z","title":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!!!!!!!!","description":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!!!!!!!! LET the SUNSETS be your permanent back drop!!!!!!!!! This ONE BEDROOM residence, at FRANKLIN TOWER, located at 16TH and RACE STREET is a must see!!! All open and spacious living and dining area, kitchen with STAINLESS steel appliances, breakfast bar, and CUSTOM cabinetry. The Bedroom is VERY spacious, with an all tile EUROPEAN style bathroom. There is nothing like FRANKLIN TOWER apartments, in all of Philadelphia!!! With amenities on EVERY FLOOR, Peloton Rooms, Yoga studios, Screening Rooms, Game Rooms, Lounges, and Gyms, as well as the ROOF TOP LOUNGE , with flat screen, grills, and fire place. A BASKETBALL COURT, and GARAGE PARKING. Parking available for additional cost. Photo's are of model unit.\n200 N 16th St #503","num_images":5,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '656ft2', 'available jan 14, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T08:23:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545857999.html","post_id":7545857999,"result_date":"2022-10-15T12:26:56.000Z","title":"One-of-a-kind Dramatic Sun-filled Home With Towering Ceilings","description":"One-of-a-kind dramatic sun-filled home with towering ceilings, exposed brick and covered garage parking on a virtually hidden block in the historic Society Hill section of Philadelphia. This home features three levels of living with a massive living room, half bath, dining room and full kitchen conveniently located on the first floor. Following the exposed brick and sun drenched stairs up to the second level opens you to your first two bedrooms, laundry, and first full bathroom. Your master is revealed to you after a long private corridor greeting you with his and hers full bathroom with walk-in closet and tremendous shower room. The third floor features a romantic full floor fourth bedroom option with exposed beams and unprecedented privacy. Those of you who enjoy walkability, shops and a nightlife you can leave at the club will love the accessibility this home offers. Being footsteps away from some of the best restaurants, cafes and farmers markets this home allows you to enjoy the finer things the city has to offer. Highlights of the neighborhood include, The Twisted Tail, Bloomsday Café, Bistro Romano. In the mood for something else? Cherry street pier, Spruce Street Harbor park and Liberty point are only a 15 minute walk. Experience 114 Naudain in person and set up your tour today! Unit is part of an HOA which is included in monthly rent.\n114-18 Naudain St #G\n","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['4BR \/ 3.5Ba', '1973ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T08:07:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545858895.html","post_id":7545858895,"result_date":"2022-10-15T12:16:48.000Z","title":"$1000 MOVE-IN CREDIT ON ALL VACANT UNITS!!!","description":"$1000 MOVE-IN CREDIT ON ALL VACANT UNITS!!! $500 security deposit for a limited time!!! 1600 Walnut is surrounded by the performing arts and numerous other cultural venues. One of the best values in Center City. Secure entry, Gym, Bike room! Bright and sunny units with hardwood floors, large windows, marble baths and open layouts with great closet space. Known for its popular restaurants and nightlife spots, Just steps away from some of Philadelphia's best culinary experiences Midtown Philadelphia is a fun and exciting place to live. Pictures are of a similar unit.\n1600-1 Walnut St #1104","num_images":6,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T08:12:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545854275.html","post_id":7545854275,"result_date":"2022-10-15T12:11:59.000Z","title":"Perfect Location the building represents the best in Rittenhouse Squar","description":"Available for lease starting December 1st! All utilities included in the rent!! This condominium features granite counter tops and parquet floors, Large closet space, The Dorchester building is right on the square in the heart of center city. The location is perfect, The building represents the finest of Rittenhouse Square. The Dorchester provides exceptional services and amenities professional doorman, all utilities and basic cable TV. There is parking under the building which belongs to the phila parking authority, rooftop pool, and fitness room available for additional reasonable fees. Looking for a tenant to move in starting after November 30th. One year lease available. Rent spree application is $42. Move in fee of $425. is required by tenant at move in.\n224-30 W Rittenhouse Sq #803","num_images":6,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '583ft2', 'available dec 1', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T07:44:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545857473.html","post_id":7545857473,"result_date":"2022-10-15T12:08:58.000Z","title":"ONE MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!!","description":"ONE MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!! Just 1st month's rent and $500 security deposit to move-in!!! 2bed \/ 2bath unit with balcony! This splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. The Warehouse is located in a highly walkable area with access to all forms of public transportation. Amenities include secured entry and controlled building access, on-site parking (additional $150\/month), full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a similar unit in the building!\n9-1 N 9th St #510","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '994ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T08:04:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545857041.html","post_id":7545857041,"result_date":"2022-10-15T12:06:35.000Z","title":"Gorgeous, 2-bedroom Condo in Queen Village!!","description":"Available Now! A fantastic opportunity to rent a gorgeous, 2-bedroom condo in Queen Village. With hardwood floors, exposed brick, full laundry, gas cooking, air conditioning, and outdoor space—this unit has it all! Enter into the hallway of the building and then through the door of the unit to an open living room\/dining area featuring beautiful custom lighting & exposed brick. A large galley kitchen features a gas range and lots of storage. The long hallway leads to a full bath, a bright 2nd bedroom with full-sized laundry, and a master bedroom with a large closet. This unit has a private patio area that leads to the intimate, shared gated courtyard. Added features: Outside bike storage, extra storage in the basement and easy trash\/recycle area. Note: Photos are from a previous listing. The unit is vacant and ready for occupancy!\n213 Christian St #A","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '780ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T08:02:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545852157.html","post_id":7545852157,"result_date":"2022-10-15T11:58:32.000Z","title":"Great value in Fairmount! A tree-lined block in the heart of Fairmount","description":"Great value in Fairmount!! A tree-lined block in the heart of Fairmount acts as the idyllic foreground to 1707 Wallace St #2R. This updated 2 bed, 1.5 bath bi-level apartment sits on the top two floors of a 4-unit building. The exterior of the building features a classic red brick facade and detailed cornice trim. Inside the unit, you're greeted by a bright and open living room and dining area with soaring 9ft ceilings, tall windows, and beautiful hardwood floors. There's also a huge storage closet and a powder room. The home's kitchen is fitted with tons of cabinetry space, stainless steel appliances, including a dishwasher, and the in-unit laundry closet. The home's second level has a spacious bedroom, with great closet space, at the front. A full bathroom and another bedroom, ideal for an office or nursery, complete this level. 1707 Wallace St's central Fairmount location is a walker's paradise, earning a WalkScore of 92. The Philadelphia Museum of Art, Kelly Drive, and The Community College of Philadelphia are all within walking distance. Nearby Fairmount Ave and North Broad Street are lined with local shops, gyms, and restaurants, including Bar Hygge, Rybread cafe, SOUTH, and Osteria. Whole Foods, Target, and Wine & Spirits are also close by. Plus, there's easy access to public transportation, I-76, Drexel University, and The University of Penn. Schedule your in-person or virtual tour today!\n1707 Wallace St #2R","num_images":5,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1.5Ba', '990ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T07:30:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545853608.html","post_id":7545853608,"result_date":"2022-10-15T11:57:28.000Z","title":"Welcome home! Located in Bella Vista","description":"Welcome home! Located in Bella Vista in the much sought after Meredith catchment this 2 bedroom home is snuggled inside a private gated courtyard directly across from the neighborhood favorite Cianfrani Park. As you enter into the spacious living area accented by beautiful hardwood flooring and the first of two fireplaces you're enveloped with the warm feeling of love that has filled this home. Flowing off the living room of this expanded trinity, the full eat in kitchen is contemporarily designed with a subway tiled back splash, granite countertops, a brightly lit skylight shining down from the second floor, and a unique cut out above the sink allowing for the open flow feel of this wonderful living space. The second floor features the first of two bedrooms continuing with the hardwood flow throughout, your full bathroom bright with light from your second skylight, and the perfect hallway nook accented by that same skylight that shines all the way down to the kitchen. The master bedroom on the third floor features the second fireplace as well as a lighter hard wood finish that seems to draw in all of the natural light. This along with the high slanting ceiling give this room a very open airy feel making it a truly \"feel good\" space. Off of the master you will find the crown of this jewel of a home in a roof deck perfect for relaxing and enjoying all of the wonderful changing seasons our city has to offer. Take advantage of this amazing opportunity to be a part of a community that truly cares for each other in a home that will truly care for you.\n725-727 Pemberton St #6","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '858ft2', 'available nov 1', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T07:40:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545852521.html","post_id":7545852521,"result_date":"2022-10-15T11:57:14.000Z","title":"Amazing 2 Bed 2 full bath home located on Bella Vista!","description":"Amazing 2 bedroom 2 full bathroom home located on a quiet side street in Bella Vista! Enter into the living room with south-facing windows, exposed brick, and hardwood flooring throughout the home. The kitchen features stainless steel appliances, a hidden dishwasher, tons of useful counter space, a farmhouse sink, glass door leading to a private backyard. Upstairs you will find a large bedroom with a nice-sized closet with south-facing windows. You will also find a full bath with a tub on the second floor. There is also an open space that can be used as a bedroom, office, or flex space. This leads to a great deck overlooking the private backyard. The basement is fully finished and has great ceiling height. There is a full bathroom and laundry in the basement as well as an unfinished portion that is great for storage!\n1013 Salter St","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1.5Ba', '840ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T07:33:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545854854.html","post_id":7545854854,"result_date":"2022-10-15T11:52:55.000Z","title":"ONE MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!!","description":"ONE MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!! JUST $500 SECURITY DEPOSIT AND 1ST MONTH RENT TO MOVE-IN!!! Urban charm and spacious floor plans! This 2 bedroom unit is spacious and priced right! Located just one block from scenic Washington Square Park, our properties along Spruce Street are the perfect place to call home. These affordably priced properties are located close to shopping, dining, and entertainment venues, as well as all forms of public transportation. Hardwood flooring Exposed brick walls Living room Master bath Some units with decorative fireplaces. Dishwasher, A\/C, Microwave, and Laundry on site. Pictures are of the actual unit. Parking on-site available at 225.00 a month (waitlist). The 2nd bedroom is an open loft.\n727 Spruce St #3F","num_images":5,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '905ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T07:48:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545854558.html","post_id":7545854558,"result_date":"2022-10-15T11:50:46.000Z","title":"Bright and sunny apartment with a Fully Enclosed Bedroom","description":"Bright and sunny apartment with a Fully Enclosed Bedroom and Oversized Windows located in the heart of the historic Old City! 315 Flats is an Elevator Building with a welcoming lobby featuring Marble Floors and an Intercom\/Camera system for Additional Security. Upon entering unit 301, you're greeted by 10-foot ceilings and South-Facing Oversized Windows filling the living space with natural light. The kitchen features Stainless Steel Appliances, a built-in Microwave and Dishwasher, Granite Countertops, Modern Cabinetry, and an Island overlooking the living area. Hardwood Floors are throughout the living space and bedroom. The living room\/dining room combo offers views of The historic Quaker Meeting House and plenty of room for entertaining. The Bathroom includes a Double Sink, a Tub\/Shower combo, and Tiled floors. The in-unit Washer & Dryer are conveniently located in a dedicated closet. The 10-foot Ceilings and Oversized Windows continue in the spacious bedroom, which includes a Walk-In Closet and a modern shelving unit for additional storage. 315 Flats is situated in the heart of the neighborhood and steps from excellent restaurants, shops, Spruce Harbor Park, Independence Hall, Philadelphia's most historic sites, and all that Old City offers. Easy access to I-95, the Vine Street Expressway, and Ben Franklin Bridge. Schedule a private tour today! Garage parking options are located right around the corner.\n315 Arch St #301","num_images":5,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '777ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T07:46:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545851307.html","post_id":7545851307,"result_date":"2022-10-15T11:48:02.000Z","title":"Gorgeous bi-level condominium in Center City! The home features a cont","description":"Gorgeous bi-level condominium in Center City! The home features a contemporary eat-in kitchen (granite countertops, stainless steel appliances) on the main level, along with a bedroom and full bathroom. Downstairs, you'll find the living room, as well as another bedroom and a full bathroom with a tub. Enjoy central air, in-unit laundry, walk-in closets, a dishwasher, and hardwood floors throughout. The south-facing windows provide lots of light. Short walk to Rittenhouse Square, Broad Street Subway, and dozens of restaurants\/shops.\n1343 Lombard St #A","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '982ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T07:24:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545853852.html","post_id":7545853852,"result_date":"2022-10-15T11:46:14.000Z","title":"This 1 bed, 1 bath condo WITH PRIVATE ROOF DECK","description":"Available for move-in early November - This 1 bed, 1 bath condo WITH PRIVATE ROOF DECK and shared rear yard is waiting for you!!! Old world charm mixed with new modern finishes! Best lay-out in the building with 15 ft. high ceilings creating a spacious living area. Hardwood flooring through-out. Eat-in kitchen featuring quartz tops and stainless steel appliances. Large bedroom with large closet & custom storage space. Building features a private roof deck designated to the unit with unobstructed center city skyline views, a shared back yard on ground level and large storage closet in the basement included! ! Fantastic location - walking distance to center city, local restaurants and night life. Easy street parking. Residential quiet block but still close to the action! (note: bedroom color is now neutral - not blue!)\n729 S 12th St #200","num_images":7,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '529ft2', 'available nov 5', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T07:42:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545853132.html","post_id":7545853132,"result_date":"2022-10-15T11:41:35.000Z","title":"This Spacious Bi-level Apartment Incredible Location!","description":"This spacious bi-level apartment checks all of the boxes... hardwood floors, central heat\/AC, gas cooking, dishwasher, in-unit laundry, outdoor space, and an incredible location! In fact, this location has a Walk Score of 98, surrounded by some of the city's best coffee shops\/brunch spots (Shot Tower Coffee, Fitzwater Cafe, etc) and neighborhood favorites new and old such as Fitz on 4th, Saloon Restaurant, & Little Fish. Inside the apartment you'll enjoy the top two floors (2nd\/3rd) of the building, so no one living above you. The massive living room with exposed brick walls, 1\/2 bathroom, laundry, and kitchen\/dining area are all located on the 2nd floor. Off of the kitchen\/dining room you can enjoy the first of two decks, convenient for grilling and outdoor dining. On the top floor there is a full bathroom and 3 spacious bedrooms, all with full closets. The rear bedroom also has a sliding door which leads out to your 2nd private deck. Property is vacant and can be scheduled on short notice!\n762 S 5th St","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1.5Ba', '1408ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T07:37:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545852836.html","post_id":7545852836,"result_date":"2022-10-15T11:39:22.000Z","title":"Large 2 Bedroom 2 Bathroom Apartment Right by the Philadelphia","description":"IMAGES ARE OF ANOTHER UNIT IN THE SAME BUILDING UNIT ITSELF HAS A DIFFERENT LAYOUT. Large 2 bedroom 2 bathroom apartment right by the Philadelphia Rail Park. Unit is available at the beginning of August 2021. 1 Year Lease terms, $45 application fee. A minimum credit score of 620 is required or have a co-signer. If you have further questions, please feel free to contact me and I will do my best to answer them.\n439-47 N 13th St #1A","num_images":6,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '11700ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T07:35:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545851881.html","post_id":7545851881,"result_date":"2022-10-15T11:32:36.000Z","title":"Gorgeous bi-level condominium in Center City!","description":"Gorgeous bi-level condominium in Center City! The home features a contemporary eat-in kitchen (granite countertops, stainless steel appliances) on the main level, along with a bedroom and full bathroom. Downstairs, you'll find the living room, as well as another bedroom and a full bathroom with a tub. Enjoy central air, in-unit laundry, walk-in closets, a dishwasher, and hardwood floors throughout. The south-facing windows provide lots of light. Short walk to Rittenhouse Square, Broad Street Subway, and dozens of restaurants\/shops.\n1343 Lombard St #A","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '982ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T07:28:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545851639.html","post_id":7545851639,"result_date":"2022-10-15T11:30:44.000Z","title":"Bi-level 1-bed Apt in the Spring Garden Section of Philadelphia","description":"Live at 1504 Green St unit #1F, a bi-level 1-bedroom apartment in the Spring Garden section of Philadelphia. This home features a modern and updated living space with a large window, an island kitchen with stainless steel appliances and private access to a small balcony area, and a spacious lower level bedroom with a huge closet and en suite bathroom. This apartment is a couple of blocks from the new Giant, Retro Fitness, BSL Station, and plenty more.\n1504 Green St #1F","num_images":5,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '900ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T07:26:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545846510.html","post_id":7545846510,"result_date":"2022-10-15T11:05:13.000Z","title":"Apartment in UCity","description":"3 bedroom\/1 bath apartment available in UCity. Close to public transportation. Serious inquiries only. Thanks in advance!","num_images":0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T06:37:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545846015.html","post_id":7545846015,"result_date":"2022-10-15T10:34:36.000Z","title":"Large 3 bedroom and 1.5 bath home located in Lawncrest!","description":"Large 3 bedroom and 1.5 bath home located in Lawncrest!\nProperty Address\n994 Anchor Street | Philadelphia, PA 19124\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Updated Home!⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 1.5 bath.\n✔️Updated Kitchen w\/ newer appliances!\n✔️Spacious Kitchen\n✔️Beautiful laminate flooring throughout\n✔️Parking in rear of the property\n✔️Open layout, plenty of closet space.\n✔️Finished Basement\n✔️CLOSE TO PUBLIC TRANSPORTATION!\n✔️EASY ACCESS TO MAJOR ROUTES!\n✔️Close to shopping\n✔️Short walk to SEPTA\n✔️This property won't last long, inquire now!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant pays own Utilities\n*** Build your credit! We report rent payments to Experian! ***\n**** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING **** You must make an appointment by completing this form https:\/\/redblockrentals.com\/showing\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\ntags: 3 bedrooms, three, basement, bd, finished basement, powder room, redblock realty inc, red block, house, North East, Oxford, Castor, Lawncrest, Route 1, Roosevelt Blvd, Naval Support Activity Philadelphia, Benjamin Franklin School, Samuel Fels High School, Northeast Tower Center, Adams Ave, Friends Hospital, Frankford, NE, Walmart,  OXFORD CIRCLE\/ CASTOR, LAWNCREST, 19124, 19149, 19152, 19111, 19149\n\nDetails\nBeds\/Baths: 3BD\/1.5BA\nSquare Feet: 1,200\nRental Terms\nRent: $1,600.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,400.00\n\nPet Policy\nCats allowed\nDogs allowed\n#nata\n","num_images":15,"lat":40.032661,"lng":-75.087136,"attrs":"['3BR \/ 1.5Ba', '1200ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T06:30:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545845736.html","post_id":7545845736,"result_date":"2022-10-15T10:31:37.000Z","title":"RECENTLY UPDATED, 3 BD \/ 3 BA HOME LOCATED IN NORTHEAST PHILLY!!!","description":"⭐⭐⭐ RECENTLY UPDATED, 3 BEDROOMS AND 3 BATH HOME LOCATED IN NORTHEAST PHILLY!!! ⭐⭐⭐\nProperty Address\n9331 Neil Road | Unit A | Philadelphia, PA 19115\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ COMPLETELY UPDATED\n✔️ LARGE 3 BEDROOM AND 3 BATHS HOME LOCATED IN NORTH EAST!!!\n✔️ SPACIOUS BEDROOMS!!!\n✔️ LARGE CLOSETS!!!\n✔️ LARGE LIVING ROOM\n✔️ BRAND NEW KITCHEN WITH NEW APPLIANCES\n✔️ LAUNDRY HOOK-UP\n✔️ DRIVEWAY FOR PARKING\n✔️ CENTRAL AIR!!!\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nVIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=v2aX8Q4NGN5\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in. (1 months rent and 2 months security)\n- The tenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\n\nDetails\nBeds\/Baths: 3BD\/3.0BA\nSquare Feet: 1,500\nRental Terms\nRent: $2,500.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $5,000.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":16,"lat":40.084822,"lng":-75.042885,"attrs":"['3BR \/ 3Ba', '1500ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T06:27:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545845502.html","post_id":7545845502,"result_date":"2022-10-15T10:28:35.000Z","title":"UPDATED 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WEST OAK LANE!!!","description":"⭐⭐⭐ UPDATED 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WEST OAK LANE! ⭐⭐⭐\nProperty Address\n6641 Ogontz Ave | Philadelphia, PA 19126\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WEST OAK LANE!\n✔️ SPACIOUS EAT-IN-KITCHEN\n✔️ THE KITCHEN HAS TILED FLOORING FOR EASY CLEANING\n✔️ LAMINATE\/PARQUET FLOORING THROUGHOUT THE REST OF THE APARTMENT\n✔️ CEILING FANS IN EVERY BEDROOM\n✔️ CABLE READY\n✔️ LOTS OF NATURAL LIGHT\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO PUBLIC TRANSPORTATION\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY COMMUTE TO AND FROM THE CITY\n✔️ SHORT COMMUTE TO BOTH GRATZ AND LA SALLE UNIVERSITY\n✔️ SHORT DISTANCE FROM EINSTEIN HOSPITAL\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nVIRTUAL TOUR:  https:\/\/my.matterport.com\/show\/?m=JD3cEwYhHw8\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant is responsible for the electric, gas, and water fee\nBuild your credit! We report rent payments to Experian!\n***Please apply online at: https:\/\/redblock.com\/apartment\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 850\nRental Terms\nRent: $1,100.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,200.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":6,"lat":40.055289,"lng":-75.149612,"attrs":"['2BR \/ 1Ba', '850ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T06:24:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545845262.html","post_id":7545845262,"result_date":"2022-10-15T10:25:50.000Z","title":"UPDATED 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WEST OAK LANE!","description":"⭐⭐⭐ UPDATED 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WEST OAK LANE! ⭐⭐⭐\nProperty Address\n6630 Ogontz Ave | Philadelphia, PA 19126\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WEST OAK LANE!\n✔️ SPACIOUS EAT-IN-KITCHEN W\/ A PANTRY CLOSET\n✔️ THE KITCHEN HAS TILED FLOORING FOR EASY CLEANING\n✔️ LAMINATE\/PARQUET FLOORING THROUGHOUT THE REST OF THE APARTMENT\n✔️ CEILING FANS IN EVERY BEDROOM\n✔️ CABLE READY\n✔️ LOTS OF NATURAL LIGHT\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO PUBLIC TRANSPORTATION\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY COMMUTE TO AND FROM THE CITY\n✔️ SHORT COMMUTE TO BOTH GRATZ AND LA SALLE UNIVERSITY\n✔️ SHORT DISTANCE FROM EINSTEIN HOSPITAL\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant is responsible for the electric, gas, and water fee\nBuild your credit! We report rent payments to Experian!\n***Please apply online at: https:\/\/redblock.com\/apartment\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 750\nRental Terms\nRent: $1,100.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,200.00\n\nPet Policy\nCats allowed\nDogs not allowed\n#nata\n","num_images":8,"lat":40.055129,"lng":-75.149636,"attrs":"['2BR \/ 1Ba', '750ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T06:21:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545844880.html","post_id":7545844880,"result_date":"2022-10-15T10:21:01.000Z","title":"2BR\/1BA near DREXEL, PENN, and ART MUSEUM | Located in UNIVERSITY CITY","description":"2BR\/1BATH near DREXEL, PENN, and ART MUSEUM | Located in UNIVERSITY CITY!\nProperty Address\n613 N 32nd St | Philadelphia, PA 19104\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ BEST VALUE APARTMENT ⭐⭐⭐⭐⭐\n✔️ LARGE 2 BEDROOMS AND 1 BATH LOCATED IN UNIVERSITY CITY\n✔️ WALKING DISTANCE FROM THE ART MUSEUM\n✔️ 2ND-FLOOR WALK-UP\n✔️ LARGE LIVING ROOM\n✔️ SPACIOUS BEDROOMS\n✔️ HIGH CEILINGS\n✔️ CEILING FANS\n✔️ LAMINATED FLOORING\n✔️ CABLE READY\n✔️ CITY LIVING WITH A SUBURBAN FEEL\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for electric, gas, and water\nBuild your credit! We report rent payments to Experian!\nTO SCHEDULE A SHOWING:\n⭐⭐⭐ https:\/\/redblock.com\/apartment\/⭐⭐⭐\n**** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING **** You must make an appointment by completing this form https:\/\/redblock.com\/properties-for-rent\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: Drexel, UPENN, Penn, Powelton, University City, campus, art museum, clean, renovated, hardwood, center city, West Philly, west Philadelphia, redblock realty inc, redblock, red block, center city,2 bedrooms, two-bedrooms, 2BD, two BD, bedroom, septa, high ceilings, clean, spacious, close to center city, septa, transportation, easy commute\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 900\nRental Terms\nRent: $1,300.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,600.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":10,"lat":39.964772,"lng":-75.188784,"attrs":"['2BR \/ 1Ba', '900ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T06:17:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545844681.html","post_id":7545844681,"result_date":"2022-10-15T10:18:23.000Z","title":"SPACIOUS 2 BD & 1 BA APT W\/BACKYARD LOCATED IN UNIVERSITY CITY!","description":"AMAZING VALUE! SPACIOUS 2 BEDROOMS & 1 BATH APARTMENT W\/BACKYARD LOCATED IN UNIVERSITY CITY!\nProperty Address\n613 N 32nd St | Philadelphia, PA 19104\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ BEST VALUE APARTMENT!\n✔️ JUST A MILE AWAY FROM THE ART MUSEUM AT 1\/2 THE PRICE!\n✔️ SPACIOUS 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN UNIVERSITY CITY!\n✔️ 1ST- FLOOR APARTMENT IN A TRIPLEX\n✔️ EAT-IN KITCHEN\n✔️ OPEN KITCHEN\/LIVING ROOM LAYOUT\n✔️ LOTS OF NATURAL LIGHT\n✔️ LAMINATE FLOORING\n✔️ HIGH CEILINGS\n✔️ DESIGNER COLORS\n✔️ SPACIOUS BEDROOMS\n✔️ CEILING FANS\n✔️ CENTRAL AIR\/HEAT\n✔️ SPACIOUS BACKYARD\n✔️ CLOSE COMMUTE TO CENTER CITY\n✔️ CLOSE TO DREXEL, PENN, HUP, CHOP, USP\n✔️ EASY ACCESS TO SEPTA, MAJOR ROUTES I-95,  I-76, I-676\nLink to Virtual Tour:  https:\/\/my.matterport.com\/show\/?m=SdacbFAGf9M\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant is responsible for electric, gas, and water fee\nBuild your credit! We report rent payments to Experian!\n***Please apply online at https:\/\/redblock.com\/apartment\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: Drexel, UPENN, Penn, Powelton, University City, campus, art museum, clean, renovated, hardwood, center city, west Philly, west Philadelphia, redblock realty inc, redblock, red block, center city,2 bedroom, two-bedroom, 2BD, two BD, bedroom, septa, high ceilings, clean, spacious, close to center city, septa, transportation, easy commute\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 950\nRental Terms\nRent: $1,100.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,200.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":13,"lat":39.964772,"lng":-75.188784,"attrs":"['2BR \/ 1Ba', '950ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T06:14:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545844129.html","post_id":7545844129,"result_date":"2022-10-15T10:10:31.000Z","title":"Completely Updated 4BR in Oxford Circle \/w finished basement!","description":"Completely Updated 4BR in Oxford Circle \/w finished basement and guestroom\nProperty Address\n6059 Alma Street | Philadelphia, PA 19149\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ COMPLETELY UPDATED\n✔️ LARGE 4 BEDROOM AND 1.5 BATHS HOME LOCATED IN NORTH EAST!!!\n✔️ SPACIOUS BEDROOMS!!!\n✔️ LARGE CLOSETS!!!\n✔️ FORMAL DINING ROOM\n✔️ FINISHED BASMENT WITH GUEST ROOM\n✔️ LAUNDRY HOOK-UP\n✔️ REAR DRIVEWAY FOR PARKING\n✔️ CENTRAL AIR!!!\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nVIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=cu5G7v8nENH\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in. (1 months rent and 2 months security)\n- The tenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\ntags: northeast Philadelphia, Oxford Circle, Naval Support, SEPTA, renovated, three bedroom, 4BR, basement, castor, lawncrest, cottman, frankford, mayfair\n\nDetails\nBeds\/Baths: 4BD\/1.5BA\nSquare Feet: 1,300\nRental Terms\nRent: $1,800.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,600.00\n\n#nata\n","num_images":12,"lat":40.035646,"lng":-75.082254,"attrs":"['4BR \/ 1.5Ba', '1300ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T06:06:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545843930.html","post_id":7545843930,"result_date":"2022-10-15T10:07:27.000Z","title":"SPACIOUS 1 BEDROOM & 1 BATH LOCATED IN POWELTON VILLAGE!","description":"SPACIOUS 1 BEDROOM & 1 BATH LOCATED IN POWELTON VILLAGE! SHORT DISTANCE TO PENN & DREXEL!\nProperty Address\n524 N Preston St | Philadelphia, PA 19104\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️POWELTON VILLAGE!\n✔️BEST VALUE APARTMENT ⭐⭐⭐⭐⭐\n✔️Large 1 BEDROOM!!!!\n✔️Spacious living room\n✔️Updated kitchen, bath, floors, windows, and appliances!\n✔️1st fl Apartment, almost no steps!\n✔️Laminate flooring\n✔️Plenty of closets\n✔️Backyard access\n✔️Walk to Drexel and Penn\n✔️A short ride from USP\n✔️Close to public transportation\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- 3 months rent to move in.\n*** Income requirement of 3 times the rent ***\n*** Build your credit! We report rent payments to Experian! ***\ntags: 1 BD, 1 bedroom, one bath, 1BA, REDBLOCK REALTY INC, University of the Sciences, University of Pennsylvania School of Veterinary Medicine, University of Pennsylvania School of Nursing, Hospital of the University of Pennsylvania, Penn Museum, The Children's Hospital of Philadelphia, Drexel University, West Philadelphia High School, Cedar Park, University City, Center City, Springfield Ave, Squirrel Hill, Walnut Hill, Spruce Hill, Saunders Park, UPENN, PENN, Va Hospital: Schaefer William J, 19143, 19104, 19121, 19139, 19142, 19145, 19146, 19103, 19130, 19151\n\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 675\nRental Terms\nRent: $950.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,900.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":8,"lat":39.961814,"lng":-75.20388,"attrs":"['1BR \/ 1Ba', '675ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T06:03:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545842521.html","post_id":7545842521,"result_date":"2022-10-15T10:03:03.000Z","title":"Welcome to our 2 Bedroom 2 Bathroom Beautiful Philadelphia Home.","description":"Welcome to our 2 Bedroom 2 Bathroom Beautiful Philadelphia Home. Please note this home is available on a monthly basis from October through May each year. It is rented out on a weekly basis during the summer. Please inquire with your interest in either monthly or weekly options. Typical rental rate is $200 week in the summer, and $800\/month in the off-season\nThe House comes completely furnished and the kitchen is fully equipped and laundry machines are provided. please text::  show contact info\nWhile the living space is clean and fully functional the outdoor space is what sets this home apart. There are both front and rear decks\/patios with several \"nooks\" for casual seating around the beautifully landscaped property. You can enjoy an unobstructed view of the beach and beautiful sunsets from either the covered patio or the Adirondack chairs along the break-wall. There are two grills; one is charcoal and the other is propane (renters bring their own tank). Ask anything at:  show contact info","num_images":1,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T05:40:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545843622.html","post_id":7545843622,"result_date":"2022-10-15T10:02:44.000Z","title":"LARGE 4 BEDROOMS AND 1 BATH HOME LOCATED IN OAKLANE!","description":"LARGE 4 BEDROOMS AND 1 BATH HOME LOCATED IN OAKLANE!\nProperty Address\n5031 N Marvine st | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED LARGE 4-BEDROOM HOUSE! ⭐⭐⭐⭐⭐\n✔️ LARGE KITCHEN\n✔️ RESTORED PARQUET FLOORING\n✔️ CUSTOM WOOD-TRIMMED LIVINGROOM\n✔️ CENTRAL HEATING\n✔️ OPEN LAYOUT\n✔️ LOTS OF CLOSET SPACE\n✔️ LARGE BASEMENT FOR STORAGE\n✔️ WASHER\/DRYER HOOK-UP\n✔️ BACKYARD\n✔️ SPACIOUS FRONT PATIO\n✔️ CLOSE TO SHOPPING\n✔️ SHORT WALK TO SEPTA\n✔️ EASY ACCESS TO MAJOR ROUTES\n✔️ EASY COMMUTE TO AND FROM THE CITY\n✔️ THIS PROPERTY WON'T LAST LONG, INQUIRE NOW!\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in.\n- Tenant pays for electricity, gas, and a water\n***VIDEO TOUR: https:\/\/my.matterport.com\/show\/?m=tvyEEWtMt7i\n*** Build your credit! We report rent payments to Experian! ***\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: Mt Airy, Germantown, Logan, Olney, Cheltenham, septa, parking, laundry, commuter, Cheltenham, west oak lane, oak lane, La Salle, Redblock, red block, Redblock Realty Inc, four bedrooms, 4br, einstein hospital, college of optometry, 19144, 19141,19126,19138,19119, 19120, Redblock realty, 4BR, 4 bedrooms, La Salle University, Ogontz, Mount Airy, Logan, Germantown, Olney, Route 309, spacious, buses, schools, Philadelphia, Broad Street, Albert Einstein Medical Center, Pennsylvania College of Optometry, SEPTA, commuter, Fern Rock Transportation Center, Gratz College, Philadelphia High School for Girls, Widener Memorial School, Lindley Academy Charter School, Delaware Valley Charter High School, Thurgood Marshall School, Lindley Playground\n\nDetails\nBeds\/Baths: 4BD\/1.0BA\nSquare Feet: 1,700\nRental Terms\nRent: $1,800.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,600.00\n\nPet Policy\nCats allowed\nDogs allowed\n#nata\n","num_images":13,"lat":40.029006,"lng":-75.142233,"attrs":"['4BR \/ 1Ba', '1700ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T05:58:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545843434.html","post_id":7545843434,"result_date":"2022-10-15T09:59:21.000Z","title":"UPDATED 1 BEDROOM AND 1 BATH APT LOCATED IN NORTHEAST\/TACONY AREA!","description":"⭐⭐⭐UPDATED 1 BEDROOM AND 1 BATH APARTMENT LOCATED IN NORTHEAST\/TACONY AREA!⭐⭐⭐\nProperty Address\n4831 Longshore Ave - 1F | Philadelphia, PA 19135\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n✔️ SPACIOUS 1 BEDROOM APARTMENT LOCATED IN TACONY AREA!\n✔️ BEST VALUE APARTMENT ⭐⭐⭐\n✔️ UPDATED KITCHEN W\/ TILES FOR EASY CLEANING\n✔️ KITCHEN IS EQUIPPED W\/ A STOVE, FRIDGE, AND MICROWAVE\n✔️ SPACIOUS LIVING ROOM SPACE\n✔️ LARGE BEDROOM\n✔️ LOCATED ON THE 1ST FL, NO STEPS!\n✔️ OPEN LAYOUT\n✔️ LAMINATE FLOORING THROUGHOUT\n✔️ CLOSE TO PUBLIC TRANSPORTATION\n✔️ EASY ACCESS TO I-95\n✔️ SHORT WALK TO DISSTON PARK\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in.\n- Tenant pays their own utilities plus a water fee.\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING ****\n*** Build your credit! We report rent payments to Experian! ***\nTags: 1BD, 1 bedroom, spacious, luxurious, 1st floor, apartment, private house, Tacony, Wissinoming, Mayfair, Frankford ave, Torresdale, Disston Park, Disston Recreation Center, I-95, highway, Vogt Playground, Delaware Expressway, Lardner's Point Park, Moss Park, Trenton Line, septa, train, commuter, easy access to the city, Franklin Towne Charter High School, REDBLOCK Realty inc, red block, 19135, 19136, 19124, 19149, 19137\nAvailability and pricing is subject to change.  Information Deemed Reliable But Not Guaranteed. All information is subject to errors, omissions, or withdrawal without notice.\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 700\nRental Terms\nRent: $900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,800.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":9,"lat":40.024291,"lng":-75.041996,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T05:55:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545843248.html","post_id":7545843248,"result_date":"2022-10-15T09:56:10.000Z","title":"LARGE FULLY RENOVATED 2 BD & 1 BA LOCATED IN OAKLANE\/LOGAN AREA!","description":"⭐⭐⭐ LARGE FULLY RENOVATED 2 BEDROOMS & 1 BATH LOCATED IN OAKLANE\/LOGAN AREA!!!! ⭐⭐⭐\nProperty Address\n4830 N 12th St - 1F | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT!!!!⭐⭐⭐⭐⭐\n✔️HUGE!!! FULLY RENOVATED 2 BEDROOM AND 1 BATH\n✔️LOCATED ON THE 1ST FL, PROVIDING EASY ACCESS\n✔️BEAUTIFUL NEW KITCHEN WITH ISLAND\n✔️LARGE KITCHEN\/LIVING ROOM AREA!\n✔️NEW FLOORING THROUGHOUT\n✔️TILED KITCHEN\n✔️EVERYTHING IS ELECTRIC\n✔️BRAND NEW STOVE\/FRIDGE\/MICROWAVE\n✔️CABLE READY\n✔️MOVE-IN READY\n✔️LARGE BEDROOMS\n✔️LARGE COMPLETELY RENOVATED CONTEMPORARY BATHROOM\n✔️UNFINISHED BASEMENT PERFECT FOR STORAGE\n✔️WASHER\/DRYER HOOKUP\n✔️REAR YARD\n✔️SHARED FRONT PORCH\n✔️DESIGNER PAINT\n✔️CONVENIENTLY LOCATED\n✔️EASY ACCESS TO SEPTA\n✔️EASY ACCESS TO AND FROM THE CITY\n✔️WILL NOT LAST LONG!!!! INQUIRE TODAY!!!!\nLINK TO VIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=THbFKiM2RFR\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 1100\nRental Terms\nRent: $1400\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs not allowed\nNotic\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nTAGS: 2 bedroom, 2 bd, 1 bath, large apartment, spacious, cozy, Logan, Oak Lane, West Oak Lane, Philly, Philadelphia, Pa, Pennsylvania, house, apartment, septa, Philadelphia County Assistance Office District F Glendale, Logan Library, LOGAN Hope School, Logan Station, Einstein Medical Center Philadelphia Emergency Medicine, Central High School, La Salle University, Widener Memorial School, Fern Rock Transportation Center Station, Community College of Philadelphia - Northwest Regional Center, Eye Institute of Penna College, City Of Philadelphia Office Of Supportive Housing, 19144, 19138, 19126, 19141, 19140, 19120\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 1,100\nRental Terms\nRent: $1,300.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,600.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":10,"lat":40.026118,"lng":-75.143684,"attrs":"['2BR \/ 1Ba', '1100ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T05:52:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545842993.html","post_id":7545842993,"result_date":"2022-10-15T09:52:35.000Z","title":"UPDATED, LARGE, 2 BEDROOMS AND 1 BATH APT LOCATED IN ELMWOOD PARK!","description":"⭐⭐⭐ UPDATED, LARGE, 2 BEDROOMS AND 1 BATH APARTMENT LOCATED IN ELMWOOD PARK!!! ⭐⭐⭐\nProperty Address\n408 N 64th St - 1F | Philadelphia, PA 19151\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ BRAND NEW EVERYTHING! 2 BEDROOMS & 1BATH, LOCATED IN ELMWOOD PARK!\n✔️ NEW!!! KITCHEN W\/ AN ISLAND!\n✔️ NEW!!! CUSTOM BACKSPLASH!\n✔️ NEW!!! GRANITE COUNTERS!\n✔️ NEW!!! STAINLESS STEEL APPLIANCES!\n✔️ NEW!!! HARDWOOD FLOORING!\n✔️ NEW!!! STYLISH DESIGNER PAINT COLOR!\n✔️ NEW!!! ELECTRIC HEATING AND COOKING!\n✔️ NEW!!! STYLISH BATHROOM DESIGN!\n✔️ NEW!!! CUSTOM TILES!\n✔️ NEW!!! SPACIOUS ROOMS!\n✔️ NEW!!! TONS OF CLOSET SPACE!\n✔️ NEW!!! CENTRAL AIR \/ HEAT!\n✔️ NEW!!! SEMI-FINISHED BASEMENT FOR STORAGE!\n✔️ NEW!!! LARGE SHARED DRIVEWAY!\n✔️ CLOSE TO ALL MAJOR ROUTES!\n✔️ EASY COMMUTE TO CENTER CITY!\n✔️ WILL NOT LAST LONG, INQUIRE TODAY!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays their own utilities plus a water fee.\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING ****\n*** Build your credit! We report rent payments to Experian! ***\nTAGS: 2 bedrooms, 2bd, Elmwood park, Connell Park, Bartram Highschool, Thomas G. Morton Elementary school, Lindbergh Blvd, West Philadelphia, South Philadelphia, Center City Philadelphia, Southwest Philadelphia, Darby, Kingsessing,\n\nAmenities\nOff-Street Parking\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 825\nRental Terms\nRent: $1,250.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,500.00\n\nPet Policy\nCats allowed\nDogs not allowed\n#nata\n","num_images":8,"lat":39.969217,"lng":-75.247492,"attrs":"['2BR \/ 1Ba', '825ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T05:48:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545842653.html","post_id":7545842653,"result_date":"2022-10-15T09:46:34.000Z","title":"LARGE 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WYNNEFIELD HEIGHTS!","description":"LARGE 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WYNNEFIELD HEIGHTS!\nProperty Address\n3929 Lankenau Ave - 2F | Philadelphia, PA 19131\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ BEST VALUE APARTMENT!\n✔️ CONVENIENTLY LOCATED, EASY COMMUTE TO CENTER CITY!\n✔️ SPACIOUS 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WYNNEFIELD HEIGHTS!\n✔️ LARGE LIVINGROOM\n✔️ PARQUET FLOORING\n✔️ SPACIOUS BEDROOMS\n✔️ SMALL BALCONY CONNECTED TO THE LIVING ROOM\n✔️ LOTS OF NATURAL LIGHT\n✔️ DESIGNER COLORS\n✔️ SPACIOUS BEDROOMS\n✔️ CEILING FANS\n✔️ CENTRAL AIR\/HEAT\n✔️ LOTS OF CLOSET SPACE\n✔️ BASEMENT ACCESS FOR STORAGE\n✔️ SHARED GARAGE FOR STORAGE\n✔️ CLOSE TO DREXEL, PENN, HUP, CHOP, USP, SJU\n✔️ EASY ACCESS TO SEPTA, MAJOR ROUTES I-95, I-76, I-676\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move-in. (1 months rent and 2 months security)\n- Tenant is responsible for electric, gas, and water fee\nBuild your credit! We report rent payments to Experian!\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\ntags: Redblock realty inc, red, 2bd, 2 bedroom, two, Wordsworth Philadelphia, River Park House, I-95, I-76, River Park House, Wynnefield, 19131 19104,19139,19151,19132,19121,19130,19143,19127,19129,19146,19147,19103,19123,19122,19102,19106, city line ave, Fairmount park, Bala, Saint Joseph's University, Belmont village, Hilton Philadelphia City Avenue, Fairmount Park Athletic Field, City Line, City Line Ave, Saint Joe's, St Joe's, St. Joe's, Temple, La Salle, PCOM, Center City, Jefferson, Hahnemann, Drexel,\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 800\nRental Terms\nRent: $1,100.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,200.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":12,"lat":40.000912,"lng":-75.208412,"attrs":"['2BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T05:42:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545842192.html","post_id":7545842192,"result_date":"2022-10-15T09:38:12.000Z","title":"NEWLY RENOVATED, 2 BEDROOMS & 1 BATH APT LOCATED IN WEST PHILADELPHIA!","description":"⭐⭐⭐ NEWLY RENOVATED, 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WEST PHILADELPHIA!!! ⭐⭐⭐\nProperty Address\n1313 N 53rd St - 2F | Philadelphia, PA 19131\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT!!!!⭐⭐⭐\n✔️SPACIOUS! FULLY RENOVATED 2 BEDROOM & 1 BATH APARTMENT\n✔️BEAUTIFUL NEW KITCHEN WITH GRANITE COUNTERTOP ISLAND\n✔️ALL NEW! LARGE KITCHEN\/LIVING ROOM AREA!\n✔️NEW BAMBOO FLOORING THROUGHOUT\n✔️DESIGNER TILES\/BACKSPLASH\/ GRANITE COUNTERTOP TILED KITCHEN\n✔️EVERYTHING IS ELECTRIC\n✔️BRAND NEW STAINLESS STEEL STOVE\/FRIDGE\/MICROWAVE\n✔️MOVE-IN READY\n✔️LARGE BEDROOMS\n✔️WASHER\/DRYER HOOKUP\n✔️SHARED FRONT PORCH\n✔️DESIGNER PAINT\n✔️EASY ACCESS TO SEPTA\n✔️EASY ACCESS TO AND FROM THE CITY\n✔️WILL NOT LAST LONG! INQUIRE TODAY! REDBLOCK.COM\nVirtual Tour:  https:\/\/my.matterport.com\/show\/?m=aRx33RwBYbe\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 735\nRental Terms\nRent: $1,250.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,500.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":11,"lat":39.973166,"lng":-75.227588,"attrs":"['2BR \/ 1Ba', '735ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T05:34:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545813733.html","post_id":7545813733,"result_date":"2022-10-15T05:07:52.000Z","title":"Dramatic views from this high floor one bedroom unit","description":"Dramatic views from this high floor one bedroom facing south with city and water views. Renovated kitchen and flooring thru-out, open kitchen. Rent includes all utilities - tenant to pay internet and cable totaling $63.98 per month. Parking, seasonal pool and yearly gym\/fitness room available at an extra charge. if interested listing agent will prepare lease .","num_images":16,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '712ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-14T23:47:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545820817.html","post_id":7545820817,"result_date":"2022-10-15T04:42:00.000Z","title":"__ studio apt close to temple university","description":"Studio apartment close to Temple University and BSL. This studio apartment features large bathroom, wooden floors and a shared laundry room with 2 washers and 2 dryers. Water included. Please note: no stove in unit. Previous tenant utilized air fryer and instant pot. Cats allowed with deposit. Available for November move in. Water included. Tenant responsible for electricity\nmust be able to provide references and pass credit check\n","num_images":4,"lat":39.9811,"lng":-75.174,"attrs":"['1BR \/ 1Ba', 'available nov 1', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T00:38:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546083226.html","post_id":7546083226,"result_date":"2022-10-15T21:07:01.000Z","title":"Wow! You'll love this amazing 1 bed 1 bath home in Coatesville","description":"Millview Apartments Bedroom: 1 | Bathroom: 1Square Footage: 845 sq ftMonthly Rent: $1524 - $2057 show contact info\nCommunity Description  Nestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!    Community Amenities❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral BonusesUnit Features❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In Closets  Contact InformationVisit Us: 100 Cobblestone Dr Coatesville, PA 19320 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/   Additional DetailsPet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Lease Terms: VariableManagement Company: Paradise Management, LLC Price is subject to change without prior noticeEQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":12,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T17:03:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546082476.html","post_id":7546082476,"result_date":"2022-10-15T21:05:14.000Z","title":"Ready to lease! Beautifully designed 2 bed 2 bath apartment","description":"Millview ApartmentsVisit Our Community Today!100 Cobblestone Dr Coatesville, PA 19320  show contact info\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort-style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Bedrooms: 2 |  Bathrooms:  2  Square Footage: 1018 sq ft Rental Pricing: $1684 - $2057\/Month  Our Residents Enjoy:  − Business Center− On-Site Leasing Office− Pet-Friendly− Private Garages In Select Units− 24-Hour Emergency Maintenance− Coffee Bar Clubhouse Kitchen− Resident Referral Bonuses This Unit Comes With: − Built-In Microwave− Central Heat & Air Conditioning− Disability Access In Select Units− Dishwasher− Full-Size Washer & Dryer In Every Apartment− Mini Blinds On All Windows− Refrigerator\/Freezer With Ice Maker− Walk-In ClosetsWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ Phone-Number:  show contact info\nPet-Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Lease-Length: VariableCall for Directions  EQUAL HOUSING OPPORTUNITY7252BEBBC7094AC\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1018ft2', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T17:01:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546080984.html","post_id":7546080984,"result_date":"2022-10-15T21:01:21.000Z","title":"Live in style! Gorgeous upgraded 2 Bed \/ 2 Bath! 1178 Sq Ft!","description":"Millview Apartments Visit our community today! 100 Cobblestone Dr Coatesville, PA 19320 show contact info\nUnit Rates:  $1692 - $2282\/month Unit Type: 2-BR 2-BA Unit Size: 1178 sq ftLease Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.What you’ll find in our community: ✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral BonusesDescription: Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.This unit comes with: ✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In ClosetsCall or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Property Management: Paradise Management, LLCEQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":14,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T16:57:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546066348.html","post_id":7546066348,"result_date":"2022-10-15T21:01:07.000Z","title":"Wonderful Sunny 2 bedrooms 1 bath duplex Available ASAP","description":"Available ASAP- Move In Fees on 1-18 month leases! This unique unit is located in the heart of the city in a quiet basement area of the building with only one other neighbor. Unit is an open concept 1 bedroom with murphy bed pull out in the back to maximize space and features ALL utilities included (resident responsible for Wi-Fi). This unit is brand new to market. This property is in a great location; just a walk to downtown features. The unit has natural hardwood floors, built in A\/C unit and good closet space! Gorgeous, Sunny Unit- Just Rehabbed! This 2 bed, 1 bath front unit features modern kitchen with quartz countertops with dishwasher, designer vinyl flooring, large windows for lots of natural light, queen-sized bedrooms, in-unit laundry, Central Heat\/AC, enclosed porch. Step through your new french doors to a back deck\/patio and yard perfect for BBQ’s and weekend gatherings. Just adjacent to the kitchen is a bonus room perfect for a media room, kids playroom, or home office. Cat or small dog (under 50lbs, over two years, breed restrictions). This building, conveniently great restaurants and nightlife are abound- Spinning J. Rent includes heat, water & cooking gas and access to onsite coin-operated laundry. $34 application fee required for each applicant over the age of 18. Minimum credit score of 625, gross monthly income of at least 3x the rent amount, and good landlord referrals are required for application approval. *Meeting these requirements does not guarantee application approval.\nAll M&M properties are smoke free. For more details regarding our application approval criteria, please contact Alayna8232gmail,com\nIt's cozy, quiet, and a friendly living experience!\n","num_images":5,"lat":40.0092,"lng":-75.132,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T16:20:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546070842.html","post_id":7546070842,"result_date":"2022-10-15T20:35:07.000Z","title":"Amazing 1 Bed, 1 Bath with public transit access! 732 Sq Ft!","description":"The Glen at Lafayette Hill555 Andorra Glen Ct Lafayette Hill, PA 19444A wonderful home in Lafayette Hill is waiting for you!We currently have a gorgeous 1 bedroom 1 bathroom renting for $1827 - $2328 per month. This unit comes with 732 - 750 sq ft. Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.-Laundry Room\n-Tub and Stall Shower\n-High Ceilings\n-Breakfast Bar show contact info\nCommunity Highlights:− 24 Hour Availability− Barbecue\/Grill− Cardio Machines− Conference Room− Elevator− Gated, Controlled Access− Multi-Use Room− Online Services− Pet Friendly− Pet Play Area− BBQ Picnic Garden− Billiards, Club Lounge, Cafe Area, Library and Community Room− Fitness Center w\/ Free Weights, Weight Machines− Message Therapist Practice On-site− Outdoor Cafe & Coffee Bar− Outdoor Patio Lounge− Sprinkler System− Storage Space− Wi-Fi at ClubhouseUnit Highlights:− Air Conditioning & Heating− Cable Ready− Carpet− Ceiling Fans (Select Floor Plans)− Dining Room− Heating− Range, Oven, Disposal, Oven− Refrigerator, Freezer and Ice Maker− Tub\/Shower− Wi-Fi− Crown Molding (Select Floor Plans)− Dishwasher− High Speed Internet Access− Linen Closet− Microwave− Storage Units− Tile Floors− Trash Compactor− Walk-In Closets (Select Floor Plans)− Washer\/DryerContact:  show contact info\nWebsite: https:\/\/www.the-glen-apartments.comLeasing Options: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds. Management: Paradise Management, LLC All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITY6833BD3DFB3343EC\n","num_images":22,"lat":40.0896,"lng":-75.2601,"attrs":"['1BR \/ 1Ba', '732ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-15T16:31:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546070325.html","post_id":7546070325,"result_date":"2022-10-15T20:34:02.000Z","title":"Incredible Amenities, Stylish Features, Lease Today","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nLease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\n[#9442799]","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T16:30:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546046335.html","post_id":7546046335,"result_date":"2022-10-15T20:29:18.000Z","title":"cozy and freshly painted 2 br APT for rent","description":"Cozy is a good word for this adorable place to call home! Above an unused garage, this second floor apartment is very convenient and updated. Total of three rooms and a kitchen. Driveway parking. Good closets- Fresh paint and new flooring make it ready for you. First, last, and one month security, possible pet (see agent). Professionally managed. Water is included in rent, tenant pays oil *(tank will be full upon move in) and electric.\nOwner pays water. Tenant pays all other utilities'\n","num_images":7,"lat":40.0612,"lng":-75.3999,"attrs":"['2BR \/ 1Ba', '704ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T15:33:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546053613.html","post_id":7546053613,"result_date":"2022-10-15T19:59:27.000Z","title":"Shop, Eat, Sleep and More at Park Lane!!","description":"Available: 11\/30\/22\nBalmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":11,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-15T15:50:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546052223.html","post_id":7546052223,"result_date":"2022-10-15T19:51:06.000Z","title":"1 bedroom apartment with den","description":"71XX lindbergh Blvd 1 bedroom apartment with den\nOnly $750 Monthly, I'm not finished yet also there will be a senior citizen discount\nWasher and dryer available for use, Garage with remote ( Will be extra )\nfor more info call  show contact info","num_images":5,"lat":39.9055,"lng":-75.2444,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T15:47:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546050781.html","post_id":7546050781,"result_date":"2022-10-15T19:47:47.000Z","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T15:43:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546050559.html","post_id":7546050559,"result_date":"2022-10-15T19:47:16.000Z","title":"Private Balcony, Quiet Community, Move In Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Walk-in Closet\n* Garden Tub\n* Linen Closet\n* Washer and Dryer in unit\n* Kitchen Island\n* Stainless Steel Appliances\nCommunity Features\n* Outdoor Grill Area\n* Billiards\n* Fitness Studio\n* Spa\n* Swimming Pool\n* Yoga Lounge\n* Professionally Managed\n* Bark Park\n* Pet Salon\n* Easy Freeway Access\n* Sun Deck\n* Community Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* TV Lounge","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1363ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T15:43:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546027296.html","post_id":7546027296,"result_date":"2022-10-15T19:25:50.000Z","title":"Cable Ready, Disposal, Efficient Appliances","description":"Bedrooms: 2\nBathrooms: 2\nSquare Feet: 855\nDate Available: 2022-10-05\nAddress: 100 North 17th Street\nThe Arch Luxury Apartments embodies Philadelphia’s architectural splendor. A hidden gem between the Comcast towers, the Arch delivers apartments ideal for city-living in a piece of Philadelphia's history!\nAmenities Include:\nEfficient Appliances\nPatio\/Balcony\nLarge Closets\nCarpeting\nNewly renovated apartments with contemporary design\nRefrigerator\nDishwasher\nCable Ready\nDisposall\nCall: show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/lcorymf3\/arch","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '855ft2', '\\nfriday 2022-10-21\\n', '\\nmonday 2022-10-24\\n', '\\nthursday 2022-10-27\\n', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T14:51:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546037310.html","post_id":7546037310,"result_date":"2022-10-15T19:23:11.000Z","title":"Jogging trail right outside your door, Bark park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Upgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsBocce ball fieldMarble master baths, some with deep linen storageBBQ and deck areaState-of-the-art fitness center overlooking the Manayunk canalUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingOnline Payments AvailableJogging trail right outside your doorBark parkUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with dens9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyard48-hour Maintenance CommitmentCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/lxfhyhaz\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1364ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-10-15T15:13:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546038095.html","post_id":7546038095,"result_date":"2022-10-15T19:18:57.000Z","title":"Brand new renovation!!! 2 BR \/ 2 BA available","description":"Brand new renovation!!! 2 BR \/ 2 BA available Newly renovated 2 bedroom & 2 bathroom apartment for rent. WE WILL NO RESPOND TO ANY TEXT!!! Available. Suitable for single person or single person with small child or couple, there is very cute storage in this unit. It is close to all amenities, shops, grocery stores. PETS OK!! The location affords ample extra parking on Bamboo light flooring unifies the space, there is no carpet, and the outdoor patio is perfect for plants, pets, and storage as there are dual sliders to the large patio, one in the main living area & another into the primary bedroom. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application. and meet the qualifying criteria. Parking is limited, no storage of campers, trailers, boats, RVs, or utility vehicles. . Kitchen is fully equipped with all German made stainless Miele appliances, Quartz countertops with beautiful glass backsplash, under-mount cabinet lighting and deep under mounted sink. Kohler plumbing fixtures, wall mounted frameless medicine cabinets, marble bathroom vanity and the rich dark-colored stone flooring. All this in the most walkable score address. Sorry Pets ok and No-Smoking. This is a non-smoking property; If you interested please contact: - show contact info","num_images":1,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T15:14:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546027794.html","post_id":7546027794,"result_date":"2022-10-15T19:18:56.000Z","title":"NEW LISTING!*Fantastic LOCATION Historic-Detail RENOVATED Philly HOUSE","description":"Here's a great, uniquely-Philly house in a great neighborhood!\nThe house is a classic \"trinity\" house probably constructed in the late 1700s\/early 1800s.\n\"Philadelphia \"Trinity\" Houses: Built 1703-1836 to house tradesmen and artisans, these small brick structures were built in the Georgian and Federal-style along a cobblestone street. The name trinity refers to the three-story vertical structure connected by a spiral staircase.\"\nSears Street @ S 3rd Street (very close to E Moyamensing Ave)\nPennsport \/ South Philly \/ Queen Village Adjacent, Philadelphia\nThis classic Philadelphia \"trinity\" house was COMPLETELY RENOVATED. Finishes are high-end and upscale. Important foundational components have been addressed too; there's a recently-installed roof, deck and paved backyard patio. Location? It's excellent! You're really close & equidistant from South Street and the Italian Market. So if you like biking or walking, this house is an excellent fit. Otherwise, there's lots of on-street parking immediately accessible.\nMonthly Rent: $1695 for leases starting on or November 16\nUtilities: Gas, Electric & Water on your own meters.\nLease:\t1 year lease required w\/detailed agreement.\nMove-in:\t1st month, last month + security.\nPets:\tCat OK (and maybe a small dog) with pet addendum & fee.\nExterior Front: Steel front door with privatized leaded-glass detail. All front windows have been \"capped\" to reduce drafts. New house number, front light and railing.\nLiving Room: Enter directly into the compact living room featuring newly installed recessed lighting. There's a built-in closet directly ahead for storage. You can't miss the beautiful Caribbean Pine flooring. It starts at the front door and continues. . .\nKitchen: . . .into the kitchen. The entire first floor has hardwood flooring. On the way into the kitchen, you'll see the entrance to the basement (and stairs to the 2nd floor) to your left. A modern Italian-tiled \"feature\" wall wraps around the right-side entrance to the kitchen and faces the kitchen door. The kitchen cabinets are bright white w\/stainless trimming and handles. Mini-subway tiles and black glass serve as the backsplash above a black granite countertop. Modern appliances including a compact dishwasher and gas stove.\nPatio\/Backyard: The backyard was dug out to uncover a ground drain, then completely resurfaced. The back wall has been painted. A new wooden fence was installed on the west side of the patio, including a gate leading to a side walkway to the front street (great for taking out trash and storing your bike).\nBathroom (2nd floor): Original circular wood stairs lead up to 2nd floor hall w\/original hardwood plank flooring. Full bathroom at the front of the house with upgraded fixtures. . . even the bathtub. The bathtub \"surround\" is completely tiled with white marble. More modern Italian porcelain tile on the floor. Full-glass medicine cabinet and modern vanity. Chrome bath hardware.\nBedroom (2nd floor): Our contractor installed unique random-width plank flooring including all American hardwoods -- white oak, red oak, hickory and cherry. There's a built-in closet for clothing. A sliding fabric-panel system opens to reveal a large deck exclusively accessible from this bedroom.\nThird floor: Climb another set of circular steps to the top floor, where you'll find a second bedroom w\/new exotic-wood laminate flooring. The ceiling is super high, with painted beam struts and modern glass and stainless fixtures. There's another small room on the third floor, too -- great as a computer room, home office, extra large walk-in closet, etc.\nBasement: Unfinished with your own washer & dryer + storage space!\nLocation, location, location:\nLocation is excellent. You're really close\/equidistant to Queen Village and the Italian Market. Just a few blocks south of Washington Avenue, right off one of Queen Village's main North\/South thoroughfares, E Moyamensing Avenue.\nGreat spot for biking and walking!\nHerman's Coffee is 1\/2 block away. Jaxx Steaks & Taproom, Pennsport Beer Boutique and Aroma on 3rd are around the corner.\n","num_images":15,"lat":39.931475,"lng":-75.150046,"attrs":"['2BR \/ 1Ba', '1050ft2', 'available nov 1', 'air conditioning', 'application fee details: $35\/adult application', 'cats are OK - purrr', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T14:52:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546032742.html","post_id":7546032742,"result_date":"2022-10-15T19:07:47.000Z","title":"Schedule a Tour, Granite Countertops, Playground","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nApartment Features\n* Garden Tub\n* Window Coverings\n* Roommate Friendly Floor Plan\n* Full sized Washer and Dryer in unit\n* Walk-in Closet\n* Pantry\n* Central Heat and Air\n* Private Patio or Private Balcony (on select apartments)\n* High Efficiency Lighting Fixtures\n* Breakfast Bar\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Linen Closet\n* Pre-wired for internet and cable\n* Disposal\n* Lofty Vaulted Ceilings\n* Ceiling Fan\n* Stainless Steel Appliances\n* Granite Countertops","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1128ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T15:03:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546009698.html","post_id":7546009698,"result_date":"2022-10-15T18:32:18.000Z","title":"⭐️ Beautiful Completely Renovated 3 BR 1.5 bath Manayunk House⭐️","description":"Welcome to 4615 Smick Street! This freshly renovated charming 3 bedroom and 1.5 bathroom house is conveniently located on a quiet street in the heart of Manayunk. Brand new heater, central air, appliances, kitchen, flooring, dimmable recessed lighting, plumbing, electrical and more. Live within a 5 minute walk to all the restaurants\/bars on Main Street and the Manayunk Train Station. Enjoy walking\/running\/biking along the Schuylkill River Trail which is only steps away. The house features a lovely front porch and a fenced-in backyard patio. Inside you will find a spacious open floorplan with new oak hardwood floors leading into a beautiful kitchen designed for hosting (stainless steel appliances, granite countertops and an eat-in peninsula). Off the kitchen is a conveniently located laundry room, half bathroom and access to the back yard. On the second floor, you will find three nice size bedrooms, refinished original hardwood floors and a full bathroom. The full basement offers plenty of room for storage. Lease details one year lease, no smoking, security deposit is one month's rent, tenant responsible for all utilities and available now.\nOne year lease, no smoking, security deposit is one month's rent, and tenant responsible for all utilities.\n","num_images":18,"lat":40.0304,"lng":-75.2283,"attrs":"['3BR \/ 1.5Ba', '1308ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T14:14:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546015423.html","post_id":7546015423,"result_date":"2022-10-15T18:30:48.000Z","title":"Check out The Glen at Lafayette Hill! Convenient university location","description":"The Glen at Lafayette Hill Leasing Office:  555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nTake a look at what The Glen at Lafayette Hill has to offer! Our residents enjoy luxurious amenities including an amazing outdoor cafe area, a clubhouse with flat screen TVs, and a full kitchen and fitness center. Open-concept floor plans accompanied by a variety of upscale features define the one-of-a-kind luxury lifestyle only found at our Lafayette Hill apartments.-Split Bedrooms\n-Laundry Room\n-High Ceilings\n-Walk-In ClosetRental Information: 2 Bedroom \/ 2 Bathroom \/ 1019 - 1042 sq ft \/ $2194 - $2560\/Month  Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthApartment Amenities:❖ Air Conditioning & Heating❖ Cable Ready❖ Carpet❖ Ceiling Fans (Select Floor Plans)❖ Dining Room❖ Range, Oven, Disposal, Oven❖ Refrigerator, Freezer and Ice Maker❖ Tub\/Shower❖ Wi-Fi❖ Window Coverings❖ Crown Molding (Select Floor Plans)❖ Dishwasher❖ High Speed Internet Access❖ Linen Closet❖ Microwave❖ Trash Compactor❖ Vaulted Ceiling (Select Floor Plans)❖ Walk-In Closets (Select Floor Plans)❖ Washer\/Dryer❖ Wheelchair Accessible (Rooms)Additional Information:❖ 24 Hour Availability❖ Barbecue\/Grill❖ Business Center❖ Cardio Machines❖ Elevator❖ Package Service❖ Pet Play Area❖ Planned Social Activities❖ Recycling❖ Renters Insurance Program❖ BBQ Picnic Garden❖ Billiards, Club Lounge, Cafe Area, Library and Community Room❖ Fitness Center w\/ Free Weights, Weight Machines❖ Message Therapist Practice On-site❖ Outdoor Cafe & Coffee Bar❖ Outdoor Patio Lounge❖ Sprinkler System❖ Storage Space❖ Wi-Fi at Clubhouse Leasing Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM show contact info\nPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds. Website: https:\/\/www.the-glen-apartments.com  Management Company: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITY8561B6493AAB4D0\n","num_images":20,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1019ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-15T14:26:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546015032.html","post_id":7546015032,"result_date":"2022-10-15T18:29:59.000Z","title":"Cute Southbrook Park 2 Bed 1 Bath Home! W\/D! Yard! Come check it out!!","description":"Cute Southbrook Park Rehab! Come see this. Walk in to a large living room\/dining room combo with new hardwood floors, coat closet, and freshly painted walls throughout the home. The kitchen has been revamped and features new gorgeous granite countertops, new hardwood floors and cabinets that have been beautifully refinished. Plenty of counter top and cabinet space. Check out the modern tile backsplash and stainless steel appliances including refrigerator, gas range and sink. Huge yard! New rear painted exterior and rear siding gives the back a breath of fresh air! Basement is large and unfinished with sound systems and washer\/dryer. The second floor features two nice-sized bedrooms with closets and hardwood floors. The classic pink bathroom has been restored with a new toilet, sink, and refinished tub. This house features tons of nice natural light and plenty of windows! Come see it! One owner is a licensed PA Real Estate Agent. Cats and Small dogs under 25 lbs. are ok. with a non-refundable Pet Fee. Tenant pays gas, electric, cold water\/sewer, and cable\/internet. 1st, last and security due at lease signing. 1 year lease minimum. $75 non refundable application fee with two paystubs\/some form of income verification and photo ID - we run a credit, criminal and eviction check. For gross monthly income, we look for 3x the rent. If approved, you will be charged a document preparation fee of $100.00. THIS FEE IS NON-REFUNDABLE. Each resident over the age of 18 must submit a separate rental application.. Available November 1, 2022! Contact Mike Giordano at  show contact info\n!","num_images":24,"lat":39.927438,"lng":-75.193491,"attrs":"['2BR \/ 1Ba', '900ft2', 'available nov 1', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $100', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T14:25:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546005649.html","post_id":7546005649,"result_date":"2022-10-15T18:17:00.000Z","title":"Bocce ball field, Huge walk-in closets with ample storage, Bark park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Upgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsBocce ball fieldGame Room with Billiards Table, Shuffle Board, and more48-hour Maintenance CommitmentMarble master baths, some with deep linen storageOnline Payments AvailableUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densAlexa or Google Home Capable in all ApartmentsHuge walk-in closets with ample storageOn-site bike storage9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/d5kjtosj\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['1BR \/ 1Ba', '768ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-10-15T14:06:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545976593.html","post_id":7545976593,"result_date":"2022-10-15T17:20:11.000Z","title":"Studio Apartment Home on Rittenhouse Square, Gym, Yoga Studio, Sauna","description":"The studio apartment home at 1006 is available for lease at this moment! This 400 square foot Dali studio apartment home on the 10th floor features large windows that face north and have a city view. You may gaze upon skyscrapers like BNY Mellon Center, Comcast Center, One Liberty Place, and Two Liberty Place. This renovated kitchen is nice with its white cabinets and granite countertops. This kitchen is fully-equipped with a dishwasher, disposal, microwave, and gas stove. The renovated bathroom tile is white. This home has wood floors. The Rittenhouse Claridge is located on Rittenhouse Square. Move into your new home as early as December 7, 2022!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to shopping, dining, and more! Go grocery shopping at the Rittenhouse Market, Trader Joe's, Giant, Target, Di Bruno Bros., Venditore by Giordano, Sue's Produce Market, Reading Terminal Market, Giant Heirloom Market, Aldi, Sprouts, and Whole Foods. Browse the books at Barnes & Noble. Shop at the retail stores on Rittenhouse Row such as Anthropologie, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, gorjana, Paper Source, Philadelphia Runner, Allbirds, Bluemercury, Scotch & Soda, Vince, Theory, L'Occitane en Provence, and Marine Layer. Dine out at Rouge, Devon, Parc, Barclay Prime, Pietro's, Restaurant Aleksandar, Pizzeria Vetri, a.kitchen, HipCityVeg, The Love, Via Locusta, The Dandelion, Veda, and Friday Saturday Sunday. Savor a cup of coffee at La Colombe, K'Far Cafe, Ultimo, Vibrant, Alchemy, Elixr, Bluestone Lane, Di Bruno Bros., Gran Caffe L'Aquila, and Le Pain Quotidien. Indulge in a decadent Sunday brunch at Green Eggs. Savor scoops of gelato from Gran Caffe L'Aquila. Indulge in ice cream at Van Leeuwen. Try the Rittenhouse Churro at El Merkury! Stroll across the park and then buy a loaf of French Table at Metropolitan Bakery. Catch a show at one of the many nearby theaters. Wander around the Rodin Museum. Relax with a mani\/pedi at Philly Nails Bar. Shop at the weekly farmer's market every Saturday and Tuesday from 9:00 AM to 2:00 PM. There is so much to do in this area!\nCommunity Amenities:\n* High-rise building on Rittenhouse Square\n* Top-of-the-line fitness center with park view\n* Fitness\/yoga studio\n* Sauna\n* Package lockers by Luxer One\n* 8,000 square foot resident lounge with free wifi\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Bike storage in the attached parking garage\n* Nightly guest suites for the family and friends of current residents\n* Elevator building with beautiful lobby\n* 24\/7 front door attendant and 24\/7 concierge desk staff\n* 24\/7 on-site emergency maintenance\n* Online resident portal for rent payments, maintenance requests, and more\n* Laundry room featuring a single washer and a single dryer on every floor\n* Larger laundry facility on the 3rd floor\n* Attached valet parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Unfurnished studio apartment home on 10th floor\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* White kitchen cabinets\n* Granite kitchen countertops\n* Wood floor\n* Large north-facing windows\n* City skyline view\n* All utilities included (except cable and internet)\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 1006 is still listed under the Dali floor plan! Please make an appointment to tour with Michelle or Gabby using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com 24\/7. Live virtual tours in Zoom available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 22 month lease term.\n2-22 month lease terms available!\n* *Rental rates, availability, and apartment home features are subject to change without notice.* *\nWelcome home!","num_images":24,"lat":39.949786,"lng":-75.17056,"attrs":"['0BR \/ 1Ba', '400ft2', 'available dec 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T13:07:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545969280.html","post_id":7545969280,"result_date":"2022-10-15T16:56:42.000Z","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nYou will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T12:52:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545957459.html","post_id":7545957459,"result_date":"2022-10-15T16:52:24.000Z","title":"Rittenhouse Square Studio Apt Home with City Skyline View, Wood Floors","description":"The studio apartment home at 2307 is available for lease at this moment! This 400 square foot Dali studio apartment home on the 23rd floor features large windows that face north and have a city skyline view. You may gaze upon skyscrapers like BNY Mellon Center, Comcast Center, One Liberty Place, and Two Liberty Place. This renovated kitchen is nice with its white cabinets and granite countertops. This kitchen is fully-equipped with a dishwasher, disposal, microwave, and gas stove. The renovated bathroom tile is white. This home has wood floors. The Rittenhouse Claridge is located on Rittenhouse Square. Move into your new home as early as December 15, 2022!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to shopping, dining, and more! Go grocery shopping at the Rittenhouse Market, Trader Joe's, Giant, Target, Di Bruno Bros., Sue's Produce Market, Venditore by Giordano, Reading Terminal Market, Giant Heirloom Market, Aldi, Sprouts, and Whole Foods. Browse the books at Barnes & Noble. Shop at the retail stores on Rittenhouse Row such as Anthropologie, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, gorjana, Paper Source, J. Crew, Philadelphia Runner, Allbirds, The Dr. Martens Store, Scotch & Soda, Bluemercury, Brooklinen, Vince, Urban Outfitters, Theory, L'Occitane en Provence, and Marine Layer. Dine out at Rouge, Devon, Parc, Barclay Prime, Pietro's, Restaurant Aleksandar, Pizzeria Vetri, a.kitchen, Spice Finch, HipCityVeg, The Love, Via Locusta, Monks' Cafe, Marathon on the Square, Rosy's Taco Bar, and Scarpetta. Savor a cup of coffee at La Colombe, K'Far Cafe, Vibrant, Ultimo, Alchemy, Nook Bakery & Coffee Bar, Elixr, and Di Bruno Bros. Indulge in a decadent Sunday brunch at Green Eggs. Savor scoops of gelato from Gran Caffe L'Aquila. Indulge in ice cream at Van Leeuwen. Try the Rittenhouse Churro from El Merkury! Stroll across the park and then buy baked goods at Metropolitan Bakery. Relax with a manicure and pedicure at Philly Nails Bar. Catch a show at one of the many nearby theaters. Wander around the Barnes Foundation. Shop at the weekly farmer's market every Saturday and Tuesday from 9 AM to 2 PM. There is so much to do in this area!\nCommunity Amenities:\n* High-rise building on Rittenhouse Square\n* Package lockers by Luxer One\n* 8,000 square foot resident lounge with free wifi\n* Top-of-the-line fitness center with park view\n* Fitness\/yoga studio\n* Sauna\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Bike storage in the attached parking garage\n* Nightly guest suites for the family and friends of current residents\n* Elevator building with 24\/7 front door attendant and 24\/7 concierge desk staff\n* 24\/7 on-site emergency maintenance\n* Online resident portal for maintenance requests and rent payments\n* Laundry room featuring a single washer and a single dryer on every floor\n* Larger laundry facility on the 3rd floor\n* Attached valet parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Unfurnished studio apartment home on 23rd floor\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* White kitchen cabinets\n* Granite kitchen countertops\n* Wood floor\n* Large north-facing windows\n* City skyline view\n* All utilities included (except cable and internet)\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 2307 is still listed under the Dali floor plan! Please make an appointment to tour with Michelle or Gabby using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com 24\/7. Live virtual tours in Zoom available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 22 month lease term.\n2-22 month lease terms available!\n* * *Rental rates, availability, and apartment home features are subject to change without notice.* * *\nWelcome home!","num_images":24,"lat":39.949819,"lng":-75.170581,"attrs":"['0BR \/ 1Ba', '400ft2', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T12:29:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545956001.html","post_id":7545956001,"result_date":"2022-10-15T16:30:35.000Z","title":"First Floor Modern! 2 Bed 2 Bath Apartment The Edge at Yardley","description":"The Edge at Yardley is a great place to be if you are looking for apartments in Yardley, PA. We offer spacious one-, two-, and three-bedroom floor plans with bi-level living options. The Edge at Yardley features a rare combination of great location, open generous space, and fantastic amenities and features.\nTo schedule a tour of our amazing Yardley, PA apartments, call us at  show contact info\n!\nLeasing Office Hours:\nMon – Fri: 9:00 am – 5:30pm\nSaturday: 9:00 am – 5:00pm\n","num_images":4,"lat":40.2084,"lng":-74.8291,"attrs":"['2BR \/ 2Ba', 'available now', '\\nsaturday 2022-10-15\\n', '\\nmonday 2022-10-17\\n', '\\ntuesday 2022-10-18\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T12:26:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545954343.html","post_id":7545954343,"result_date":"2022-10-15T16:27:12.000Z","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nFind yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two-bedroom two-bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms and so much more!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Window Coverings\n* Roommate Friendly Floor Plan\n* Pre-wired for internet and cable\n* Pantry\n* Granite Countertops\n* Private Patio or Private Balcony (on select apartments)\n* Garden Tub\n* Breakfast Bar\n* Lofty Vaulted Ceilings\n* Walk-in Closet\n* Full sized Washer and Dryer in unit\n* High Efficiency Lighting Fixtures\n* Stainless Steel Appliances\n* Central Heat and Air\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Linen Closet\n* Ceiling Fan\n* Disposal","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1075ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T12:23:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545951692.html","post_id":7545951692,"result_date":"2022-10-15T16:21:36.000Z","title":"Fall Forward! 2 Bed 1 Bath Apartment The Edge at Yardley","description":"The Edge at Yardley is a great place to be if you are looking for apartments in Yardley, PA. We offer spacious one-, two-, and three-bedroom floor plans with bi-level living options. The Edge at Yardley features a rare combination of great location, open generous space, and fantastic amenities and features.\nTo schedule a tour of our amazing Yardley, PA apartments, call us at  show contact info\n!\nLeasing Office Hours:\nMon – Fri: 9:00 am – 5:30pm\nSaturday: 9:00 am – 5:00pm\n","num_images":4,"lat":40.2084,"lng":-74.8291,"attrs":"['2BR \/ 1Ba', 'available nov 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T12:17:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545946460.html","post_id":7545946460,"result_date":"2022-10-15T16:11:18.000Z","title":"Luxurious 1 bed \/ 1 bath available with convenient washer & dryer","description":"Silk Factory Lofts200 S Line St Lansdale, PA 19446A wonderful home in Lansdale is waiting for you!We currently have a gorgeous 1 bedroom 1 bathroom renting for $1679 per month. This unit comes with 809 sq ft. SEE WHAT YOU'VE BEEN MISSING  Located in the heart of Lansdale, Pennsylvania, Silk Factory Lofts offer an irresistible lifestyle set in a historic landmark building. Our open loft-style apartments feature oversized windows, high ceilings and modern kitchens. Our community boasts an upscale resident lounge, modern fitness center and beautiful courtyards. Apartment options include 1, 2 and 3 bedroom floor plans. Silk Factory Lofts is located close to public transportation, shopping, dining and entertainment. If you want to venture out, we offer convenient access to major highways, and we're less than an hour from downtown Philadelphia.Bright and Cheery one bedroom Apartment home with brand new plank flooring. show contact info\nCommunity Highlights:◾ 18' Long Shuffle Board◾ Business Center◾ Dog Wash Room◾ Elevator◾ Laundry Facilities◾ Monthly Community Events◾ Package Service◾ Pool Table◾ Smoke-Free◾ Vintage Building◾ Beautifully Landscaped Grounds with Access to Local Businesses◾ Community Lounge featuring free Verizon Fios TV\/Wi-Fi◾ Courtyard featuring tasteful Outdoor Seating and Fire Pits◾ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting◾ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi◾ Free Parking - 2 Spaces per Apartment Home + Guest Parking◾ Lobby Area with Complimentary Coffee◾ Professional On-Site Management Team◾ Storage units - $50\/$75 per month◾ Within Walking Distance to TrainsUnit Highlights:◾ Cable & Hi-Speed Internet Ready◾ Central Air Conditioning◾ Courtyard View in select apartments◾ Dishwasher◾ Full Size Washer & Dryer◾ Large Windows◾ Refrigerator\/Freezer◾ Secured Building Access◾ Storage Spaces◾ Upgraded Kitchens in Select ApartmentsContact:  show contact info\nFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/Leasing Options: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthPet Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German Sheph Management: Paradise Management, LLC Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITY5E8167B8E9FC4A\n","num_images":24,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '809ft2', 'available dec 5', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T12:07:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545939843.html","post_id":7545939843,"result_date":"2022-10-15T16:08:42.000Z","title":"Renovated Studio Apartment Home, Sauna, Package Lockers, Near Stores","description":"The studio apartment home at 2512 is available for lease at this moment! This 400 square foot Dali studio apartment home on the 25th floor (of 26 floors) features large windows that face south and have a view of Chancellor Street and South Philadelphia. Be the first to enjoy a newly renovated kitchen and bathroom! This kitchen will be fully-equipped with a dishwasher, disposal, microwave, and gas stove. This home will have wood floors. The Rittenhouse Claridge is located on Rittenhouse Square. Move into your new home immediately!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to shopping, dining, and more! Go grocery shopping at the Rittenhouse Market, Venditore by Giordano, Trader Joe's, Giant, Target, Di Bruno Bros., Reading Terminal Market, Giant Heirloom Market, Aldi, Sprouts, and Whole Foods. Browse the books at Barnes & Noble. Shop at the retail stores on Rittenhouse Row such as Anthropologie, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, gorjana, Paper Source, J. Crew, Bluemercury, Scotch & Soda, Vince, Urban Outfitters, Angela Monaco Jewelry, Bella Turka, Ritual Shoppe, Tselaine, Rebel, Je Suis Jolie, Banana Republic Factory, MAC Cosmetics, Sephora, and Nordstrom Rack. Relax with a manicure and pedicure at Philly Nails Bar. Dine out at Rouge, Devon, Parc, Via Locusta, Barclay Prime, Pietro's, a.kitchen, HipCityVeg, Pizzeria Vetri, Marathon on the Square, Veda, The Love, and Gran Caffe L'Aquila. Savor a cup of coffee at La Colombe, Vibrant, Ultimo, Alchemy, Elixr, Di Bruno Bros., and Bluestone Lane. Indulge in a decadent Sunday brunch at Green Eggs. Savor scoops of gelato from Gran Caffe L'Aquila. Indulge in ice cream at Van Leeuwen. Try the Rittenhouse Churro from El Merkury! Stroll across the park and then buy a slice of cake at Metropolitan Bakery. Catch a show at one of the many nearby theaters. Wander around the Rodin Museum. Shop for produce and flowers at the weekly farmer's market every Saturday and Tuesday from 9 AM to 2 PM. There are many banks in the neighborhood, including TD Bank in the building. This building has the best location!\nCommunity Amenities:\n* High-rise building on Rittenhouse Square\n* Sauna\n* Package lockers by Luxer One\n* 8,000 square foot resident lounge with free wifi\n* Top-of-the-line fitness center with park view\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Fitness\/yoga studio\n* Bike storage in the attached parking garage\n* Nightly guest suites for the family and friends of current residents\n* Elevator building with 24\/7 front door attendant and 24\/7 concierge desk staff\n* 24\/7 on-site emergency maintenance\n* Laundry room featuring a single washer and a single dryer on every floor\n* Larger laundry facility on the 3rd floor\n* Attached valet parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Unfurnished studio apartment home on 25th floor\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* White kitchen cabinets\n* Granite kitchen countertops\n* Wood floor\n* Large south-facing windows\n* Chancellor Street\/South Philadelphia view\n* All utilities included (except cable and internet)\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 2512 is still listed under the Dali floor plan! Please make an appointment to tour with Michelle or Gabby using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com 24\/7. Live virtual tours in Zoom available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 19 month lease term.\n2-22 month lease terms available!\n* Rental rates, availability, and apartment home features are subject to change without notice, so don't delay, apply today! *\nWelcome home!","num_images":24,"lat":39.949803,"lng":-75.17056,"attrs":"['0BR \/ 1Ba', '400ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T11:53:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545936841.html","post_id":7545936841,"result_date":"2022-10-15T16:03:24.000Z","title":"Renovated One Bedroom Apartment Home on Rittenhouse Square, Concierge","description":"The 575 square foot Warhol one bedroom one bathroom apartment home at 2015 is available for lease at this moment! This home on the 20th floor features large windows that mainly face south and have a view of Chancellor Street. One window in the living and dining room area faces west for morning shade and afternoon sunshine and has a park view. This renovated kitchen is nice with its white cabinets and granite countertops. This kitchen is fully-equipped with a dishwasher, disposal, microwave, and gas stove. The renovated bathroom tile is white. This home has neutral carpet. The Rittenhouse Claridge is located on Rittenhouse Square. Move into your new home immediately!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to shopping, dining, and more! Go grocery shopping at the Rittenhouse Market, Trader Joe's, Giant, Giant Heirloom Market, Target, Venditore by Giordano, Di Bruno Bros., Aldi, Sprouts, Whole Foods, and Reading Terminal Market. Browse the books at Barnes & Noble. Shop at the retail stores on Rittenhouse Row such as Anthropologie, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, gorjana, Paper Source, The Dr. Martens Store, Bella Turka, Philadelphia Runner, Allbirds, Bluemercury, Scotch & Soda, Vince, Theory, L'Occitane en Provence, and Marine Layer. Relax with a manicure or pedicure at Philly Nails Bar or Nail Spa Bar. Dine out at Rouge, Devon, Parc, Barclay Prime, Pietro's, Pizzeria Vetri, a.kitchen, HipCityVeg, The Love, and Via Locusta. Savor a cup of coffee at La Colombe, Ultimo, Vibrant, Alchemy, Elixr, Di Bruno Bros., and Gran Caffe L'Aquila. Savor scoops of gelato from Gran Caffe L'Aquila. Indulge in ice cream at Van Leeuwen. Try the Rittenhouse Churro at El Merkury! Stroll across the park and then grab a loaf of French Table at Metropolitan Bakery. Catch a show at one of the many nearby theaters. Wander around the Mütter Museum. Pick up fresh flowers for your home at the weekly farmer's market every Saturday from 9:00 AM to 2:00 PM. There is so much to do in this area!\nCommunity Amenities:\n* High-rise building on Rittenhouse Square\n* Elevator building with 24\/7 front door attendant and 24\/7 concierge desk staff\n* 8,000 square foot resident lounge with free wifi\n* Top-of-the-line fitness center with park view\n* Fitness\/yoga studio\n* Sauna\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Bike storage in the attached parking garage\n* Package lockers by Luxer One\n* Nightly guest suites for the family and friends of current residents\n* 24\/7 on-site maintenance\n* Online resident portal for rent payments, maintenance requests, and more\n* Laundry room on every floor\n* Larger laundry facility on the 3rd floor\n* Attached valet parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Unfurnished one bedroom one bathroom apartment home on 20th floor\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* White kitchen cabinets\n* Granite kitchen countertops\n* Renovated bathroom\n* Neutral carpet\n* Large mainly south-facing windows with Chancellor Street view\n* One west-facing window with park view\n* All utilities included (except cable and internet)\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 2015 is still listed under the Warhol floor plan! Please make an appointment to tour with Michelle or Gabby using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com 24\/7. We welcome you to tour your new home in person. Live virtual tours in Zoom are also available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 22 month lease term.\n2-22 month lease terms available!\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24,"lat":39.949786,"lng":-75.170624,"attrs":"['1BR \/ 1Ba', '575ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T11:47:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545941329.html","post_id":7545941329,"result_date":"2022-10-15T16:00:51.000Z","title":"Public transportation close by! Great commuter location. 2 bed, 2 ba","description":"Welcome to The Glen at Lafayette Hill Rental Information  Pricing: $2370 - $2960\/Month | 2 Bedroom 2 Bath | 1157 sq ftLease Term: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nApartment Amenities   ● Air Conditioning & Heating● Cable Ready● Carpet● Ceiling Fans (Select Floor Plans)● Dining Room● Range, Oven, Disposal, Oven● Refrigerator, Freezer and Ice Maker● Tub\/Shower● Wi-Fi● Window Coverings● Crown Molding (Select Floor Plans)● Dishwasher● High Speed Internet Access● Linen Closet● Microwave● Tile Floors● Trash Compactor● Vaulted Ceiling (Select Floor Plans)● Walk-In Closets (Select Floor Plans)● Wheelchair Accessible (Rooms)Community Features  ● 24 Hour Availability● Barbecue\/Grill● Business Center● Conference Room● Elevator● Multi-Use Room● Online Services● Package Service● Pet Play Area● Renters Insurance Program● BBQ Picnic Garden● Billiards, Club Lounge, Cafe Area, Library and Community Room● Fitness Center w\/ Free Weights, Weight Machines● Message Therapist Practice On-site● Outdoor Cafe & Coffee Bar● Outdoor Patio Lounge● Sprinkler System● Storage Space● Wi-Fi at ClubhouseAbout CommunityDescription: We offer the premier location for apartment homes in Lafayette Hill. With a great location and easy access to I-476 (Veteran's Memorial Hwy), you will love calling The Glen Apartments your home. Residents of our Lafayette Hill apartment rentals enjoy our one, two, and three bedroom floor plans that add a touch of style and sophistication to any lifestyle. We boast a number of lavish amenities, including 42-inch kitchen cabinetry, gas cooking, over-sized closets and in-unit washers and dryers. With its convenient location near the most prominent dining, shopping and entertainment venues in Lafayette Hill, The Glen is perfect for commuters all across the Pennsylvania area. Schedule a tour of our luxury Lafayette Hill apartments today and see why residents love coming home to our apartments.  Location: 555 Andorra Glen Ct  Lafayette Hill, PA 19444  show contact info\nOffice Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMAdditional InformationPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds. Website: https:\/\/www.the-glen-apartments.comOur Management Company: Paradise Management, LLC All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":17,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-15T11:56:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545934828.html","post_id":7545934828,"result_date":"2022-10-15T15:47:09.000Z","title":"Roxborough Three bedroom home","description":"Three bedroom ranch style, garage front twin\nMain level: Wrap around living \/ dining area, large kitchen, full tile bath, three bedrooms.\nLowr level: Large, full floor area, finished rec room. Full tile bath. Utility room, and garage.\nAll hardwood floors, thermal windows, central air, large, fenced rear yard with patio. Exterior yard entrance from rec room.\nOn Henry Ave . Four miles from Philadelphia University.\nAvailable November 15th, or sooner\n1890.00 plus utilities\nshow contact info","num_images":0,"lat":40.0471,"lng":-75.217827,"attrs":"['3BR \/ 2Ba', '1900ft2', 'available nov 1', 'air conditioning', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T11:43:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545929196.html","post_id":7545929196,"result_date":"2022-10-15T15:35:26.000Z","title":"Enjoy our views of lush landscaping and beautiful courtyards","description":"The Gateway Apartments1515 Manley Rd West Chester, PA 19380A wonderful home in West Chester is waiting for you!We currently have a gorgeous 2 bedroom 2 bathroom renting for $1946 - $2348 per month. This unit comes with 1199 sq ft. Offering a vibrant selection of living options, The Gateway Apartment Homes maintains the prime for luxury apartments in West Chester, PA. Our open and inviting floor plans are enhanced by a variety of exclusive features which define the unique lifestyle only found at our community. With a great location in the East Goshen Township, you will love calling our apartments your home. show contact info\nCommunity Highlights:✓ Business Center✓ Clubhouse✓ Fitness Center✓ Onsite Maintenance✓ Onsite Management✓ Package Service✓ Picnic and Grilling Area✓ Pool and Sundeck✓ Storage Space✓ Walking\/Biking Trails✓ Across From Wawa & Goshen Crossing Shopping Center✓ Beautifully Landscaped Grounds✓ Gated Entrances✓ Maintenance Free Lifestyle✓ Onsite Leasing Office✓ Pet-Friendly✓ Relaxing Fire Pit✓ Storage Units For Lease✓ Three BBQ\/Picnic Areas✓ Wi-Fi Access in Clubhouse and at PoolUnit Highlights:✓ Air Conditioning & Heating✓ Alarm✓ Den✓ Dining Room✓ Dishwasher✓ Garbage Disposal✓ Refrigerator, Freezer, Ice Maker✓ Tub\/Shower✓ Walk-In Closets✓ Window Coverings✓ Built-In Computer Nook (select homes)✓ Built-In Microwave Oven✓ Garden\/Spa Tub (select homes)✓ Gas Fire Place (select homes)✓ Kitchen Pantry✓ Large Windows✓ Private Entrance To Each Unit✓ Vaulted Ceiling (select homes)✓ Washer And Dryer In Each Apartment Home✓ Wired For High-Speed InternetContact:  show contact info\nFacebook: https:\/\/www.facebook.com\/TheGatewayApartmentsAParadiseManagementCommunity\/ Website: https:\/\/www.thegatewayapartments.com\/Leasing Options: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthPet Policy: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Mon Management: Paradise Management, LLC All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITYFC0F0603CBEC49\n","num_images":12,"lat":39.967056,"lng":-75.529129,"attrs":"['2BR \/ 2Ba', '1199ft2', 'available now', 'air conditioning', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T11:31:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545901935.html","post_id":7545901935,"result_date":"2022-10-15T15:32:53.000Z","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #4\nBI-LEVEL\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":7,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:30:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545927434.html","post_id":7545927434,"result_date":"2022-10-15T15:31:39.000Z","title":"Manayunk Two Bedroom Apartment","description":"Newly renovated 2nd & 3rd Floor apartment.\nSecond floor: Living room, study, laundry (with washer and dryer), full tile bath, kitchen.\nThird floor: Two bedrooms\nFreshly painted, thermal windows, sanded and finished floors throughout. ceiling fans, window A\/C units.\nOne block from bicycle path entrance on Dupont St. (Cynwood to Valley Forge), two blocks to Main St., two blocks to railroad station (Manayunk stop\/ Norristown R-6 line), and two blocks to expressway entrance (Green Lane\/ Belmont Ave.)\nAvailable October 29th\n1240.00 plus utilities\nshow contact info","num_images":0,"lat":40.028572,"lng":-75.22731,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available oct 29', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T11:27:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545914672.html","post_id":7545914672,"result_date":"2022-10-15T15:27:18.000Z","title":"THREE BED ON COMM! - AVAILABLE NOW! FOR RENT","description":"Studios starting at $900\/month\n1\/1 starting at $1000\/month\n2\/1 starting at $1200\/month\n2\/2 starting at $1250\/month\nEasy access to Uptown Philadelpia, a premier neighborhood in PA!!! Resident clubroom for parties or sit by the fire in one of the resident lounges. Work remotely from the WiFi workspaces. Boutique-hotel inspired pool with bronzing ledge for relaxing on a beautiful day outside. Resident courtyard with private cabanas, fire features and BBQ grills. Oversized games on the outdoor terrace. Access-controlled garage featuring electric vehicle charge stations. Full-service fitness and cardio facility. Pet styling station. Package service. Rooftop observation deck. Stained concrete or plank flooring in living, dining, and bathroom areas. 9' or higher ceilings. Granite countertops in kitchen and bathrooms. Gourmet kitchens with hardwood-styled cabinetry. Under-mount sinks in kitchens. Stainless steel finish appliances with front-control ranges and refrigerators with in door ice & water dispensers. Walk-in custom closets. Full size washers and dryers.\nPrivate, expansive patios, balconies or private yards*. Shower\/tub combinations*. And More!!!\nHousing vouchers NOT accepted - Regards!\nPRICES and AVAILABILITY CHANGE DAILY!!!\nApt id: 297010\nDana Dahlen, Realtor\neXp Realty, LLC\nshow contact info\ndirect line\nshow contact info\nCALL\ndanadahlen exprealty com","num_images":9,"lat":40.0178,"lng":-75.0895,"attrs":"['1BR \/ 1Ba', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-10-15T11:00:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545906079.html","post_id":7545906079,"result_date":"2022-10-15T15:24:26.000Z","title":"Beautifully maintained and updated efficiency unit.","description":"Beautifully maintained and updated efficiency unit in the much desired Greens at Westover 55+ Active Adult community. This one bedroom, one bath has been beautifully updated with laminate flooring through main living area and carpeted bedroom. The condo is painted a lovely neutral color and has updated lighting. Things you will love about this condo: The light bright kitchen with all young (and barely used) stainless steel appliances including GE Refrigerator\/Freezer, Range and Dishwasher. There is a counter-top microwave; newer stackable washer dryer and efficient water heater. Both the kitchen and bathroom have been updated with white cabinetry, updated fixtures and beautiful solid surface countertops. The closets are all outfitted with storage units for maximum in-unit storage PLUS you get a 3x8x8 storage bin in the lower level. Additionally, in the lower level, there is a large item storage room; and an off-season clothes storage room. Amenities within the building include a fitness room and large social room for in-building social gatherings. For larger gatherings there is a beautiful clubhouse with full kitchen which can be used for community functions. The clubhouse houses the community swimming pool and office. There is a beautiful community garden. Pets are allowed with restrictions for breed and size.","num_images":6,"lat":40.1496,"lng":-75.3796,"attrs":"['1BR \/ 1Ba', '775ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T10:40:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545905273.html","post_id":7545905273,"result_date":"2022-10-15T15:17:31.000Z","title":"1 Bedroom Apartment","description":"UNIT #4\nBI-LEVEL\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":6,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:38:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545919860.html","post_id":7545919860,"result_date":"2022-10-15T15:14:59.000Z","title":"Very cute 2 bedroom 2 bath apartment for rent in Philadelphia.","description":"Very cute 2 bedroom 2 bath apartment for rent in Philadelphia. NO TEXT ABOUT THIS PROPERTY. WE WILL NO RESPOND TO ANY TEXT!!! Available until NOV 3rd. Suitable for single person or single person with small child or couple, there is very cute storage in this unit. It is close to all amenities, shops, grocery stores. ABSOLUTELY NO PETS!! Location affords ample extra parking on Ashford. Bamboo light flooring unifies the space, there is no carpet, and the outdoor patio is perfect for plants, pets, and storage as there are dual sliders to the large patio, one in the main living area & another into the primary bedroom. Original pine wood floors, thermal windows, free laundry in basement, pets okay. Everyone age 18+ must complete an application and meet the qualifying criteria; minimum requirement is a gross monthly income equivalent to 3x the rent. Parking is limited, no storage of campers, trailers, boats, RVs, utility vehicles. This is a non-smoking property; animals considered. If you interested please contact::::Text me:::","num_images":1,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T11:10:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545907237.html","post_id":7545907237,"result_date":"2022-10-15T15:11:05.000Z","title":"3 Bedroom house","description":"3 BEDROOM HOUSE\nWOOD FLOORS\nRENOVATED\nFRONT PORCH\nBACK YARD\nBIG LIVING ROOM\nCLOSE TO TRANSPORTATION\nLOCATION: 4563 N. COLORADO ST","num_images":6,"lat":40.0118,"lng":-75.1456,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:43:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545911665.html","post_id":7545911665,"result_date":"2022-10-15T15:10:25.000Z","title":"Renovated 1 BR Apartment Home on Rittenhouse Square, Near Restaurants","description":"The home at 915 is available for lease at this moment! This 575 square foot Warhol one bedroom one bathroom apartment home on the 9th floor features large windows that mainly face south and have a view of Chancellor Street. One window in the living and dining room area faces west for morning shade and afternoon sunshine and has a park view. This renovated kitchen is nice with its white cabinets and granite countertops. This kitchen is fully-equipped with a dishwasher, disposal, microwave, and gas stove. The renovated bathroom tile is white. This home has neutral carpet. The Rittenhouse Claridge is located on Rittenhouse Square. Move into your new home as early as October 20, 2022!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to shopping, dining, and more! Go grocery shopping at the Rittenhouse Market, Venditore by Giordano, Trader Joe's, Giant, Target, Di Bruno Bros., Aldi, Reading Terminal Market, Giant Heirloom Market, Whole Foods, or Sprouts. Browse the books at Barnes & Noble. Shop at the retail stores on Rittenhouse Row such as Anthropologie, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, gorjana, Paper Source, Philadelphia Runner, Allbirds, The Dr. Martens Store, Brooklinen, Vince, Urban Outfitters, rag & bone, Theory, L'Occitane en Provence, and Marine Layer. Have breakfast, bruch, lunch or dinner at Rouge, Devon, Parc, Barclay Prime, Pietro's, Restaurant Aleksandar, Pizzeria Vetri, Marathon on the Square, a.kitchen, HipCityVeg, The Love, Via Locusta, and Veda. Savor a cup of coffee at La Colombe, Ultimo, Vibrant, Alchemy, Nook Bakery & Coffee Bar, Elixr, K'Far, and Di Bruno Bros. Savor scoops of gelato from Gran Caffe L'Aquila. Indulge in French ice cream at nearby Van Leeuwen. Try the Rittenhouse Churro at El Merkury. Stroll across the park and then grab a French baguette at Metropolitan Bakery. Indulge in a decadent Sunday brunch at Green Eggs. Relax with a manicure or pedicure at Philly Nails Bar. Catch a show at one of the many nearby theaters. Wander around the Mütter Museum. Shop at the weekly farmer's market every Saturday and Tuesday from 9:00 AM to 2:00 PM. There is so much to do in this area!\nCommunity Amenities:\n* High-rise building on Rittenhouse Square\n* 8,000 square foot resident lounge with free wifi\n* Top-of-the-line fitness center with park view\n* Sauna\n* Pet-friendly community complete with a dog spa! Please note that certain restrictions apply.\n* Fitness\/yoga studio\n* Package lockers by Luxer One\n* Bike storage in the attached parking garage\n* Nightly guest suites for the family and friends of current residents\n* Elevator building with 24\/7 front door attendant and concierge desk staff\n* 24\/7 maintenance\n* Laundry room on every floor\n* Larger laundry facility on the 3rd floor\n* Attached valet parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Unfurnished one bedroom one bathroom apartment home on 9th floor\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* White kitchen cabinets\n* Granite kitchen countertops\n* Renovated bathroom\n* Neutral carpet\n* Large mainly south-facing windows with Chancellor Street view\n* One west-facing window with park view\n* All utilities included (except cable and internet)\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 915 is still listed under the Warhol floor plan! Please make an appointment to tour with Michelle or Gabby using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com 24\/7. We welcome you to tour your new home in person. Live virtual tours in Zoom are also available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 22 month lease term.\n2-22 month lease terms available!\n* Rental rates, availability, and apartment home features are subject to change without notice. *\nWelcome home!","num_images":24,"lat":39.949786,"lng":-75.17056,"attrs":"['1BR \/ 1Ba', '575ft2', 'available oct 20', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T10:53:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545901253.html","post_id":7545901253,"result_date":"2022-10-15T15:06:16.000Z","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #2\nTHREE BEDROOM\nTHREE BATH\nFURNISHED\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":11,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:29:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545903140.html","post_id":7545903140,"result_date":"2022-10-15T14:59:33.000Z","title":"Adorable 1 br home up for rent","description":"Adorable, SPACIOUS One Bedroom Condo in Valley Stream of Chesterbrook. Neutral decor throughout, fresh paint, updated kitchen and bathroom and a large patio overlooking open space. WASHER\/DRYER in-unit .Assigned parking space plus guest parking areas. FANTASTIC LOCATION!! Easy access to the walking\/bike trail, access to Routes 252, 202, and the PA Turnpike. Just minutes to King of Prussia, Wegmans, Trader Joe's, Valley Forge Park and a train ride to Philadelphia. TWO POOLS plus tennis courts, playgrounds, and Wilson Farm Park just steps away.\nNo smoking allowed. 650+ credit score and proof of income required.","num_images":6,"lat":40.0612,"lng":-75.3999,"attrs":"['1BR \/ 1Ba', '1146ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:33:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545907721.html","post_id":7545907721,"result_date":"2022-10-15T14:57:13.000Z","title":"1 Bedroom Apartment Home on Rittenhouse Square, Gym, Near Coffee Shops","description":"The 575 square foot Warhol one bedroom one bathroom apartment home at 414 is available for lease at this moment! This home on the 4th floor features large windows that mainly face east for morning sunshine and afternoon shade and have a view of Chancellor Street including the loading dock. One window in the bedroom area faces south and has a view of Chancellor Street. This renovated kitchen is nice with its white cabinets and granite countertops. This kitchen is fully-equipped with a dishwasher, disposal, microwave, and gas stove. The renovated bathroom tile is white. This home has wood floors. The Rittenhouse Claridge is located on Rittenhouse Square. Move into your new home immediately!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to shopping, dining, and more! Go grocery shopping at Venditore by Giordano, Sue's Produce Market, the Rittenhouse Market, Trader Joe's, Giant, Giant Heirloom Market, Target, Di Bruno Bros., Aldi, Sprouts, Whole Foods, and Reading Terminal Market. Browse the books at Barnes & Noble. Shop at the retail stores on Rittenhouse Row such as Anthropologie, Bella Turka, Tselaine, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, gorjana, Paper Source, The Dr. Martens Store, Philadelphia Runner, Allbirds, Bluemercury, Scotch & Soda, Vince, and Theory. Relax with a manicure or pedicure at Philly Nails Bar or Nail Spa Bar. Dine out at Rouge, Devon, Parc, Barclay Prime, Pietro's, Restaurant Aleksandar, Pizzeria Vetri, Luke's Lobster Rittenhouse, Bottega Rittenhouse, Tria Cafe Rittenhouse, a.kitchen, Spice Finch, HipCityVeg, The Love, Via Locusta, and Veda. Savor a cup of coffee at Elixr, La Colombe, K'Far Cafe, Ultimo, Vibrant, Alchemy, Bluestone Lane, Di Bruno Bros, Gran Caffe L'Aquila, and Nook Bakery & Coffee Bar. Savor scoops of gelato from Gran Caffe L'Aquila. Indulge in ice cream at Van Leeuwen. Stroll across the park and then grab a loaf of French Table at Metropolitan Bakery. Catch a show at one of the many nearby theaters. Wander around the Philadelphia Museum of Art. Shop at the weekly farmer's market every Saturday and Tuesday from 9:00 AM to 2:00 PM. There is so much to do in this area!\nCommunity Amenities:\n* High-rise building on Rittenhouse Square\n* 8,000 square foot resident lounge with free wifi\n* Top-of-the-line fitness center with park view\n* Fitness\/yoga studio\n* Sauna\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Package lockers by Luxer One\n* Bike storage in the attached parking garage\n* Nightly guest suites for the family and friends of current residents\n* Elevator building with 24\/7 front door attendant and 24\/7 concierge at the front desk\n* 24\/7 on-site maintenance\n* Laundry room on every floor\n* Larger laundry facility on the 3rd floor\n* Attached valet parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Unfurnished one bedroom one bathroom apartment home on 4th floor\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* White kitchen cabinets\n* Granite kitchen countertops\n* Renovated bathroom\n* Wood floors\n* Large mainly east-facing windows with Chancellor Street view\n* One south-facing window with Chancellor Street view\n* All utilities included (except cable and internet)\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 414 is still listed under the Warhol floor plan! Please make an appointment to tour with Michelle or Gabby using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com 24\/7. We welcome you to tour your new home in person. Live virtual tours in Zoom are also available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 22 month lease term.\n2-22 month lease terms available!\n* *Rental rates, availability, and apartment home features are subject to change without notice.* *\nWelcome home!","num_images":24,"lat":39.94977,"lng":-75.17056,"attrs":"['1BR \/ 1Ba', '575ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T10:44:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545907720.html","post_id":7545907720,"result_date":"2022-10-15T14:57:13.000Z","title":"2 bed\/2bath Available Soon!","description":"Balmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-15T10:44:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545905508.html","post_id":7545905508,"result_date":"2022-10-15T14:54:03.000Z","title":"2 bed\/2bath Available Soon!","description":"Balmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-15T10:39:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545909810.html","post_id":7545909810,"result_date":"2022-10-15T14:53:02.000Z","title":"3 Bedroom house","description":"3 Bedroom House\n1 Bathroom\nFront Porch\nFront yard\nHardwood Floors throughout the house\nClose to public transportation\nLOCATION: 56 N Hirst Street, Philadelphia PA 19139 (West Philadelphia)","num_images":6,"lat":39.9612,"lng":-75.2303,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:49:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545908529.html","post_id":7545908529,"result_date":"2022-10-15T14:50:02.000Z","title":"2 Bedroom House","description":"2 BEDROOM HOUSE\nRENOVATED\nWOOD FLOOR\nNEW KITCHEN\nNEW BATHROOM\nBACKYARD\nLOCATION: 3462 LEE ST 19134 (KENSINGTON)","num_images":12,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:46:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545907937.html","post_id":7545907937,"result_date":"2022-10-15T14:48:44.000Z","title":"Updated One Bedroom Rental with views of the green roof!","description":"Welcome home to the Philadelphian! Located in the beautiful and desirable Art Museum\/Fairmount neighborhood. Updated One Bedroom Rental with views of the green roof. Features: Remodeled kitchen with Corian countertops, plenty of cabinets, flooring & appliances with added bonus- flat screen TV! Custom window treatments dress up the living, dining and bedroom. Hardwoods and abundant closet space throughout this spacious 1160 square foot unit. Conveniently located on same floor as the pool\/fitness center! Rent covers all utilities, basic cable, the fitness center & pool, 24HR concierge and shuttle to Center City. Additional fee for valet parking. Occupancy December 1. Move right in!\n2401 Pennsylvania Ave #3B22","num_images":5,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '1160ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T10:44:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545902471.html","post_id":7545902471,"result_date":"2022-10-15T14:46:59.000Z","title":"Renovated 1 BR Apt Home on Rittenhouse Square, Guest Suites, Sauna","description":"The home at 315 is available for lease at this moment! This 575 square foot Warhol one bedroom one bathroom apartment home on the 3rd floor features large windows that mainly face south and have a view of Chancellor Street. One window in the living and dining room area faces west for morning shade and afternoon sunshine and has a park view. This renovated kitchen is nice with its white cabinets and granite countertops. This kitchen is fully-equipped with a dishwasher, disposal, microwave, and gas stove. The renovated bathroom tile is white. This home has neutral carpet. The Rittenhouse Claridge is located on Rittenhouse Square. Move into your new home immediately!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to shopping, dining, and more! Go grocery shopping at the Rittenhouse Market, Sue's Produce Market, Venditore by Giordano, Trader Joe's, Giant, Target, Di Bruno Bros., Aldi, Reading Terminal Market, Giant Heirloom Market, Whole Foods, or Sprouts. Browse the books at Barnes & Noble. Shop at the retail stores on Rittenhouse Row such as Anthropologie, Lagos, Tumi, Lovesac, Athleta, lululemon, Indochino, Philadelphia Runner, gorjana, Paper Source, J. Crew, Philadelphia Runner, Allbirds, The Dr. Martens Store, Brooklinen, Scotch & Soda, Vince, Urban Outfitters, Theory, L'Occitane en Provence, and Marine Layer. Experience fine dining at Rouge, Devon, Parc, Barclay Prime, or Pietro's. Savor a cup of coffee at La Colombe, Vibrant, Ultimo, Alchemy, Elixr, and Di Bruno Bros. Savor scoops of gelato from Gran Caffe L'Aquila. Indulge in French ice cream at nearby Van Leeuwen. Stroll across the park and then grab a French baguette at Metropolitan Bakery. Catch a show at one of the many nearby theaters. Wander around the Rodin Museum. Relax with a manicure or pedicure at Philly Nails Bar, Spa Nail Bar, or Coco Blue Spruce. Shop at the weekly farmer's market every Saturday and Tuesday from 9:00 AM to 2:00 PM. There is so much to do in this area!\nCommunity Amenities:\n* High-rise building on Rittenhouse Square\n* Nightly guest suites for the family and friends of current residents\n* Sauna\n* Package lockers by Luxer One\n* Top-of-the-line fitness center with park view\n* 8,000 square foot resident lounge with free wifi\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Fitness\/yoga studio\n* Bike storage in the attached parking garage\n* Elevator building with 24-hour front door attendant and 24-hour concierge at the front desk\n* 24\/7 maintenance\n* Laundry room on every floor\n* Larger laundry facility on the 3rd floor\n* Online Resident Portal for Rent Payments, Maintenance Requests, and More\n* Attached valet parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Unfurnished one bedroom one bathroom apartment home on 3rd floor\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* White kitchen cabinets\n* Granite kitchen countertops\n* Renovated bathroom\n* Neutral carpet\n* Large mainly south-facing windows with Chancellor Street view\n* One west-facing window with park view\n* All utilities included (except cable and internet)\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 315 is still listed under the Warhol floor plan! Please make an appointment to tour with Michelle or Gabby using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com 24\/7. We welcome you to tour your new home in person. Live virtual tours in Zoom are also available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 22 month lease term.\n2-22 month lease terms available!\n* * *Rental rates, availability, and apartment home features are subject to change without notice.* * *\nWelcome home!","num_images":24,"lat":39.949819,"lng":-75.170603,"attrs":"['1BR \/ 1Ba', '575ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T10:31:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545897468.html","post_id":7545897468,"result_date":"2022-10-15T14:44:48.000Z","title":"Beautiful one bedroom, one bath home at the Ellington!","description":"WELCOME HOME to this beautiful one bedroom, one bath home at the Ellington! The living and dining areas offer dramatic ten foot high ceilings, Brazilian cherry hardwood floors, and oversized windows that fill the home with natural light. The kitchen with breakfast bar features Poggenpohl cabinets, stainless steel appliances, Kohler fixtures, and Capao Bonito granite countertops. The bedroom features a double door closet and is set across from the spacious spa-like bathroom, which boasts White Gioia marble tile flooring, chrome fixtures, and a ceramic sink with storage vanity. Included in the rent are central air and heating, water and sewer, 24 hour concierge, private fitness center, and club room. Valet parking is available next door in a public garage. Perfectly situated in the Rittenhouse and Avenue of the Arts area, this home is steps away from fine dining, one-of-a kind shopping, world-renowned cultural destinations and exciting nightlife. APARTMENT ALSO AVAILABLE PARTIALLY FURNISHED AT NO ADDITIONAL COST. ** Photos from another unit with identical floorplan\n1500 Chestnut St #8E","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '759ft2', 'available now', 'furnished', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T10:19:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545906025.html","post_id":7545906025,"result_date":"2022-10-15T14:44:19.000Z","title":"3 Bedroom house","description":"3 BEDROOM\n1 BATHROOM\nCorner House Very Nice\nWood floor\nRemodeled Kitchen\nRemodeled Bathroom\nFRESH PAINT\nNICE YARD SIZE\nNear School\n6934 Garman St. Philadelphia PA  19142 (Southwest Philly)","num_images":7,"lat":39.9223,"lng":-75.2338,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:40:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545906002.html","post_id":7545906002,"result_date":"2022-10-15T14:44:16.000Z","title":"Beautiful 2bed\/1bath 800 sqft apartment!","description":"Location, location, location. Welcome to 2333 Catharine St. Unit 4 is a beautiful 2bed\/1bath 800 sqft apartment located in the heart of Graduate Hospital. Each unit contains hardwood floors, updated appliance package & granite countertops. There is a brand new washer & dryer in the basement. This apartment is in close proximity to many bars, restaurants and public transportation. CHOP & UPENN are within walking distance\/a quick bike ride & you have direct access to i76.\n2333 Catharine St #4","num_images":4,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '800ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:40:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545904594.html","post_id":7545904594,"result_date":"2022-10-15T14:40:56.000Z","title":"Renovated Studio 50th & Arch","description":"Renovated bright studio apartment on second floor of apartment building. New flooring, paint, cabinets, vanity & stainless steel appliances. $775\/month, tenant pay own PECO meter. First, last & secuirty due before move in. $2,325 due before move in. No prior evictions. If interested, please attached pay stubs & proof of funds to email reply. 10\/20 move in date.","num_images":5,"lat":39.9612,"lng":-75.2303,"attrs":"['0BR \/ 1Ba', '500ft2', 'available oct 20', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:36:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545903696.html","post_id":7545903696,"result_date":"2022-10-15T14:39:00.000Z","title":"Enjoy the best of city life, steps from various museums!","description":"Live in Logan Square, a Philadelphia neighborhood steeped in art and culture. Enjoy the best of city life, steps from various museums, parks, restaurants, and other conveniences. Just minutes from the Schuylkill River trail, I-76, and Market St transportation west to Chop and the universities and east to City Hall and beyond. Unit #803 is a sun-filled open concept 1-bedroom unit facing west towards the river. Features include warm-tone laminate wood flooring throughout and a custom built modern kitchen with high-end appliances, peninsula island, and walk-in pantry. The bedroom fits a King-bed comfortably and includes a large closet with custom shelving. In-unit laundry is located next to a modern bathroom with tub. Last but not least, one storage locker is provided for added convenience. This building has several parking options within walking distance. Tenant pays electric; water included in rent. One pet under 30lbs permitted at landlord's discretion. Live in the center of it all and experience Philadelphia as it's truly meant to be. Schedule your appointment today!\n2201 Cherry St #803","num_images":5,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '948ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:35:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545899187.html","post_id":7545899187,"result_date":"2022-10-15T14:37:08.000Z","title":"Beautiful 1 bedroom Ranch with 1 full bath","description":"Beautiful 1 bedroom Ranch with 1 full bath ,fireplace and garage. Sliders from the living rm. and Primary bed room that lead out to a fenced in yard and patio. Wood floors .Updated kitchen(S.S. Appliances).","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-15T10:24:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545892901.html","post_id":7545892901,"result_date":"2022-10-15T14:36:15.000Z","title":"$500 Security Deposit - Limited Time Move In Special!!!!","description":"$500 Security Deposit - Limited Time Move In Special!!!! The Society Hill Building is a beautiful mid-rise community located in the Society Hill\/Washington Square neighborhood of Center City. This building features spacious 1 bedroom 1 bath apartments, overlooking scenic Washington Square Park. The Society Hill Building is within walking distance of historic Old City as well as close to all forms of public transportation. 10 foot high ceilings, controlled access keypad entry, hardwood floors in some units, abundant natural light, dishwasher, microwave, high-efficiency individually controlled A\/C and heat. Laundry on each floor and pet-friendly! Brand new windows in all apartments. Pictures are of a similar unit.\n701 Sansom St #504","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '630ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T10:08:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545883027.html","post_id":7545883027,"result_date":"2022-10-15T14:29:23.000Z","title":"Enjoy ONE MONTH FREE with a application submitted by 10\/15\/2022!","description":"Enjoy ONE MONTH FREE with a application submitted by 10\/15\/2022! Start this fall in this Philadelphia Chapter Landmark Property originally designed in 1951! Enter through the spacious remodeled lobby where you are greeted by a 24 hour front desk attendant. The property features a fitness center on the lower level along with common areas where you can relax and watch TV or catch up with friends with a game of pool. There's also a place to store your bike in the designated bike room. Looking for outdoor space? There's a roof deck that offers panoramic views of the city! The views are simply breathtaking! This large north and east facing corner Two bedroom has beautiful hardwood parquet floors and a view you will LOVE! The living area and bedrooms are spacious and have tons of closet space! SUPER Pet Friendly!! Come see what all the buzz is about at The Parkway House and everything that living in the Art Museum area has to offer!! ***Pictures featured are of the new model unit.***\n2201 Pennsylvania Ave #813","num_images":5,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T09:42:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545894168.html","post_id":7545894168,"result_date":"2022-10-15T14:28:37.000Z","title":"Gorgeous Duplex 1 bedroom 1 bathroom apartment in Philadelphia $500.","description":"Gorgeous Duplex 1 bedroom 1 bathroom apartment in Philadelphia $500. New redwood landing. Includes fridge and stove. Has a built in kitchen nook and built in shelving. New waterproof flooring. Newer windows and fresh paint. Includes water and trash. Don't reply with craigslist mail, Just contact me: sarah65895 (at)gmailcom\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\nWhile the living space is clean and fully functional the outdoor space is what sets this home apart. There are both front and rear decks\/patios with several \"nooks\" for casual seating around the beautifully landscaped property. You can enjoy an unobstructed view of the beach and beautiful sunsets from either the covered patio or the Adirondack chairs along the break-wall. There are two grills; one is charcoal and the other is propane (renters bring their own tank).\nWhile the home is fantastic for hosting friends and family, this will absolutely not be a party house. This is our home. We expect people to enjoy their stay but treat the home and neighbors with the upmost respect. If you would like to discuss the specifics of this I would be happy to do so. Sorry, but no pets are permitted.\nFeel free to email with any questions or to arrange a time to see the home. We are able to show the place most weekends.\nThank you for looking! All utilities included during weekly summer rentals. Utilities TBD for monthly rentals based on length of stay..If you are interestedUp to 4 people, $150 per additional ADULT\n-2 bd, 1 ba\n-Hidden gem neighborhood\n-Trash, landscaping, 50% water\/wastewater included\n-Electricity, gas, heat, and wifi not included\n-Has a porch, fridge, and on-site laundry (not coin-operated)\n-Washer and dryer access with no additional cost in the separate basement area\n-Additional outdoor and downstairs basement storage\n-2 to 4 uncovered parking spots\n-Located near North Atherton Shopping Mall on Vairo Blvd.\n-Access to multiple CATA bus stops\n-Spacious backyard with clothesline\n-Backyard has access to Suburban Park with tennis courts, baseball field, swings, and playground equipment\n-Located near Wegman's, Trader Joes, TJ Maxx, Giant, etc.\n-4 minute drive to downtown\n-Walking distance to campus including walking trail to North Campus and the Arboretum\n-Schools nearby: Radio Park El School, Park Forest Middle School, State College Area High School\n-Credit check is required, cosigner accepted\n位于San Pablo山顶一单位Studio出租。内配浴室，厕所，厨房。全新装修首次出租，独立门口出入，通风透光，街外停车位，环境安全安静,可遥望湾区景色，hiking 可到附近Wildcat Canyon Regional Park. 大约7分钟车程到地铁站，5分钟上高速 I80, 10分钟到顺发唐人超市，15分钟到大华99超市，唐人餐馆和Costco, 20分钟到UCB 校园， 10分钟到Bio-Rad公司。月租＄1250，有意者面聊. 联系人：Sally, 电话\n","num_images":3,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'duplex', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-15T10:11:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7545896100.html","post_id":7545896100,"result_date":"2022-10-15T14:26:28.000Z","title":"Chancery Lane offers loft-style apartment!","description":"$500 Security Deposit!!! NEW FLOORS will be installed! Chancery Lane offers loft-style apartment homes with elevator, in a gated courtyard setting within historic Old City and boasts a community rooftop deck with panoramic views of the city. Beautiful large loft-style 1 bedroom apartment. Pictures are of a similar unit.\n130 Arch St #206","num_images":5,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-15T10:16:28-0400"}]