[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547345226.html","post_id":7547345226,"result_date":"2022-10-19T03:59:04.000Z","title":"2 bed\/ 2 bath Loft - Lofts 640","description":"Amazing 1413 sq ft. 2 Bedroom \/ 2 Bathroom Lofted Space available for rent starting in January 2023 (Flexible)\nApartment building is 5 blocks north of city hall, walking distance to three grocery stores, and few blocks away from the subway station\nAt Lofts 640 has indoor garage parking ($75\/month), an indoor pool and jacuzzi, a fitness center, cyber lounge, yoga studio. The property is gated with a 24\/7 front desk attendant.\nFeel free to reach out with any questions!","num_images":8.0,"lat":39.96454,"lng":-75.161419,"attrs":"['2BR \/ 2Ba', 'available jan 6, 2023', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T23:55:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547342130.html","post_id":7547342130,"result_date":"2022-10-19T03:39:06.000Z","title":"Don't wait, immediate move in","description":"This 2 bedroom, 1.5 bathroom beauty is perfect for a young couple or college roommates\n3400 Midvale was awarded 2nd place in Philadelphia’s most beautiful \/ green streets.\nGreat curb appeal, roomy and sunny. Includes the following\n• 2 bedrooms\n• 1.5 baths\n• Hardwood floors through out\n• Full bath has Jacuzzi tub, slate tile and heated floor\n• Kitchen with granite countertops, stainless steel appliances and heated floor\n• Radiator heat keeps you toasty in the winter, A\/C keeps you cool in the summer\n• Private patio in back (newly renovated)\n• Private drive in back\n• Large basement\n• Close to R6 and R8 and Philadelphia U.\n• Garage included for off street parking","num_images":16.0,"lat":40.014666,"lng":-75.190988,"attrs":"['2BR \/ 1.5Ba', '1100ft2', 'available nov 1', 'air conditioning', 'townhouse', 'w\/d in unit', 'no smoking', 'detached garage', 'rent period: monthly']","posted_date":"2022-10-18T23:35:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547338400.html","post_id":7547338400,"result_date":"2022-10-19T03:16:57.000Z","title":"424 Summit House 2\/3 Bedroom Condo","description":"Summit House Condominiums\n2\/3 Bedrooms\/Study, Updated appliances, Modern upgraded interior, Master bedroom with walk in closet, 1.5 bathrooms, 2 balconies, Full attic storage, carport with storage area, 2nd floor laundry, Pool, tennis courts, weight room, and club house access included, no pets. Nice place to live and this unit is Available.\nAvailable January 1 2023\nVery clean unit A must see, $1,750.00\nOff major road ( Rt. 3) with public transportation.\nWest Chester Area School District.\nConveniently located to Philadelphia, Wilmimgton, King of Prussia, West Chester, Exton, Great Valley, Downingtown.\nRent includes all exterior maintiance, water, condo fee, pool, tennis courts, play grounds, workout room, trash\n","num_images":24.0,"lat":39.9441,"lng":-75.5882,"attrs":"['3BR \/ 1.5Ba', '1500ft2', 'available jan 1, 2023', 'condo', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-10-18T23:12:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547335718.html","post_id":7547335718,"result_date":"2022-10-19T03:03:01.000Z","title":"Fully renovated 2 bedroom and 1 full bath Apt for rent in Philadelphia","description":"Fully renovated 2 bedroom and 1 full bath Apt for rent in Philadelphia!! This ranch features a recently updated cabinet-packed kitchen with a center island, recessed lights, and beautiful butcher block countertops with lots of natural light. Step down into the living room with hardwood floors and a large picture window that opens up to the dining area. Two bedrooms, possibility for a third. Generous closet space. The Interior is freshly painted. Sliding doors open to a spacious covered deck off of one of the bedrooms. Relax on the newer stone patio in the fenced backyard. Text number!!\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nContact me more for more listings, I am here to find the perfect fit for you. Stunning STUDIO available in luxury, full amenity building! This building has it all with stunning chef inspired kitchens, to HUGE walk in closets, and amazing state of the art amenities. Also offers a free shuttle to NY Waterway Ferry station!! ***NO BROKER FEE ***FREE SHUTTLE TO NY WATERWAY FERRY STATION ***ONLY $700 SECURITY DEPOSIT (Based on Credit) This building is conveniently located right on river road, which makes commutes to NYC a breeze with bus, and ferry options! Apartment features include: Two Exceptional finish palettes to choose from High force Chimney hood Recessed LED overhead lighting 8' Tall Storage Cabinets Stainless Steel dual convection oven Pull out pantry Huge French door Refrigerators Floor To ceiling windows European white oak solid hardwood flooring Thermostatically controlled shower with rain-style head, body jets, and hand shower Ambient LED overhead lighting Extra Large Mirrors with integrated make-up lighting Italian Floating vanity with deep storage cabinets Built in roller shades Manhattan skyline and Hudson River views High Capacity Washer and Dryers Building amenities include: Heated Pool Hott tub Private cabanas Lounging Pods Steam Room Sauna Private Terraces Wellness Center Massage Room Weight and Cardio room State of the art fitness center Juice Bar Yoga Deck Firepit Lounges Outdoor Salon with built-in seating and cafe tables Party Lounge Wine Bar room Game room Skyline overlook Rooftop Kitchen Kids play area Contact me today for more info or a private showing! Servicing all of North Jersey no broker fee luxury rentals - Fort Lee, Edgewater, Cliffside Park, West New York, Weehawken, Port Imperial, North Bergen, Secaucus, Kearny, Harrison, East Rutherford, Englewood, Hoboken, Jersey City, just to name a few!\n","num_images":4.0,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T22:59:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547333523.html","post_id":7547333523,"result_date":"2022-10-19T02:52:00.000Z","title":"3BR1.5bath Townhouse for Rent","description":"Nice and affordable 3 bedroom, 1.5bath townhouse in the Grays Ferry neighborhood, easy access to I-76, center city, super markets and restaurants, minutes to the hospital of UPenn. Required proof of income, and good rental history. Two months security deposits and first month rent to move in. Tenant pays for all utilities: Electric, gas and water. No pets. contact: 215-eight69-98zero9","num_images":7.0,"lat":39.933227,"lng":-75.189688,"attrs":"['3BR \/ 1.5Ba', 'available nov 1', 'townhouse', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T22:48:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547322154.html","post_id":7547322154,"result_date":"2022-10-19T02:11:42.000Z","title":"Gorgeous Fishtown 3BR\/2.5 Expansive Entertainer Featuring Panoramic","description":"Gorgeous Fishtown home with gated parking for 2 cars! 3 bedrooms, 2.5 baths, finished basement and parking directly behind the house that can fit 2 cars! This townhome offers 4 levels of living and a roof deck with very nice artificial turf with panoramic views of the city. Just steps from Girard Avenue and all that Fishtown has to offer. A bright front entrance welcomes you into the living room which features brilliant wood floors that carry throughout the entire house. An open floor plan on the main floor is great for entertaining and family gatherings - the living room leads into a large kitchen which showcases a long island with seating, stainless appliances and tons of cabinet space! Upstairs you'll find two generously sized bedrooms with plenty of closet space and big windows for glorious natural light. This floor also has a full bathroom in the hallway. On the third floor is the AMAZING master bedroom suite - spacious bedroom with a hallway of closets and big windows. You'll enjoy waking up on Monday mornings as you get ready in your en suite master bathroom with oversized tiled shower, double sink vanity and sunny morning views! Don't miss the finished basement as an added space for those who are working from home, complete with a half bathroom and laundry room with full size w\/ d and wash sink! The location can't be beat - walk to your favorite restaurants, coffee shops and boutiques, and jump on Girard Ave or 95 to make your commute a breeze!\nPlease Contact Me: Cheryl! “ :  show contact info\nTenant(s) will be responsible for monthly rent, gas\/electric\/water and cable\/internet.\n","num_images":12.0,"lat":39.970798,"lng":-75.125384,"attrs":"['3BR \/ 2.5Ba', '2188ft2', 'available now', '\\nmonday 2022-10-24\\n', '\\ntuesday 2022-10-25\\n', '\\nwednesday 2022-10-26\\n', 'application fee details: Credit-Criminal\/Background, Evictions Check Required!', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T21:54:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547320235.html","post_id":7547320235,"result_date":"2022-10-19T02:08:12.000Z","title":"The expansive primary bedroom veers off the main hallway and features","description":"An entrance foyer leading to the main living area is bordered by a large coat and storage closet and a convenient powder room. The expansive primary bedroom veers off the main hallway and features high ceilings, a stylish glass transom window, and an exposed brick accent wall. The en suite boasts light teak colored cabinetry and a warm toned ceramic tile shower\/tub surround. A walk-in closet completes this space with ample storage.\nA stunning light-filled great room accented with three oversized windows overlooks historic Church Street. The entire west wall is comprised of rustic exposed brick, a nod to historic roots and a characteristic of many buildings in this pre-industrial era neighborhood. Lovely wood floors are a perfect accent throughout the space. The open floor plan encompasses a spacious U-shaped kitchen area that is a handsome compliment and asset to the gourmand minded cook. A stunning Bertazzoni range with a matching hood is delightful for cooking, while granite counters crowning custom-painted cabinetry act as an eating area where stools sit on one side and ample prep space on the other.\n","num_images":13.0,"lat":39.950314,"lng":-75.142012,"attrs":"['1BR \/ 1Ba', '900ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T21:46:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547314464.html","post_id":7547314464,"result_date":"2022-10-19T02:03:26.000Z","title":"Spacious 1Br w\/ washer & dryer, refrig near International Airport !","description":"This apt. was 100% NEW several years ago. It is in A-1 shape and ready to move in on Jan 20th – Feb 1st.\nFREE SHARED LAUNDRY. The apartment includes a raised panel maple kitchen with new counter tops, a range & a refrig, and a ceramic tile floor. Modern bath. Newer windows, trim and doors t\/o. Wall to wall carpet in the BR and wide plank click floors in the LR. Gas heat, hot water and cooking.  shared washer & dryer in the basement.\nOnly $839.00\/MO., plus gas and electricity. 2 months' security and first month's rent are required to move. Cats are OK. Dogs are ok.\nConvenient to Southwest Philadelphia, Elmwood, Penrose, Eastwick, Cobbs Creek, West Philadelphia, Island Ave., Lindbergh Blvd. Philadelphia International Airport, I-95, the Philadelphia Post Office and Center City. Also a short distance from Darby and Yeadon.\nSet an Appointment today; Contact for Tours\/Qs:   Sofia -  ⸑⸑ show contact info\nThanks for finding us.\n","num_images":18.0,"lat":39.916017,"lng":-75.234073,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', '\\nthursday 2022-10-20\\n', '\\nfriday 2022-10-21\\n', '\\nsaturday 2022-10-22\\n', 'air conditioning', 'application fee details: Background\/Criminal Record + Credit Check is required!', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-10-18T21:21:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547309426.html","post_id":7547309426,"result_date":"2022-10-19T01:05:56.000Z","title":"Contemporary 2BR with Eat-In Kitchen & Optional Furniture","description":"2 Bedrooms\n(1 queen sized bedroom & 1 twin sized bedroom\n1 Bathroom with Bathtub\nPolished Original Hardwood Floors\nLarge Kitchen\nLiving Room\nDeep Closets w\/ Mirror Sliding Doors\nShared, Covered Porch\nProfessionally Landscaped front Yard\n*** optional furniture (all or none)\nWalking Distance from Temple Hospital, Broad Street, & SEPTA Broad Street Line and other Major Public Transportation.\n$49 Application Fee\nFirst Month’s Rent & Full Month’s Rent Security Deposit\nSuccessful Applicants will have:\n- 3x the rent in monthly, recurring income\n- No evictions\n- No repossessions\n- No money owed to utility companies\n- No bankruptcy\n- decent payment history\n*** We strongly suggest including your mobile number in communications regarding this listing.\n","num_images":17.0,"lat":40.004202,"lng":-75.148644,"attrs":"['2BR \/ 1Ba', 'available nov 1', 'EV charging', 'application fee details: $49', 'cats are OK - purrr', 'furnished', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T21:01:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547301979.html","post_id":7547301979,"result_date":"2022-10-19T00:39:09.000Z","title":"One-Bedroom Apartment","description":"2-story Row Duplex, 1-Bedroom Apt. Located on the 1st floor. Has a front porch ,Laminate wood flooring living Room, laminated wooden floor Bedroom, ceramic tile floor full Bath with a tub\/shower, ceramic tile floor kitchen, unfinished basement with Private washer\/Dryer access. Everything is Electric no high gas bills. Landlord pays water. $800\/month plus electric and all associated utilities. First, last, and 1-month security deposit to move in under normal circumstances. Non-refundable $75\/application processing fee for 1st adult and any additional adult over the age of 18 yrs $50.00 Proof of documentable, stable income is a must no exceptions. On street parking only, near public transportation and famous 52nd and Market Street and Malcolm X Park. Application waived to first accepted\/qualified applicant make my house your home. Cats ok have to be  spayed\/neutered. Absolutely no dogs of any kind. Serious  applicants only can contact me at  show contact info\nask for Mr. White.\nFYI: THERE IS NO OPEN HOUSE. ALL SHOWING ARE DONE THROUGH APPOINTMENT ARE\/IS BY INDIVIDUAL\n","num_images":0.0,"lat":39.9617,"lng":-75.2253,"attrs":"['1BR \/ 1Ba', '500ft2', 'available nov 15', '\\ntuesday 2022-11-15\\n', 'EV charging', 'application fee details: Non-Refundable $75\/pp', 'cats are OK - purrr', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T20:35:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547291108.html","post_id":7547291108,"result_date":"2022-10-19T00:04:59.000Z","title":"Beautiful 1 bedroom 1 full bath Apt for rent in Philadelphia !!","description":"Beautiful 1 bedroom 1 full bath Apt for rent in Philadelphia !! Amenities included: balcony, central air, central heat, dishwasher, stainless steel appliance, and washer dryer. No Utilities included. Its pet friendly\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n. Contact: Vishal Moorjani | Keller Williams Realty PHONE -  s\nContact me more for more listings, I am here to find the perfect fit for you. Stunning STUDIO available in luxury, full amenity building! This building has it all with stunning chef inspired kitchens, to HUGE walk in closets, and amazing state of the art amenities. Also offers a free shuttle to NY Waterway Ferry station!! ***NO BROKER FEE ***FREE SHUTTLE TO NY WATERWAY FERRY STATION ***ONLY $500 SECURITY DEPOSIT (Based on Credit) This building is conveniently located right on river road, which makes commutes to NYC a breeze with bus, and ferry options! Apartment features include: Two Exceptional finish palettes to choose from High force Chimney hood Recessed LED overhead lighting 8' Tall Storage Cabinets Stainless Steel dual convection oven Pull out pantry Huge French door Refrigerators Floor To ceiling windows European white oak solid hardwood flooring Thermostatically controlled shower with rain-style head, body jets, and hand shower Ambient LED overhead lighting Extra Large Mirrors with integrated make-up lighting Italian Floating vanity with deep storage cabinets Built in roller shades Manhattan skyline and Hudson River views High Capacity Washer and Dryers Building amenities include: Heated Pool Hott tub Private cabanas Lounging Pods Steam Room Sauna Private Terraces Wellness Center Massage Room Weight and Cardio room State of the art fitness center Juice Bar Yoga Deck Firepit Lounges Outdoor Salon with built-in seating and cafe tables Party Lounge Wine Bar room Game room Skyline overlook Rooftop Kitchen Kids play area Contact me today for more info or a private showing! Servicing all of North Jersey no broker fee luxury rentals - Fort Lee, Edgewater, Cliffside Park, West New York, Weehawken, Port Imperial, North Bergen, Secaucus, Kearny, Harrison, East Rutherford, Englewood, Hoboken, Jersey City, just to name a few!","num_images":3.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T20:00:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547287367.html","post_id":7547287367,"result_date":"2022-10-18T23:53:24.000Z","title":"spacious 3rd floor with 2 bedrooms and 1 bathroom available now","description":"Live at N 17th St #3 a spacious 3rd floor with 2 bedrooms and 1 bathroom available now. This home features a bright and airy living space with hardwood flooring. The kitchen features plenty of cabinet space. The bedrooms are expansive and feature carpeting. Pets are welcome! Text \/call  show contact info\n) for more information to schedule move in date..","num_images":9.0,"lat":40.0118,"lng":-75.1456,"attrs":"['2BR \/ 1Ba', '800ft2', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T19:49:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547278082.html","post_id":7547278082,"result_date":"2022-10-18T23:24:07.000Z","title":"Beautiful 3 Bed Home in Mantua","description":"Beautiful 3 Bed Home in MantuaKHP Property Management | Philadelphia  |   show contact info\n4123 Ogden St, Philadelphia, PA 19104-1569$1,450.00 \/ Month- Description:To schedule a showing, submit an application or for our leasing criteria, please visit www.KHPPM.com\/leasing.This beautiful 3 bed home is located in the Mantua part of Philadelphia. 4123 Ogden St, Philadelphia, PA 19104 has 1,084 sq.ft. which offers beautiful natural light and inviting living space. This gem is located in a great community near shopping, public transportation, parks and schools. 4123 Ogden St will not be on the market for long!This home features both a crisp, clean bathroom and a modernized kitchen. Some of the updates include: fresh paint, hardwood floors, granite counter tops with updated kitchen appliances. This residence also has central AC, central heat and laundry on the premises.This property has a friendly and reliable management team in place to respond promptly to our residents.Resident pays for water, gas and electric where applicable. This is a pet friendly home for approved animals only. We require a non-refundable administrative fee of $200 for the first pet, and $100 for an additional pet, PLUS a non-refundable monthly rent of $10 per pet and $300K in Renters Insurance for animals over 25lbs. No animals over 25lbs are permitted in multifamily units. In order to qualify, resident must gross a monthly income of three and a half times the monthly rent. TO MOVE IN, resident must pay first & last month's rent, as well as a security deposit, all in certified funds.Please visit our website as we may have a 3D virtual tour available for viewing. If you are interested, you may also contact us and we'll provide you the link of the 3D scan.- Details:Type: HouseBedrooms: 3Pets: YesTotal Area: 1084 Sq FtBathrooms: 2.0Smoking: NoNumber of Floors: 2- Terms:Deposit: $2,900.00Min. Lease:12 MonthsAvailable:10\/18\/2022Other Charges:Water, Electricity, Gas - Building Amenities: Granite Counter Tops Pets Allowed Air Conditioning New Rehab! Washer\/Dryer In Unit Hardwood Floors Front PorchKHP Property Management show contact info\n","num_images":15.0,"lat":39.969093,"lng":-75.207053,"attrs":"['3BR \/ 2Ba', '1084ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T19:20:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547274775.html","post_id":7547274775,"result_date":"2022-10-18T23:14:35.000Z","title":"Great 1 bedroom available now at 3412 Spring garden!","description":"Great location! Cozy 1 bedroom available after September 15th. Laundry room is in the building. Tenant pays for all utilities. 1 year lease. $50 application fee. 3 months to move in. Must to have a good credit score and monthly income 3 times rent.\nCall Alena for showing at  show contact info","num_images":10.0,"lat":39.956707,"lng":-75.223538,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T19:10:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547260505.html","post_id":7547260505,"result_date":"2022-10-18T22:45:55.000Z","title":"Available Now! Massive 2 Bedroom 1 Bathroom Duplex Condo Unit","description":"2nd floor 2 bedroom with a den at 40th\/Spring Garden with private entrance. Full kitchen with cherry cabinets, granite counter-tops, fridge, range, dishwasher, garbage disposal, and lots of storage! Expansive hardwood floors carry throughout the apartment. The open floor-plan living room\/kitchen in the front of the apartment is immediately welcoming. A full hall bath comes complete with under-sink vanity storage and space for additional shelving units, perfect for towels, toiletries, and additional necessities. Main bedroom is in the back of the apartment, and includes the washer\/dryer and large closet.\nCall \/ Text – Email to make appointment!  show contact info\nBlocks from the Market-Frankford Line, SEPTA Bus and Trolley Lines, UPenn & Drexel Hospitals and Campuses, and I-76\/I-95 access points.\nRequirements are first\/last\/deposit, credit score above 550, past 2 years of good rental history. 2 pet could be considered.\nOwner pays water, sewer, and trash\nFeatures:\n- Full hall bath\n- Expansive hardwood floors\n- Granite counter-tops\n- Cherry cabinets\n- Large closet\n- Full kitchen\n","num_images":11.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T18:30:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547263451.html","post_id":7547263451,"result_date":"2022-10-18T22:42:50.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547254856.html","post_id":7547254856,"result_date":"2022-10-18T22:38:30.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547259999.html","post_id":7547259999,"result_date":"2022-10-18T22:33:35.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547238495.html","post_id":7547238495,"result_date":"2022-10-18T22:14:40.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547246135.html","post_id":7547246135,"result_date":"2022-10-18T21:58:00.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547040813.html","post_id":7547040813,"result_date":"2022-10-18T15:42:50.000Z","title":"Upgraded & Fabulous 3 bed 2 bath home with rad kitchen & more!","description":"Beautifully renovated 3 bedroom 2 bathroom home in the heart of  Philadelphia. Near  of Goodwin College of Professional Studies. Close to public transit, highways, convenience stores, parks, grocery stores and more. This is a great convenient location for anyone.\nThe home itself is a 2 story single family home with 3 bedrooms, 2 bathroom and a full clean and dry basement. The main floor offers hardwood floors, tall ceilings, and good natural light. The kitchen is fantastic with all wood cabinets, granite counter tops and full size stainless steel appliances, simply beautiful. Through the kitchen is a door that leads to a private little deck perfect for a BBQ or dining outside. The basement is offers additional storage, a full size washer and dryer, and access to the rear small street which you can park a car outside of this house.\nThe 2nd floor offers 3 bedrooms and a gorgeous 3 piece tiled bathroom. A must see home!!\nHome boasts:\n– Central heat\n– Hardwood floors\n– New windows\n– Patio\n– Full basement\n– Full size appliances\n– Laundry\n– Great location\nIf you are interested please contact Johan  today for more information and showing!! message with your number Johan  will call you.\nThank You.","num_images":4.0,"lat":39.9597,"lng":-75.2024,"attrs":"['3BR \/ 2Ba', 'application fee details: $10 Application Fee for Credit Check', 'broker fee details: Free Broker fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', \"listed by: Realtor fee equal to one month's rent\", 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:02:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547043161.html","post_id":7547043161,"result_date":"2022-10-18T15:40:11.000Z","title":"Affordable  3 bedroom 2 full bathroom home","description":"Nestled on a beautiful yet quiet street youâll find one of Philadelphiaâs true gems. This affordable, yet move-in ready 3 bedroom 2 full bathroom home is now available. Immediately upon arrival, youâll be wowed by the curb appeal of the exterior of this home.  On the second level, you will find three well sized bedrooms including a large master with dual closets and a contemporary bathroom with beautiful new tiling. Downstairs you will find a fully finished basement with an abundance of room and a full bathroom.The exterior of the home also features private off street parking. And to tie everything together, this property is very conveniently located to major transportation routes including 309, Old York Rd, and I-76. Donât wait, take advantage of this aggressively priced home (and use one of those low money down financing programs) to buy this one today! FOR A FASTER RESPONSE PLEASE EMAIL WITH THE NUMBER","num_images":6.0,"lat":40.028042,"lng":-75.15425,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:07:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547054777.html","post_id":7547054777,"result_date":"2022-10-18T15:33:39.000Z","title":"☎LUXURY STUDIO! EASY NYC COMMUTE! NO BROKER FEE!","description":"Contact: Vishal Moorjaw contact ini | Keller Williams Realty\nPHONE - ( 8 8 8 ) 9 0 2 3 4 1 6\nContact me more for more listings, I am here to find the perfect fit for you.\nStunning STUDIO available in luxury, full amenity building!\nThis building has it all with stunning chef inspired kitchens, to HUGE walk in closets, and amazing state of the art amenities. Also offers a free shuttle to NY Waterway Ferry station!!\n***NO BROKER FEE\n***FREE SHUTTLE TO NY WATERWAY FERRY STATION\n***ONLY $500 SECURITY DEPOSIT (Based on Credit)\nThis building is conveniently located right on river road, which makes commutes to NYC a breeze with bus, and ferry options!\nApartment features include:\nTwo Exceptional finish palettes to choose from\nHigh force Chimney hood\nRecessed LED overhead lighting\n8' Tall Storage Cabinets\nStainless Steel dual convection oven\nPull out pantry\nHuge French door Refrigerators\nFloor To ceiling windows\nEuropean white oak solid hardwood flooring\nThermostatically controlled shower with rain-style head, body jets, and hand shower\nAmbient LED overhead lighting\nExtra Large Mirrors with integrated make-up lighting\nItalian Floating vanity with deep storage cabinets\nBuilt in roller shades\nManhattan skyline and Hudson River views\nHigh Capacity Washer and Dryers\nBuilding amenities include:\nHeated Pool\nHott tub\nPrivate cabanas\nLounging Pods\nSteam Room\nSauna\nPrivate Terraces\nWellness Center\nMassage Room\nWeight and Cardio room\nState of the art fitness center\nJuice Bar\nYoga Deck\nFirepit Lounges\nOutdoor Salon with built-in seating and cafe tables\nParty Lounge\nWine Bar room\nGame room\nSkyline overlook\nRooftop Kitchen\nKids play area\nContact me today for more info or a private showing!\nServicing all of North Jersey no broker fee luxury rentals - Fort Lee, Edgewater, Cliffside Park, West New York, Weehawken, Port Imperial, North Bergen, Secaucus, Kearny, Harrison, East Rutherford, Englewood, Hoboken, Jersey City, just to name a few!\n","num_images":20.0,"lat":40.0369,"lng":-75.0664,"attrs":"['2BR \/ 1Ba', 'available now', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:29:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547048462.html","post_id":7547048462,"result_date":"2022-10-18T15:33:36.000Z","title":"Chancery Lane offers loft-style apartment!","description":"$500 Security Deposit!!! NEW FLOORS will be installed! Chancery Lane offers loft-style apartment homes with elevator, in a gated courtyard setting within historic Old City and boasts a community rooftop deck with panoramic views of the city. Beautiful large loft-style 1 bedroom apartment. Pictures are of a similar unit.\n130 Arch St #206","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T11:17:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547051996.html","post_id":7547051996,"result_date":"2022-10-18T15:28:25.000Z","title":"With everything you’ve ever dreamt of at your fingertips, you may not","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:767-780 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nLeasing Special\nReduced Security Deposit and Waived Application Fee when you move-in by 11\/30\/2022 and apply within 48 hours of your tour! *Security Deposit reduced from 1 Month's Rent to $1,000.00! *Up to 3 Application Fees Waived\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 1BR floor-plans in the sought after Fishtown\/Northern Liberties area.\nConvenient to I-95, 676 and Girard Avenue, getting around the city is a breeze whether you're driving, taking public transportation or Uber\/Lyft!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home. Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":24.0,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '777ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:24:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547046244.html","post_id":7547046244,"result_date":"2022-10-18T15:27:22.000Z","title":"Just 1st month's rent and $500 security deposit to move-in!!","description":"Just 1st month's rent and $500 security deposit to move-in!!! The Gratz Building- With nearly a hundred years of History, this newly renovated apartment building has just the perfect amount old world charm combined with the latest design of high-end finishes, in a premier location in Society Hill. Modern kitchens with stainless steel appliances, Wooden cabinetry and Granite stone counters. Lovely baths, complete with beautiful bath fixtures. Washer and dryer in the apartment. Pet-Friendly building. Lovely shared courtyard. Parking onsite $300mth. Pictures are of a similar unit.\n532 Spruce St #7","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:13:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547039483.html","post_id":7547039483,"result_date":"2022-10-18T15:23:31.000Z","title":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!","description":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!!!!!!!! LET the SUNSETS be your permanent back drop!!!!!!!!! This ONE BEDROOM residence, at FRANKLIN TOWER, located at 16TH and RACE STREET is a must see!!! All open and spacious living and dining area, kitchen with STAINLESS steel appliances, breakfast bar, and CUSTOM cabinetry. The Bedroom is VERY spacious, with an all tile EUROPEAN style bathroom. There is nothing like FRANKLIN TOWER apartments, in all of Philadelphia!!! With amenities on EVERY FLOOR, Peloton Rooms, Yoga studios, Screening Rooms, Game Rooms, Lounges, and Gyms, as well as the ROOF TOP LOUNGE , with flat screen, grills, and fire place. A BASKETBALL COURT, and GARAGE PARKING. Parking available for additional cost. Photo's are of model unit.\n200 N 16th St #418","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '656ft2', 'available oct 24', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:00:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547034162.html","post_id":7547034162,"result_date":"2022-10-18T15:23:28.000Z","title":"Large north and east-facing corner 2-bed view you will LOVE!","description":"Enjoy ONE MONTH FREE with a application submitted by 10\/15\/2022! Start this fall in this Philadelphia Chapter Landmark Property originally designed in 1951! Enter through the spacious remodeled lobby where you are greeted by a 24 hour front desk attendant. The property features a fitness center on the lower level along with common areas where you can relax and watch TV or catch up with friends with a game of pool. There's also a place to store your bike in the designated bike room. Looking for outdoor space? There's a roof deck that offers panoramic views of the city! The views are simply breathtaking! This large north and east facing corner Two bedroom has beautiful hardwood parquet floors and a view you will LOVE! The living area and bedrooms are spacious and have tons of closet space! SUPER Pet Friendly!! Come see what all the buzz is about at The Parkway House and everything that living in the Art Museum area has to offer!! ***Pictures featured are of the new model unit.***\n2201 Pennsylvania Ave #813","num_images":6.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T10:49:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547048933.html","post_id":7547048933,"result_date":"2022-10-18T15:22:32.000Z","title":"Apartment for rent","description":"One bedroom apartment 750.00 kitchen bathroom living room requires two months rent one month security. Available immediately.  Call Venice  show contact info","num_images":0.0,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:18:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547048394.html","post_id":7547048394,"result_date":"2022-10-18T15:21:29.000Z","title":"Patio\/Balcony, Disposal, Cable Ready","description":"Bedrooms: 1Bathrooms: 1Square Feet: 457Date Available: 2022-10-18Address: 100 North 17th StreetThe Arch Luxury Apartments embodies Philadelphia’s architectural splendor. A hidden gem between the Comcast towers, the Arch delivers apartments ideal for city-living in a piece of Philadelphia's history! Amenities Include:Cable ReadyRefrigeratorDishwasherLarge ClosetsDisposalCarpetingPatio\/BalconyNewly renovated apartments with contemporary designEfficient AppliancesCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/svtxdfwu\/archPricing and availability are subject to change.\n","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '457ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T11:17:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547047762.html","post_id":7547047762,"result_date":"2022-10-18T15:20:17.000Z","title":"Welcome to the Greenfair!","description":"Welcome to the Greenfair! An historic building that has been converted into residential units. This Spacious bi-level 1 bedroom 1 full bathroom is located in the Art Museum district in Philadelphia. Enter through the front door of this unit into a spacious living area which is open to the kitchen. The large bedroom is on the lower level for privacy and has a full bathroom attached. Recently updated with hardwood floors, a new kitchen with new appliances and cabinets, this rental features plenty of character with high ceilings, a stained-glass window and a decorative marble fireplace with mantel. Close to the city, parks, museums, public transportation, shopping and restaurants, this unit is situated in an ideal location. Available immediately, schedule a showing today as this rental won't last long!\n1738 Green St #10","num_images":7.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '838ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:16:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547042156.html","post_id":7547042156,"result_date":"2022-10-18T15:18:10.000Z","title":"Fall In Love with this 2 bed\/2 bath Apartment!","description":"Balmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T11:05:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547040300.html","post_id":7547040300,"result_date":"2022-10-18T15:17:58.000Z","title":"** PROMOTION: 14month lease\/2 months free**","description":"** PROMOTION: 14month lease\/2 months free** Applies for AND Moves in by or before 10\/31\/22. Assigned Parking Available At $125\/mo Lofts 640 offers you the \"most bang for your buck\" in Philadelphia! Included with your monthly rental price is extended cable TV service, fitness center, indoor\/heated pool and hot tub with attached outdoor roof deck, yoga\/fitness studio, cyber lounge, 24\/7 front desk attendant, and more!! Walk off the busy street into 640 North Broad and enter an urban space that combines the old with the new. Feel the past mix with a refreshing dose of hip, understated sophistication. The original character of the building is not lost but enhanced by modern accents and furnishings. A thriving community dwells within our walls -- a state-of-the-art fitness center, cyber cafe, and yoga studio serve to nurture body, mind, and spirit. Setting the night sky aglow, our glass-domed pool house is the perfect place to unwind. Go for a swim in the warm salt water, relax your muscles in the Jacuzzi, or meet and socialize on the roof deck lounge. Enter the lobby, your public space. Experience orange as it bursts in the artwork and pours from geometric ceiling lights that warm the mocha-colored floors. Accented with a healthy dose of pure white and stainless steel, contrast brings together the energizing elements of your entrance. A thriving community dwells within our walls -- a state-of-the-art fitness center, cyber cafe, and yoga studio serve to nurture body, mind, and spirit. Setting the night sky aglow, our glass-domed pool house is the perfect place to unwind. Go for a swim in the warm salt water, relax your muscles in the Jacuzzi, or meet and socialize on the roof deck lounge. Lofts 640 is just six (6) blocks north of City Hall on Broad Street. Lofts 640 is centrally located to Philadelphia shoppes, restaurants, hospitals, and the thriving community of Fairmount. Minutes from Reading Terminal Market and the Pennsylvania Convention Center, Lofts 640 combines commuter convenience of center city living with spectacular urban spaciousness of true loft living.*Property amenities-Cable included in rent Reconnect at the Cyber Lounge. Reenergize at the gym. Rejuvenate at the pool. Relax at the yoga studio. Reward yourself with a new lifestyle. Unit amenities12 Foot CeilingsBalconies Available w\/select loftsBeautifully Landscaped CourtyardCentral Heat \/ AirCovered Garage ParkingDesigner Wall to Wall CarpetEuro-Luxe Stainless KitchenExposed BrickHigh Speed Internet available industrial Size Windows Lavish Closet Space Unspoiled Skyline ViewsWasher \/ Dryer in each loft *Availability subject to change on a daily basis.\n640 N Broad St #805","num_images":6.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '917ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:01:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547044388.html","post_id":7547044388,"result_date":"2022-10-18T15:13:39.000Z","title":"Washer\/Dryer, Extra Storage, Modern Kitchen Appliances","description":"Bedrooms: 0Bathrooms: 1Square Feet: 300Date Available: 2022-10-18Address: 1201 Chestnut StreetJuxtaposing the building’s 1902 Renaissance Rival architecture with Midtown Village’s contemporary nightlife and hip markets, The Commonwealth weaves a seamless tapestry of historic elegance and the vibrant urban culture of Center City Philadelphia, PA. This restored mid-rise community blends classic design with contemporary, upscale finishes that have resulted in multiple awards from the Pennsylvania Apartment Association for presentation, maintenance and service. Amenities Include:Valet Dry-CleaningHardwood FloorsBicycle StorageStorage LockersRefrigeratorWasher\/DryerExtra StorageModern Kitchen AppliancesSpacious 1 & 2 Bedroom ApartmentsMicrowaveDishwasherAir ConditionerCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/itveosyq\/commonwealthPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9487,"lng":-75.1593,"attrs":"['0BR \/ 1Ba', '300ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T11:09:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547044097.html","post_id":7547044097,"result_date":"2022-10-18T15:13:08.000Z","title":"Spacious 2 bedroom available now at 4163 Ridge ave!","description":"Very spacious 2 bedroom available now near The Kelly Drive. Parking lot. Laundry room is in the building. Pet friendly. $250 one time pet fee, plus $25 pet rent. Tenants pay all utilities. 1 year lease. $50 application fee.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":16.0,"lat":40.008421,"lng":-75.19292,"attrs":"['2BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:09:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547043291.html","post_id":7547043291,"result_date":"2022-10-18T15:11:28.000Z","title":"Package Receiving, Fitness Center w\/ Peloton Bikes, Hardwood Floors","description":"Bedrooms: 1Bathrooms: 1Square Feet: 518Date Available: 2022-10-18Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:MicrowaveElectronic ThermostatSmart Home FeaturesWasher\/DryerRecyclingOn-Site ManagementBike StorageWindow CoveringsParking Garage (Additional Fees)RefrigeratorLarge ClosetsFOB Controlled AccessCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/3mj327nb\/lvl-northPricing and availability are subject to change.\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '518ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T11:07:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547043260.html","post_id":7547043260,"result_date":"2022-10-18T15:11:24.000Z","title":"Stunning 3 bedroom\/3 bath with GARAGE!","description":"Stunning 3 bedroom\/3 bath with GARAGE in the heart of the Art Museum Area! Marble entranceway leads to the the first floor bedroom suite. Second Floor: Gorgeous open renovated kitchen with SS appliances, granite counter tops & lots of cabinets and counter top space. Spacious living room features hardwood floors, a fireplace & high ceilings. Dramatic staircase reminiscent of an Italian villa leads to the third floor boasting the master suite with a beautiful white marble bathroom and an oversized shower; 2nd bedroom with exposed wood beams which opens to the deck; and a luxurious hall bathroom with oversized tub. Washer\/dryer. The square footage in public records is incorrect. This home has approximately 2200 square feet. First, last and one month's security deposit due at lease signing. $50 application fee per applicant.\n822 N Ringgold St","num_images":6.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 3Ba', '1360ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T11:07:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547038579.html","post_id":7547038579,"result_date":"2022-10-18T15:10:53.000Z","title":"Pet Spa Station, In Unit Washer & Dryer, Keyless Entry","description":"Bedrooms: 0Bathrooms: 1Address: 1401 Arch StreetLocated in Philadelphia’s historic Center City neighborhood, One City offers modern elegance with timeless grandeur. With views of Philadelphia's City Hall and just steps away from iconic Philly locations such as the Pennsylvania Convention Center, Reading Terminal Market, and Love Park, One City offers sophisticated luxury in the heart of Philadelphia. One City offers the most discerning residents the ultimate living experience. Inside this historic building, located at 1401 Arch Street, each apartment residence holds unique original features coupled with contemporary sophistication. Thoughtful design details include custom built-in storage, stainless steel appliances, and modern connectivity offering luxury and convenience to a range of lifestyles. Control is always at your fingertips with your app-based smart home features including keyless entry. Amenities Include:Stainless Steel AppliancesSmart ThermostatConference RoomFully Equipped KitchensFlexible Lease OptionsPet Spa StationLuxury Vinyl Tile flooring throughoutInterior & Exterior Entertainment LoungesPackage Receiving SystemPet Friendly                                                                                                                                2 pets max; up to 40 lbs. Some restrictions and fees apply.Stove Range with Microwave, Refrigerator with ice maker, Dishwasher, Food Waste Disposal, Under Cabinet LightingCustom Built-In & Historic DetailingCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/3licp77b\/one-cityPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T10:58:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547042481.html","post_id":7547042481,"result_date":"2022-10-18T15:09:46.000Z","title":"2nd bedroom style unit with a South facing view!","description":"P1303 is a large one plus den or 2nd bedroom style unit with a South facing view of the Ben Franklin Bridge and The City skyline. This unit has an open floor plan with walls of windows and stunning unobstructed views. The kitchen has a beautiful Island Bar with granite countertop, new wide plank flooring through out the living area and a large balcony. Lite ceiling fans in dining room area and bedroom for added lighting . A reverse osmosis drinking water system has been installed for added convenience . Waterfront Square offers a 3- level parking garage, with Philadelphia's largest green roof situated on top, inclusive of putting green! Waterfront Square resides on a 9.5-acre riverfront enclave, with lush manicured outdoor common parks and gardens right on the river's edge. Management is on site, and Waterfront boasts an advanced security system . For your convenience, The river deck is oversized, encompassing a 25-meter heated lap pool (junior Olympic). Waterfront Square has an excellent location, due to it's proximity to area highways & airports (676,95, all bridges).\n901 N Penn St #P1303","num_images":4.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1.5Ba', '1178ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T11:05:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547041547.html","post_id":7547041547,"result_date":"2022-10-18T15:08:05.000Z","title":"Live at 101 Arch St #1K a spacious bi-level Old City condo!","description":"Live at 101 Arch St #1K a spacious bi-level Old City condo with exposed beams and amazing \"Classic Philly\" touches. Enter the private entrance via Front St into the open living room\/dining space, with a cafeteria-style kitchen. This level includes a large living room, dining room, kitchen, and a convenient half-bathroom. An extra wide staircase leads down to the bedroom with tons of closet space and an in-unit washer and dryer. The lower level is very spacious and could easily accommodate an office or den area The full bathroom is also located on this floor with double vanity and a linen closet. Recent updates include the kitchen, half bath, Renewal by Andersen windows, central air, water heater, and new upstairs flooring. Unit is conveniently located to Old City's many shops and restaurants as well as being a 2-block walk to the 2nd street stop on The El. You won’t want to miss this opportunity.\n101-111 Arch St #1K","num_images":7.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1.5Ba', '1027ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:04:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547041471.html","post_id":7547041471,"result_date":"2022-10-18T15:07:55.000Z","title":"Renovated 1 bedroom available now at 4800 Brown street!","description":"Experience forward-thinking urban living.\n1, 2 & 3 bedroom luxury loft-style apartments located in an affordable up-and-coming district just north of University City make up this 34-unit complex. We offer thoughtful architecture and design creating a contemporary feel in an old factory setting. Elevator access, stainless steel appliances including a dishwasher and garbage disposal, a multi-camera security system, intercom system with remote door buzzer, on-site laundry, high ceilings, custom cabinetry with self-closing hardware, granite counters, kitchen pantry, exposed brick & concrete in many units, tile flooring, central heat & air, LED lighting, extra large commercial sized windows, large closets and large bright common hallways will be more than enough to make you want to come home!\nAmenities:\n-Elevator\n-Assigned gated parking available for car and scooters $100 per space\n-Multi-camera security system\n-Intercom system with electronic door opener\n-On-site laundry\n-Choice of Comcast or Verizon\n-Full-size stainless steel appliances\n-Bus line at corner\n-Garbage disposal\n-High ceilings\n-Large closets\n-Custom cabinetry with self closing cabinet doors & drawers\n-Sinks with magnetic retractable faucet hose\n-Granite counters\n-Pantries\n-Exposed ductwork, brick & concrete floors\/ceilings (in some units)\n-Central air and heat\nIn addition to monthly rent, tenant is responsible for their own electricity bill, a water fee of $40 & a liability insurance fee of $9.50\nCats & dogs are $40 \/ monthly per pet\nCall Alena for showing at  show contact info\nCity Wide Realty\n","num_images":12.0,"lat":39.966337,"lng":-75.216657,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:03:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547041326.html","post_id":7547041326,"result_date":"2022-10-18T15:07:41.000Z","title":"Classic white wood slat window treatments, Rooftop Lounge, Concierge","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1255Date Available: 2022-10-18Address: 1530 Locust StreetExperience the history and splendor of the Versailles from the comforts of your own luxury Rittenhouse apartment. The Versailles Philadelphia is a historic, 1920s-era residential building that has been upgraded for the contemporary age, now featuring 1-bedroom, 2-bedroom, and 3-bedroom Philadelphia apartments for rent in Rittenhouse. Finished with high-end materials, premium appliances and fixtures, and preserved architectural details, these Center City apartments are just steps from Rittenhouse Square. With a rooftop lounge, fitness center, yoga studio, business center, and more, the Versailles is well-equipped with comforts and amenities to enhance any lifestyle. Amenities Include:Fitness CenterKitchenRooftop LoungeSmart HomeRoof Top Dog RunStainless steel appliancesFull size in-unit washer & dryerConciergeBusiness CenterCarrera marble kitchen backsplashCustom tiled showersSolid wood kitchen cabinetryCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/7o5vnays\/versaillesPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '1255ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T11:03:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547041123.html","post_id":7547041123,"result_date":"2022-10-18T15:07:19.000Z","title":"On-Site Management, Fitness Center, Media Room","description":"Bedrooms: 3Bathrooms: 2Square Feet: 1328Date Available: 2022-10-18Address: 1000 South Broad Street\nExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.\nAmenities Include:\nPackage Receiving\nView\nFitness Center\nElevator\nMedia Room\nConcierge\nMicrowave\nFree Weights\nAir Conditioner\nBusiness Center\nWasher\/Dryer\nLarge Closets\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/epxyastl\/lincoln-squarePricing and availability are subject to change.\n","num_images":9.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '1328ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T11:03:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547038550.html","post_id":7547038550,"result_date":"2022-10-18T15:02:50.000Z","title":"Great 2 bedroom\/2 bathroom rental in Graduate Hospital!","description":"Great 2 bedroom\/2 bathroom rental in Graduate Hospital! This newer construction unit has a well-designed kitchen with stainless steel appliances including a dishwasher and built-in microwave and is open to the living room for easy entertaining and convenience. The spacious living room is large enough to accommodate a seating area and dining set, or add some bar stools for dining at the ample counter space dividing the two rooms. In-unit laundry and central air conditioning add additional comfort and convenience. There are two large bedrooms, each with significant closet space. The larger bedroom has an en suite bathroom, walk-in closet and opens to a private balcony. The 2nd bedroom has a double-wide closet and easy use of the hallway bath. A roof deck shared with the other two units provides additional outdoor space and great views of the skyline. Close to local universities, hospitals and downtown businesses as well as great restaurants, fitness centers, coffee shops, public trans and I-76. With Lincoln Square less than 3 blocks away (Sprouts, Target, Wine & Spirits, etc.) everything you need is just a few steps away! Come see this great unit today.\n1542 Christian St #C","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T10:58:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547037407.html","post_id":7547037407,"result_date":"2022-10-18T15:00:30.000Z","title":"Great 2 bedroom\/2 bathroom rental in Graduate Hospital!","description":"Great 2 bedroom\/2 bathroom rental in Graduate Hospital! This newer construction unit has a well-designed kitchen with stainless steel appliances including a dishwasher and built-in microwave and is open to the living room for easy entertaining and convenience. The spacious living room is large enough to accommodate a seating area and dining set, or add some bar stools for dining at the ample counter space dividing the two rooms. In-unit laundry and central air conditioning add additional comfort and convenience. There are two large bedrooms, each with significant closet space. The larger bedroom has an en suite bathroom, walk-in closet and opens to a private balcony. The 2nd bedroom has a double-wide closet and easy use of the hallway bath. A roof deck shared with the other two units provides additional outdoor space and great views of the skyline. Close to local universities, hospitals and downtown businesses as well as great restaurants, fitness centers, coffee shops, public trans and I-76. With Lincoln Square less than 3 blocks away (Sprouts, Target, Wine & Spirits, etc.) everything you need is just a few steps away! Come see this great unit today.\n1542 Christian St #C","num_images":5.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '997ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:56:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547011131.html","post_id":7547011131,"result_date":"2022-10-18T14:58:38.000Z","title":"Invincible Location Frankford Ave w\/2-Parkings, Laundry, Updated Floor","description":"Three bedrooms are available for rent now in the Kensington area. Move in deposit is 3 months ($2,985). The tenant is responsible for all utilities. Oil Heat. A rental application must be completed. Proof of income and photo ID are required. Applicants must earn 3x net rent and the owner prefers a 550+ credit score. No prior evictions. Unemployment will not be counted as income.\nPlease Contact Daisy:   ⸑  show contact info\n\nFor more info on application criteria and\/or to set up a showing.\nThree bedrooms are available for rent now in the Kensington area. Move in deposit is 2 months ($1990). The tenant is responsible for ALL utilities. Oil Heat. A rental application must be completed. Proof of income and photo ID are required. Applicants must earn 3x net rent and the owner prefers a 550+ credit score. No prior evictions. Unemployment will not be counted as income.\nRent-995\/m\nBedroom- 3\nBathrooms- 1\nProperty Owner pays for water, sewer and trash\n","num_images":8.0,"lat":39.990114,"lng":-75.117272,"attrs":"['3BR \/ 1Ba', '1100ft2', 'available now', '\\nthursday 2022-10-20\\n', '\\nfriday 2022-10-21\\n', '\\nsaturday 2022-10-22\\n', 'application fee details: Background\/Criminal Record + Credit Check is required!', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-10-18T09:58:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547030638.html","post_id":7547030638,"result_date":"2022-10-18T14:54:56.000Z","title":"A Wonderful opportunity to rent a gorgeous 2 Bedroom Apt","description":"Wonderful 2 Bedroom Apt. w\/ Hardwood Floors and Stainless Steel Appliances -w\/ Beautiful Hardwood Floors, Central Air and Stainless Steel Appliances. Walk Out Of Your Door and You Are Steps From Great Restaurants and Shopping and The Excitement of Living In The Heart of Center City! Drexel University School of Medicine is Directly Across The Street. Close to Suburban Station!\n1522-24 Race St #5","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', '692ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:41:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547034843.html","post_id":7547034843,"result_date":"2022-10-18T14:54:54.000Z","title":"Recently remodeled home with 3 bedrooms and 2 baths!","description":"Live at 1132 Webster St a recently remodeled home with 3 bedrooms and 2 baths. The first floor has an amazing kitchen that is open to the living room with hardwood flooring, high ceilings, and fantastic natural light from south-facing glass doors that lead to a large back patio, great for grilling and entertaining. The second floor has 2 bedrooms and a full bath with a shower. The 3rd floor is a large primary suite with a huge full bathroom. This home has wonderful closet space and plenty of storage in the basement. Enjoy the amazing location, close to the Italian Market, great restaurants, South Street, Whole Foods, Passyunk Square, the Broad Street line, and public transportation.\n1132 Webster St","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', '1176ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:50:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547029269.html","post_id":7547029269,"result_date":"2022-10-18T14:52:49.000Z","title":"Enter This Charming 2-bed Unit and Find an Entryway Closet","description":"Welcome to 159 N 21st Street Unit 1R! Enter this charming two-bedroom unit and find an entryway closet, decorative original fireplace, and exposed brick in the kitchen and living areas. The bright bathroom off the kitchen boasts a porcelain tub and shower. The first bedroom is adjacent to the living area with the second bedroom on the lower level, making this comfortable for roommates. There is a private patio to the back of the unit and laundry in the basement of this secure, well-maintained building. Enjoy all Logan Square has to offer like museums, restaurants, Whole Foods, Trader Joe's, and an easy point from which to commute! Nearby schools include Science Leadership Academy, Russell Byers Cs, John W. Hallahan Catholic Girls' High School and Albert M Greenfield Elementary School. The City of Philadelphia has completed a real estate tax reassessment, effective January 1, 2023. If you have any questions or concerns about the impact of this reassessment on future real estate taxes, please contact the City of Philadelphia. Compass RE is not involved in the City of Philadelphia’s tax reassessment and does not have any input or control in the results.\n159 N 21st St #1R","num_images":8.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '664ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T10:38:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547031928.html","post_id":7547031928,"result_date":"2022-10-18T14:48:51.000Z","title":"MUST SEE 2 bedroom, 1 bath apartment at 1300 Chestnut!","description":"MUST SEE 2 bedroom, 1 bath apartment at 1300 Chestnut! All open living and dining space. Kitchen has plenty of cabinet and counter space. Spacious and gracious bedroom with all tile bath. Enjoy living in this elevator, doorman building (from 12pm to 8pm) in the heart of MIDTOWN. Just minutes from Avenue of the Arts, Jefferson Hospital, and The Reading Terminal Market. Walking score 110! Great space and value and yes a fantastic gym at your disposal as well to use.\n1300-6 Chestnut St #304","num_images":6.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T10:44:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547031312.html","post_id":7547031312,"result_date":"2022-10-18T14:47:26.000Z","title":"Spacious 2-bedroom corner apartment in Fairmount!","description":"Spacious 2-bedroom corner apartment in Fairmount! Enjoy lots of natural light, big bedrooms, and updated kitchen with living area and breakfast nook in the bay window. There is a nice-sized outdoor patio space for the tenants to use, as well. Central air provides forced air heating and cooling. Hardwood floors are pet friendly! Enjoy this incredible location!\n754 N 25th St #2","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', '750ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T10:43:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547030134.html","post_id":7547030134,"result_date":"2022-10-18T14:44:50.000Z","title":"Renovated 1 bedroom available now at 4800 Brown street!","description":"Experience forward-thinking urban living.\n1, 2 & 3 bedroom luxury loft-style apartments located in an affordable up-and-coming district just north of University City make up this 34-unit complex. We offer thoughtful architecture and design creating a contemporary feel in an old factory setting. Elevator access, stainless steel appliances including a dishwasher and garbage disposal, a multi-camera security system, intercom system with remote door buzzer, on-site laundry, high ceilings, custom cabinetry with self-closing hardware, granite counters, kitchen pantry, exposed brick & concrete in many units, tile flooring, central heat & air, LED lighting, extra large commercial sized windows, large closets and large bright common hallways will be more than enough to make you want to come home!\nLive the uptown urban lifestyle you crave!\nAmenities:\n-Water $35.00 per month\n-Elevator\n-Assigned gated parking available for car and scooters ($150 per space, coming Summer 2021)\n-Multi-camera security system\n-Intercom system with electronic door opener\n-On-site laundry\n-Choice of Comcast or Verizon\n-Full-size stainless steel appliances\n-Bus line at corner\n-Garbage disposal\n-High ceilings\n-Large closets\n-Custom cabinetry with self closing cabinet doors & drawers\n-Sinks with magnetic retractable faucet hose\n-Granite counters\n-Pantries\n-Exposed ductwork, brick & concrete floors\/ceilings (in some units)\n-Central air and heat\nIn addition to monthly rent, tenant is responsible for their own electricity bill, a water fee of $35 & a liability insurance fee of $9.50\nCall Alena for showing at  show contact info\nCity wide realty","num_images":9.0,"lat":39.966337,"lng":-75.216657,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:40:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547029945.html","post_id":7547029945,"result_date":"2022-10-18T14:44:23.000Z","title":"MUST SEE 1 bedroom, 1 bath apartment at 1300 Chestnut!","description":"MUST SEE 1 bedroom, 1 bath apartment at 1300 Chestnut! All open living and dining space. Kitchen has plenty of cabinet and counter space. Spacious and gracious bedroom with all tile bath. Enjoy living in this elevator, doorman building (from 12pm to 8pm) in the heart of MIDTOWN. Just minutes from Avenue of the Arts, Jefferson Hospital, and The Reading Terminal Market. Walking score 110! Great space and value and yes a fantastic gym at your disposal as well to use.\n1300-6 Chestnut St #1001","num_images":5.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'available nov 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T10:40:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547018366.html","post_id":7547018366,"result_date":"2022-10-18T14:44:06.000Z","title":"1bedroom\/1bath Apartment in the Heart of Logan Square Area","description":"FRESH to the market, enormous 1Bedroom\/1Bath apartment in the Heart of Logan Square area. Kitchen features plenty of GRANITE counter space\/bar, STAINLESS Steel appliances...combination kitchen\/breakfast nook\/dining area. Loft like feeling with hardwood floors and tile throughout. The bedroom his HUGE with ample closet space...large bathroom. Washer\/Dryer, Fitness Center, and Secured entry all for you! Check it out its a MUST SEE! Photo's are of model unit.\n2130 Arch St #205","num_images":7.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '864ft2', 'available dec 28', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T10:14:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547016107.html","post_id":7547016107,"result_date":"2022-10-18T14:41:10.000Z","title":"Spacious 1 Bed Apt in a Landmark Building With a Newly Renovated Lobby","description":"ONE MONTH FREE SPECIAL FOR APPLICATIONS SUBMITTED BY 9\/30!!! $500 Security Deposit and 1st Month's Rent to move-in!! Spacious 1 Bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block away from Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit.\n1411 Walnut St #206","num_images":6.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:09:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547028470.html","post_id":7547028470,"result_date":"2022-10-18T14:40:57.000Z","title":"Great, lower level studio available now at 35th and Spring garden!","description":"Affordable studio available now at 501 N 35th street. Hardwood floor. Window heat and AC. Pet friendly. $250 one time pet fee plus $25 pet rent. 1 year lease. $55 application fee. Security deposit, first and last month to move in. Must to have a good credit. Laundry room is in the building.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":4.0,"lat":39.962769,"lng":-75.192846,"attrs":"['0BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:36:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547019630.html","post_id":7547019630,"result_date":"2022-10-18T14:40:51.000Z","title":"Spacious 2 bedroom \/ 2 bath unit at the pet-friendly Metro Club","description":"ONE MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!! Spacious 2 bedroom \/ 2 bath unit at the pet-friendly Metro Club with a washer\/dryer in unit and 1 secured gated parking spot included. Great natural lighting, expansive windows, open layout, modern stainless steel appliances, beautiful hardwood floors, pendant lights above the breakfast bar. Closet galore, double bathroom sinks! Metro Club in an elevator high-rise with a heated outdoor pool, Boutique hotel-style lobby, fireplace, and lounge seating. Secured entry and controlled building access with a full gym. Easy access to Market East SEPTA station and SEPTA bus routes and many area local attractions including Reading Terminal Market, Maggiano's Italy, The Melting Pot etc. Pictures are of a similar unit!\n201 N 8th St #902","num_images":7.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1792ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:16:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547021301.html","post_id":7547021301,"result_date":"2022-10-18T14:36:42.000Z","title":"Truly unique, stunning Fishtown townhouse w\/ PARKING for lease!","description":"Truly unique, stunning Fishtown townhouse w\/ PARKING for lease! The first level of the home is the garage that spans the length of the home followed by the rear yard that can be used for gardening, relaxing and entertaining. Up the stairs you have the main level of the home that is completely open with massively tall ceilings and incredible natural light. The tiered level has the living and dining space on the lower level and full kitchen with eat in nook on the upper level. The kitchen has been recently remodeled with new countertops and fixtures. The top level features three bedrooms, stackable laundry closet, hall bathroom and a brand new primary bathroom. The primary bathroom is jawdropping with accented barn door, wall to wall mirrors, gorgeous tiling, waterfall shower and free standing tub. Through the primary bedroom is access to the green roof deck. The roof deck is lined with succulents to make it a true \"green\" roof, has panoramic views of the city, and tons of space for get togethers. Lastly, but perhaps the biggest selling point is the prime location in fishtown right off of Frankford ave and next to Palmer park. The home is just steps away from some of the best dining\/restaurants in the city such as Suraya, Wm Mulherin's & sons, Pizzeria Beddia and La Colombe. This is a rare rental in a perfect location. **Owner would like to keep the back parking spot for his wood work space but could be leased for an additional $200 per month. Home can be rented furnished for an additional $200 per month.\n401 Memphis St","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2Ba', '1894ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T10:20:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547014540.html","post_id":7547014540,"result_date":"2022-10-18T14:35:44.000Z","title":"$500 security deposit to move-in!!! 1 Bed 1 bath","description":"1\/2 MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!! Just 1st month's rent and $500 security deposit to move-in!!! 1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. Hardwood floors in the living area and the bedroom is carpeted. The Warehouse Property is located in a highly walkable area with access to all forms of public transportation. Secured entry, gated property, gym\/fitness center and on-site parking- add'l $200 mo. with full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a similar unit.\n9-1 N 9th St #608","num_images":7.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '635ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:05:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547012154.html","post_id":7547012154,"result_date":"2022-10-18T14:34:55.000Z","title":"You Will Find Pure Luxury at the Residences of Dockside","description":"You will find Pure Luxury at The Residences of Dockside right on the waterfront with this amazing Corner unit, NORTH FACING condo with center city views, 2 Garage Parking spots, and storage. This TOTALLY RENOVATED 3 Bedroom, 3 Bathroom condo of nearly 2000 sq ft offers some of the finest elements starting with the highly sought-after open floorplan, pristine hardwood floors throughout, a gourmet kitchen, custom fitted California walk-in closet and is book-ended by terraces and breathtaking views. The expansive Main Bedroom Suite features beautiful hardwood floors, LED lighting, custom sconces, large walk-in his\/her California Closet, and a terrace just off the main sleeping area. The Main Bathroom Suite features a tiled shower with angular body sprays & glass doors, a full-length mirror, LED lighting & sconces over the vanity, granite countertops, a tiled vanity wall, and decorative basket weave floor tile. Bedroom #2 is presently being used as a guest room and office space with great natural light and amazing water views with access to a terrace to step away from work for an outdoor breather or just to take in the beautiful days or starlit nights. Bedroom #3 is large in scale, has hardwood floors, large windows overlooking the city, window seating with excellent natural light, and custom overhead lighting, and is just across the hall from full bathroom #2 which also houses a brand new stackable full-sized washer and dryer. The guest Powder Room does not disappoint with its modern design featuring a glass bowl sink, sleek vanity, and decorative tile flooring. The gourmet kitchen features granite counters, marble subway backsplash, under-cabinet lighting, a bar nook, wine rack, brand new sto,ve and a private terrace. The Main Living area is the true definition of a free-flowing, open-floor concept. With continued uniformed hardwood flooring, the combo living area features an in-wall electric fireplace, crown molding with cove lighting, overhead LED lighting, window seating and breathtaking wrap-around views of the waterfront, PA, NJ and the famous Philadelphia skyline. Exit the main living area via sliding glass doors to a large terrace where you can entertain friends and family with views that cannot be replicated elsewhere in the city. Dockside has 24 hour gated security and concierge plus VISITOR PARKING when you need it, a totally renovated clubroom with full kitchen and seating for personal use (can be rented for an event) or to just to change up your scenery. The indoor pool and hot tub is a dream, not to mention the state of the art gym and wrap around outdoor patio with tables and chairs that overlook the water and Center City. With three elevators, dedicated bike room storage, separate owners' storage, shuttle service and walkable to everything waterfront including Spruce Street Harbour Park, Liberty Pointe, Bluecross Riverrink, Independence Seaport Museum, the Chart House, Moshulu, Zahav, Old City, Society Hill and much more you will love city living at its finest. You will also appreciate being close to all major highways and bridges to get in and out of the city and to NJ as well as Philadelphia International Airport. Set up a private tour today.\n717 S Columbus Blvd #1201","num_images":5.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2.5Ba', '1907ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:00:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547025102.html","post_id":7547025102,"result_date":"2022-10-18T14:33:22.000Z","title":"Renovated 1 bedroom available now at 35th and Spring garden!","description":"Very spacious 1 bedroom apartment available now at 35th and Spring garden. It’s located on the 3rd floor. Cold water is included, tenant pay for electric and gas. Laundry room is in the building. 1 year lease, $55 application fee.3 months to move in. Pet friendly, $250 one time pet fee, plus $25 pet rent.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":13.0,"lat":39.962769,"lng":-75.192846,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:29:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547017095.html","post_id":7547017095,"result_date":"2022-10-18T14:33:17.000Z","title":"ONE MONTH FREE ON APPLICATIONS BEFORE 10\/15!!!","description":"ONE MONTH FREE ON APPLICATIONS BEFORE 10\/15!!! $500 SECURITY DEPOSIT - Limited Time Move In Special! Welcome home! Spacious 1 bedroom+ Den \/1 bath. Carpet in bedrooms, vinyl flooring downstairs. Washer and dryer in unit! Whether CHOP, HUP, Penn, or Drexel, Liberty View is the ideal location. Spectacular city views! Within blocks of prestigious Rittenhouse Square and Philadelphia public transportation, Liberty View is situated along vibrant, tree-lined South Street. Spacious apartment homes available in bi-level, patio, and balcony unit formats offer Center City living with comfortable outdoor space! Pictures are of a similar unit!\n2031 South St #200","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T10:11:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547024895.html","post_id":7547024895,"result_date":"2022-10-18T14:32:57.000Z","title":"Modernista Studio In Haverford","description":"Beautiful Large Studio. Murphy Bed, Television included.  Close to the Haverford Train Station , Shopping & Dining.\nHeat Included.","num_images":4.0,"lat":40.0097,"lng":-75.3121,"attrs":"['0BR \/ 1Ba', '551ft2', 'available oct 24', 'cats are OK - purrr', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:28:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546997841.html","post_id":7546997841,"result_date":"2022-10-18T14:30:34.000Z","title":"2 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3\nBI-LEVEL\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":8.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:22:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547012996.html","post_id":7547012996,"result_date":"2022-10-18T14:30:31.000Z","title":"$1000 MOVE-IN CREDIT ON ALL VACANT UNITS!!!","description":"$1000 MOVE-IN CREDIT ON ALL VACANT UNITS!!! $500 security deposit for a limited time!!! 1600 Walnut is surrounded by the performing arts and numerous other cultural venues. One of the best values in Center City. Secure entry, Gym, Bike room! Bright and sunny units with hardwood floors, large windows, marble baths and open layouts with great closet space. Known for its popular restaurants and nightlife spots, Just steps away from some of Philadelphia's best culinary experiences Midtown Philadelphia is a fun and exciting place to live. Pictures are of a similar unit.\n1600-1 Walnut St #1104","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T10:02:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547023464.html","post_id":7547023464,"result_date":"2022-10-18T14:29:40.000Z","title":"Minutes from Temple University - 2 Bed Apartment","description":"Beautifully renovated apartment just a couple minute walk to Temple Universities main campus and just a block over from the Susquehanna-Dauphin stop for the Broad St line. This apartment is extremely spacious with two big bedrooms, roomy living room and a beautiful kitchen with tons of cabinet space. The apartment is available now! Come and check it out before it is gone!","num_images":12.0,"lat":39.987877,"lng":-75.155934,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:25:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547023391.html","post_id":7547023391,"result_date":"2022-10-18T14:29:28.000Z","title":"Great 1 bedroom available now at 3412 Spring garden!","description":"Great, 1 bedroom available now at 3412 Spring garden! Gated community, 24 hours camera system. 1 year lease. 3 months to move in. Pet friendly, $250 one time pet fee, $25 pet rent.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":10.0,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:25:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547022964.html","post_id":7547022964,"result_date":"2022-10-18T14:28:34.000Z","title":"Modern Kitchen Appliances, Bicycle Storage, Air Conditioner","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1005Date Available: 2022-10-18Address: 1201 Chestnut StreetJuxtaposing the building’s 1902 Renaissance Rival architecture with Midtown Village’s contemporary nightlife and hip markets, The Commonwealth weaves a seamless tapestry of historic elegance and the vibrant urban culture of Center City Philadelphia, PA. This restored mid-rise community blends classic design with contemporary, upscale finishes that have resulted in multiple awards from the Pennsylvania Apartment Association for presentation, maintenance and service. Amenities Include:Extra StorageStorage LockersDishwasherRefrigeratorModern Kitchen AppliancesMicrowaveAir ConditionerBicycle StorageCable ReadyElectronic ThermostatEfficient AppliancesValet Dry-CleaningCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/6tcslpxc\/commonwealthPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '1005ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T10:24:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547021406.html","post_id":7547021406,"result_date":"2022-10-18T14:24:57.000Z","title":"Off Campus Temple University Housing","description":"Beautifully renovated apartment just a couple minute walk to Temple Universities main campus and just a block over from the Susquehanna-Dauphin stop for the Broad St line. This apartment is extremely spacious with two big bedrooms, roomy living room and a beautiful kitchen with tons of cabinet space. The apartment is available now! Come and check it out before it is gone!","num_images":12.0,"lat":39.987877,"lng":-75.155934,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:20:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547011463.html","post_id":7547011463,"result_date":"2022-10-18T14:24:26.000Z","title":"One-of-a-kind Dramatic Sun-filled Home With Towering Ceilings","description":"One-of-a-kind dramatic sun-filled home with towering ceilings, exposed brick and covered garage parking on a virtually hidden block in the historic Society Hill section of Philadelphia. This home features three levels of living with a massive living room, half bath, dining room and full kitchen conveniently located on the first floor. Following the exposed brick and sun drenched stairs up to the second level opens you to your first two bedrooms, laundry, and first full bathroom. Your master is revealed to you after a long private corridor greeting you with his and hers full bathroom with walk-in closet and tremendous shower room. The third floor features a romantic full floor fourth bedroom option with exposed beams and unprecedented privacy. Those of you who enjoy walkability, shops and a nightlife you can leave at the club will love the accessibility this home offers. Being footsteps away from some of the best restaurants, cafes and farmers markets this home allows you to enjoy the finer things the city has to offer. Highlights of the neighborhood include, The Twisted Tail, Bloomsday Café, Bistro Romano. In the mood for something else? Cherry street pier, Spruce Street Harbor park and Liberty point are only a 15 minute walk. Experience 114 Naudain in person and set up your tour today! Unit is part of an HOA which is included in monthly rent.\n114-18 Naudain St #G\n","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['4BR \/ 3.5Ba', '1973ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T09:59:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547021186.html","post_id":7547021186,"result_date":"2022-10-18T14:24:26.000Z","title":"Great 1 bedroom available now at 5100 Walnut street!","description":"Great location! Cozy 1 bedroom available after September 15th. Laundry room is in the building. Tenant pays for all utilities. 1 year lease. $50 application fee. 3 months to move in. Must to have a good credit score and monthly income 3 times rent.\nCall Alena for showing at  show contact info","num_images":8.0,"lat":39.956707,"lng":-75.223538,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:20:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547020413.html","post_id":7547020413,"result_date":"2022-10-18T14:22:40.000Z","title":"Modern bi-level condo in booming Fishtown!","description":"Modern bi-level condo in booming Fishtown! This spacious 3 bed 3 & 1\/2 bath 1st-floor condo features an open floor plan, plenty of natural light, contemporary appliances, beautiful flooring, and a private backyard that is ideal for entertaining or relaxing outdoors. The main floors host your living. dining, 1\/2 bath, and gourmet kitchen. The lower level comprises of 3 bedrooms each conveniently having its own private full bath. This home is just steps away from Surya, Evil Genius, Frankford Hall, Johnny Brendaâ€™s, Wm. Mulherinâ€™s Sons, and many more of Philadelphiaâ€™s hottest bars and restaurants!\n1514 Frankford Ave #1","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 3.5Ba', '2261ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:18:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547003161.html","post_id":7547003161,"result_date":"2022-10-18T14:19:46.000Z","title":"Perfect Location the building represents the best in Rittenhouse Squar","description":"Available for lease starting December 1st! All utilities included in the rent!! This condominium features granite counter tops and parquet floors, Large closet space, The Dorchester building is right on the square in the heart of center city. The location is perfect, The building represents the finest of Rittenhouse Square. The Dorchester provides exceptional services and amenities professional doorman, all utilities and basic cable TV. There is parking under the building which belongs to the phila parking authority, rooftop pool, and fitness room available for additional reasonable fees. Looking for a tenant to move in starting after November 30th. One year lease available. Rent spree application is $42. Move in fee of $425. is required by tenant at move in.\n224-30 W Rittenhouse Sq #803","num_images":7.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '583ft2', 'available dec 1', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:37:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547018999.html","post_id":7547018999,"result_date":"2022-10-18T14:19:23.000Z","title":"Experience city living in this charming & sun-filled Townhome","description":"Available Now for rent in Queen Village. Experience city living in this charming & sun-filled Townhome located in Queen Village featuring 3 bedrooms & 1 1\/2 bathrooms. Arrive home to an open floor plan ideal for entertaining family & friends. You will be delighted with the open floor plan for the living room and dining, recessed lighting & hardwood floors on the first & second floor. The beautiful eat-in kitchen is equipped with Refrigerator, Microwave Oven, Range, Hood & Dishwasher with plenty of cabinetry for storage & countertops for creating your culinary delights. Added bonus of first floor 1\/2 bathroom. Access provided to the spacious rear yard from the kitchen. The patio is a wonderful space for grilling and relaxing. The first floor is graced with original hardwood flooring and the second floor of the home is naturally filled with sunlight. Second floor features 3 spacious bedrooms plus 1 full bathroom. The bathroom is beautifully updated & offers a tub\/shower combination and vanity. Access to the basement provides plenty of storage. There is a laundry which includes washer and dryer. The home was recently renovated in the last 2 years and offers newer plumbing, electric, HVAC to include Central Air Conditioning. Prime location in desirable Queen Village neighborhood. Daily errands do not require a car as this is a walker’s paradise. With an amazing Walk Score of 98, Transit Score of 70 & Bike Score of 81. You will enjoy living in this home & will appreciate all of amenities that that neighborhood has to offer. Just moments to Meredith, venture to nearby Shots Tower coffee, Weccacoe playground, Mario Lanza park, restaurants along E Passyunk Ave & South St Super easy access to Delaware Ave, Old City, Ben Franklin Bridge & I-95. Easy access to nearby shopping; Target, Home Depot, TJ Maxx & Home Goods, Acme Market all along Delaware Ave. First month rent, last month rent and security deposit is required. Tenant is responsible for all utilities.\n511 Christian St","num_images":5.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1.5Ba', '1272ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:15:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547018767.html","post_id":7547018767,"result_date":"2022-10-18T14:18:57.000Z","title":"Parking Garage (Additional Fees), On-Site Management, Elevator","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1006Date Available: 2022-10-18Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:24\/7 Front Desk AttendantRecyclingOn-Site ManagementMicrowaveBike StorageWindow CoveringsRefrigeratorWasher\/DryerFOB Controlled AccessFitness Center w\/ Peloton BikesParking Garage (Additional Fees)Electronic ThermostatCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/dfvpajvn\/lvl-northPricing and availability are subject to change.\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['2BR \/ 2Ba', '1006ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T10:14:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547018197.html","post_id":7547018197,"result_date":"2022-10-18T14:17:42.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547017783.html","post_id":7547017783,"result_date":"2022-10-18T14:16:50.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547017742.html","post_id":7547017742,"result_date":"2022-10-18T14:16:44.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547017055.html","post_id":7547017055,"result_date":"2022-10-18T14:15:11.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547006595.html","post_id":7547006595,"result_date":"2022-10-18T14:14:59.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547015555.html","post_id":7547015555,"result_date":"2022-10-18T14:11:58.000Z","title":"Luxury, Location, and Convenience.","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 to 481 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nLeasing Special\nReduced Security Deposit and Waived Application Fee when you move-in by 11\/30\/2022 and apply within 48 hours of your tour! *Security Deposit reduced from 1 Month's Rent to $1,000.00! *Up to 3 Application Fees Waived\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our brand new apartment community offers you spacious Studio apartments in the sought after Fishtown\/Northern Liberties area.\nDwell 2nd Street is convenient to I-95, 676 and Girard Avenue, so getting around the city is a breeze whether you're driving, biking, walking or taking public transportation!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Full-size stackable Washer and Dryer in Unit\n» Expansive closets with dust free organizers\n» Wood style plank flooring in Living space\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» Controlled building access\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball\n» Game Room with Pool Table, Foosball and shuffleboard\n» Business Center and conference room\n» Bike storage and repair space\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced dog park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.  Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":24.0,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T10:07:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547014678.html","post_id":7547014678,"result_date":"2022-10-18T14:10:04.000Z","title":"Large Closets, Carpeting, Refrigerator","description":"Bedrooms: 2Bathrooms: 2Square Feet: 855Date Available: 2022-10-18Address: 100 North 17th StreetThe Arch Luxury Apartments embodies Philadelphia’s architectural splendor. A hidden gem between the Comcast towers, the Arch delivers apartments ideal for city-living in a piece of Philadelphia's history! Amenities Include:Large ClosetsEfficient AppliancesNewly renovated apartments with contemporary designPatio\/BalconyCable ReadyDisposalRefrigeratorCarpetingDishwasherCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/o4gs4z24\/archPricing and availability are subject to change.\n","num_images":7.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', '855ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T10:06:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547001475.html","post_id":7547001475,"result_date":"2022-10-18T14:08:08.000Z","title":"Welcome home! Located in Bella Vista","description":"Welcome home! Located in Bella Vista in the much sought after Meredith catchment this 2 bedroom home is snuggled inside a private gated courtyard directly across from the neighborhood favorite Cianfrani Park. As you enter into the spacious living area accented by beautiful hardwood flooring and the first of two fireplaces you're enveloped with the warm feeling of love that has filled this home. Flowing off the living room of this expanded trinity, the full eat in kitchen is contemporarily designed with a subway tiled back splash, granite countertops, a brightly lit skylight shining down from the second floor, and a unique cut out above the sink allowing for the open flow feel of this wonderful living space. The second floor features the first of two bedrooms continuing with the hardwood flow throughout, your full bathroom bright with light from your second skylight, and the perfect hallway nook accented by that same skylight that shines all the way down to the kitchen. The master bedroom on the third floor features the second fireplace as well as a lighter hard wood finish that seems to draw in all of the natural light. This along with the high slanting ceiling give this room a very open airy feel making it a truly \"feel good\" space. Off of the master you will find the crown of this jewel of a home in a roof deck perfect for relaxing and enjoying all of the wonderful changing seasons our city has to offer. Take advantage of this amazing opportunity to be a part of a community that truly cares for each other in a home that will truly care for you.\n725-727 Pemberton St #6","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '858ft2', 'available nov 1', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:33:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547004346.html","post_id":7547004346,"result_date":"2022-10-18T14:05:08.000Z","title":"Bright and sunny apartment with a Fully Enclosed Bedroom","description":"Bright and sunny apartment with a Fully Enclosed Bedroom and Oversized Windows located in the heart of the historic Old City! 315 Flats is an Elevator Building with a welcoming lobby featuring Marble Floors and an Intercom\/Camera system for Additional Security. Upon entering unit 301, you're greeted by 10-foot ceilings and South-Facing Oversized Windows filling the living space with natural light. The kitchen features Stainless Steel Appliances, a built-in Microwave and Dishwasher, Granite Countertops, Modern Cabinetry, and an Island overlooking the living area. Hardwood Floors are throughout the living space and bedroom. The living room\/dining room combo offers views of The historic Quaker Meeting House and plenty of room for entertaining. The Bathroom includes a Double Sink, a Tub\/Shower combo, and Tiled floors. The in-unit Washer & Dryer are conveniently located in a dedicated closet. The 10-foot Ceilings and Oversized Windows continue in the spacious bedroom, which includes a Walk-In Closet and a modern shelving unit for additional storage. 315 Flats is situated in the heart of the neighborhood and steps from excellent restaurants, shops, Spruce Harbor Park, Independence Hall, Philadelphia's most historic sites, and all that Old City offers. Easy access to I-95, the Vine Street Expressway, and Ben Franklin Bridge. Schedule a private tour today! Garage parking options are located right around the corner.\n315 Arch St #301","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '777ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T09:41:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547010799.html","post_id":7547010799,"result_date":"2022-10-18T14:01:42.000Z","title":"2bed \/ 2bath unit with balcony! splendidly renovated House","description":"ONE MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!! Just 1st month's rent and $500 security deposit to move-in!!! 2bed \/ 2bath unit with balcony! This splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. The Warehouse is located in a highly walkable area with access to all forms of public transportation. Amenities include secured entry and controlled building access, on-site parking (additional $150\/month), full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a similar unit in the building!\n9-1 N 9th St #510","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '994ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:57:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547010400.html","post_id":7547010400,"result_date":"2022-10-18T14:00:50.000Z","title":"3 Bedroom house","description":"3 Bedroom House\n1 Bathroom\nFront Porch\nFront yard\nHardwood Floors throughout the house\nClose to public transportation\nLOCATION: 56 N Hirst Street, Philadelphia PA 19139 (West Philadelphia)","num_images":6.0,"lat":39.9612,"lng":-75.2303,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:56:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546995712.html","post_id":7546995712,"result_date":"2022-10-18T14:00:28.000Z","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"THREE BEDROOM\nTHREE BATH\nFURNISHED\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":11.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:16:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547009402.html","post_id":7547009402,"result_date":"2022-10-18T13:58:19.000Z","title":"Great studio available now at 3412 Spring garden!","description":"Cozy studio available now in university city area. Walking distance to Drexel university. Laundry room in the building. Window air conditioning. Hardwood floors. Tenants will be responsible only for electric. Security deposit, first and last month to move in. $55 application fee.\nRental Terms\nRent: $890\nApplication Fee: $55\nSecurity Deposit: $890\nAvailable now\nPet Policy\nCats allowed\nDogs allowed\nCall Alena for showing at  show contact info\nAlena Skorynina\nCity wide realty\n","num_images":6.0,"lat":39.9597,"lng":-75.2024,"attrs":"['0BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:54:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547008547.html","post_id":7547008547,"result_date":"2022-10-18T13:56:12.000Z","title":"Ready to lease upgraded 1st floor apartment home is perfect for you!","description":"1 Bedroom  1 Bathroom | 842 sq ft | $1931 - $2634\/Month The Gateway Apartments1515 Manley Rd West Chester, PA 19380 show contact info\nDescription: Residents of our West Chester, PA apartments enjoy a spacious one or two bedroom floor plan which adds warmth and comfort to any lifestyle. The Gateway provides a number of lavish amenities, including a full kitchen, 9-foot ceilings, walk-in closets, and large windows. Our premier location is close to public transportation and the most prominent dining, shopping, and recreational venues in the area, making our community perfect for commuters all across Chester County. Schedule a tour of our West Chester community today and see why residents love coming home. Apartment Amenities:◾ Air Conditioning & Heating◾ Alarm◾ Carpet◾ Den◾ Dining Room◾ Dishwasher◾ Trash Compactor◾ Tub\/Shower◾ Walk-In Closets◾ Window Coverings◾ Built-In Computer Nook (select homes)◾ Built-In Microwave Oven◾ Frost-Free Refrigerator\/Ice Maker◾ Garden\/Spa Tub (select homes)◾ Kitchen Pantry◾ Large Windows◾ Upgrade◾ Washer And Dryer In Each Apartment Home◾ Wired For High-Speed Internet◾ Wooded View\/Pool View (select homes)Our Residents Enjoy:◾ Business Center◾ Clubhouse◾ Fitness Center◾ Onsite Maintenance◾ Onsite Management◾ Package Service◾ Picnic and Grilling Area◾ Pool and Sundeck◾ Storage Space◾ Walking\/Biking Trails◾ Across From Wawa & Goshen Crossing Shopping Center◾ Beautifully Landscaped Grounds◾ Gated Entrances◾ Maintenance Free Lifestyle◾ Onsite Leasing Office◾ Pet-Friendly◾ Resort-Style Pool With Sun Deck◾ Storage Units For Lease◾ Three BBQ\/Picnic Areas◾ Wi-Fi Access in Clubhouse and at PoolAdditional Details:Deposit: CallTerms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthPets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonUpgraded ApartmentWebsite: https:\/\/www.thegatewayapartments.com\/All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY66333F8967D246\n","num_images":16.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '842ft2', 'available nov 21', 'air conditioning', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T09:52:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547007864.html","post_id":7547007864,"result_date":"2022-10-18T13:54:24.000Z","title":"1 BR 1Bath 2nd Flr Carriage House Apt. Unit #2","description":"Newly renovated 1 BR, 1 Bath Apartment with new kitchen and new bath. Newly installed Luxury vinyl tile floors throughout the unit. Central Air. NON-SMOKING Property. NO PETS.  Exterior Masonry Building with original charming millwork inside. Nice quiet residential neighborhood with big side yard. On-street Parking.","num_images":1.0,"lat":40.254835,"lng":-75.641617,"attrs":"['1BR \/ 1Ba', '850ft2', 'available oct 23', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:50:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547007821.html","post_id":7547007821,"result_date":"2022-10-18T13:54:18.000Z","title":"2 Bedroom House","description":"2 BEDROOM HOUSE\nRENOVATED\nWOOD FLOOR\nNEW KITCHEN\nNEW BATHROOM\nBACKYARD","num_images":12.0,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:50:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547007448.html","post_id":7547007448,"result_date":"2022-10-18T13:53:19.000Z","title":"229 Brown St #4","description":"Open House this Monday, 10\/24 from 12:00 pm - 12:45 pm! Gorgeous, charming and very spacious one bedroom bi-level with a den in the heart of Northern Liberties. This adorable apartment features hardwood floors, built-in bookshelves and tons of character. The huge windows and skylight let in tons of natural light. On the first floor you will find the laundry area, a spacious kitchen with plenty of room for a table, and a marvelous living room as well as an additional living space, which could be used as a home office or bonus area. The spiral staircase takes you up to the spacious bedroom, with tons of closet space and the three piece bathroom. There is also a convenient additional staircase outside the apartment that can be used for easy access between floors. Water is included with the rent. Now let's talk about location: in the heart of Northern Liberties, this property is close to all the restaurants and shops that make this one of the premier Philadelphia neighborhoods, as well as big-name destinations like Schmidt Commons, Liberties Walk, and the Fillmore just to name a few. Additionally, the property is close to I-95, the Market Frankford Line and other numerous SEPTA stops.","num_images":9.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '\\nmonday 2022-10-24\\n', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:49:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547007041.html","post_id":7547007041,"result_date":"2022-10-18T13:52:16.000Z","title":"Gorgeous, 2-bedroom Condo in Queen Village!!","description":"Available Now! A fantastic opportunity to rent a gorgeous, 2-bedroom condo in Queen Village. With hardwood floors, exposed brick, full laundry, gas cooking, air conditioning, and outdoor space—this unit has it all! Enter into the hallway of the building and then through the door of the unit to an open living room\/dining area featuring beautiful custom lighting & exposed brick. A large galley kitchen features a gas range and lots of storage. The long hallway leads to a full bath, a bright 2nd bedroom with full-sized laundry, and a master bedroom with a large closet. This unit has a private patio area that leads to the intimate, shared gated courtyard. Added features: Outside bike storage, extra storage in the basement and easy trash\/recycle area. Note: Photos are from a previous listing. The unit is vacant and ready for occupancy!\n213 Christian St #A","num_images":8.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '780ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:48:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547005440.html","post_id":7547005440,"result_date":"2022-10-18T13:51:52.000Z","title":"1 BR 1Bath 2nd Flr Carriage House Apt. Unit #3","description":"Newly renovated 1 BR, 1 Bath Apartment with new kitchen and new bath. Newly installed Luxury vinyl tile floors throughout the unit. Central Air. NON-SMOKING Property. NO PETS. Exterior Masonry Building with original charming millwork inside. Nice quiet residential neighborhood with big side yard. On-street Parking.","num_images":1.0,"lat":40.254835,"lng":-75.641617,"attrs":"['1BR \/ 1Ba', '850ft2', 'available oct 23', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:44:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547005746.html","post_id":7547005746,"result_date":"2022-10-18T13:48:53.000Z","title":"Bark park, 48-hour Maintenance Commitment, BBQ and deck area","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Alexa or Google Home Capable in all ApartmentsHuge walk-in closets with ample storageOnline Payments AvailableState-of-the-art fitness center overlooking the Manayunk canalUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living Rooms48-hour Maintenance CommitmentBark parkUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingBocce ball fieldMarble master baths, some with deep linen storageJogging trail right outside your doorUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/kevtlxey\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['1BR \/ 1Ba', '768ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-10-18T09:44:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547005721.html","post_id":7547005721,"result_date":"2022-10-18T13:48:49.000Z","title":"ONE MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!!","description":"ONE MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!! JUST $500 SECURITY DEPOSIT AND 1ST MONTH RENT TO MOVE-IN!!! Urban charm and spacious floor plans! This 2 bedroom unit is spacious and priced right! Located just one block from scenic Washington Square Park, our properties along Spruce Street are the perfect place to call home. These affordably priced properties are located close to shopping, dining, and entertainment venues, as well as all forms of public transportation. Hardwood flooring Exposed brick walls Living room Master bath Some units with decorative fireplaces. Dishwasher, A\/C, Microwave, and Laundry on site. Pictures are of the actual unit. Parking on-site available at 225.00 a month (waitlist). The 2nd bedroom is an open loft.\n727 Spruce St #3F","num_images":7.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '905ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T09:44:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546986914.html","post_id":7546986914,"result_date":"2022-10-18T13:46:19.000Z","title":"Luxury 2-bed aprat*2-story-open floor plan(cat or dog OK)","description":"Brand new luxury patio home located in Philadelphia, PA. This home has an open floor plan, windows a plenty for ample natural light and hardwood floors on the main level. The large kitchen with stainless steel appliances, hard surface counters and expansive island flow into an open dining area and large great room complete with a gas fireplace. A covered patio that backs to open space is just off of the great room, great view for those amazing sunsets. The master bedroom is located on the main level with attached ensuite, walk in closet and laundry room. An office\/bedroom and full bath round out the main floor. Upstairs is home to two large bedrooms, a full bath, large loft area, and open office space. This home is close to schools, parks, dining, entertainment.Great location, South of Girard (center city side of Girard). Less than a 10 min drive to City Hall. Lots of free parking in a nearby free public lot.\n-Off Street Parking\n-Pet Friendly(Cat or Dog)\n-Natural Fresh Painting\nAddress_980 N Marshall St #3, Philadelphia, PA 19123","num_images":1.0,"lat":39.968582,"lng":-75.14768,"attrs":"['2BR \/ 1Ba', '980ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T08:48:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546992087.html","post_id":7546992087,"result_date":"2022-10-18T13:43:18.000Z","title":"Great value in Fairmount! A tree-lined block in the heart of Fairmount","description":"Great value in Fairmount!! A tree-lined block in the heart of Fairmount acts as the idyllic foreground to 1707 Wallace St #2R. This updated 2 bed, 1.5 bath bi-level apartment sits on the top two floors of a 4-unit building. The exterior of the building features a classic red brick facade and detailed cornice trim. Inside the unit, you're greeted by a bright and open living room and dining area with soaring 9ft ceilings, tall windows, and beautiful hardwood floors. There's also a huge storage closet and a powder room. The home's kitchen is fitted with tons of cabinetry space, stainless steel appliances, including a dishwasher, and the in-unit laundry closet. The home's second level has a spacious bedroom, with great closet space, at the front. A full bathroom and another bedroom, ideal for an office or nursery, complete this level. 1707 Wallace St's central Fairmount location is a walker's paradise, earning a WalkScore of 92. The Philadelphia Museum of Art, Kelly Drive, and The Community College of Philadelphia are all within walking distance. Nearby Fairmount Ave and North Broad Street are lined with local shops, gyms, and restaurants, including Bar Hygge, Rybread cafe, SOUTH, and Osteria. Whole Foods, Target, and Wine & Spirits are also close by. Plus, there's easy access to public transportation, I-76, Drexel University, and The University of Penn. Schedule your in-person or virtual tour today!\n1707 Wallace St #2R","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1.5Ba', '990ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:05:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546992960.html","post_id":7546992960,"result_date":"2022-10-18T13:42:00.000Z","title":"This is a beautiful 3 bedroom \/ 1 bathroom single family home##@+++","description":"Available NOW: Welcome to 2112 Cross St! This is a beautiful 3 bedroom \/ 1 bathroom single family home featuring hardwood floors and unique character throughout. Enter through a lovely vestibule with a vintage glass door into your sizable living area. There's great space for different living room and dining room furniture set ups, and a beautiful iron rail staircase is to your right. A large window at the front and another by the dining area offers great sunlight, and there's a ceiling fan for year-round comfort. Head back to your separate kitchen, equipped with tile flooring, ample cabinetry above & below for storage, mosaic tile backsplash, and granite countertops. Out the back door is your sizable patio with room for a grill & patio furniture. Continue the tour upstairs on the 2nd level with wall-to-wall carpeting in the hallway and 3 bedrooms. The bedrooms all vary in size, and the primary bedroom is at the front with 2 windows and 2 closets for storage. Your full bathroom is also on this level and features gorgeous tiling and a full size bathtub \/ shower combo. Laundry is available in the unfinished basement along with additional storage options. Schedule your showing today! About The Neighborhood: This lovely, sun-soaked apartment is located in the Point Breeze neighborhood of Philadelphia. You'll be close to public transportation, Wharton Square and Chew Playgrounds, and great local spots for drinking and dining like Good Morning Breakfast, 22nd Street Cafe, Fine Wine & Good Spirits, Philly Tacos, American Sardine Bar, Mattei Family Pizza, On Point Bistro, Burg's Hideaway Lounge, The Tasty Toast, Point Breakfast, and much more! Lease Terms: Generally, first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord.  Pets are conditional on owner's approval and may require an additional fee, if accepted. (Generally $300\/dog and $250\/cat, or monthly pet rent). Tenants responsible for all utilities: water, gas, electricity, cable\/internet. Landlord Requirements: Applicants to make a minimum of 3x the monthly rent in verifiable net income, no landlord filings or evictions within the past 4 years, and must have a verifiable rental history. Call\/Text  show contact info\nfor more information on how to move in ASAP!!!","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 1Ba', '948ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:08:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546993182.html","post_id":7546993182,"result_date":"2022-10-18T13:36:46.000Z","title":"Amazing 2 Bed 2 full bath home located on Bella Vista!","description":"Amazing 2 bedroom 2 full bathroom home located on a quiet side street in Bella Vista! Enter into the living room with south-facing windows, exposed brick, and hardwood flooring throughout the home. The kitchen features stainless steel appliances, a hidden dishwasher, tons of useful counter space, a farmhouse sink, glass door leading to a private backyard. Upstairs you will find a large bedroom with a nice-sized closet with south-facing windows. You will also find a full bath with a tub on the second floor. There is also an open space that can be used as a bedroom, office, or flex space. This leads to a great deck overlooking the private backyard. The basement is fully finished and has great ceiling height. There is a full bathroom and laundry in the basement as well as an unfinished portion that is great for storage!\n1013 Salter St","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1.5Ba', '840ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:08:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547000876.html","post_id":7547000876,"result_date":"2022-10-18T13:35:18.000Z","title":"This Spacious Bi-level Apartment Incredible Location!","description":"This spacious bi-level apartment checks all of the boxes... hardwood floors, central heat\/AC, gas cooking, dishwasher, in-unit laundry, outdoor space, and an incredible location! In fact, this location has a Walk Score of 98, surrounded by some of the city's best coffee shops\/brunch spots (Shot Tower Coffee, Fitzwater Cafe, etc) and neighborhood favorites new and old such as Fitz on 4th, Saloon Restaurant, & Little Fish. Inside the apartment you'll enjoy the top two floors (2nd\/3rd) of the building, so no one living above you. The massive living room with exposed brick walls, 1\/2 bathroom, laundry, and kitchen\/dining area are all located on the 2nd floor. Off of the kitchen\/dining room you can enjoy the first of two decks, convenient for grilling and outdoor dining. On the top floor there is a full bathroom and 3 spacious bedrooms, all with full closets. The rear bedroom also has a sliding door which leads out to your 2nd private deck. Property is vacant and can be scheduled on short notice!\n762 S 5th St","num_images":5.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1.5Ba', '1408ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T09:31:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547000837.html","post_id":7547000837,"result_date":"2022-10-18T13:35:11.000Z","title":"Granite Countertops, Leasing Now, We Love Pets","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills offers all of the amenities your looking for and some you didn't even know you wanted. Check out our two-story clubhouse-complete with flat screen TVs, a 24-hour fitness center and a pool table. Enjoy our on-site yoga studio or our outdoor putting green. Visit us today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nCommunity Features\n* Bocce Ball\n* Easy Freeway Access\n* Bark Park\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* TV Lounge\n* Yoga Lounge\n* Fitness Studio\n* Putting Green\n* Sun Deck\n* Outdoor Grill Area\n* Swimming Pool\n* Community Lounge\n* Professionally Managed\n[#9445382]","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T09:31:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546996910.html","post_id":7546996910,"result_date":"2022-10-18T13:33:05.000Z","title":"Renovated 1 BR Apartment Home on Rittenhouse Square, Near Restaurants","description":"The home at 915 is available for lease at this moment! This 575 square foot Warhol one bedroom one bathroom apartment home on the 9th floor features large windows that mainly face south and have a view of Chancellor Street. One window in the living and dining room area faces west for morning shade and afternoon sunshine and has a park view. This renovated kitchen is nice with its white cabinets and granite countertops. This kitchen is fully-equipped with a dishwasher, disposal, microwave, and gas stove. The renovated bathroom tile is white. This home has neutral carpet. The Rittenhouse Claridge is located on Rittenhouse Square. Move into your new home as early as October 20, 2022!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to shopping, dining, and more! Go grocery shopping at the Rittenhouse Market, Venditore by Giordano, Trader Joe's, Giant, Target, Di Bruno Bros., Aldi, Reading Terminal Market, Giant Heirloom Market, Whole Foods, or Sprouts. Browse the books at Barnes & Noble. Shop at the retail stores on Rittenhouse Row such as Anthropologie, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, gorjana, Paper Source, Philadelphia Runner, Allbirds, The Dr. Martens Store, Brooklinen, Vince, Urban Outfitters, rag & bone, Theory, L'Occitane en Provence, and Marine Layer. Have breakfast, brunch, lunch or dinner at Rouge, Devon, Parc, Barclay Prime, Pietro's, Restaurant Aleksandar, Pizzeria Vetri, Marathon on the Square, a.kitchen, The Love, and Via Locusta. Savor a cup of coffee at La Colombe, Ultimo, Vibrant, Alchemy, Nook Bakery & Coffee Bar, Elixr, K'Far, and Di Bruno Bros. Savor scoops of gelato from Gran Caffe L'Aquila. Indulge in French ice cream at nearby Van Leeuwen. Try the Rittenhouse Churro at El Merkury. Stroll across the park and then grab a French baguette at Metropolitan Bakery. Indulge in a decadent Sunday brunch at Green Eggs. Relax with a manicure or pedicure at Philly Nails Bar. Catch a show at one of the many nearby theaters. Wander around the Mütter Museum. Shop at the weekly farmer's market every Saturday and Tuesday from 9:00 AM to 2:00 PM. There is so much to do in this area!\nCommunity Amenities:\n* High-rise building on Rittenhouse Square\n* 8,000 square foot resident lounge with free wifi\n* Top-of-the-line fitness center with park view\n* Sauna\n* Pet-friendly community complete with a dog spa! Please note that certain restrictions apply.\n* Fitness\/yoga studio\n* Package lockers by Luxer One\n* Bike storage in the attached parking garage\n* Nightly guest suites for the family and friends of current residents\n* Elevator building with 24\/7 front door attendant and concierge desk staff\n* 24\/7 maintenance\n* Laundry room on every floor\n* Larger laundry facility on the 3rd floor\n* Attached valet parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Unfurnished one bedroom one bathroom apartment home on 9th floor\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* White kitchen cabinets\n* Granite kitchen countertops\n* Renovated bathroom\n* Neutral carpet\n* Large mainly south-facing windows with Chancellor Street view\n* One west-facing window with park view\n* All utilities included (except cable and internet)\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 915 is still listed under the Warhol floor plan! Please make an appointment to tour with Michelle or Gabby using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com 24\/7. We welcome you to tour your new home in person. Live virtual tours in Zoom are also available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 22 month lease term.\n2-22 month lease terms available!\n* Rental rates, availability, and apartment home features are subject to change without notice. *\nWelcome home!","num_images":24.0,"lat":39.949803,"lng":-75.17056,"attrs":"['1BR \/ 1Ba', '575ft2', 'available oct 20', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T09:20:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546992243.html","post_id":7546992243,"result_date":"2022-10-18T13:31:48.000Z","title":"2 bed\/2bath Available Soon!","description":"Apt. 2510 — Oxford floor plan — 1,203 sq. ft. — $3,510\nThis 5th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T09:05:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546999542.html","post_id":7546999542,"result_date":"2022-10-18T13:31:44.000Z","title":"3 Bedroom house","description":"3 BEDROOM\n1 BATHROOM\nCorner House Very Nice\nWood floor\nRemodeled Kitchen\nRemodeled Bathroom\nFRESH PAINT\nNICE YARD SIZE\nNear School\n6934 Garman St. Philadelphia PA  19142 (Southwest Philly)","num_images":7.0,"lat":39.9223,"lng":-75.2338,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:27:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546999474.html","post_id":7546999474,"result_date":"2022-10-18T13:31:34.000Z","title":"Large 2 Bedroom 2 Bathroom Apartment Right by the Philadelphia","description":"IMAGES ARE OF ANOTHER UNIT IN THE SAME BUILDING UNIT ITSELF HAS A DIFFERENT LAYOUT. Large 2 bedroom 2 bathroom apartment right by the Philadelphia Rail Park. Unit is available at the beginning of August 2021. 1 Year Lease terms, $45 application fee. A minimum credit score of 620 is required or have a co-signer. If you have further questions, please feel free to contact me and I will do my best to answer them.\n439-47 N 13th St #1A","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '11700ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:27:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546992970.html","post_id":7546992970,"result_date":"2022-10-18T13:31:02.000Z","title":"This is a beautiful 3 bedroom \/ 1 bathroom single family home##@+++","description":"Available NOW: Welcome to 2112 Cross St! This is a beautiful 3 bedroom \/ 1 bathroom single family home featuring hardwood floors and unique character throughout. Enter through a lovely vestibule with a vintage glass door into your sizable living area. There's great space for different living room and dining room furniture set ups, and a beautiful iron rail staircase is to your right. A large window at the front and another by the dining area offers great sunlight, and there's a ceiling fan for year-round comfort. Head back to your separate kitchen, equipped with tile flooring, ample cabinetry above & below for storage, mosaic tile backsplash, and granite countertops. Out the back door is your sizable patio with room for a grill & patio furniture. Continue the tour upstairs on the 2nd level with wall-to-wall carpeting in the hallway and 3 bedrooms. The bedrooms all vary in size, and the primary bedroom is at the front with 2 windows and 2 closets for storage. Your full bathroom is also on this level and features gorgeous tiling and a full size bathtub \/ shower combo. Laundry is available in the unfinished basement along with additional storage options. Schedule your showing today! About The Neighborhood: This lovely, sun-soaked apartment is located in the Point Breeze neighborhood of Philadelphia. You'll be close to public transportation, Wharton Square and Chew Playgrounds, and great local spots for drinking and dining like Good Morning Breakfast, 22nd Street Cafe, Fine Wine & Good Spirits, Philly Tacos, American Sardine Bar, Mattei Family Pizza, On Point Bistro, Burg's Hideaway Lounge, The Tasty Toast, Point Breakfast, and much more! Lease Terms: Generally, first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord.  Pets are conditional on owner's approval and may require an additional fee, if accepted. (Generally $300\/dog and $250\/cat, or monthly pet rent). Tenants responsible for all utilities: water, gas, electricity, cable\/internet. Landlord Requirements: Applicants to make a minimum of 3x the monthly rent in verifiable net income, no landlord filings or evictions within the past 4 years, and must have a verifiable rental history. Call\/Text  show contact info\nfor more information on how to move in ASAP!!!","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 1Ba', '948ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:08:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546998893.html","post_id":7546998893,"result_date":"2022-10-18T13:29:39.000Z","title":"1 Bedroom Apartment","description":"1 Bedroom Apartment\nCompletely New Construction\nNew Floors\nNew Kitchen\nNew Bathroom\nNew Appliances\nElevator in Building\nLaundry in Building\nClose to Schools, Hospital & Transportation\nNo Pets Allowed\nLOCATION: 5101 N. 12TH STREET 19141","num_images":6.0,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:25:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546998010.html","post_id":7546998010,"result_date":"2022-10-18T13:27:06.000Z","title":"Must See! Top Floor, Pool View 1 Bedroom","description":"The Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two story one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, pantry, washer\/dryer, walk-through closet, living and dining areas, and a patio\/balcony on the main level. This unit also features a loft with a walk=in closet for extra storage!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\n[#9445476]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '786ft2', 'available nov 1', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:23:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546995569.html","post_id":7546995569,"result_date":"2022-10-18T13:20:02.000Z","title":"Work Pods, Ideal Location, Schedule a Tour","description":"The Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis studio apartment features a fully equipped kitchen, two spacious closets, and a washer\/dryer!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nApartment Features\n* Walk-in Closet\n* Garden Tub\n* Stainless Steel Appliances\n* Linen Closet\n* Washer and Dryer in unit\n* Kitchen Island\n* Private Patio or Private Balcony (on select apartments)\nCommunity Features\n* Professionally Managed\n* Bark Park\n* Sun Deck\n* Easy Freeway Access\n* Outdoor Grill Area\n* Swimming Pool\n* Fitness Studio\n* Spa\n* Billiards\n* TV Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* Yoga Lounge\n* Community Lounge\n[#9445352]","num_images":23.0,"lat":40.013891,"lng":-75.685564,"attrs":"['0BR \/ 1Ba', '584ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:16:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546991159.html","post_id":7546991159,"result_date":"2022-10-18T13:19:35.000Z","title":"Gorgeous bi-level condominium in Center City!","description":"Gorgeous bi-level condominium in Center City! The home features a contemporary eat-in kitchen (granite countertops, stainless steel appliances) on the main level, along with a bedroom and full bathroom. Downstairs, you'll find the living room, as well as another bedroom and a full bathroom with a tub. Enjoy central air, in-unit laundry, walk-in closets, a dishwasher, and hardwood floors throughout. The south-facing windows provide lots of light. Short walk to Rittenhouse Square, Broad Street Subway, and dozens of restaurants\/shops.\n1343 Lombard St #A","num_images":5.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '982ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T09:02:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546994517.html","post_id":7546994517,"result_date":"2022-10-18T13:17:04.000Z","title":"Extra Storage, Efficient Appliances, Storage Lockers","description":"Bedrooms: 1Bathrooms: 1Square Feet: 586Date Available: 2022-10-18Address: 1201 Chestnut StreetJuxtaposing the building’s 1902 Renaissance Rival architecture with Midtown Village’s contemporary nightlife and hip markets, The Commonwealth weaves a seamless tapestry of historic elegance and the vibrant urban culture of Center City Philadelphia, PA. This restored mid-rise community blends classic design with contemporary, upscale finishes that have resulted in multiple awards from the Pennsylvania Apartment Association for presentation, maintenance and service. Amenities Include:Spacious 1 & 2 Bedroom ApartmentsEfficient AppliancesRefrigeratorStorage LockersValet Dry-CleaningDishwasherHardwood FloorsCable ReadyAir ConditionerElectronic ThermostatBicycle StorageModern Kitchen AppliancesCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/eycp7taa\/commonwealthPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '586ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T09:13:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546992179.html","post_id":7546992179,"result_date":"2022-10-18T13:09:38.000Z","title":"Flush Mount Sinks with Goose Neck Faucets, Free Weights, Sundeck","description":"The Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Call Now -  show contact info\nx 54OR Text 54 to  show contact info\nto text our leasing team.Interested in more information? See link below:https:\/\/mack.touraptnow.com\/17s2e1 Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree. This is a 1 Bedroom, 1 Bath, approximately 776 Sq. Ft.  The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia. Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMvt3XgPNkgBX\n","num_images":10.0,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '776ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T09:05:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546990228.html","post_id":7546990228,"result_date":"2022-10-18T13:04:12.000Z","title":"Bi-level 1-bed Apt in the Spring Garden Section of Philadelphia","description":"Live at 1504 Green St unit #1F, a bi-level 1-bedroom apartment in the Spring Garden section of Philadelphia. This home features a modern and updated living space with a large window, an island kitchen with stainless steel appliances and private access to a small balcony area, and a spacious lower level bedroom with a huge closet and en suite bathroom. This apartment is a couple of blocks from the new Giant, Retro Fitness, BSL Station, and plenty more.\n1504 Green St #1F","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '900ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T09:00:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546984481.html","post_id":7546984481,"result_date":"2022-10-18T12:42:57.000Z","title":"Multi-Family - 58XX Delancey St (Unit 2)","description":"Description\n5834 Delancey St Philadelphia, PA 19143 (Unit 2)\n2bed, 1bath\n$1300 Monthly Rent\nQuestions? Call  show contact info\nExt. 1 or Text  show contact info\nOpen from 9am - 6pm Eastern Monday - Friday\nSchedule Showing Here\nhttps:\/\/app.tenantturner.com\/listings\/jacksonrentalhomes\n","num_images":10.0,"lat":39.955608,"lng":-75.238735,"attrs":"['2BR \/ 1Ba', 'available now', 'apartment', 'laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T08:38:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546983812.html","post_id":7546983812,"result_date":"2022-10-18T12:40:18.000Z","title":"Multi-Family - 58XX Delancey St (Unit 1)","description":"Description\n5834 Delancey St Philadelphia, PA 19143 (Unit 1)\n1bed, 1bath\n$1150Monthly Rent\nQuestions? Call  show contact info\nExt. 1 or Text  show contact info\nOpen from 9am - 6pm Eastern Monday - Friday\nSchedule Showing Here\nhttps:\/\/app.tenantturner.com\/listings\/jacksonrentalhomes\n","num_images":8.0,"lat":39.955608,"lng":-75.238735,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T08:36:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546976107.html","post_id":7546976107,"result_date":"2022-10-18T12:38:52.000Z","title":"beautiful renovated studio apartment ,minutes from Rittenhouse Square,","description":"please, Give me your contact number ...\nThis beautifully renovated studio apartment is available immediately! The moment you walk through the door the Tiger wood flooring leads you down the hallway to the full sized kitchen including: base cabinet with sink, two burner electric range, built in microwave, and full size fridge. The unit also includes a completely updated full bath with stone floor in shower, plank porcelain floor, and subway tile with bronze and stone inlays. The Arts Condominiums is located across from the Academy of Music and minutes from Rittenhouse Square, Jefferson, and PA hospitals. Enter the building through security doors to a large luxurious main lobby with seating and a 24\/7 desk attendant. Unit has 9 foot ceilings, Central AC, and two large windows which provide plenty of natural sunlight. Easy access to elevators and clean well kept trash room. Partial views of symphony house & Kimmel Center Glass Dome, convenient mailbox rooms and multiple passenger and freight elevators. There is an on-site Barber Shop, Hair Salon, newly remodeled fitness center, laundry facility, business center\/lounge area, and bike storage room. Pet friendly environment (one cat or dog,  ).","num_images":7.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '320ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T08:00:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546959908.html","post_id":7546959908,"result_date":"2022-10-18T11:30:25.000Z","title":"Beautiful corner townhouse for rent 3 bedroom 1 bath newly renovated.","description":"A beautiful corner townhouse with original (1st floor) and new Brazilian hardwood (2nd floor) floors. Three bedrooms are on the second floor along with the full bath, which contains a jetted jacuzzi tub. The first floor consists of the living room with an ornamental fireplace, the dining room with storage closet, and a kitchen with two doors, one to the beautiful backyard (with a giant fig tree!) and one to the concrete finished basement. The unit is flanked by two beautiful stone churches and literally steps away from the 42 and 21 busses, and a 10 min walk from the MFL or Baltimore ave. The typical uneven Philly sidewalk adjacent to the house was just remade as well with new cement poured recently. Amenities included: washer\/dryer, boiler, water heater, fridge, gas stove, air conditioner units. Call for more information___ show contact info","num_images":3.0,"lat":40.0118,"lng":-75.1456,"attrs":"['3BR \/ 1Ba', '1440ft2', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-10-18T05:38:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7546964551.html","post_id":7546964551,"result_date":"2022-10-18T10:42:05.000Z","title":"Wanamaker House Studio 2020 Walnut St","description":"Wanamaker House Studio Unit 8G - 543 square feet. Wanamaker House is a full service high rise Doorman building with 24\/7 Security. 8G has a fully equipped kitchen with frost free frig, self cleaning range, dishwasher, garbage disposal, and a ton of cabinets. There are 3 huge clothes closets, and a linen closet, 21 foot living room with bay window with City Skyline views, individually controlled HVAC. Washer\/dryer on each floor of building. Easy walk to Upenn, Chop, and HUP. Half block walk to all Rittenhouse Square has to offer. There is a roof top pool, gym, hospitality room, and parking for a fee if available. Floor plan available upon request. Yearly lease, no pets, non smoking building. $50 non refundable application fee. One month security deposit, first and last months rent all due upon signing of the lease. Landlord is a licensed realtor in the state of PA.","num_images":24.0,"lat":39.950562,"lng":-75.174064,"attrs":"['0BR \/ 1Ba', '543ft2', 'available nov 1', 'air conditioning', 'condo', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T06:38:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547238726.html","post_id":7547238726,"result_date":"2022-10-18T21:54:11.000Z","title":"2 bed 2 bath, FIRST FLOOR, Hardwood, Stainless Steel Appls, & Balcony","description":"Metropolitan East Goshen Estates!\nM-F: 9-6 pm\nSat: 10-4PM\nThe Metropolitan East Goshen Estates Luxury Apartment Homes is located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Giant, Acme and Whole Foods Supermarkets, along with various retailers, making shopping for your personal needs a breeze! Off of Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, Gay Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, West Goshen, and King of Prussia.\nApt 229-!! Luxury apartment home with upgraded fixtures and finishes. Conveniently located in West Chester. TONS of storage, high end finishes. Call for an appointment!! Chef inspired kitchen with stainless steel appliances. Private ENTRANCE! Real hardwood flooring! Huge walk in closets!\n-Barbecue \/ Picnic Area\n-Salt Water Pool\n-Walk-In Closets\n-Central Heat\/Air\n-Private Off-Street Parking\n-Full Size Washer \/ Dryer\n-Chef Inspired Open Kitchen Concept\n-2 Dog Parks\n-Spacious Floor Plans\n-Patios \/ Balconies\n-Refrigerators with Ice Maker\n-Two Fitness Centers\nstarting at $2435.00\nCall:  show contact info\nFor more information, visit us at:yourmetropolitan.com\nEqual Housing Opportunity\n","num_images":14.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1120ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T17:36:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547236721.html","post_id":7547236721,"result_date":"2022-10-18T21:35:22.000Z","title":"One Bedroom w\/ a Den Space, W\/D, D\/W, Balcony & MOVE IN READY!","description":"Metropolitan East Goshen!\nOne bedroom apartment home with BALCONY, NEW CARPET & FULL SIZE W\/D.\nVisit your new apartment home by taking a self-guided tour with Sierra today! Please call us OR email today to set up your personalized tour through our outstanding community. We are open and available to meet your needs.\nThe Leasing Office is open Monday-Friday: 9:00-6:00 pm. Saturday 10-4PMWe look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application, visit us at: yourMetropolitan.com\/eastgoshen\nUnit 35:\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Kitchen\n*Dishwasher\/ Microwave\n*Refrigerator with Ice Maker\n*Air Conditioning\n*Window Treatments\n*Upgraded Bathroom\n*Spacious Walk-in Closets\n*Plush Wall-to-Wall Carpeting\n🐶PET FRIENDLY🐱\nCOMMUNITY AMENITIES\n*24 Hour Fitness Center\n*Salt Water Pool Available\n*Barbecue & Picnic Area\n*Off-Street Parking\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\nThe Metropolitan East Goshen Premium Apartment Homes is located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Giant, Acme, Whole Foods, Weis, Trader Joes, and Wegmans Supermarkets, along with various retailers, making shopping for your personal needs a breeze. Off of Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, Gay Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\n*CALL NOW TO SCHEDULE AN APPOINTMENT*\nEQUAL HOUSING OPPORTUNITY\n","num_images":8.0,"lat":39.96692,"lng":-75.551165,"attrs":"['1BR \/ 1Ba', '650ft2', 'available now', 'air conditioning', 'application fee details: 60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T17:31:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547224398.html","post_id":7547224398,"result_date":"2022-10-18T21:06:59.000Z","title":"Immaculate design coupled with first-class amenities.","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N.American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:2\nBathrooms:2\nSquare Footage:1135-1260 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday   10:00 - 5:00\n· Sunday    12:00 - 5:00\nLeasing Special\nReduced Security Deposit and Waived Application Fee when you move-in by 11\/30\/2022 and apply within 48 hours of your tour! *Security Deposit reduced from 1 Month's Rent to $1,000.00! *Up to 3 Application Fees Waived\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 2BR floor-plans in the sought after Fishtown\/Northern Liberties 19122 zip-code.\nConvenient to I-95, 676 and Girard Avenue, getting around the city is a breeze whether you're driving, taking public transportation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company,\na Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":23.0,"lat":39.971179,"lng":-75.140092,"attrs":"['2BR \/ 2Ba', '1135ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T17:02:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547224131.html","post_id":7547224131,"result_date":"2022-10-18T21:06:29.000Z","title":"Pet Friendly Two Bedroom Apartment in Gated Community","description":"RENT: $2229 - $2692\/Month | SIZE: 1043 sq ft | BEDROOMS: 2 | BATHROOMS: 2LEASE TERMS: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nABOUT COMMUNITY: Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.Pet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.UNIT FEATURES:   ❖ Air Conditioning & Heating❖ Carpet❖ Ceiling Fans (Select Floor Plans)❖ Dining Room❖ Heating❖ Range, Oven, Disposal, Oven❖ Refrigerator, Freezer and Ice Maker❖ Tub\/Shower❖ Wi-Fi❖ Window Coverings❖ Crown Molding (Select Floor Plans)❖ Linen Closet❖ Microwave❖ Storage Units❖ Tile Floors❖ Trash Compactor❖ Vaulted Ceiling (Select Floor Plans)❖ Walk-In Closets (Select Floor Plans)❖ Washer\/Dryer❖ Wheelchair Accessible (Rooms)COMMUNITY FEATURES: ❖ 24 Hour Availability❖ Elevator❖ Furnished Units Available❖ Gated, Controlled Access❖ Multi-Use Room❖ Online Services❖ Pet Friendly❖ Pet Play Area❖ Planned Social Activities❖ Recycling❖ BBQ Picnic Garden❖ Billiards, Club Lounge, Cafe Area, Library and Community Room❖ Fitness Center w\/ Free Weights, Weight Machines❖ Message Therapist Practice On-site❖ Outdoor Cafe & Coffee Bar❖ Outdoor Patio Lounge❖ Sprinkler System❖ Storage Space❖ Wi-Fi at ClubhouseCONTACT US TODAY!The Glen at Lafayette Hill555 Andorra Glen Ct  Lafayette Hill, PA 19444Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMWebsite: https:\/\/www.the-glen-apartments.com Professionally managed by Paradise Management, LLC All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7FEB687AB31D403\n","num_images":17.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1043ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T17:02:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547222295.html","post_id":7547222295,"result_date":"2022-10-18T21:02:41.000Z","title":"Large Studio Apartment! Great Location! Washer & Dryer!","description":"Large Studio Available at The Metropolitan! $500 off your first month! *restrictions apply.\nGenerous closet space and free storage.\nWasher\/Dryer in Unit.\nConvenient to Suburban Station and Reading Terminal!\nComplimentary amenities AND $500 Security deposit for qualified applicants.\nIn-Person and Virtual Tours. Walk-Ins Welcome!\n. Spacious Floor Plan\n. Garbage Disposal\n. Microwave\n. Dishwasher\n. Washer\/Dryer in Unit\n. Pet Friendly (Restrictions Apply)\n. State-of-the-Art Fitness Center\n. Indoor Basketball Court\n. Roof Deck with Amazing City Views\n. Conference Room\n. Resident lounge\/Multi-Purpose Room\n. On Site Maintenance\n. 24\/7 Lobby Attendant\n. Convenient Location\nJAR Reinhold Residential Real Estate LLC\nhttps:\/\/reinholdresidential.com\/properties\/the-metropolitan\/\n","num_images":23.0,"lat":39.955078,"lng":-75.164742,"attrs":"['0BR \/ 1Ba', '536ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T16:58:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547219739.html","post_id":7547219739,"result_date":"2022-10-18T20:56:31.000Z","title":"1 bedroom, 1 bath TOP FLOOR LUXURY CONDO with balcony view.","description":"This light and airy condo looks like a stone cottage. It is tucked away in a quiet corner in Newtown Borough; - a convenient to walk to the center of historic Newtown. Stroll by charming shops and restaurants. There is even a Starbucks and a local movie theater.\nIncludes appliances, central air conditioning and a full-size washer and dryer. Pergo style laminate wood floors look just like hardwood. There is a large walk-in closet plus a 6-foot closet in the dressing area. That’s more storage than any one-bedroom condo I have ever seen. This condo has its own private entrance, convenient off-street parking and a private balcony overlooking trees and lawn.\nEasy access to route 95 for convenient commuting to Philadelphia or to New York via Amtrack. Close to Langhorne, Holland, Yardley and Richboro.\nCondo fees are paid by the landlord, which includes trash collection, snow removal and landscaping. Available December 1, 2022.\n$1595 per month plus utilities.\nCall Allan\n994-9464 cell in area 267\n1 year lease, $1595 security deposit. At least one occupant or a married couple must show a minimum $64,000 income verification and 700 or better FICO credit score.\n","num_images":7.0,"lat":40.222528,"lng":-74.935021,"attrs":"['1BR \/ 1Ba', '780ft2', 'available dec 1', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T16:52:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547172091.html","post_id":7547172091,"result_date":"2022-10-18T20:40:14.000Z","title":"- Beautiful westside home is a 2 bedroom, 1.5 bath ranch","description":"This beautiful westside home is a 2 bedroom, 1.5 bath ranch situated on a 1.47 acre lot with lake access. The home includes a finished basement and has been completely renovated. The property is located on a corner lot and features a wonderful private setting with views of the lake. As you enter the home, you'll be greeted by a large great room, which opens to the renovated kitchen with brand new stainless steel appliances, new quartz countertops, and new cabinetry. The main level also features a primary bedroom with a completely updated, attached full bath, an additional bedroom, and a half hall bath. The finished walk-out basement includes a bedroom, a full bath, a flex entertainment area, and a mudroom\/laundry room with access to the 2.5 car attached garage. The backyard features a paver-patio, and an abundance of space for gathering with friends and family around the fire pit. Per Seller- Updates include: - All new roof, all new electric, All new HVAC, All new plumbing, All new flooring throughout, All new hardware and fixtures, All new doors, All new kitchen & Appliances, Added 80 tons of dirt and had yard professionally excavated and graded,\nIf you are interested or have any questions please call: (855)-8_6_5_2_6_7_9**","num_images":1.0,"lat":40.0596,"lng":-75.0818,"attrs":"['2BR \/ 1Ba', 'available now', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T15:13:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547211762.html","post_id":7547211762,"result_date":"2022-10-18T20:39:00.000Z","title":"Beautiful 2 bedroom, 2 bath apartment! Great Location! Nice Views!","description":"Large 2 Bed, 2 Bath Apartment Available at The Metropolitan! Over 1200 square feet!\nGenerous closet space and free storage.\nWasher\/Dryer in Unit.\nConvenient to Suburban Station and Reading Terminal!\nComplimentary amenities AND $500 Security deposit for qualified applicants.\nIn-Person and Virtual Tours. Walk-Ins Welcome!\n. Spacious Floor Plan\n. Garbage Disposal\n. Microwave\n. Dishwasher\n. Washer\/Dryer in Unit\n. Pet Friendly (Restrictions Apply)\n. State-of-the-Art Fitness Center\n. Indoor Basketball Court\n. Roof Deck with Amazing City Views\n. Conference Room\n. Resident lounge\/Multi-Purpose Room\n. On Site Maintenance\n. 24\/7 Lobby Attendant\n. Convenient Location\nJAR Reinhold Residential Real Estate LLC\nhttps:\/\/reinholdresidential.com\/properties\/the-metropolitan\/\n","num_images":24.0,"lat":39.955078,"lng":-75.164742,"attrs":"['2BR \/ 2Ba', '1220ft2', 'available nov 25', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T16:35:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547208415.html","post_id":7547208415,"result_date":"2022-10-18T20:31:52.000Z","title":"Save Today On This Beautiful 2 Bedroom apartment with fireplace !","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nOffering one, two and three  bedroom apartments with private entrances, these apartments more closely resemble private townhomes rather than an apartment rental community.  Easy access to Route 422, the main artery between Reading, Pottstown and King of Prussia.\nDetails\nAvailability date: Today\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Our Pet Policy: $30\/month pet rent. $400 (Non-refundable pet fee) for “first pet” and $250 (Non-refundable pet fee) for the “second pet.” Maximum of 2 pets per apartment home. No pet deposit. Breed Restrictions Apply. No aggressive breeds shall be permitted.\nDeposit: $1,000.00\nLeasing options: 12+ months\nLeasing notes:\nApplication fee: $50 per adult\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage\nUtilities Cost: Varies by apartment size\nLaundry: In Unit\nParking type: Garage\nParking notes:\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard\nHeating\/cooling: Heat: forced air, Central AC, Ceiling fans\nWiring: Cable-ready, High-speed internet, Wired, Intercom system\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Playground, Barbecue, Business center, Golf course\nSecurity and Access:\nViews:\nAdditional features: Hardwood floor, Tile floor, Granite countertop, Fireplace, Vaulted ceiling, Jacuzzi, Sauna, Hot tub \/ Spa, Non-Smoking Property\nOffered by:\nBotanica Cottages\nEqual Housing Opportunity","num_images":21.0,"lat":40.235417,"lng":-75.535466,"attrs":"['2BR \/ 2Ba', '975ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T16:27:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547204937.html","post_id":7547204937,"result_date":"2022-10-18T20:24:16.000Z","title":"Celebrate the Savings Here At Botanica!(Ask Us How You Can Save Today)","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nOffering one, two and three  bedroom apartments with private entrances, these apartments more closely resemble private townhomes rather than an apartment rental community.  Easy access to Route 422, the main artery between Reading, Pottstown and King of Prussia.\nDetails\nAvailability date: November 26, 2022\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Our Pet Policy: $30\/month pet rent. $400 (Non-refundable pet fee) for “first pet” and $250 (Non-refundable pet fee) for the “second pet.” Maximum of 2 pets per apartment home. No pet deposit. Breed Restrictions Apply. No aggressive breeds shall be permitted.\nDeposit: $1,000.00\nLeasing options: 12+ months\nLeasing notes:\nApplication fee: $50 per adult\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage\nUtilities Cost: Varies by apartment size\nLaundry: In Unit\nParking type: Garage\nParking notes:\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard\nHeating\/cooling: Heat: forced air, Central AC, Ceiling fans\nWiring: Cable-ready, High-speed internet, Wired, Intercom system\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Playground, Barbecue, Business center, Golf course\nSecurity and Access:\nViews:\nAdditional features: Hardwood floor, Tile floor, Granite countertop, Fireplace, Vaulted ceiling, Jacuzzi, Sauna, Hot tub \/ Spa, Non-Smoking Property\nOffered by:\nBotanica Cottages\nEqual Housing Opportunity","num_images":21.0,"lat":40.235417,"lng":-75.535466,"attrs":"['2BR \/ 2Ba', '975ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T16:20:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547203435.html","post_id":7547203435,"result_date":"2022-10-18T20:21:00.000Z","title":"On-Site Management, Multiple, Expansive Outdoor Spaces, Garage","description":"The Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Use this link for more info:https:\/\/mack.touraptnow.com\/03782h Call Now:  show contact info\nx 56OR Text 56 to  show contact info\nto contact us.Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree. This is a 2 Bedroom, 2 Bath, approximately 1268 Sq. Ft.  The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia. Features - Large Closets with Organizing Systems  - Custom Subway Tile Backsplashes  - Selected  - Disposal  - Cable Ready  - Patio\/Balcony*  - Stone Counters  - Washer\/Dryer  - Tons of Natural Lighting Throughout  - Electronic Thermostat  - Flush Mount Sinks with Goose Neck Faucets  - Dishwasher  - Air Conditioner  - Premium Stainless Steel Appliance Package  - Hardwood Style Flooring  - Gas Range *In Select Apartment Homes Community Amenities - Smoke-Free Community  - Garage  - Off Street Parking  - Multiple, Expansive Outdoor Spaces  - Free Weights  - Elevator  - On-Site Management  - Playground  - Rooftop Dog Park  - On-Site Maintenance  - Courtyard  - Selected  - Tennis Court  - BBQ\/Picnic Area  - Fitness Center  - Parisian Style Café with Demonstration Kitchen  - Sundeck  - Multiple Co-Working Studios  - Covered Parking Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMPet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. bKOQvO7JOpnf\n","num_images":8.0,"lat":40.0118,"lng":-75.2342,"attrs":"['2BR \/ 2Ba', '1268ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T16:17:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547198129.html","post_id":7547198129,"result_date":"2022-10-18T20:10:32.000Z","title":"Mid-size Studios Becoming Available!! Heat\/Water Included!!","description":"Sunny, mid-sized and large studio apartments STARTING at $1,105! Apartments feature upgraded kitchens and baths, amazing views, large windows and 9 ft. ceilings. Ask about our NO SECURITY DEPOSIT program!! Cats are welcome (add'l fee)! All apartments are rented unfurnished.\nChancellor Apartments is a convenient high rise apartment community in an amazing location in Center City. We are close to most major schools and universities, public transportation, historical attractions, shopping, restaurants and theaters. Center City at its best!!\nRent includes: heat, hot\/cold water, 24-hour front desk attendant, free bike storage room, package acceptance service, 24-hour emergency maintenance service, on-site smart card laundry plus card access system and BuildingLink resident services portal access for all residents.\nThe Chancellor boasts several different studio and one bedroom floor plans. Apartments feature high ceilings, large bright windows, ceiling fans in most units, hardwood floors and breathtaking views of the Philadelphia skyline and Delaware River. Many apartments have large walk-in closets, too!\nWe have partnered with Optimal Sport Health Club to offer a generous discounted gym membership (we pay your initiation fee!). There are several off street parking lots and garages in the area, too!\nCHANCELLOR APARTMENTS\n206 S. 13th Street\nPhiladelphia, PA 19107\nshow contact info\nFranceina Thorne, REALTOR\nHours:\nMon. - Fri. 8:30 to 5:00\nSaturday - 10:00 to 3:00\nAppointments are highly recommended","num_images":14.0,"lat":39.948681,"lng":-75.162197,"attrs":"['0BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T16:06:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547195471.html","post_id":7547195471,"result_date":"2022-10-18T20:05:35.000Z","title":"Stay Warm In A Beautiful  Apartment Home This Winter!","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nOffering one, two and three  bedroom apartments with private entrances, these apartments more closely resemble private townhomes rather than an apartment rental community.  Easy access to Route 422, the main artery between Reading, Pottstown and King of Prussia.\nDetails\nAvailability date: December 17, 2022\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Our Pet Policy: $30\/month pet rent. $400 (Non-refundable pet fee) for “first pet” and $250 (Non-refundable pet fee) for the “second pet.” Maximum of 2 pets per apartment home. No pet deposit. Breed Restrictions Apply. No aggressive breeds shall be permitted.\nDeposit: $1,000.00\nLeasing options: 12+ months\nLeasing notes:\nApplication fee: $50 per adult\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage\nUtilities Cost: Varies by apartment size\nLaundry: In Unit\nParking type: Garage\nParking notes:\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard\nHeating\/cooling: Heat: forced air, Central AC, Ceiling fans\nWiring: Cable-ready, High-speed internet, Wired, Intercom system\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Playground, Barbecue, Business center, Golf course\nSecurity and Access:\nViews:\nAdditional features: Hardwood floor, Tile floor, Granite countertop, Fireplace, Vaulted ceiling, Jacuzzi, Sauna, Hot tub \/ Spa, Non-Smoking Property\nOffered by:\nBotanica Cottages\nEqual Housing Opportunity","num_images":24.0,"lat":40.235417,"lng":-75.535466,"attrs":"['3BR \/ 2Ba', '1400ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T16:01:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547182881.html","post_id":7547182881,"result_date":"2022-10-18T19:59:16.000Z","title":"2 bedroom apartment","description":"2 bedroom, 1 bath apartment available November 1st.  Located close to train station, shopping, schools and parks.  Parking available on site. No pets, no smoking.","num_images":3.0,"lat":40.242258,"lng":-75.282767,"attrs":"['2BR \/ 1Ba', 'available nov 1', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T15:35:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547163394.html","post_id":7547163394,"result_date":"2022-10-18T19:58:27.000Z","title":"How To Live Better - 101","description":"Find the perfect apartment to cozy up!\nOur fully renovated apartments are located within the iconic Croydon Hall. Each apartment features amazing views and tons of light in addition to granite countertops, stainless steel appliances, spacious layouts, environmentally friendly PVC and tile flooring, self-controlled heating and cooling via PTAC unit, and bathrooms equipped with a rainfall showerhead, tying everything together with sleek, modern finishes you'll be sure to love.\nApartment 101 - 1BD, 1 BA\nMonthly Rent: $1,400.00\nApplication Fee: $50 per tenant\nSquare Footage: 650\nLease Term: Flexible - Please Enquire!\nIncluded Utilities: Water, Sewer, Trash, Recycle\nTenant Pays: Electric, Cable\/Internet\nSchools: Henry C. Lea Elementary, West Philadelphia High School\nParking: Street Parking is Free\nStorage: Indoor Storage Units Available for $24.99\/month\nUnique Features\n- Loading Zone for all your shopping needs\n- Secure Entry with FOB access\n- Online Resident Portal\n- Smoke-Free Building\n- Conference Room\n- Free Bicycle Storage and Free Air for bike tires\n- Enclosed Community Courtyard with gazebo, firepit, lawn games, and grill!\n- Recreation Lounge with TV, Games, Vending Machines, & more\nThe Amenities\n- Lobby Staffed 24\/7 with Package Concierge\n- Elevator\n- Recently renovated 24-hour Laundry Room with card or mobile app payment\n- Fully Equipped Fitness Center in Building\n- Recreation Lounge with TV, Games, Vending Machines, & more\n- Playroom for the kiddies\nPet Policy\nPets are residents, too!\nTwo pets per apartment.\nBreed & Weight restrictions apply*.\nNon-refundable pet fee of $200\/per pet.\nNo pet rent!\nThe Community\n- Within walking distance to Baltimore Ave., there are a number of cafes, restaurants, shops, co-ops, parks, community gardens, & even a tennis court in the neighborhood to enjoy!\n- There are 2 bus stops within a block and a half (#42 & #21) and the MFL station is just a 10-15 minute stroll.\n- Prefer to bike? We've got you covered with indoor bicycle racks, too!\nInterested?\nProperty Management works on-site and is available M-F 9:30A-4:30P. Evening & weekend tours can be arranged with an agent as well. Need a virtual tour? We can do so if you have an iphone or ipad. Contact me today to schedule your private tour!\nDon't see your move-in date?\nAsk! We're sure to have something you'll love.\n*All animals must be approved by management prior to move-in and during the course of residency.\nPhotos are of our model apartment.\nAvailability is subject to change rapidly, so contact us ASAP to schedule your\nprivate tour of our available floor plans!\n","num_images":22.0,"lat":39.954343,"lng":-75.21987,"attrs":"['1BR \/ 1Ba', '650ft2', 'available oct 24', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:55:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547188950.html","post_id":7547188950,"result_date":"2022-10-18T19:52:00.000Z","title":"Experience the Beauty of Autumn Here at Botanica Cottages!","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nOffering one, two and three  bedroom apartments with private entrances, these apartments more closely resemble private townhomes rather than an apartment rental community.  Easy access to Route 422, the main artery between Reading, Pottstown and King of Prussia.\nDetails\nAvailability date: Today\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Our Pet Policy: $30\/month pet rent. $400 (Non-refundable pet fee) for “first pet” and $250 (Non-refundable pet fee) for the “second pet.” Maximum of 2 pets per apartment home. No pet deposit. Breed Restrictions Apply. No aggressive breeds shall be permitted.\nDeposit: $1,000.00\nLeasing options: 12+ months\nLeasing notes:\nApplication fee: $50 per adult\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage\nUtilities Cost: Varies by apartment size\nLaundry: In Unit\nParking type: Garage\nParking notes:\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard\nHeating\/cooling: Heat: forced air, Central AC, Ceiling fans\nWiring: Cable-ready, High-speed internet, Wired, Intercom system\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Playground, Barbecue, Business center, Golf course\nSecurity and Access:\nViews:\nAdditional features: Hardwood floor, Tile floor, Granite countertop, Fireplace, Vaulted ceiling, Jacuzzi, Sauna, Hot tub \/ Spa, Non-Smoking Property\nOffered by:\nBotanica Cottages\nEqual Housing Opportunity","num_images":21.0,"lat":40.235417,"lng":-75.535466,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T15:48:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547172068.html","post_id":7547172068,"result_date":"2022-10-18T19:45:12.000Z","title":"- Two years lease has a big rent discount","description":"Brand new carpet flooring! Two years lease has a big rent discount! $1000\/month only for a two years lease!! We also accept a one year lease! Great location; great schools, great value! This house is available now. Qualified people with no less than $70000 annual family gross income can schedule a time with us for a showing. 4 bedroom, 2 1\/2 bath beautiful house in popular Oak Hall Neighborhood. This neighborhood has a beautiful pool. Big Lot! Large family Room with fireplace! Washer and dryer included! Large Master suite with spacious master bath! Attached Garage! Don't miss the private fully fenced in yard with playset and bamboo bushes! This house is in the ever-beautiful Holly Springs..... only 2 miles from Apex. Walk to shopping and restaurants. Rent: $1000\/month for 2 year lease;..1893 square feet! You can only rent a townhouse in Cary or Apex with this amount. Please contact me directly to schedule a time for individual shows.\nIf you are interested or have any questions please call: (855)-8_6_5_2_6_7_9**","num_images":1.0,"lat":40.0247,"lng":-75.0518,"attrs":"['4BR \/ 2Ba', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T15:13:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547185159.html","post_id":7547185159,"result_date":"2022-10-18T19:44:01.000Z","title":"Large Bedroom & Closet\/ Third Floor\/ Near Shopping Centers\/ Pool\/ Gym","description":"RENT PERIOD: YEARLY\nAsk about apartment home A09 on the third floor available now!!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up a tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday: 9:00 am-6:00 pm, Fridays: 9am – 5pm and also Saturday from 10:00 am-4:00 pm. * Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\n-Full Size Washer\/Dryer In select homes.\nCOMMUNITY FEATURES:\n-On-Site Management\n-On-site maintenance\/24 hour emergency service\n-Septa Bus stop on the corner\n-Ivy Ridge Train Station blocks away\n-Online Payments Available\n-Cable Ready\n-On line service request\n-Septa Transportation outside the Rental Office\n-Pool located at sister property(Pool membership available. Fees Apply)\n-Gym located at sister property\nThe Metropolitan Manayunk Hill apartment homes, are just minutes to Center City Philadelphia, Manayunk Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA turnpike. Walk to Ivy Ridge Shopping Center and ShopRite Supermarket. Convenient to Ivy Ridge Train Station to Center City, Andorra Shopping Center, Target and more! The Metropolitan Manayunk Hill apartment homes are a great choice for both convenience and a quality of life. that's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity.\n","num_images":12.0,"lat":40.043502,"lng":-75.236199,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T15:40:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547181570.html","post_id":7547181570,"result_date":"2022-10-18T19:36:36.000Z","title":"Large Closets, Near Laundry Room, Cat Friendly, Pool, Gym, BBQ Grills","description":"RENT PERIOD: YEARLY\nAsk about apartment home 121 on the first floor, available mid-November!!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday 9:00 am-6:00 pm, Fridays 9:00 am-5:00 pm, and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity","num_images":13.0,"lat":40.053166,"lng":-75.236179,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T15:32:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547179721.html","post_id":7547179721,"result_date":"2022-10-18T19:33:01.000Z","title":"Carve Out A Great Life at Botanica Cottages!","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nOffering one, two and three  bedroom apartments with private entrances, these apartments more closely resemble private townhomes rather than an apartment rental community.  Easy access to Route 422, the main artery between Reading, Pottstown and King of Prussia.\nDetails\nAvailability date: October 20, 2022\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Our Pet Policy: $30\/month pet rent. $400 (Non-refundable pet fee) for “first pet” and $250 (Non-refundable pet fee) for the “second pet.” Maximum of 2 pets per apartment home. No pet deposit. Breed Restrictions Apply. No aggressive breeds shall be permitted.\nDeposit: $1,000.00\nLeasing options: 12+ months\nLeasing notes:\nApplication fee: $50 per adult\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage\nUtilities Cost: Varies by apartment size\nLaundry: In Unit\nParking type: Garage\nParking notes:\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard\nHeating\/cooling: Heat: forced air, Central AC, Ceiling fans\nWiring: Cable-ready, High-speed internet, Wired, Intercom system\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Playground, Barbecue, Business center, Golf course\nSecurity and Access:\nViews:\nAdditional features: Hardwood floor, Tile floor, Granite countertop, Fireplace, Vaulted ceiling, Jacuzzi, Sauna, Hot tub \/ Spa, Non-Smoking Property\nOffered by:\nBotanica Cottages\nEqual Housing Opportunity","num_images":22.0,"lat":40.235417,"lng":-75.535466,"attrs":"['2BR \/ 2Ba', '1244ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T15:29:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547179640.html","post_id":7547179640,"result_date":"2022-10-18T19:32:52.000Z","title":"Washer Dryer in Unit, Lease Today, Leasing Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nLooking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nCommunity Features\n* Professionally Managed\n* Easy Freeway Access\n* Outdoor Grill Area\n* Bocce Ball\n* Pet Salon\n* Minutes from Restaurants, Shopping, and Much More\n* Swimming Pool\n* TV Lounge\n* Putting Green\n* Bark Park\n* Sun Deck\n* Community Lounge\n* Fitness Studio\n* Yoga Lounge\n[#9446178]","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T15:28:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547167837.html","post_id":7547167837,"result_date":"2022-10-18T19:32:35.000Z","title":"1BRx1BA APT w\/Expansive Hardwood, Campuses, and I-76\/I-95 Access Point","description":"2nd floor 1 bedroom with a den at 40th\/Spring Garden with private entrance. Full kitchen with cherry cabinets, granite counter-tops, fridge, range, dishwasher, garbage disposal, and lots of storage! Expansive hardwood floors carry throughout the apartment. The open floor-plan living room\/kitchen in the front of the apartment is immediately welcoming. A full hall bath comes complete with under-sink vanity storage and space for additional shelving units, perfect for towels, toiletries, and additional necessities. Main bedroom is in the back of the apartment, and includes the washer\/dryer and small closet.\nCall \/ Text – Email to make appointment!   show contact info\nBlocks from the Market-Frankford Line, SEPTA Bus and Trolley Lines, UPenn & Drexel Hospitals and Campuses, and I-76\/I-95 access points.\nRequirements are first\/last\/deposit, credit score above 550, past 2 years of good rental history. 2 pet could be considered.\nOwner pays water, sewer, and trash\nFeature\nFull hall bath\nExpansive hardwood floors\nGranite counter-tops\nCherry cabinets\nSmall closet\nFull kitchen\n","num_images":14.0,"lat":39.962336,"lng":-75.202307,"attrs":"['1BR \/ 1Ba', '550ft2', 'available now', '\\nmonday 2022-10-24\\n', '\\ntuesday 2022-10-25\\n', '\\nwednesday 2022-10-26\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T15:04:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547179011.html","post_id":7547179011,"result_date":"2022-10-18T19:31:33.000Z","title":"1 Bedroom Apartment  All Utilities are included","description":"All Utilities are included 1 Bd Apt Across from Philadelphia Mill \/95 and Rt 63.\ncall for a tour today  show contact info","num_images":4.0,"lat":40.0897,"lng":-74.9781,"attrs":"['1BR \/ 1Ba', '780ft2', 'available oct 27', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T15:27:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547171623.html","post_id":7547171623,"result_date":"2022-10-18T19:16:19.000Z","title":"End-Unit, Stainless Steel Appliances, Close To Pool & Parking, Gym","description":"RENT PERIOD: YEARLY\nAsk about apartment home 124 on the first floor, available as early as November 15th!!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday 9:00 am-6:00 pm, Fridays 9:00 am-5:00 pm, and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity","num_images":11.0,"lat":40.053166,"lng":-75.236179,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T15:12:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547166122.html","post_id":7547166122,"result_date":"2022-10-18T19:05:12.000Z","title":"Stackable Washer & Dryer, Lots Of Counter Space, 2nd Floor, Pool, Gym","description":"RENT PERIOD: YEARLY\nAsk about apartment home H07 on the second floor, available November!! This unit does not have stainless steel appliances, it has the standard white appliances.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up a tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday: 9:00 am-6:00 pm, Fridays: 9am – 5pm and also Saturday from 10:00 am-4:00 pm. * Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\n-Full Size Washer\/Dryer In select homes.\nCOMMUNITY FEATURES:\n-On-Site Management\n-On-site maintenance\/24 hour emergency service\n-Septa Bus stop on the corner\n-Ivy Ridge Train Station blocks away\n-Online Payments Available\n-Cable Ready\n-On line service request\n-Septa Transportation outside the Rental Office\n-Pool located at sister property(Pool membership available. Fees Apply)\n-Gym located at sister property\nThe Metropolitan Manayunk Hill apartment homes, are just minutes to Center City Philadelphia, Manayunk Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA turnpike. Walk to Ivy Ridge Shopping Center and ShopRite Supermarket. Convenient to Ivy Ridge Train Station to Center City, Andorra Shopping Center, Target and more! The Metropolitan Manayunk Hill apartment homes are a great choice for both convenience and a quality of life. that's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity.\n","num_images":12.0,"lat":40.043502,"lng":-75.236199,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T15:01:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547161130.html","post_id":7547161130,"result_date":"2022-10-18T19:00:32.000Z","title":"1 bedroom \/ 1 bathroom for rent NOW","description":"3rd floor apartment ready to move in.\n1 bedroom\n1 bathroom\nLarge Living Room\nRecently updated\nOn Septa Line\nOverbrook Area\n$2550 (1st month, last month + refundable security deposit) moves you in.\n$30 application fee\nCall Cheryl (8am-9pm)\nshow contact info","num_images":14.0,"lat":39.9744,"lng":-75.254,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:50:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547162921.html","post_id":7547162921,"result_date":"2022-10-18T18:58:28.000Z","title":"Large Master Bedroom & Kitchen, 2nd Floor, Walk To Stores, Pool, Gym","description":"RENT PERIOD: YEARLY\nAsk about apartment home A07 on the second floor, available November!!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up a tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday: 9:00 am-6:00 pm, Fridays: 9am – 5pm and also Saturday from 10:00 am-4:00 pm. * Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\n-Full Size Washer\/Dryer In select homes.\nCOMMUNITY FEATURES:\n-On-Site Management\n-On-site maintenance\/24 hour emergency service\n-Septa Bus stop on the corner\n-Ivy Ridge Train Station blocks away\n-Online Payments Available\n-Cable Ready\n-On line service request\n-Septa Transportation outside the Rental Office\n-Pool located at sister property(Pool membership available. Fees Apply)\n-Gym located at sister property\nThe Metropolitan Manayunk Hill apartment homes, are just minutes to Center City Philadelphia, Manayunk Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA turnpike. Walk to Ivy Ridge Shopping Center and ShopRite Supermarket. Convenient to Ivy Ridge Train Station to Center City, Andorra Shopping Center, Target and more! The Metropolitan Manayunk Hill apartment homes are a great choice for both convenience and a quality of life. that's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity.\n","num_images":14.0,"lat":40.043502,"lng":-75.236199,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:54:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547162732.html","post_id":7547162732,"result_date":"2022-10-18T18:58:06.000Z","title":"Rake In the Fall Savings Here At Botanica Cottages!","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nOffering one, two and three  bedroom apartments with private entrances, these apartments more closely resemble private townhomes rather than an apartment rental community.  Easy access to Route 422, the main artery between Reading, Pottstown and King of Prussia.\nDetails\nAvailability date: December 9, 2022\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Our Pet Policy: $30\/month pet rent. $400 (Non-refundable pet fee) for “first pet” and $250 (Non-refundable pet fee) for the “second pet.” Maximum of 2 pets per apartment home. No pet deposit. Breed Restrictions Apply. No aggressive breeds shall be permitted.\nDeposit: $1,000.00\nLeasing options: 12+ months\nLeasing notes:\nApplication fee: $50 per adult\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage\nUtilities Cost: Varies by apartment size\nLaundry: In Unit\nParking type: Garage\nParking notes:\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard\nHeating\/cooling: Heat: forced air, Central AC, Ceiling fans\nWiring: Cable-ready, High-speed internet, Wired, Intercom system\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Playground, Barbecue, Business center, Golf course\nSecurity and Access:\nViews:\nAdditional features: Hardwood floor, Tile floor, Granite countertop, Fireplace, Vaulted ceiling, Jacuzzi, Sauna, Hot tub \/ Spa, Non-Smoking Property\nOffered by:\nBotanica Cottages\nEqual Housing Opportunity","num_images":20.0,"lat":40.235417,"lng":-75.535466,"attrs":"['2BR \/ 2Ba', '975ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T14:54:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547162203.html","post_id":7547162203,"result_date":"2022-10-18T18:57:00.000Z","title":"Pet Spa, Lease Today, Ideal Location","description":"The Point at Exton is ideally located in the heart of Chester County within walking distance to popular restaurants and shops including Whole Foods, The Pour House and more. Set up your tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, ensuite bathrooms, walk-in closets, and a washer\/dryer!\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm\n[#9446174]","num_images":23.0,"lat":40.031462,"lng":-75.628976,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available nov 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T14:53:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547155451.html","post_id":7547155451,"result_date":"2022-10-18T18:42:41.000Z","title":"Stunning Apartment Homes! Reserve Today!","description":"Hours of Operation;\nMonday-Friday 9:00 am-6:00 pm\nVirtual Tours, Facebook Tours and No Contact Tours Available by Appointment Only!\nThis offer can be withdrawn at any time without prior written notice. Qualified applicants only\nVisit your new apartment home by taking a self-guided tour with Andrea today! We also our offering virtual tours. Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday: 9:00 am-6:00 pm. Need to request another time for your personalized visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nApartment Features:\n-Air Conditioning\n-Kitchen Island\n-Walk-In Closet\n-Microwave, Dishwasher\n-Gas Range\n-Refrigerator w\/Ice Maker\n-Washer\/Dryer\n-Quartz Countertop\n-Tile Backsplash\n-Hardwood Floors\n-Ceiling Fans\n-Tiled Bath\n-Stainless Steel Appliances\n-Storage Available\n-Accent Walls Available\nPET FRIENDLY\nCommunity Features:\n-Off Street Parking\n-Garage Parking Available\n-BBQ Area\n-Private Courtyard\n-Walk to Train\n-Walk to Restaurants\n-Jogging Trail\n-Convenient Shopping\n-24 Hour Maintenance Service\n-Online Payments\n-Onsite Management\nCall:  show contact info\nand ask for Andrea!\nFor more information or to start your application, visit us at: yourmetropolitan.com\/rent-balacynwyd\nThe metropolitan bala cynwyd offers an apartment home for rent with a beautiful secluded courtyard setting, newly renovated, old-world charm. Located in Lower Merion Township along the Main Line, our apartment home community is walking distance shopping, restaurants, nightlife and theatres.\nConvenient to Routes- 76, 1, 30, 23, 476, Center City Philadelphia, PCOM, SJU, UPENN colleges. Lankenau, Bryn Mawr, UPENN and CHOP Hospitals. Convenient drive to Fairmount Park, Manayunk, Ardmore, Narberth and Wynnewood\nEqual Housing Opportunity","num_images":9.0,"lat":40.0118,"lng":-75.2342,"attrs":"['2BR \/ 1Ba', 'available oct 21', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:38:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547154244.html","post_id":7547154244,"result_date":"2022-10-18T18:40:14.000Z","title":"Bark Park, Lease Today, Ideal Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a balcony!\nCommunity Features\n* Fitness Studio\n* Minutes from Restaurants, Shopping, and Much More\n* Community Lounge\n* TV Lounge\n* Outdoor Grill Area\n* Bark Park\n* Spa\n* Sun Deck\n* Yoga Lounge\n* Swimming Pool\n* Billiards\n* Professionally Managed\n* Easy Freeway Access\n* Pet Salon\n[#9446157]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1218ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:36:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547153644.html","post_id":7547153644,"result_date":"2022-10-18T18:39:00.000Z","title":"One Bedroom in Beautiful Building","description":"Beautiful hardwood floors, heat included, beautiful courtyards.\n","num_images":3.0,"lat":40.0097,"lng":-75.3121,"attrs":"['1BR \/ 1Ba', '651ft2', 'cats are OK - purrr', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:35:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547142539.html","post_id":7547142539,"result_date":"2022-10-18T18:38:33.000Z","title":"Where Luxury Meets Convenience!!","description":"Available: 11\/20\/22\nApt. 2510 — Oxford floor plan — 1,203 sq. ft. — $3,510\nThis 5th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T14:12:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547152508.html","post_id":7547152508,"result_date":"2022-10-18T18:36:39.000Z","title":"Washer & Dryer, Large Breakfast Bar, 3rd Floor, Pet Friendly, Pool","description":"RENT PERIOD: YEARLY\nAsk about apartment home F09 on the third floor, available now!!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up a tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday: 9:00 am-6:00 pm, Fridays: 9am – 5pm and also Saturday from 10:00 am-4:00 pm. * Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\n-Full Size Washer\/Dryer In select homes.\nCOMMUNITY FEATURES:\n-On-Site Management\n-On-site maintenance\/24 hour emergency service\n-Septa Bus stop on the corner\n-Ivy Ridge Train Station blocks away\n-Online Payments Available\n-Cable Ready\n-On line service request\n-Septa Transportation outside the Rental Office\n-Pool located at sister property(Pool membership available. Fees Apply)\n-Gym located at sister property\nThe Metropolitan Manayunk Hill apartment homes, are just minutes to Center City Philadelphia, Manayunk Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA turnpike. Walk to Ivy Ridge Shopping Center and ShopRite Supermarket. Convenient to Ivy Ridge Train Station to Center City, Andorra Shopping Center, Target and more! The Metropolitan Manayunk Hill apartment homes are a great choice for both convenience and a quality of life. that's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity.\n","num_images":12.0,"lat":40.043502,"lng":-75.236199,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:32:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547150139.html","post_id":7547150139,"result_date":"2022-10-18T18:31:59.000Z","title":"Fabulous 732 sq ft 1 bed \/ 1 bath, great spot near public transport","description":"The Glen at Lafayette HillVisit Our Community Today!555 Andorra Glen Ct Lafayette Hill, PA 19444  show contact info\nWe offer the premier location for apartment homes in Lafayette Hill. With a great location and easy access to I-476 (Veteran's Memorial Hwy), you will love calling The Glen Apartments your home. Residents of our Lafayette Hill apartment rentals enjoy our one, two, and three bedroom floor plans that add a touch of style and sophistication to any lifestyle. We boast a number of lavish amenities, including 42-inch kitchen cabinetry, gas cooking, over-sized closets and in-unit washers and dryers. With its convenient location near the most prominent dining, shopping and entertainment venues in Lafayette Hill, The Glen is perfect for commuters all across the Pennsylvania area. Schedule a tour of our luxury Lafayette Hill apartments today and see why residents love coming home to our apartments.-Laundry Room\n-Tub and Stall Shower\n-High Ceilings\n-Breakfast BarBedrooms: 1 |  Bathrooms:  1  Square Footage: 732 - 750 sq ft Rental Pricing: $1827 - $2328\/Month  Our Residents Enjoy:  ✓ 24 Hour Availability✓ Business Center✓ Cardio Machines✓ Conference Room✓ Furnished Units Available✓ Multi-Use Room✓ Online Services✓ Pet Play Area✓ Planned Social Activities✓ Recycling✓ BBQ Picnic Garden✓ Billiards, Club Lounge, Cafe Area, Library and Community Room✓ Fitness Center w\/ Free Weights, Weight Machines✓ Message Therapist Practice On-site✓ Outdoor Cafe & Coffee Bar✓ Outdoor Patio Lounge✓ Sprinkler System✓ Storage Space✓ Wi-Fi at Clubhouse This Unit Comes With: ✓ Air Conditioning & Heating✓ Cable Ready✓ Carpet✓ Ceiling Fans (Select Floor Plans)✓ Dining Room✓ Heating✓ Range, Oven, Disposal, Oven✓ Tub\/Shower✓ Wi-Fi✓ Window Coverings✓ Crown Molding (Select Floor Plans)✓ Dishwasher✓ High Speed Internet Access✓ Linen Closet✓ Microwave✓ Tile Floors✓ Trash Compactor✓ Walk-In Closets (Select Floor Plans)✓ Washer\/Dryer✓ Wheelchair Accessible (Rooms)Website: https:\/\/www.the-glen-apartments.com Phone-Number:  show contact info\nPet-Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.Lease-Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthCall for Directions  All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY6833BD3DFB3343EC\n","num_images":22.0,"lat":40.0896,"lng":-75.2601,"attrs":"['1BR \/ 1Ba', '732ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T14:27:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547150110.html","post_id":7547150110,"result_date":"2022-10-18T18:31:55.000Z","title":"Beautiful 1 bed, 1 bath on the 3rd floor!","description":"The Gateway Apartments - A place to call home! Bed: 1 \/ Bath: 1  Sq. Footage: 779 sq ft Rent: $1857 - $2363\/MonthTerms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month show contact info\nExclusive features, including a resort-style pool with a sun deck and a 24-hour fitness center, are what make us the best apartment homes in the West Chester, PA area. Whether you want to spend a tranquil afternoon enjoying our beautiful landscapes or invite people over for a social function in our clubhouse, our community has something to offer everyone. Secure gated entrances and 24-hour maintenance provide the residents of our pet-friendly apartments with peace of mind. If you are searching for luxury West Chester apartment homes or are simply looking to relocate to the East Goshen Township area, come tour our wonderful apartments. Offering the best apartments in the area, we will help you feel right at home. Whatever you desire in life, find it at The Gateway Apartments.Please take our virtual tour\nhttps:\/\/my.matterport.com\/show\/?m=4RkQ1PobBkE&brand=0Our Apartment Homes Feature:   ✓ Air Conditioning & Heating✓ Cable Ready✓ Carpet✓ Den✓ Dining Room✓ Dishwasher✓ Garbage Disposal✓ Refrigerator, Freezer, Ice Maker✓ Walk-In Closets✓ Window Coverings✓ Built-In Computer Nook (select homes)✓ Disability Access (select homes)✓ Frost-Free Refrigerator\/Ice Maker✓ Garden\/Spa Tub (select homes)✓ Gas Fire Place (select homes)✓ Large Windows✓ Mini Blinds On All Windows✓ Private Entrance To Each Unit✓ Wired For High-Speed Internet✓ Wooded View\/Pool View (select homes) Our Residents Enjoy:  ✓ Business Center✓ Clubhouse✓ Fitness Center✓ Onsite Maintenance✓ Onsite Management✓ Package Service✓ Picnic and Grilling Area✓ Pool and Sundeck✓ Storage Space✓ Walking\/Biking Trails✓ Across From Wawa & Goshen Crossing Shopping Center✓ Beautifully Landscaped Grounds✓ Gated Entrances✓ Maintenance Free Lifestyle✓ Onsite Leasing Office✓ Pet-Friendly✓ Relaxing Fire Pit✓ Resort-Style Pool With Sun Deck✓ Three BBQ\/Picnic Areas✓ Wi-Fi Access in Clubhouse and at PoolContact Info: show contact info\n1515 Manley Rd West Chester, PA 19380Facebook: https:\/\/www.facebook.com\/TheGatewayApartmentsAParadiseManagementCommunity\/ Website: https:\/\/www.thegatewayapartments.com\/Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Pets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Mon All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY970F506CB0054A\n","num_images":20.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '779ft2', 'available oct 28', 'air conditioning', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:27:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547148232.html","post_id":7547148232,"result_date":"2022-10-18T18:27:55.000Z","title":"Great Location In Lower Merion! Reserve Your New Apartment Home","description":"Hours of Operation;\nMonday-Friday 9:00 am-6:00 pm\nVirtual Tours, Facebook Tours and No Contact Tours Available by Appointment Only!\nThis offer can be withdrawn at any time without prior written notice. Qualified applicants only\nVisit your new apartment home by taking a self-guided tour with Andrea today! We also our offering virtual tours. Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday: 9:00 am-6:00 pm. Need to request another time for your personalized visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nApartment Features:\n-Air Conditioning\n-Kitchen Island\n-Walk-In Closet\n-Microwave, Dishwasher\n-Gas Range\n-Refrigerator w\/Ice Maker\n-Washer\/Dryer\n-Quartz Countertop\n-Tile Backsplash\n-Hardwood Floors\n-Ceiling Fans\n-Tiled Bath\n-Stainless Steel Appliances\n-Storage Available\n-Accent Walls Available\nPET FRIENDLY\nCommunity Features:\n-Off Street Parking\n-Garage Parking Available\n-BBQ Area\n-Private Courtyard\n-Walk to Train\n-Walk to Restaurants\n-Jogging Trail\n-Convenient Shopping\n-24 Hour Maintenance Service\n-Online Payments\n-Onsite Management\nCall:  show contact info\nand ask for Andrea!\nFor more information or to start your application, visit us at: yourmetropolitan.com\/rent-balacynwyd\nThe metropolitan bala cynwyd offers an apartment home for rent with a beautiful secluded courtyard setting, newly renovated, old-world charm. Located in Lower Merion Township along the Main Line, our apartment home community is walking distance shopping, restaurants, nightlife and theatres.\nConvenient to Routes- 76, 1, 30, 23, 476, Center City Philadelphia, PCOM, SJU, UPENN colleges. Lankenau, Bryn Mawr, UPENN and CHOP Hospitals. Convenient drive to Fairmount Park, Manayunk, Ardmore, Narberth and Wynnewood\nEqual Housing Opportunity","num_images":9.0,"lat":40.0118,"lng":-75.2342,"attrs":"['2BR \/ 1Ba', 'available oct 21', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:23:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547145863.html","post_id":7547145863,"result_date":"2022-10-18T18:27:01.000Z","title":"Spacious 2 Bedroom 1 Bath Corner 2nd flr Unit. AVAIL TODAY","description":"Spacious 2nd floor Unit with lots of Natural Light Exposure.\nFeatures new life proof vinyl flooring throughout.\nLarge Living room with lots of windows.\n2 Nice Size Bedrooms both with large closets!\nCute Cook-in Kitchen with built-in pantry.\nFull Bathroom with Tub.\nReady for immediate move in.\nWalkable to many major shopping centers and SEPTA Access.\nBecome a part of this quiet, tight knit, welcoming neighborhood.\nCats OK.\nMust have good credit and income.","num_images":9.0,"lat":39.918821,"lng":-75.152407,"attrs":"['2BR \/ 1Ba', '800ft2', 'available now', 'application fee details: $50\/per Adult Occupant', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T14:19:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547147757.html","post_id":7547147757,"result_date":"2022-10-18T18:27:00.000Z","title":"Beautiful 3BR\/2.5BA, Roof Deck, Fin. Bsmt!","description":"Also available for sale at $899,900. Meredith catchment. Storybook townhouse on picturesque, tree-lined, prestige Queen Village block. Immaculate finishes, high-end appliances, thoughtful features, and style-conscious details throughout. Open-concept first floor with half bath and oversized custom kitchen featuring bar island with built-in microwave. Two generous bedrooms and a charming full bath on second floor. Soaring third-floor ceilings with thoughtful built-ins, pocket doors, shower with dual shower heads, double vanity, and private water closet. Upper floor laundry. Lush, private roof deck oasis with built-in planters. Finished basement with custom work area cabinetry and plenty of semi-finished storage space. Hardwood floors and casement windows throughout. Dual-zone temperature control.  A truly unique opportunity that mixes high style with high quality. Located steps from all the best dining, shops, and amenities on offer in Queen Village, Bella Vista, the Italian Market, and East Passyunk.","num_images":24.0,"lat":39.940196,"lng":-75.152664,"attrs":"['3BR \/ 2.5Ba', 'available nov 1', 'air conditioning', 'application fee details: $50', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:23:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547145254.html","post_id":7547145254,"result_date":"2022-10-18T18:21:49.000Z","title":"Leasing Now, Playground, Pet Park","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nSchedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nApartment Features\n* Stainless Steel Appliances\n* Full sized Washer and Dryer in unit\n* Ceiling Fan\n* Pantry\n* High Efficiency Lighting Fixtures\n* Central Heat and Air\n* Disposal\n* Breakfast Bar\n* Lofty Vaulted Ceilings\n* Walk-in Closet\n* Roommate Friendly Floor Plan\n* Linen Closet\n* Garden Tub\n* Window Coverings\n* Private Patio or Private Balcony (on select apartments)\n* Granite Countertops\n* Pre-wired for internet and cable\n* Refrigerator, Microwave, Dishwasher & Electric Stove","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1128ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:17:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547140877.html","post_id":7547140877,"result_date":"2022-10-18T18:19:18.000Z","title":"BBQ and deck area, Online Payments Available, Pet-friendly living","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:48-hour Maintenance CommitmentPet-friendly living9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardState-of-the-art fitness center overlooking the Manayunk canalUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingGame Room with Billiards Table, Shuffle Board, and moreOnline Payments AvailableUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsBocce ball fieldOn-site bike storageJogging trail right outside your doorCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/3scnnwqn\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-10-18T14:09:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547136416.html","post_id":7547136416,"result_date":"2022-10-18T18:05:11.000Z","title":"New Kitchen! New Appliances! W\/D, Hd Wd Fl, Train, Trails, Location!","description":"Hours of Operation;\nMonday-Friday 9:00 am-6:00 pm\nVirtual Tours, Facebook Tours and No Contact Tours Available by Appointment Only!\nThis offer can be withdrawn at any time without prior written notice. Qualified applicants only\nVisit your new apartment home by taking a self-guided tour with Andrea today! We also our offering virtual tours. Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday: 9:00 am-6:00 pm. Need to request another time for your personalized visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nApartment Features:\n-Air Conditioning\n-Kitchen Island\n-Walk-In Closet\n-Microwave, Dishwasher\n-Gas Range\n-Refrigerator w\/Ice Maker\n-Washer\/Dryer\n-Quartz Countertop\n-Tile Backsplash\n-Hardwood Floors\n-Ceiling Fans\n-Tiled Bath\n-Stainless Steel Appliances\n-Storage Available\n-Accent Walls Available\nPET FRIENDLY\nCommunity Features:\n-Off Street Parking\n-Garage Parking Available\n-BBQ Area\n-Private Courtyard\n-Walk to Train\n-Walk to Restaurants\n-Jogging Trail\n-Convenient Shopping\n-24 Hour Maintenance Service\n-Online Payments\n-Onsite Management\nCall:  show contact info\nand ask for Andrea!\nFor more information or to start your application, visit us at: yourmetropolitan.com\/rent-balacynwyd\nThe metropolitan bala cynwyd offers an apartment home for rent with a beautiful secluded courtyard setting, newly renovated, old-world charm. Located in Lower Merion Township along the Main Line, our apartment home community is walking distance shopping, restaurants, nightlife and theatres.\nConvenient to Routes- 76, 1, 30, 23, 476, Center City Philadelphia, PCOM, SJU, UPENN colleges. Lankenau, Bryn Mawr, UPENN and CHOP Hospitals. Convenient drive to Fairmount Park, Manayunk, Ardmore, Narberth and Wynnewood\nEqual Housing Opportunity","num_images":7.0,"lat":40.0118,"lng":-75.2342,"attrs":"['2BR \/ 1Ba', 'available oct 21', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T14:01:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547135048.html","post_id":7547135048,"result_date":"2022-10-18T18:02:36.000Z","title":"appartement for rent","description":"Second floor Apartment  For rent , consisting 2 bedroom,living room, bathroom, kitchen","num_images":0.0,"lat":39.9542,"lng":-75.2443,"attrs":"['2BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T13:58:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547134278.html","post_id":7547134278,"result_date":"2022-10-18T18:01:06.000Z","title":"Updated Loft Style 1 Bedroom with Central Air!","description":"A rent rebate is available for a November 1st move-in! Dramatic 1 bedroom bi-level loft-like apartment in a super Washington Square West location! Roomy living room, separate dining area, and a brand new charming kitchen with gas range. The loft bedroom area has a sizable closet and a sparkling white tiled bathroom with a large stall shower. Coin-op washer and dryer in the common laundry room.  Conveniently located within one block of supermarkets and an easy walk to great restaurants, shops, Jefferson University, and the theatre district. Parking garage rentals are available at 10th & South.\nLandlord pays for Hot Water & Cold Water. Tenant is responsible for Electric and Gas. Building has a laundry room and a trash room.\n","num_images":11.0,"lat":39.943732,"lng":-75.157744,"attrs":"['1BR \/ 1Ba', '700ft2', 'available nov 1', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T13:57:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547129692.html","post_id":7547129692,"result_date":"2022-10-18T17:51:45.000Z","title":"Newly Renovated on 1236 W. Lehigh Ave","description":"This charming 1-bedroom apartment is located in North Philadelphia. A short walk to the Broad Street line and several bus routes, just a few blocks from Mastery Charter School, Temple University, Temple Hospital, and several local shops. The apartment offers a renovated kitchen with a refrigerator, stove, new cabinets, hardwood floors, and lots of natural lighting. Inquire today!","num_images":5.0,"lat":39.993533,"lng":-75.151392,"attrs":"['1BR \/ 1Ba', '415ft2', 'available now', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T13:47:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547116105.html","post_id":7547116105,"result_date":"2022-10-18T17:26:25.000Z","title":"Charming One Bedroom in Historic Building","description":"Elevator building, New Fitness Center , Close to train, Heat included .\n","num_images":6.0,"lat":40.0097,"lng":-75.3121,"attrs":"['1BR \/ 1Ba', '630ft2', 'available oct 21', 'cats are OK - purrr', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T13:22:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547112806.html","post_id":7547112806,"result_date":"2022-10-18T17:20:34.000Z","title":"Washer\/Dryer, Hardwood Style Flooring, On-Site Maintenance","description":"Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Call Now:  show contact info\nx 55OR Text 55 to  show contact info\nto text our team directly.Use the link below for more details:https:\/\/mack.touraptnow.com\/c4ki6a This is a 2 Bedroom, 2 Bath, approximately 1248 Sq. Ft. Features - Disposal  - Stone Counters  - Flush Mount Sinks with Goose Neck Faucets  - Selected  - Cable Ready  - Dishwasher  - Washer\/Dryer  - Premium Stainless Steel Appliance Package  - Gas Range  - Large Closets with Organizing Systems  - Tons of Natural Lighting Throughout  - Electronic Thermostat  - Patio\/Balcony*  - Hardwood Style Flooring  - Air Conditioner  - Custom Subway Tile Backsplashes *In Select Apartment Homes Community Amenities - Tennis Court  - On-Site Maintenance  - Playground  - Fitness Center  - Selected  - Elevator  - Off Street Parking  - Sundeck  - Covered Parking  - Rooftop Dog Park  - Parisian Style Café with Demonstration Kitchen  - Multiple Co-Working Studios  - Courtyard  - On-Site Management  - Multiple, Expansive Outdoor Spaces  - BBQ\/Picnic Area  - Smoke-Free Community  - Free Weights  - Garage Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMThe Kelly  10 Union Ave, Bala Cynwyd, PA, 19004VarM6nDDZ6x4\n","num_images":9.0,"lat":40.0118,"lng":-75.2342,"attrs":"['2BR \/ 2Ba', '1248ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T13:16:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547107549.html","post_id":7547107549,"result_date":"2022-10-18T17:10:58.000Z","title":"Short Term Lease, Controlled Access\/Gated,Guest Room","description":"Bedrooms: 1Bathrooms: 1Square Feet: 762Date Available: 2022-10-18Address: 1000 South Broad Street\nExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.\nAmenities Include:\nDishwasher\nMedia Room\nGuest Room\nView\nWasher\/Dryer\nCarpeting\nDisposal\nRooftop Walking Path\nCovered Parking\nEfficient Appliances\nRefrigerator\nElevator\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/ajvqkzm4\/lincoln-squarePricing and availability are subject to change.\n","num_images":9.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '762ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T13:06:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547095226.html","post_id":7547095226,"result_date":"2022-10-18T17:07:18.000Z","title":"Furnished Luxury 1 Bedroom Apt Home, Package Rm, Gym, Near Restaurants","description":"Stay in a furnished luxury one bedroom one bathroom apartment home on the 15th floor in a building located on Rittenhouse Square! The large windows face east for morning sunshine and afternoon shade and have a view looking down Walnut Street with skyscrapers to the left. The renovated kitchen is nice with its white cabinets and granite counters! This kitchen is also fully-equipped with a gas stove, microwave, disposal, and dishwasher. Savor a cup of coffee, tea, or cocoa at the breakfast bar every morning. There is abundant closet space for plenty of storage. A must see, this home is beautiful with its wood floors and high-end furniture!\nThe Rittenhouse Claridge offers you the opportunity to stay in Philadelphia’s most vibrant, walkable neighborhood. So close to stores, restaurants, coffee shops, and bakeries! Target, Trader Joe's, Giant, Venditore by Giordano, Sue's Produce Market, Rittenhouse Market, Spruce Food Market, Di Bruno Bros., Reading Terminal Market, Giant Heirloom Market, Aldi, Whole Foods, and Sprouts are grocery stores within walking distance! Retail stores on Rittenhouse Row include Anthropologie, Barnes & Noble, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, gorjana, J. Crew, Philadelphia Runner, Allbirds, Bluemercury, Scotch & Soda, Vince, Urban Outfitters, L'Occitane, Boyds, MAC Cosmetics, and Sephora. Nearby dining options include: Rouge, Devon Seafood Grill, Parc, Via Locusta, Spice Finch, Pietro's Coal Oven Pizzeria, Aleksandar, Alice Pizza, Marathon Grill, Marathon on the Square, and The Continental Mid-town. Savor a cup of coffee at Ultimo, La Colombe, Vibrant, Elixr, Alchemy, and Gran Caffe L'Aquila. Pick up a beautiful French dessert at Miel Patisserie. Grab a French baguette at Metropolitan Bakery. Savor a scoop of ice cream from Van Leeuwen or Jeni's. Try the Rittenhouse Churro at El Merkury! There is so much to do in this area!\nCommunity Features:\n* High-rise building on Rittenhouse Square\n* 24\/7 Top-of-the-line fitness center\n* Package room with lockers by Luxer One\n* Fitness\/yoga studio\n* Sauna\n* 24\/7 8,000 square foot resident lounge with free wifi\n* Bike storage in the attached parking garage\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Elevator building with 24-hour front door attendant and 24-hour concierge desk staff\n* 24\/7 on-site maintenance\n* Amazing roof deck with fantastic views\n* Laundry room on every floor\n* Large laundry room on 3rd floor\n* Attached parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\n* Online resident portal for rent payments, maintenance requests, and more!\nApartment Home Features:\n* Furnished one bedroom one bathroom apartment home on the 15th floor\n* Oversized floor plan\n* Large closets\n* Wood floors\n* Breakfast bar\n* Renovated kitchen\n* White kitchen cabinets\n* Granite kitchen counters\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* East-facing windows with a city view\n* All utilities included\nInterested in this home? Then, your next step is to schedule an appointment to tour with Michelle or Gabby using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com. You may take a guided tour in person. Live virtual tours in Zoom are also available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\n* Rental rates, availability, and apartment home features are subject to change without notice. *\nWelcome home!","num_images":24.0,"lat":39.949836,"lng":-75.170581,"attrs":"['1BR \/ 1Ba', '700ft2', 'available oct 21', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T12:44:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547101895.html","post_id":7547101895,"result_date":"2022-10-18T17:00:47.000Z","title":"Come Home For the Holidays and Stay Forever!","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nOffering one, two and three  bedroom apartments with private entrances, these apartments more closely resemble private townhomes rather than an apartment rental community.  Easy access to Route 422, the main artery between Reading, Pottstown and King of Prussia.\nDetails\nAvailability date: November 4, 2022\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Our Pet Policy: $30\/month pet rent. $400 (Non-refundable pet fee) for “first pet” and $250 (Non-refundable pet fee) for the “second pet.” Maximum of 2 pets per apartment home. No pet deposit. Breed Restrictions Apply. No aggressive breeds shall be permitted.\nDeposit: $1,000.00\nLeasing options: 12+ months\nLeasing notes:\nApplication fee: $50 per adult\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage\nUtilities Cost: Varies by apartment size\nLaundry: In Unit\nParking type: Garage\nParking notes:\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard\nHeating\/cooling: Heat: forced air, Central AC, Ceiling fans\nWiring: Cable-ready, High-speed internet, Wired, Intercom system\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Playground, Barbecue, Business center, Golf course\nSecurity and Access:\nViews:\nAdditional features: Hardwood floor, Tile floor, Granite countertop, Fireplace, Vaulted ceiling, Jacuzzi, Sauna, Hot tub \/ Spa, Non-Smoking Property\nOffered by:\nBotanica Cottages\nEqual Housing Opportunity","num_images":11.0,"lat":40.235417,"lng":-75.535466,"attrs":"['1BR \/ 1Ba', '714ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T12:56:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547100699.html","post_id":7547100699,"result_date":"2022-10-18T16:58:27.000Z","title":"Two Bedroom One Bathroom- DECEMBER MOVE IN","description":"We currently have a two bedroom one bathroom apartment available to move in as soon as December 21st! It will be located on the 6th floor, and is 963 sqft.\nDetails of apartment\n- renovated apartment\n- original parquet flooring\n- bedrooms carpeted\n- bathroom and kitchen tile\n- tub shower\n- lots of natural light\n- AC units , baseboard heat\n- black appliances and granite counter tops, COMES WITH DISHWASHER AND MICROWAVE!\n- cooking gas included\nWe offer sign on 12 month, 10 month or 6 month lease\n(with the 10 month, there is an added premium onto rent every month in the amount of $75)\n(with the 6 month, there is an added premium onto rent every month in the amount of $100)\nGas and amenities are included, on your own you are responsible for Electric, Water, Trash and Sewer. If you wish to get Cable we have Verizon.\nAmenities 5:30 am - 9:30pm\n- Fitness Room\n- Seasonal Pool, and Barbeque area\n- On Demand Aerobics and Yoga instruction\n-Billiard Room\n- Ping Pong Room\n- Tennis Court\n- PLUS MORE\nBuilding Details\n- Concierge from 7am-12am\n- 24-Hour On-Site Maintenance\n- Package Acceptance\n- Laundry Facility and Laundry Lounge with Wide screen TVs","num_images":5.0,"lat":40.08981,"lng":-75.126418,"attrs":"['2BR \/ 1Ba', '963ft2', 'available dec 21', 'air conditioning', 'application fee details: $35.00 per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T12:54:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547084689.html","post_id":7547084689,"result_date":"2022-10-18T16:57:15.000Z","title":"Live at Park Towne Place Apartment Homes in Center City Philadelphia!","description":"Live at Park Towne Place Apartment Homes in Center City Philadelphia, and you'll be blocks from the center of nightlife in Logan Square and Rittenhouse Square. Unit features modern kitchens, quartz countertops, stainless steel appliances, in-unit washers and dryers, breakfast bars, pendant lighting, tile backsplashes, wood plank flooring throughout, walk-in closets. Stunning city and museum views are offered in a variety of floor plans! Mainstreet Market and Caf , featuring gourmet coffee and tea and much more! Fitness center with Technogym equipment, Queenax boxing gym, yoga\/spin studio with indoor\/outdoor workout space. It boasts Philadelphia's largest pools, an art studio, fitness center with boxing gym, yoga\/spin studio, social lounge with demonstration kitchen, gourmet market and cafe, outdoor lounge with fire pit, 24-hour concierge, 24\/7 package acceptance, resident shuttle service to Center City and University City and more. Make Whole Foods as your second kitchen conveniently located just 1 block away. Our apartments are within one mile of several institutions of higher education: Drexel University, Temple University, University of Penn, CHOP, Moore college of Arts, Community College of Philadelphia. You won't find a better building to live with amenities in the Fairmount Area. Park Towne Place includes 948 apartment and penthouse homes within four high-rise towers. The community is nestled between green acres on the Benjamin Franklin Parkway in the heart of Center City Philadelphia's Museum District. Park Town. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n2200 Benjamin Franklin Pkwy #2B-W1215","num_images":6.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', '945ft2', 'available nov 21', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T12:24:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547089486.html","post_id":7547089486,"result_date":"2022-10-18T16:53:16.000Z","title":"Amazing renovated loft-style apartment!","description":"Live at 1210 N Palethorp St, an amazing renovated loft-style apartment located blocks away from the Piazza with available paid off-street parking. This apartment offers an open floor plan with an updated island kitchen with new stainless steel appliances. The space offers oversized windows that brighten up the space, hardwood floors, and beautiful exposed high ceilings. The loft area offers a walking closet with laundry. The location does not get much better than this, located caddy-corner to the Piazza you are near amazing local restaurants, and small shops, are walking distance to 2 big grocers, and have easy access to public transit. Off-street parking is available for $175\/mo\n1210-15 Palethorp #203","num_images":7.0,"lat":39.978,"lng":-75.1459,"attrs":"['1BR \/ 1Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T12:33:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547091249.html","post_id":7547091249,"result_date":"2022-10-18T16:52:42.000Z","title":"LET the SUNSETS be your permanent back drop","description":"LET the SUNSETS be your permanent back drop!!!!!!!!! This ONE BEDROOM residence, at FRANKLIN TOWER, located at 16TH and RACE STREET is a must see!!! All open and spacious living and dining area, kitchen with STAINLESS steel appliances, breakfast bar, and CUSTOM cabinetry. The Bedroom is VERY spacious, with an all tile EUROPEAN style bathroom. There is nothing like FRANKLIN TOWER apartments, in all of Philadelphia!!! With amenities on EVERY FLOOR, Peloton Rooms, Yoga studios, Screening Rooms, Game Rooms, Lounges, and Gyms, as well as the ROOF TOP LOUNGE , with flat screen, grills, and fire place. A BASKETBALL COURT, and GARAGE PARKING. Parking available for additional cost. Photo's are of model unit.\n200 N 16th St #508","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '656ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T12:36:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547085475.html","post_id":7547085475,"result_date":"2022-10-18T16:51:51.000Z","title":"Free Parking Hidden Gem on Park Lane 1\/1 washer\/dryer !!!","description":"Apt: B2 Beautiful , large, recently renovated apartment on residential street. Karen park is a boutique building just minutes from Manyunk , East Falls and 10 minutes from Center City. Near major transportation shopping and dining. perfect serein setting!\nFeatures include in apartment Washer and Dryer, Dishwasher, a new Cherry Wood Kitchen , stainless appliances and new bathroom.\nFREE OFF STREET PARKING\n45.00 monhtly water fee.Snall pet ok 35 a month plus 250 refundable deposit\nMinimum credit score 650\nFor appointment\nCALL NOW:  show contact info","num_images":3.0,"lat":39.9811,"lng":-75.174,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T12:25:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547096921.html","post_id":7547096921,"result_date":"2022-10-18T16:51:23.000Z","title":"Pet Grooming Facility, Schedule a Tour, Modern Amenities","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\n[#9445764]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '884ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T12:47:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547071767.html","post_id":7547071767,"result_date":"2022-10-18T16:50:34.000Z","title":"Huge Beautiful Newly Renovated 3 Bed 2 Bath w\/ Laundry","description":"3 BEDROOM -2 BATH\n* NO BROKER FEE *\n*Section 8 Accepted*\n** APT FEATURES**\n*Modern Kitchen\n*Trendy Bathroom\n*Hardwood Flooring\n*Naturally Well-Lit\n*Friendly Neighborhood\nFreshly Renovated Apartment\nwith a Oversized, Energy-Efficient, Naturally Well-Lit, Spacious living space ready to be moved and relaxed in.\nLocated block in the Prime Area of Newark City. Perfect for NYC commuters!\nNear by amenities such as great schools, public transportation, freeway access, dining and shopping opportunities.\nLeasing terms:\n*No Brokers Fee\n*$30 Application Fee Non-Refundable\n*Credit\/Background Check Required\n*Income required to be 2.5x the rent amount net monthly and good credit score.\nIf this apartment does not meet your interest, please reach out to us and we'll find the best place for you!\n","num_images":5.0,"lat":40.737,"lng":-74.1964,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T12:01:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547088053.html","post_id":7547088053,"result_date":"2022-10-18T16:48:41.000Z","title":"Comfort and convenience in this 2BR\/1BTH apartment!","description":"Comfort and convenience in this 2BR\/1BTH apartment. Located in the Ludlow area of Philadelphia, adjacent to Northern Liberties and Fishtown. Boasting vaulted ceilings, hardwood floors, stainless steel appliances, central air and in-unit washer\/dryer. Ten minute walk to SEPTA (Market-Frankford Line) with Bus and Bike Share opportunities as well. Owner is also willing to accept Pets with a non-refundable Pet Deposit. Come out and see this great location.\n1208 N 4th St #2","num_images":7.0,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 1Ba', '750ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T12:30:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547094910.html","post_id":7547094910,"result_date":"2022-10-18T16:47:41.000Z","title":"☎A Brand New Luxury High-Rise IN  Philadelphia","description":"Contact: Vishal Moorjaw contact ini | Keller Williams Realty\nPHONE - ( 8 8 8 ) 9 0 2 3 4 1 6\nContact me more for more listings, I am here to find the perfect fit for you.\nStunning STUDIO available in luxury, full amenity building!\nThis building has it all with stunning chef inspired kitchens, to HUGE walk in closets, and amazing state of the art amenities. Also offers a free shuttle to NY Waterway Ferry station!!\n***NO BROKER FEE\n***FREE SHUTTLE TO NY WATERWAY FERRY STATION\n***ONLY $500 SECURITY DEPOSIT (Based on Credit)\nThis building is conveniently located right on river road, which makes commutes to NYC a breeze with bus, and ferry options!\nApartment features include:\nTwo Exceptional finish palettes to choose from\nHigh force Chimney hood\nRecessed LED overhead lighting\n8' Tall Storage Cabinets\nStainless Steel dual convection oven\nPull out pantry\nHuge French door Refrigerators\nFloor To ceiling windows\nEuropean white oak solid hardwood flooring\nThermostatically controlled shower with rain-style head, body jets, and hand shower\nAmbient LED overhead lighting\nExtra Large Mirrors with integrated make-up lighting\nItalian Floating vanity with deep storage cabinets\nBuilt in roller shades\nManhattan skyline and Hudson River views\nHigh Capacity Washer and Dryers\nBuilding amenities include:\nHeated Pool\nHott tub\nPrivate cabanas\nLounging Pods\nSteam Room\nSauna\nPrivate Terraces\nWellness Center\nMassage Room\nWeight and Cardio room\nState of the art fitness center\nJuice Bar\nYoga Deck\nFirepit Lounges\nOutdoor Salon with built-in seating and cafe tables\nParty Lounge\nWine Bar room\nGame room\nSkyline overlook\nRooftop Kitchen\nKids play area\nContact me today for more info or a private showing!\nServicing all of North Jersey no broker fee luxury rentals - Fort Lee, Edgewater, Cliffside Park, West New York, Weehawken, Port Imperial, North Bergen, Secaucus, Kearny, Harrison, East Rutherford, Englewood, Hoboken, Jersey City, just to name a few!\n","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', 'available now', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T12:43:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547087398.html","post_id":7547087398,"result_date":"2022-10-18T16:33:26.000Z","title":"The Leases You Desire: Nurses Click Here!","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nOffering one, two and three  bedroom apartments with private entrances, these apartments more closely resemble private townhomes rather than an apartment rental community.  Easy access to Route 422, the main artery between Reading, Pottstown and King of Prussia.\nDetails\nAvailability date: Today\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Our Pet Policy: $30\/month pet rent. $400 (Non-refundable pet fee) for “first pet” and $250 (Non-refundable pet fee) for the “second pet.” Maximum of 2 pets per apartment home. No pet deposit. Breed Restrictions Apply. No aggressive breeds shall be permitted.\nDeposit: $1,000.00\nLeasing options: 12+ months\nLeasing notes:\nApplication fee: $50 per adult\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage\nUtilities Cost: Varies by apartment size\nLaundry: In Unit\nParking type: Garage\nParking notes:\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard\nHeating\/cooling: Heat: forced air, Central AC, Ceiling fans\nWiring: Cable-ready, High-speed internet, Wired, Intercom system\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Playground, Barbecue, Business center, Golf course\nSecurity and Access:\nViews:\nAdditional features: Hardwood floor, Tile floor, Granite countertop, Fireplace, Vaulted ceiling, Jacuzzi, Sauna, Hot tub \/ Spa, Non-Smoking Property\nOffered by:\nBotanica Cottages\nEqual Housing Opportunity","num_images":21.0,"lat":40.235417,"lng":-75.535466,"attrs":"['2BR \/ 2Ba', '1327ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T12:29:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547086464.html","post_id":7547086464,"result_date":"2022-10-18T16:31:45.000Z","title":"Bright three bedroom, two full bath unit has hardwood floors!","description":"Welcome to2302 Spruce St. unit four. This bright three bedroom, two full bath unit has hardwood floors throughout and spacious living areas. The property is equipped with an updated kitchen with microwave, electric oven, garbage disposal, and dishwasher. On the first floor you'll find two of the bedrooms and one full bath, as well as a washer and dryer. The second floor has skylights and a very sizable primary bedroom equipped with an en suite bathroom.\n2302 Spruce St #4","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 2Ba', '1326ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T12:27:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547085002.html","post_id":7547085002,"result_date":"2022-10-18T16:28:50.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547035842.html","post_id":7547035842,"result_date":"2022-10-18T16:27:07.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547083773.html","post_id":7547083773,"result_date":"2022-10-18T16:26:29.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547083175.html","post_id":7547083175,"result_date":"2022-10-18T16:25:21.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547082653.html","post_id":7547082653,"result_date":"2022-10-18T16:24:26.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547082230.html","post_id":7547082230,"result_date":"2022-10-18T16:23:42.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547081510.html","post_id":7547081510,"result_date":"2022-10-18T16:22:22.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547080748.html","post_id":7547080748,"result_date":"2022-10-18T16:20:58.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547078770.html","post_id":7547078770,"result_date":"2022-10-18T16:17:50.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547076460.html","post_id":7547076460,"result_date":"2022-10-18T16:13:50.000Z","title":"Tech- Connected Living, Flexible Lease Options, Smart Thermostat","description":"Bedrooms: 0Bathrooms: 1Address: 1401 Arch StreetLocated in Philadelphia’s historic Center City neighborhood, One City offers modern elegance with timeless grandeur. With views of Philadelphia's City Hall and just steps away from iconic Philly locations such as the Pennsylvania Convention Center, Reading Terminal Market, and Love Park, One City offers sophisticated luxury in the heart of Philadelphia. One City offers the most discerning residents the ultimate living experience. Inside this historic building, located at 1401 Arch Street, each apartment residence holds unique original features coupled with contemporary sophistication. Thoughtful design details include custom built-in storage, stainless steel appliances, and modern connectivity offering luxury and convenience to a range of lifestyles. Control is always at your fingertips with your app-based smart home features including keyless entry. Amenities Include:Rooftop Grilling StationsPin code or app accessFitness\/ Wellness Center                                                                                                                                On screen fitness classes provided in private yoga studioPet Spa StationIn Unit Washer & DryerKeyless EntryPenthouse Hideaway                                                                                                                                Fully furnished bar and lounge area for BYO entertainment.                                                                                                                            Photo                                                                                                                                 Featured amenityTech- Connected LivingConference RoomCustom Built-In & Historic DetailingStainless Steel AppliancesStove Range with Microwave, Refrigerator with ice maker, Dishwasher, Food Waste Disposal, Under Cabinet LightingCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/jo2wzvug\/one-cityPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T12:09:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547074160.html","post_id":7547074160,"result_date":"2022-10-18T16:09:51.000Z","title":"Resident Services, Roof Top Dog Run, Yoga Studio","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1201Date Available: 2022-10-18Address: 1530 Locust StreetExperience the history and splendor of the Versailles from the comforts of your own luxury Rittenhouse apartment. The Versailles Philadelphia is a historic, 1920s-era residential building that has been upgraded for the contemporary age, now featuring 1-bedroom, 2-bedroom, and 3-bedroom Philadelphia apartments for rent in Rittenhouse. Finished with high-end materials, premium appliances and fixtures, and preserved architectural details, these Center City apartments are just steps from Rittenhouse Square. With a rooftop lounge, fitness center, yoga studio, business center, and more, the Versailles is well-equipped with comforts and amenities to enhance any lifestyle. Amenities Include:Rooftop LoungeCarrera marble kitchen backsplashCustom tiled showersSolid natural ﬁnish walnut ﬂoorsFull size in-unit washer & dryerYoga StudioConciergeFitness CenterSmart HomeResident ServicesStainless steel appliancesClassic white wood slat window treatmentsCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/xpqjlyep\/versaillesPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '1201ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T12:05:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547073609.html","post_id":7547073609,"result_date":"2022-10-18T16:08:51.000Z","title":"Online Payments Available, On-site bike storage","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Upgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with dens9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardOn-site bike storageHuge walk-in closets with ample storageFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingBocce ball fieldPet-friendly livingBBQ and deck areaBark park48-hour Maintenance CommitmentUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsOnline Payments AvailableCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/gwlhdsnp\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-10-18T12:04:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547067878.html","post_id":7547067878,"result_date":"2022-10-18T15:58:31.000Z","title":"Leases Designed For Traveling Nurses Here at Botanica Cottages!","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nOffering one, two and three  bedroom apartments with private entrances, these apartments more closely resemble private townhomes rather than an apartment rental community.  Easy access to Route 422, the main artery between Reading, Pottstown and King of Prussia.\nDetails\nAvailability date: Today\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Our Pet Policy: $30\/month pet rent. $400 (Non-refundable pet fee) for “first pet” and $250 (Non-refundable pet fee) for the “second pet.” Maximum of 2 pets per apartment home. No pet deposit. Breed Restrictions Apply. No aggressive breeds shall be permitted.\nDeposit: $1,000.00\nLeasing options: 12+ months\nLeasing notes:\nApplication fee: $50 per adult\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage\nUtilities Cost: Varies by apartment size\nLaundry: In Unit\nParking type: Garage\nParking notes:\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard\nHeating\/cooling: Heat: forced air, Central AC, Ceiling fans\nWiring: Cable-ready, High-speed internet, Wired, Intercom system\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Playground, Barbecue, Business center, Golf course\nSecurity and Access:\nViews:\nAdditional features: Hardwood floor, Tile floor, Granite countertop, Fireplace, Vaulted ceiling, Jacuzzi, Sauna, Hot tub \/ Spa, Non-Smoking Property\nOffered by:\nBotanica Cottages\nEqual Housing Opportunity","num_images":21.0,"lat":40.2075,"lng":-75.5329,"attrs":"['2BR \/ 2Ba', '975ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-18T11:54:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547067360.html","post_id":7547067360,"result_date":"2022-10-18T15:57:27.000Z","title":"Affordable studio available now at 3412 Spring garden!","description":"Cozy studio available now in university city area. Walking distance to Drexel university. Laundry room in the building. Window air conditioning. Hardwood floors. Tenants will be responsible only for electric. Security deposit, first and last month to move in. $55 application fee.\nRental Terms\nRent: $890\nApplication Fee: $55\nSecurity Deposit: $890\nAvailable now\nPet Policy\nCats allowed\nDogs allowed\nCall Alena for showing at  show contact info\nAlena Skorynina\nCity wide realty\n","num_images":6.0,"lat":39.9597,"lng":-75.2024,"attrs":"['0BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:53:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547064442.html","post_id":7547064442,"result_date":"2022-10-18T15:52:04.000Z","title":"Enjoy the best of city life, steps from various museums!","description":"Live in Logan Square, a Philadelphia neighborhood steeped in art and culture. Enjoy the best of city life, steps from various museums, parks, restaurants, and other conveniences. Just minutes from the Schuylkill River trail, I-76, and Market St transportation west to Chop and the universities and east to City Hall and beyond. Unit #803 is a sun-filled open concept 1-bedroom unit facing west towards the river. Features include warm-tone laminate wood flooring throughout and a custom built modern kitchen with high-end appliances, peninsula island, and walk-in pantry. The bedroom fits a King-bed comfortably and includes a large closet with custom shelving. In-unit laundry is located next to a modern bathroom with tub. Last but not least, one storage locker is provided for added convenience. This building has several parking options within walking distance. Tenant pays electric; water included in rent. One pet under 30lbs permitted at landlord's discretion. Live in the center of it all and experience Philadelphia as it's truly meant to be. Schedule your appointment today!\n2201 Cherry St #803","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '948ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:48:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547057303.html","post_id":7547057303,"result_date":"2022-10-18T15:50:21.000Z","title":"Smart Thermostat, Tech- Connected Living, Package Receiving System","description":"Bedrooms: 0Bathrooms: 1Address: 1401 Arch StreetLocated in Philadelphia’s historic Center City neighborhood, One City offers modern elegance with timeless grandeur. With views of Philadelphia's City Hall and just steps away from iconic Philly locations such as the Pennsylvania Convention Center, Reading Terminal Market, and Love Park, One City offers sophisticated luxury in the heart of Philadelphia. One City offers the most discerning residents the ultimate living experience. Inside this historic building, located at 1401 Arch Street, each apartment residence holds unique original features coupled with contemporary sophistication. Thoughtful design details include custom built-in storage, stainless steel appliances, and modern connectivity offering luxury and convenience to a range of lifestyles. Control is always at your fingertips with your app-based smart home features including keyless entry. Amenities Include:Smart ThermostatPackage Receiving SystemLobby Lounge                                                                                    Photo                                                                                                                                 Featured amenityPenthouse Hideaway                                                                                                                                Fully furnished bar and lounge area for BYO entertainment.                                                                                                                            Photo                                                                                                                                 Featured amenityFlexible Lease OptionsKeyless EntryRooftop Grilling StationsPet Spa StationProgrammable Smart Home FeaturesProgrammable via appBike StoragePin code or app accessCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/aa7ghg54\/one-cityPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-18T11:34:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547050726.html","post_id":7547050726,"result_date":"2022-10-18T15:49:00.000Z","title":"Beautiful one bedroom, one bath home at the Ellington!","description":"WELCOME HOME to this beautiful one bedroom, one bath home at the Ellington! The living and dining areas offer dramatic ten foot high ceilings, Brazilian cherry hardwood floors, and oversized windows that fill the home with natural light. The kitchen with breakfast bar features Poggenpohl cabinets, stainless steel appliances, Kohler fixtures, and Capao Bonito granite countertops. The bedroom features a double door closet and is set across from the spacious spa-like bathroom, which boasts White Gioia marble tile flooring, chrome fixtures, and a ceramic sink with storage vanity. Included in the rent are central air and heating, water and sewer, 24 hour concierge, private fitness center, and club room. Valet parking is available next door in a public garage. Perfectly situated in the Rittenhouse and Avenue of the Arts area, this home is steps away from fine dining, one-of-a kind shopping, world-renowned cultural destinations and exciting nightlife. APARTMENT ALSO AVAILABLE PARTIALLY FURNISHED AT NO ADDITIONAL COST. ** Photos from another unit with identical floorplan\n1500 Chestnut St #8E","num_images":6.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '759ft2', 'available now', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T11:22:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547046988.html","post_id":7547046988,"result_date":"2022-10-18T15:47:54.000Z","title":"1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin !!!","description":"1\/2 MONTH FREE FOR APPLICATIONS BEFORE 9\/30!!! Just 1st month's rent and $500 security deposit to move-in!!! 1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. Hardwood floors in the living area and the bedroom is carpeted. The Warehouse Property is located in a highly walkable area with access to all forms of public transportation. Secured entry, gated property, gym\/fitness center and on-site parking- add'l $150 mo. with full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit.\n9 N 9th St #706","num_images":6.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '848ft2', 'available nov 11', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-18T11:14:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7547045493.html","post_id":7547045493,"result_date":"2022-10-18T15:42:52.000Z","title":"$500 Security Deposit - Limited Time Move In Special!!!!","description":"$500 Security Deposit - Limited Time Move In Special!!!! The Society Hill Building is a beautiful mid-rise community located in the Society Hill\/Washington Square neighborhood of Center City. This building features spacious 1 bedroom 1 bath apartments, overlooking scenic Washington Square Park. The Society Hill Building is within walking distance of historic Old City as well as close to all forms of public transportation. 10 foot high ceilings, controlled access keypad entry, hardwood floors in some units, abundant natural light, dishwasher, microwave, high-efficiency individually controlled A\/C and heat. Laundry on each floor and pet-friendly! Brand new windows in all apartments. Pictures are of a similar unit.\n701 Sansom St #504","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '630ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-18T11:11:52-0400"}]