[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-apartment-for-rent-near\/7593444629.html","post_id":7593444629,"title":"Apartment for rent near 69th street and millbourne train station","description":"Please call only for all information about the apartment at  show contact info\n. It's a one-bedroom apartment with a private bathroom, kitchen, and a large living room. Just a block away from 69th street shopping center and millbourne train station. Tenants Pay for gas, electricity, and heat the landlord pays the rest.","num_images":17.0,"lat":39.9579,"lng":-75.2681,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T21:21:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-available\/7593442568.html","post_id":7593442568,"title":"Spacious 2 bedroom available now at 5100 Walnut st!","description":"Spacious 2 bedroom apartment available now at 5100 Walnut street. Large living room comes with a balcony. 3 months to move in. $50 application fee. Pet friendly. Laundry room is in the building. Tenant pays all utilities.\nCall or text at  show contact info\nto schedule your showing today.","num_images":19.0,"lat":39.956707,"lng":-75.223538,"attrs":"['2BR \/ 1Ba', 'application fee details: 50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T21:11:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-studio-available-now\/7593441846.html","post_id":7593441846,"title":"Great studio available now at 531 N Budd street!","description":"Cozy studio close to school.\nRental Terms\nRent: $900\nApplication Fee: $55\nSecurity Deposit: $900\nAvailable Now\nPet Policy\nCats allowed\nSmall dogs allowed\nGreat studio in a newly constructed building. Close to campus.\nW\/D shared on each floor.\nSmall pets. $250 pet fee\/ one per apartment.\nFlat amenity fee of $100 per month. Includes Wi-Fi, electricity, water, w\/d usage.\nPictures are of different units in the building.\nRequirements:\n1. First, Last and Security to move in ( three months up front )\n2. $55 application fee ( non refundable )\n3. Good credit ( no prior evictions, judgments or collections )\n4. Proof of income (co signer for students if needed )\nAlthough deemed accurate, this information is subject to change without prior notice.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":10.0,"lat":39.9618,"lng":-75.204687,"attrs":"['0BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T21:07:10-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-looking-for-peacecalm-and\/7593417042.html","post_id":7593417042,"title":"Looking for peace,calm, and tranquility? Then make this your new home","description":"5524 West Oxford Street, Philadelphia, PA\nLooking for peace, calm, and tranquility? Then make 5524 W Oxford St your new home! This newly renovated, detached, 3BD\/1BA home is on a quiet tree lined st, and is available NOW! This home features a front porch AND a large fenced in private backyard, stainless steel stove, microwave, and dishwasher, and laundry hookup in the basement for your convenience! Nice sized, carpeted bedrooms are upstairs. Pets friendly. Property is close to public transportation, major universities, restaurants, City Line Ave, and much more!First, Last and Security to move in (3 months)Credit, background, income checksCold water included. Tenants pay gas, electric, cable\/wifi550+ credit.\nDetails\n3 Beds \/ 1 Bath\nin Overbrook\nRent: $1,050 \/month\n1,124 square feet\nPets Allowed: Cats & Dogs\nAmenities\nAir Conditioning\nAssigned Parking\nCeiling Fan\nCentral Heat\nDishwasher\nFireplace\nGarden\nHardwood Floor\nIn Unit Laundry\nOn Site Laundry\nContact\n\nFeagle Edward\n","num_images":20.0,"lat":39.979698,"lng":-75.233256,"attrs":"['3BR \/ 1Ba', '1124ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T19:18:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-no-fee-rent-stabilized-bed\/7593403623.html","post_id":7593403623,"title":"NO FEE RENT STABILIZED 2 Bed\/2 Bath Laundry Elevator Crown Heights!","description":"Fully gut-renovated brand new 2 Bedroom\/ 2 bath unit combining industrial-chic touches with sleek, modern, condominium-quality finishes. The winged bedroom layout promotes the ultimate privacy as well as an expansive, versatile living space. Both bedrooms offer great light, size, and abundant closet space. Two full bathrooms boast glass-enclosed showers, high-end vanities, custom tiling, and recessed lighting. Beautiful 7\" oak hardwood floors throughout. The open kitchen features recessed lighting, stainless steel kitchen-aid appliances, custom wood cabinets, and granite countertops. The unit also offers Central Air with thermostat temperature control.\nIf you are interested in this property please send me your email or contact number for more details.I will contact you as soon as possible.","num_images":4.0,"lat":39.9954,"lng":-75.1698,"attrs":"['2BR \/ 2Ba', 'available feb 28', 'air conditioning', 'cats are OK - purrr', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T18:29:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-huge-bed-duplex-for-rent\/7593403640.html","post_id":7593403640,"title":"- HUGE 3 BED DUPLEX FOR RENT!","description":"Huge 3 bed 2 bath apt! This apt features a spacious living room w\/ tons of natural light, queen-sized bedrooms and hardwood floors. Enjoy a second level room perfect for additional living space and storage! Near shops, restaurants and everyday essentials.\n-Central AC\n-Virtual Doorman\n-Hardwood floors\n-Natural light\nIf you are interested in this property please send me your email or contact number.I will contact you as soon as possible.","num_images":3.0,"lat":40.0596,"lng":-75.0818,"attrs":"['3BR \/ 2Ba', 'available feb 28', 'air conditioning', 'cats are OK - purrr', 'furnished', 'duplex', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T18:29:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/prospect-park-newly-renovated-home\/7593402635.html","post_id":7593402635,"title":"Newly renovated home","description":"Newly renovated home with new appliances, flooring, and carpeting. Located in a peaceful neighborhood with an accessible public park and about 10mins away from the Philadelphia Int'l. Airport.","num_images":7.0,"lat":39.877139,"lng":-75.306882,"attrs":"['3BR \/ 1Ba', 'available feb 27', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T18:26:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-renovated-luxury\/7593383500.html","post_id":7593383500,"title":"BRAND NEW RENOVATED LUXURY 2 BR 1 Bath Home in Port Richmond","description":"BRAND NEW RENOVATED LUXURY 2 BR 1 Bath Home in Port Richmond\nWelcome to Mercer St. located in the heart of Port Richmond! Everything in this home is BRAND NEW! This home was gut renovated to the studs!  Many 2 bedroom townhomes in the neighborhood can be very small, but not this one. This one is extra wide plus it goes back pretty deep too! Gourmet kitchen features stainless steel appliances, soft close cabinets and gorgeous quartz countertops! Kitchen has an extra large refrigerator, dishwasher, microwave, and center burner stove.  Upstairs you'll find the hall bathroom that is also brand new and was wonderfully redone with quality materials and tasteful colors.  The tile work is gorgeous! The master bedroom is huge. The second bedroom is also large which is rare among rowhomes in this neighborhood.  Both rooms have ample closet space. The backyard has plenty of space for entertaining.  It’s the perfect place to grill, set up a small garden, and have friends over! There is a breezeway to the side of the house, that is not shared with the neighbor, and it runs from the front to the backyard. It’s a good space to store your bikes or trash.  Let’s also mention that a New High Efficiency Heater (this will help you save on utility bills!) and Central Air was just installed. New Hot Water Heater just installed. The basement is clean, nice, and has a professionally installed sump pump to handle any possible water intrusion. Plenty of space for storage! New Roof. Upgraded Electric.  New Washer and Dryer will be installed in basement. Fresh gray paint and real hardwood floors cover both levels of this home. Parking on this side of Port Richmond is much easier!  Don’t settle for a bland rental home without character or charm!\nLOCATION: 15 minutes to center city, 5 minutes to I-95,  enjoy restaurants on Somerset St. (Tacconelli’s Pizza, Somerset Splits, Kitty’s Luncheonette, Hinge Café, La Roma). Plenty of great neighborhood bars (Bonk’s Bar, Byrne’s Tavern, Tin Can Bar) Easy access to Fishtown\/Northern Liberties without paying a huge rental premium.   Mainstream shopping is at your fingertips on Aramingo Avenue (ShopRite, Wal-mart, Target). 2.5 Miles from Temple University! Just 5 minutes around the corner to the Betsy Ross Bridge to NJ. A couple minutes to I-95.\nDETAILS: $1645\/month. 1 year lease. Total required to move in: (Total: $4935). Tenant pays gas, electric, and water\/sewer. $53 screening fee (background check\/income verification) per adult. STRONG stable verifiable income AND financial standing REQUIRED.  Must make minimum of $4900 after taxes per month to qualify. Proof of income required. No prior judgments or evictions in last 4 years.  Renter’s insurance required. NO SMOKING OR VAPING! All applicants are screened very thoroughly. Please do not DISTURB current resident.\nPET POLICY:  small dogs (under 20 lbs.) or cats may be considered on CASE by CASE basis. Pets must be spayed\/neutered.  All vaccines must be up to date. $45 pet fee\/month\nContact:  For quickest response please text or email.","num_images":24.0,"lat":39.988816,"lng":-75.096319,"attrs":"['2BR \/ 1Ba', '1176ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T17:22:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2br-2bd-second-floor-pet\/7593382994.html","post_id":7593382994,"title":"2br - 2BD second floor \/ pet Friendly","description":"$1,825 \/ 1br - 1BD second floor \/ pet Friendly\nBedrooms: 1 Bed\nBathrooms: 1 Bath\nParking:  optional gated parking\nUnit Floor\/Level: 2nd-Floor\/Upper Unit\nLease Duration: 1 Year (See Details Below)\nDeposit: 1 month (OAC)\nPets Policy: Cats & Dogs OK\nLaundry: Shared\nProperty Type: Apartment\nSpacious 2 Bed\/2 Bath has been Fully Renovated to Meet your Standards! OPEN HOUSE SAT & SUN! A two-story garden-style building with water fountain courtyard, gated entrance, intercom system, optional gated parking*, surveillance cameras, laundry facility, and a swimming pool.\nSpacious Living Room\/Dining Area has fresh paint and wood flooring (throughout unit), base molding, new overhead light fixture, a ceiling fan with a light on a digital dimmer, a large new double pane window with new wooden horizontal blinds, a new wall a\/c unit, and a wall gas heater on a digital thermostat.\nIf you are interested in this property please send me your email or contact number. I will contact you as soon as possible.","num_images":4.0,"lat":40.060869,"lng":-75.074965,"attrs":"['2BR \/ 2Ba', 'available feb 27', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T17:21:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/king-of-prussia-perfect-for-live-2bed\/7593347122.html","post_id":7593347122,"title":"PERFECT FOR LIVE !!2BED\/1BATH IN THE HEART OF KING OF PRUSSIA TOWN","description":"The perfect blend of city conveniences and suburban sprawl, our community of studio, 1, 2, and 3 bedroom apartments offers the best of both worlds in the heart of King of Prussia Town Center and just 30 minutes from Philadelphia. Everyday living is elevated with incomparable community amenities like our 24-hour fitness center, dog spa, swimming pool, and lush courtyards. Expand your living space with our state-of-the-art social lounge and business center with complimentary Wi-Fi. Inside each home, deluxe finishes shine in spa-inspired bathrooms and gourmet kitchens. With studio, 1, 2, and 3 bedroom floor plan options, Cirro has charm and style in every size.","num_images":9.0,"lat":40.0956,"lng":-75.3737,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-02-25T15:45:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apartment-for-rent\/7593373659.html","post_id":7593373659,"title":"Apartment for Rent","description":"Two-bedroom apartment on the 2nd floor for rent.  Great location for all public transportation, new painting, flooring, refrigerator, and more.","num_images":8.0,"lat":39.96852,"lng":-75.230234,"attrs":"['2BR \/ 1Ba', 'available mar 15', 'application fee details: application fee is $50', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T16:54:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bocce-ball-field-online\/7593364368.html","post_id":7593364368,"title":"Bocce ball field, Online Payments Available, BBQ and deck area","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Bocce ball fieldPet-friendly livingBBQ and deck areaUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingOnline Payments AvailableBark park48-hour Maintenance CommitmentUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsGame Room with Billiards Table, Shuffle Board, and moreUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingAlexa or Google Home Capable in all ApartmentsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/rk3n3stw\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2023-02-25T16:28:15-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wallingford-wallingford-bed-laundry\/7593214523.html","post_id":7593214523,"title":"Wallingford 2 bed w\/ laundry hook up & storage","description":"2 Bedroom 1 bath with laundry hook up and large storage area.  Wallingford\/Swarthmore school dist.  Summer pool access NO pets  NO smoking   newly renovated","num_images":5.0,"lat":39.8871,"lng":-75.3721,"attrs":"['2BR \/ 1Ba', '888ft2', 'available mar 1', 'air conditioning', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T10:36:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bi-level-one-bedroom-in\/7593214268.html","post_id":7593214268,"title":"Bi Level One Bedroom In The Heart Of Old City!","description":"This charming loft apartment with unique architectural features is located in the heart of Old City. The kitchen has stainless steel appliances. The loft bedroom looks down on the living space with a wall of windows. You will also have access to the rooftop deck and the awesome views!\nSee more listings at brandywinecm.com!\n","num_images":6.0,"lat":39.950773,"lng":-75.145542,"attrs":"['1BR \/ 1Ba', '735ft2', 'available mar 11', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-02-25T10:35:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-studio-in-historic\/7593210112.html","post_id":7593210112,"title":"Large Studio In Historic Old City!","description":"Charming and spacious studio apartment. An abundance of windows flood this apartment with lots of natural light.\nSee more listings in Old City at brandywinecm.com!\n","num_images":4.0,"lat":39.951373,"lng":-75.145406,"attrs":"['0BR \/ 1Ba', '561ft2', 'available mar 11', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-02-25T10:24:36-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-in-historic\/7593207777.html","post_id":7593207777,"title":"One Bedroom In Historic Old City! Available Now!!","description":"Wonderful one bedroom apartment in the heart of Old City with tons of closet space, exposed brick, and great lighting!!\nMore Old City listings at brandywinecm.com!\n","num_images":3.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '676ft2', 'available mar 11', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-02-25T10:18:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-2br-1ba\/7593181677.html","post_id":7593181677,"title":"Newly Renovated 2BR \/ 1BA apt. - Pet Friendly - 5601 Baltimore Ave!!","description":"Welcome this sweet 2 bedroom apartment located near 5601 Baltimore Ave in Philadelphia, PA! It's a 3rd floor unit, so unfortunately there's no elevator, but don't let that deter you - the location and the apartment itself are definitely worth checking out!\nThe building is a clean brick 4 unit building that's been recently renovated, so you can expect it to be in great condition. Inside the apartment, you'll find beautiful hardwood floors that are sure to impress. And the best part? The landlord is pretty cool and is known for being responsive and easy to work with, so you can rest assured that you'll be in good hands.\nOverall, this is a fantastic option for anyone looking for a comfortable and well-maintained apartment in a great location. So why not schedule a viewing today and see for yourself? You won't be disappointed!\n","num_images":4.0,"lat":39.946615,"lng":-75.236646,"attrs":"['2BR \/ 1Ba', 'available may 3', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T08:55:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-furnished-apartment-for\/7593199963.html","post_id":7593199963,"title":"Furnished apartment for rent","description":"Hello! I’m looking for someone to rent my semi-furnished two bedroom apartment. I've lived here for 12 years and looking for a respectful person or couple to watch over my place for up to 6-months, with a potential month-to-month extension.\nLocated near the intersection of Parrish and Bucknell Streets. Second floor apartment in a three unit building above a yoga studio.\nThere are one bedrooms, both are shown in the photos. One is set up as a bedroom and the second as an office.\nThere is a private roof deck with a propane grill and garden (if you're willing to care for it!). Bike storage\/ mini garage downstairs below the deck.\nFull kitchen with gas stove & disposal, Fios wifi\/ TV\/ Sonos speakers\/ smart lighting. Lots of plants & art.\nThe apartment is located above a barre \/ yoga studio and you can sometimes hear music during their classes throughout the day.\nLocation:\nTwo blocks from the Girard trolley. Two blocks from 48, 49, 15, 7, and 33 busses. 15-minute walk to Whole Foods and the Kelly Drive side of Fairmount Park. 15-minute bike ride to Drexel, 10 minutes to Temple, 18 minutes to Penn.\n* Please respond with a link to a social media account. There are too many scammers on here, so I want to be able to verify you're real and actually interested.\nRent is $750 + utilities \/ month. Available in March 1!","num_images":0.0,"lat":39.9523,"lng":-75.1638,"attrs":"['1BR \/ 1Ba', '650ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T09:56:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/stop-by-today-pet-friendly-green-roof\/7593202956.html","post_id":7593202956,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/morrisville-tour-the-edge-at-yardley\/7593197622.html","post_id":7593197622,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-bedroom-trinity\/7593195602.html","post_id":7593195602,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-the-edge-at-yardley-tour-today\/7593195032.html","post_id":7593195032,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-luxury-apartments-open-house\/7593191423.html","post_id":7593191423,"title":"Luxury Apartments! Open House Today!","description":"The edge at Yardley is a wonderful community located in Yardley PA. We offer many different kinds of units including one - , two -, and three-bedroom floorplans with bi-level living options. Our community features a rare combination of great location , generous space and wonderful amenities and features. To schedule a tour please call  show contact info\n#18110\nHours:\nMon-Fri: 9:00am-5:30pm\nSat: 9:00am-5:00pm\nSun: Closed\n","num_images":10.0,"lat":40.203849,"lng":-74.878794,"attrs":"['1BR \/ 1Ba', 'available mar 3', '\\nsaturday 2023-02-25\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T09:30:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7593190123.html","post_id":7593190123,"title":"Pets Welcome, Lease Today, Quiet Community","description":"The Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '758ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T09:25:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7593187612.html","post_id":7593187612,"title":"Lease Today, Playground, Luxurious Bathrooms","description":"Schedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '786ft2', 'available mar 3', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T09:16:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-bed-2bath-luxury-living\/7593186260.html","post_id":7593186260,"title":"2 bed\/2bath - Luxury Living","description":"Apt. 5142 — Carlyle floor plan — 1,153 sq. ft. — $3,275\nLocated on the top floor, this 2-bedroom\/2-bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full-size front-loading washer and dryer, and upgraded stainless-steel appliances. Our brand-new construction includes quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":24.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1153ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-02-25T09:11:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-1bedrm-apt\/7593186149.html","post_id":7593186149,"title":"Newly Renovated 1bedrm Apt","description":"Newly renovated 1bedroom 1bathroom apartment with all new appliances & wash & dryer in unit. Rent includes utilities.","num_images":3.0,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'available now', 'application fee details: There is a $30 Application Fee', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T09:11:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-unbeatable-bed-bath-apt\/7593177395.html","post_id":7593177395,"title":"Unbeatable 2 bed 1 bath apt. -- Remodeled -- 100 Parklane Dr!!","description":"We've got a newly remodeled 2 bedroom, 1 bathroom apartment on the third floor of a super peaceful building near 100 Parklane Dr, Norristown. This sweet pad has hardwood floors throughout and we just finished upgrading the kitchen with new cabinets, countertops, lighting, and some shiny stainless steel appliances.\nBoth bedrooms are super spacious and have decent sized closets. Plus, all the windows in the building have been replaced so you can enjoy plenty of natural light. There's even a screened-in porch at the back of the unit where you can kick back and relax.\nOh, and don't forget, you'll get one off-street parking spot included with the apartment.\nIf you're interested, let us know and we'll schedule a viewing ASAP.\n","num_images":7.0,"lat":40.1496,"lng":-75.3796,"attrs":"['2BR \/ 1Ba', 'available may 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T08:37:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-2500-upper-farm-rd-spacious\/7593177011.html","post_id":7593177011,"title":"2500 Upper Farm Rd -- Spacious Studio Apt. $715","description":"We are delighted to offer you a spacious studio apartment on the south side of Norristown, PA, located at 2500 Upper Farm Rd. This studio comes with a small bonus room, which can be utilized as an office or any other additional living space.\nThe studio is pet-friendly, and the monthly rent is $715. However, utilities are not included in the rent and will be the tenant's responsibility.\nWe invite you to schedule a viewing at your convenience to see the property and all its features. Please feel free to contact us if you have any further questions or would like to arrange a viewing.\n","num_images":7.0,"lat":40.1496,"lng":-75.3796,"attrs":"['0BR \/ 1Ba', 'available may 3', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T08:35:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bed-bath-apt-on\/7593160158.html","post_id":7593160158,"title":"Spacious 4 bed\/3 bath apt on a beautiful block lined with trees!","description":"Available March 1, 2023 Either can be rented out as a 3 bed\/3 bath or a 4 bed\/3 bath Start the new year at the new, modern, and spacious apartment on a beautiful block lined with trees and close to bars, restaurants, public transportation, Art and many other museums, the center of the city, and more! Truly an amazing location for your professionals that want to live in luxury close to major points of interest for a reasonable rent. The building was constructed in 2018 and it has all the modern stainless steel appliances, beautiful bathrooms, central A\/C and heating, hardwood floors throughout; a very spacious living area with 11 ft ceilings, large bedrooms with enough space to comfortably fit a queen-size bed, desk, dresser and whatever else you have got! The closets are deep and have installed clothes organizers. An in-unit washer and dryer, a security system, and cameras throughout the building! An amazing property management company, a convenient tenant portal to pay rent. First, last, and a security deposit is required to move in.\n1516 Green St #A","num_images":10.0,"lat":39.9677,"lng":-75.1735,"attrs":"['4BR \/ 3Ba', 'available mar 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:48:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-apt-in-the\/7593163254.html","post_id":7593163254,"title":"Amazing Apt in the desirable Olde Kensington neighborhood!","description":"Welcome to 1213 N Howard Street in the desirable Olde Kensington neighborhood of Philadelphia! This beautiful three-story trinity offers the perfect blend of modern amenities and charming character. The home boasts three bedrooms and one bathroom, perfect for a small family or roommates. The kitchen is equipped with a stainless steel appliance package, providing all the necessary tools for your culinary creations. The home also offers a nice-sized yard, providing ample space to relax outdoors. This home's location is truly ideal, as it is within walking distance of all the shops and restaurants in the trendy Northern Liberties and Fishtown neighborhoods. Enjoy a cup of coffee at La Colombe, dine on delicious Middle Eastern cuisine at Suraya, or grab dessert at Cake Life. The home's close proximity to Interstate-95, bus lines, and the Girard Avenue subway stop provides a short commute to Center City Philadelphia, making it a great option for those who want to be close to the city's business and cultural centers. Don't miss out on the opportunity to live in this beautiful and convenient rental unit. Schedule a viewing today!\n1213 N Howard St","num_images":6.0,"lat":39.978,"lng":-75.1459,"attrs":"['4BR \/ 1Ba', '1119ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T07:16:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-unit-thats-ready\/7593162292.html","post_id":7593162292,"title":"A gorgeous unit that's ready and waiting to be called home!","description":"A gorgeous unit that's ready and waiting to be called home! Located in the heart of Graduate Hospital, enter this fantastic unit and discover the hardwood flooring, recessed lighting, high coffered ceilings with installed speakers, and large energy efficient windows which provide ample natural light. The spacious, open living and dining space offers plenty of room for entertaining friends and family, and showcases the gorgeous kitchen, which includes granite counters and large island, stainless steel appliances, and a beautifully tiled backsplash. Continue past the kitchen to find the beautifully tiled bathroom with tub and shower combo with dual showerheads. The floor also includes a sun drenched bedroom with a walk in closet and access to a large fiberglass deck- just the spot for lounging on those sunny days! Washer and dryer are included in the unit, as well as an installed security and intercom system, and the location can't be beat- close to shops, restaurants, not to mention just minutes away from Center City. Don't wait, see this unit today!\n1519 Bainbridge St #B","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '1000ft2', 'available apr 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T07:08:10-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-live-at-park-towne-place\/7593163075.html","post_id":7593163075,"title":"LIVE AT PARK TOWNE PLACE APT HOMES IN CENTER CITY PHILADELPHIA!!","description":"You will be close to Rittenhouse Square and Logan Square's nightlife hubs. The condo includes walk-in closets, breakfast bars, pendant lighting, tile backsplashes, stainless steel appliances, quartz countertops, in-unit washers, and dryers. A variety of floor plans are available, all with breathtaking city and museum views! Gourmet coffee, tea, and other items can be found at Mainstreet Market and Cafe. A fitness centre with Technogym machines, a boxing gym, a yoga\/spin studio, and indoor and outdoor exercise areas. The largest pools in Philadelphia, an art studio, a fitness centre with a boxing gym and a yoga\/spin studio, a social lounge with a demonstration kitchen, a gourmet market and cafe, an outdoor lounge with a fire pit, a 24-hour concierge, package acceptance around-the-clock, resident shuttle service to Center City and University City, and more can all be found there. Consider using Whole Foods, which is conveniently located a block away, as your second kitchen. Many colleges and universities, including Drexel University, Temple University, University of Pennsylvania, CHOP, Moore Institute of Art, and the Community College of Philadelphia, are within one mile of our apartments. In the Fairmount Area, there isn't a finer building to reside in with facilities. Among its four high-rise towers, Park Towne Place contains 948 apartments and penthouse residences. In the centre of Philadelphia's Museum District, on the Benjamin Franklin Parkway, the neighbourhood is tucked between acres of lush vegetation. Park Town. Pricing and availability are subject to daily change. Pictures are model units. Parking can be provided for an extra charge.\n2200 Benjamin Franklin Pkwy #0B-E0003","num_images":6.0,"lat":39.9677,"lng":-75.1735,"attrs":"['0BR \/ 1Ba', '425ft2', 'available apr 8', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T07:15:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-experience-the-best-of\/7593162385.html","post_id":7593162385,"title":"Experience the best of urban living in this luxurious 1 bedroom Apt!","description":"Available now! Experience the best of urban living in this luxurious 1 bedroom apartment in the heart of Old City, Philadelphia! Welcome to the newly renovated building at 37 N 3rd St! In total, we have 4 different 1-bed apartments available for rent. Located between Independence Hall & Penn's landing, you truly get to enjoy all the aspects of the old city while living in a modern apartment. With its new stainless steel kitchen and bathroom, this unit truly reflects modern sophistication. You'll be delighted with the ample natural light that pours into the living space, creating a warm and inviting atmosphere. The central air conditioning and heating and the in-unit washer and dryer ensure maximum comfort and convenience. First, last, and security are required to move in.\n37 N 3rd St #4F","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '1088ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T07:08:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-immaculate-property-in\/7593163220.html","post_id":7593163220,"title":"IMMACULATE PROPERTY IN A GREAT LOCATION!!","description":"Fully Furnished and ready to go. Immaculate property in a great location with a master bedroom and bath on the 3rd floor. Available September 1st.\n1151 N Hancock St","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2.5Ba', '1359ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T07:16:10-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bi-level-pet-friendly\/7593163150.html","post_id":7593163150,"title":"This Bi-level, Pet-friendly Unit With Top Quality & Comfort Standard","description":"Welcome to the apartments at 1600 South, where top quality and comfort come standard. Located on one of Philadelphia's most recognizable streets and in the heart of the vibrant Graduate Hospital community, this bi-level, pet-friendly unit includes all the features on your wishlist, including hardwood flooring, comfortable living and dining area, video intercom security system, floor to ceiling windows, high ceilings, as well as a modern kitchen with quartz countertops, stainless steel GE appliances and a gorgeous tile backsplash. Continue upstairs to find two conveniently located full bathrooms- feel like taking a bubble bath? Hop into the one bathroom's tiled tub, and take time to admire the tile flooring and quartz counter vanity. Running short on time? Jump into the other bath with its frameless glass enclosure shower with tile to the ceiling, as well as quartz countertops and tile flooring. The bedrooms in the unit are simply fabulous, with tons of light and closet space to go around. Finally, Take a trip upstairs to the immense roof deck- perfect for lounging with a few friends in warmer weather. With additional perks such as a washer and dryer in the unit, storage space in the basement, as well as a security system and 2 door cameras at the entrance, this is definitely a unit you need to see! An agent has ownership in the property.\n1600 South St #3F","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '1300ft2', 'available apr 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T07:15:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-unit-in\/7593160117.html","post_id":7593160117,"title":"1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Sq!!","description":"Just 1st month's rent and $500 security deposit to move-in!!! 1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. Hardwood floors in the living area and the bedroom is carpeted. The Warehouse Property is located in a highly walkable area with access to all forms of public transportation. Secured entry, gated property, gym\/fitness center, on-site parking (additional $250 month) with full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit.\n9 N 9th St #701","num_images":9.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '737ft2', 'available mar 6', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:47:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-graduate-hospital\/7593162278.html","post_id":7593162278,"title":"AMAZING Graduate Hospital location! This sunny corner 2nd Floor Unit","description":"AMAZING Graduate Hospital location! This sunny corner 2nd Floor Unit has a den attached to the bedroom that can be perfect for an office space or second living area. Recently renovated with stainless steel appliances. The basement is very clean with storage for each unit and 2 washers and dryers. Tenant pays gas\/electric and cable\/internet. Won't last long!\n1800 Catharine St #2","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '700ft2', 'available mar 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T07:08:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-construction-bi-level\/7593162259.html","post_id":7593162259,"title":"New Construction Bi-level Apts With 3 Beds, 3 Baths, Modern Finishes!","description":"Nestled alongside Hawthorne, Bella Vista and the Italian Market neighborhoods, 1131 Christian Street #2 is a 2-year young new construction bi-level apartment with 3 bedrooms, 3 bathrooms, modern finishes and a private rooftop deck with skyline views. Conveniently around the corner from Hawthorne Park and surrounded by neighborhood favorites like Hawthorne’s Beer Café, Le Viet, Santucci’s Pizza, Isgros and Angelo’s Pizzeria. Sprouts, Whole Foods, ACME and the Italian Market are all within a 5 minute walk. Walkable to Center City and easy access to University City via public transit, bike or ride share.\n1131 Christian St #2","num_images":7.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 3Ba', '1330ft2', 'available apr 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T07:07:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-25-bath-tri-level\/7593162214.html","post_id":7593162214,"title":"2 Bed, 2.5 Bath, Tri-level Condo is Available for Rent in Fishtown!!","description":"Welcome to 325 E Allen St #2! Located on the first floor, so carrying groceries and bags is a breeze. This 2 bedroom, 2.5 bath, tri-level condo is available for rent in Fishtown. Enter into the unit to find an expansive open first floor with top-of-the-line amenities, modern kitchen with Carrera style counter tops, stand-alone island with ample seating, and stainless-steel appliances. Floor to ceiling windows in the living and dining room allow for an extra sun-soaked space. Through the sliding glass doors, you'll find an EXTRA-LARGE outdoor space that is RARE in the city and perfect for grilling, entertaining, and pets. Head downstairs to find a laundry room that houses mechanicals and side by side washer and dryer. Continue down the hallway to find your first generously sized bedroom with ample closet space and a three-piece ensuite accented in white subway tile. Head back upstairs to find a hall powder room and a large owners suite with walk-in closet and large spa-like bathroom, with glass enclosed doors, subway tile and an in-shower bench for relaxation! This space is perfect for roommates, as you'll each have extra privacy with your very own bathrooms. This home is walking distance to Frankford Avenue and all Fishtown has to offer. Penn Treaty Park is directly across the street. Street parking is a breeze as no permits are required! This one is hard to beat - schedule your showing today!\n325 E Allen St #2","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 2.5Ba', '1556ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-02-25T07:07:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bed-apt-in\/7593158446.html","post_id":7593158446,"title":"Spacious 2 bed apt in a landmark building with a newly renovated lobby","description":"$500 Security Deposit and 1st Month's Rent to move-in!! Spacious 2 bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block off the Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of the actual unit! Video can be provided upon request!\n1411-1 Walnut St #808","num_images":10.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '970ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:26:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-one-bedroom-unit-in\/7593160100.html","post_id":7593160100,"title":"Lovely one bedroom unit in sought after Queen Village","description":"Lovely one bedroom unit in sought after Queen Village. This quaint, self managed and well maintained unit and building has a spacious, shared, gated courtyard space. This unit offers a nice sized living area with hardwood floors, exposed brick, recessed lighting and a ceiling fan, a fully-equipped updated kitchen with tile backsplash, granite countertops, and breakfast bar, a full updated bath with built-in shelving a shower\/tub combination, and a sizeable bedroom in the rear. There is central air, good closet space, an in-unit washer\/dryer, newer HVAC system and trash and snow removal services. The location is awesome, close to popular Philadelphia Java Company, For Pete’s Sake Pub, Lucky’s Last Chance, Headhouse Salon, and green spaces such as Mario Lanza Park, and Shot Tower Recreation Center. Center City and 95 are both extremely accessible to this area. Don’t miss out on this opportunity!\n213 Christian St #3","num_images":9.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-02-25T06:47:36-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bi-level-bedroom\/7593159143.html","post_id":7593159143,"title":"Spacious bi-level 1 bedroom unit at the pet-friendly Metro Club","description":"Spacious bi-level 1 bedroom unit at the pet-friendly Metro Club with a washer\/dryer in unit and 1 secured gated parking spot included. The unit has a great deck. Great natural lighting, expansive windows, open layout, modern stainless steel appliances, beautiful hardwood floors, pendant lights above the breakfast bar. Closet galore, double bathroom sinks! Metro Club in an elevator high-rise with a heated outdoor pool, Boutique hotel-style lobby, fireplace, and lounge seating. Secured entry and controlled building access with a full gym. Easy access to Market East SEPTA station and SEPTA bus routes and many area local attractions including Reading Terminal Market, Maggiano's Italy, The Melting Pot etc. Pictures are of a similar unit!\n201 N 8th St #PH909","num_images":10.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '1180ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:36:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-move-in-ready-this-sun\/7593160140.html","post_id":7593160140,"title":"Move in ready! This sun splashed home on the 35th floor","description":"Move in ready! This sun splashed home on the 35th floor, offers panoramic sunset views on one side and gorgeous views of Liberty Place on the other. What a great, meticulously maintained home which features Pergo type flooring throughout, a completely renovated and tiled bathroom, an open renovated kitchen with a tumbled marble backsplash and an additional island with extra drawers for storage underneath a butcher block breakfast bar offering seating for four. Academy House is a 37 story condominium tower with recently renovated hallways, recently replaced exterior doors and windows, and is now undergoing a state of the art transformation in the lobby and arcade area. There is monthly valet parking available in the building, as well as a fitness room and deck for sunbathing that is included. Rent includes all utilities . If interested listing agent will prepare lease- see instructions in agent private. Internet \/cable is an additional $69.05 per mo.\n1420 Locust St #35H","num_images":7.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '624ft2', 'available apr 7', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-02-25T06:47:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-it-is-my-distinguished\/7593159269.html","post_id":7593159269,"title":"It is my distinguished honor to present to you 436 E. Thompson St","description":"It is my distinguished honor to present to you 436 E. Thompson St. available for immediate occupancy. Located in the Heart of Fishtown, along the Delaware River, anchored by Commercial Mixed Use Corridors, including South St, and surrounded by residential properties, this property is situated at the intersection of a quaint & quiet neighborhood. This 3 story new construction townhouse features high end finishes and rooftop space. There is currently an occupant in the building and we are searching for 2 additional roommates. There is a 1 bedroom with a shared bathroom on the 2nd floor renting for $1050\/month and a 3rd story bedroom loft with private en suite bathroom renting for $1475\/month. All occupants will have access to the rooftop and backyard space and common living area (kitchen, living room, and dining room) The main floor features hardwood floors with high end finishes and lacquer cabinetry & open space that leads into a private backyard space. The property is filled with radiant natural light and illumination from large windows. Walk upstairs to the 2nd floor with 2 bedrooms and a shared bathroom. Continue up the winding staircase to the 3rd story bedroom loft with intricate dimensions and angles allowing for extra ceiling height. The 3rd floor has a loft bedroom and private en suite bathroom. The property is close to bus stops and close to multi-modal public transportation, commercial mixed used corridors with many retail businesses, food establishment, and other entertainment and amenities. To apply, we are running credit reports, criminal backgrounds, eviction history, and reviewing all income & financial documentation. If you are selected as a tenant, we will collect first, last & security deposit(one month). There are no minimum score requirements. The entire financial and credit profile will be reviewed in its entirety to determine application viability. We look forward to doing business with you and we will ensure a smooth, efficient, and professional process for all parties. Thank you for the opportunity to showcase this home and we wish you the best of luck in your home search.\n436 E Thompson St #1","num_images":12.0,"lat":39.9788,"lng":-75.1262,"attrs":"['1BR \/ 1Ba', '2037ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-02-25T06:38:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-530-2nd-st\/7593160131.html","post_id":7593160131,"title":"Welcome to 530 S 2nd St Fully Furnished Condo in Beautiful Condition!","description":"Welcome to 530 South 2nd Street, Unit 819 a fully furnished condo in beautiful condition! Walk into a newly renovated open concept kitchen, finished with new hardware and cabinetry designed for maximum storage. The kitchen is also equipped with granite countertops, stainless steel appliances and a spacious peninsula, perfect for dining and entertaining. Continue into the airy living room where you will find ample space for lounging on the couch or working at the newly custom built-in desk. The couch easily turns into a queen-size sleeper sofa, ideal for hosting friends or family overnight! Off the living room you will find the bedroom, recently fitted with new windows and stylish, yet practical, plantation shutters. The master closet was recently transformed into the ultimate dream closet! Designed by California Closets, no expense was spared to ensure that you will have more than enough space for your wardrobe. Also, off the living room you will find the bathroom with beautiful stone tile throughout, generous storage space, and a shower\/tub completed with bath jets. Here you will also find your very own washer and dryer. Not only is the inside of this unit amazing, but the private covered balcony offering picturesque views of the city provides the perfect combination of indoor-outdoor living. This unit comes fully furnished, with all the furniture being in excellent condition. Also included is complete access to the gym in the building, an outdoor garden with seating, 24\/7 security, and access to a covered parking garage with the option to rent a parking space. Located in the historic area of Society Hill, this unit is surrounded by charm and beauty. You also can't beat the convenience of being only steps away from award-winning restaurants, bars, coffee shops, bakeries, and more. Don't miss out on the opportunity to make this penthouse unit in Abbotts Square your next home. Owner is related to the listing agent.\n530-10 S 2nd St #819","num_images":7.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '468ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:47:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-photos-are-of-similar-unit\/7593159323.html","post_id":7593159323,"title":"***Photos are of a similar unit, every unit is unique.***","description":"***Photos are of a similar unit, every unit is unique.*** Welcome to 1217 Spring Garden! This five-story building, the first reinforced concrete structure in the city, began life towards the end of the 19th century as the home of the Bilgram Machine Works and was later converted into this uniquely designed loft-style building featuring 40 units in its entirety. Each unit with its own DNA and original structure! As you enter the building using it’s smart building access controls, you’ll find a lobby designed to both pay homage to the building’s 19th-century industrial past and add some 21st-century gloss. You’ll also take notice of its wheel chair accessibility and new elevator in the former freight elevator shaft. Mail room is also located in the main lobby for convenience. Take a ride up to the 3rd floor where you’ll find unit 304. Walk right into the original industrial DNA design including its original hard wood flooring, loft, and brick exposed walls. You’ll surely take notice of it’s high ceiling and solid structure! As you move along you’ll find a large kitchen with plenty of cabinet storage and all of your essential appliances and your two nicely sized bedrooms. Your master bedroom includes a large closet and master bath! Make sure you stop by the fitness center and bicycle + skateboard storage room located on level B. Enjoy the tour!\n1217-35 Spring Garden St #304","num_images":9.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '917ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2023-02-25T06:38:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-spacious\/7593159113.html","post_id":7593159113,"title":"Newly Renovated, Spacious and sunny 2 bedroom, 2 bath apartment","description":"Available Feb 18. Spacious and sunny 2 bedroom, 2 bath apartment with convenient off-street PARKING spot, available now. Unit is bi-level and has been newly renovated. Main area includes a full kitchen, dining area, large coat closet, living room with wood burning fireplace. Two bedrooms and two full baths upstairs. Abundant natural light. Stacked washer & dryer, High ceilings. Great storage. Off street parking included with rent. Excellent Green St location. Walk to The Barnes, Whole Foods, and more. Close to SEPTA subway and bus lines.\n1617 Green St #4","num_images":10.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:36:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-splendidly-renovated\/7593158929.html","post_id":7593158929,"title":"Splendidly renovated warehouse in Franklin Square offers unique apt!!","description":"Just 1st month's rent and $500 security deposit to move-in!!! This splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. The Warehouse is located in a highly walkable area with access to all forms of public transportation. Amenities include secured entry and controlled building access, on-site parking (additional $250\/month), full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit in the building!\n9 N 9th St #509","num_images":9.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', '893ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:33:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-and-spacious-first\/7593158919.html","post_id":7593158919,"title":"Bright and spacious first floor condo with gated parking","description":"The beautiful tree line street sets the setting for this bright and spacious first floor condo with gated parking (#4). This unit has oversized windows which provide wonderful natural lighting. The Living room has gorgeous hardwood floors, high ceilings. The kitchen features include dishwasher, microwave, electric stove and ceramic tile floor. There is a bonus room which could be dining area or work area or a possible bedroom with a powder room. The upper level features the main bedroom with. bathroom and an attached balcony. The shared open courtyard is great for entertaining, grilling or relaxing. Enjoy all of the conveniences of city living and walking distance to the Art Museum, The Barnes, Kelly Drive, Whole Foods, Target and public transportation\n1705-11 Green St #1707B","num_images":9.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 2Ba', '870ft2', 'available now', 'apartment', 'laundry in bldg', 'detached garage', 'rent period: monthly']","posted_date":"2023-02-25T06:33:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-you-will-find-an-elevated\/7593158908.html","post_id":7593158908,"title":"You will find an elevated sleeping quarter","description":"Here is your chance to rent a unit in the highly sought after Beaux Arts Lofts building in Center City! Sporting hardwood flooring throughout, this 740 sq. ft. unit offers a spacious layout along with modern finishes. Upon entry, you are greeted with a spacious living\/dining area. The kitchen offers plenty of counterspace and is equipped with an electric range, stainless steel refrigerator, and a dishwasher. Just past the kitchen, you will find an elevated sleeping quarter. On top of the unit itself, tenants also have access to a beautiful roof deck, offering a gorgeous view of the city skyline. This building also offers a fully functional elevator for tenants to travel floor to floor. Schedule your tour today!\n1238 Callowhill St #501","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['0BR \/ 1Ba', '740ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:33:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautifully-renovated\/7593158900.html","post_id":7593158900,"title":"This Beautifully Renovated Bi-level Apartment Features","description":"This beautifully renovated bi-level apartment features original detailing with tastefully updated finishes in the kitchen and bathroom. This 1 bedroom, 1 bathroom unit is nestled in the Graduate Hospital neighborhood, just blocks from the amenity of Center City.\n2303 Christian St","num_images":10.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '1400ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-02-25T06:33:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nestled-in-the-desirable\/7593158877.html","post_id":7593158877,"title":"Nestled in the desirable Rittenhouse Square neighborhood","description":"Welcome to 1705 Spruce St! Nestled in the desirable Rittenhouse Square neighborhood, these new 2021 full gut-rehabbed apartments offer modern living in a historic district. With construction finalized in 2021, these brand-new units offer high-end appliances, plenty of closet space, and lovely views. With seven (7) available units, there are a variety of floorplans available for those seeking either a studio or 1-bedroom. You won’t have to worry about laundry, as each apartment has access to laundry on the first floor and some select floor-plans offer an in-unit washer\/dryer! With so many attractions nearby, this location is the epitome of ideal: steps away from Rittenhouse Park, Starbucks, restaurants, shopping, and so much more. Transportation is a breeze, with countless bus routes around the corner and just a quick stroll to the BSL. We have three featured units at the moment, but you can find the floor-plans for all units throughout this website. For questions or to request a tour, please contact the Philly Home Advisors! Unit 1R is approximately 300 sq ft offering a kitchen with brand new stainless-steel appliances, dishwasher, and quartz countertops. With lots of cabinetry, there is plenty of storage! The bathroom includes a shower\/tub combo, new vanity, and gorgeous modern tiling. The bedroom offers a comfortable space, lots of natural lighting, and a nicely sized closet. This 1-bed, 1-bath is offered at $1,395 a month, plus the cost of utilities. Located right outside the unit is the communal laundry, where two (2) sets of free washers and dryers are found for the tenant’s convenience.\n1705 Spruce St #2","num_images":9.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '4187ft2', 'available mar 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-02-25T06:33:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-two-bedroom-house\/7593158466.html","post_id":7593158466,"title":"This Two Bedroom House Sits on a Quiet Block and is Available for Rent","description":"Located in Graduate Hospital this two bedroom house sits on a quiet block and is available for rent! This property features hardwood flooring throughout, a fenced in yard, and a washer and dryer located in the partially finished basement. Just blocks from Rittenhouse Square, and University City\/CHOP and some of Graduate Hospitals best amenities. First, Last, and Security Deposit due a signing.\n2041 Pemberton St","num_images":9.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '750ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:27:13-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-furnished-bi-level\/7593158451.html","post_id":7593158451,"title":"Fully Furnished Bi-level 1BR apt with Private outdoor space in Fishtow","description":"Fully Furnished Bi-level 1BR apartment with Private outdoor space in Fishtown available NOW! The unit features the gleaming hardwood flooring, kitchen with stainless-steel appliances, including a gas stove, microwave and garbage disposal. Split wall AC\/heat unit in each room. A nice open living room with an L-shape couch, TV and a dining table with chairs. The lower level features a good size bedroom, a full bathroom with a standing shower, full size washer and dryer, and a private outdoor space. In addition to the features of the unit itself, you'll love the location. A quiet, residential block just steps away from local dinning and shops such as Baltic Bakery, Kraftwork, Lloyd & Fishtown's Frankford Ave corridor. There are also a few Stephen Starr restaurants very close by as Suraya, Fetta Sau & William Mulherin's Sons are all within close proximity. Within 10 min walking to Girard Train Station. Easy access to I-95. You won't want to miss an opportunity to call this your own! **Off the street parking is available for an additional $100 per month. Please note: only a small car or motorcycle would be suitable for this parking spot.** VIDEO TOUR IS AVAILABLE! Call or TEXT Now to schedule your appointment at (267) 884-5 zero 45 (I usually reply on text messages within 10 min, ask for Kateryna).\n620 E Flora St #1","num_images":7.0,"lat":39.9788,"lng":-75.1262,"attrs":"['1BR \/ 1Ba', '650ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:27:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-incredible-top-floor\/7593158109.html","post_id":7593158109,"title":"Incredible Top Floor 1 Bedroom Apartment With Wrap Around Windows","description":"Incredible top floor 1 bedroom apartment with wrap around windows PLUS parking in the middle of Rittenhouse Square!!! Located on the corner of 23rd and Walnut Street, this apartment will give you walking access to the best parts that the city has to offer! This unit boasts large living and bedroom space with a TON of natural light to match! Washer and dryers in unit. Easy access to all highways including 676 and I-95 in case you have to get out of the city limits easily and conveniently. The best restaurants within minutes' walk and the most vibrant night life as well. Elevator building that allows pets. Water and parking included in rent!\n135 S 23rd Street #B5","num_images":8.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '720ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2023-02-25T06:22:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-prime-location-cottage\/7593157115.html","post_id":7593157115,"title":"Prime Location! Cottage style(fresh painted)apartment with(wi-fi)","description":"2234 E Allegheny Ave, # 2, Philadelphia, PA 19134\nPrime Location! Cottage style(fresh painted)apartment with(wi-fi). This 1 bedroom, 1 bath home with great community . The kitchen is new with bright, white cabinets, quartz counters and new flooring. The bathroom has been completely remodeled with new plumbing, shower, vanity, flooring and fixtures. Other updates include the addition of central air, freshly painted walls, new water heater and electrical items which includes a brand new panel. The basement is unfinished offering great space for storage. This apartment is convenient to shopping at all the local shopping areas on Aramingo Avenue. There is easy access to all forms of public transportation.\nHigh Speed Internet Access\nWi-Fi\nIn Unit Washer & Dryer\nWasher\/Dryer Hookup\nAir Conditioning\nHeating\nCeiling Fans\nSprinkler System","num_images":4.0,"lat":39.990263,"lng":-75.107892,"attrs":"['1BR \/ 1Ba', '875ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:08:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-loft-style-one-bedroom-in\/7593158047.html","post_id":7593158047,"title":"Loft-style One Bedroom in a Boutique Rittenhouse Building!","description":"Rare, HUGE (1300 SQFT!), loft-style one bedroom in a boutique Rittenhouse building. Plenty of room for a work from home scenario if need be. Elegant with tall ceilings through-out, hardwood floors, great windows for natural light, dining room and open kitchen with granite countertops and stainless steel appliances. The spacious bedroom has lovely french doors and two sizable closets. Additionally, there is extra storage and private brand new laundry in the basement (directly accessible from the unit). Perfectly located in the desirable Rittenhouse Square Area, this home is in the heart of Center City with fine dining, one-of-a-kind shopping, exciting nightlife, and world-renowned cultural destinations. The campuses of Penn and Drexel, 30th Street Station and major hospitals are all minutes away. No pets. Tenant pays electric, water and gas included. Available asap! Landlord prefers at least 15 month lease. First, last and 1 month security due at signing.\n253 S 21st St #1","num_images":7.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '1360ft2', 'available mar 10', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T06:21:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/royersford-end-unit-first-flr-no-steps\/7593152120.html","post_id":7593152120,"title":"End Unit, First Flr. (no steps), Washer\/Dryer in unit, Easy access to","description":"End Unit, First Flr. (no steps), Washer\/Dryer in unit, Easy access to 422 and shopping! Tennis courts, pool and clubhouse included.\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\nTO SEE MORE PROPERTIES GO TO: www.eliterps.com\/inventory\nOffered by: ELITE Rental Properties Inc.  show contact info\nx 1\nEnd Unit, First Flr. (no steps), Washer\/Dryer in unit, Easy access to 422 and shopping! Tennis courts, pool and clubhouse included.\n*PROPERTY INFORMATION*\n-PROPERTY STATUS: For Rent Only\n-ADDRESS: 1109 Foxmeadow Drive Royersford, PA 19468\n-UNIT TYPE: Condo 2+2\n-RENTAL SPECIALS: If credit score for all applicants is greater than 800 or above, total move-in costs are reduced*.\n-MONTHLY RENT: $1795\n-MOVE-COSTS: Typically, three (3) times the monthly rent depending on credit\n-MOVE-IN DATES: 1st or 15th of the month\n-MINIMUM LEASE TERM: Through May 31st, 2024\n-HEATING: Electric, Forced Air\n-AIR CONDITIONING: Central\n-LAUNDRY: W\/D in unit\n-PARKING: Unlimited On-Street Parking\n-UTILITIES INCLUDED: Water, Sewer, Trash, Landscaping, Snow Removal, HOA\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\nTO SEE MORE PROPERTIES GO TO: www.eliterps.com\/inventory\n*LANDLORD'S RENTAL REQUIREMENTS*\nEVERYONE AGE 18 OR OVER MUST HAVE THE FOLLOWING:\n-COMBINED MONTHLY NET INCOME: Three (3) times the monthly rent in documented monthly net income\n-MIN. CREDIT SCORE: 675\n-MAX. IN COLLECTIONS\/JUDGEMENTS: $0\n-PET OCCUPANTS: Cats and small dogs (under 25lbs) welcome. Up two (2) pet occupants. $50 per pet per month.\n-SMOKING: Not Allowed\n-SECTION 8: Not Accepted\n*NEARBY*\nSpring Ford Country Club, Spring-Ford Area High School, Heritage Field Airport, Philadelphia Premium Outlets, Limerick, Trappe, Spring City, Linfield, Phoenixville, Mont Clare, Collegeville, Sanatoga\n*CONSUMER NOTICE*\nAs per Pennsylvania Real Estate Commission requirements, ELITE Rental Properties Inc. is hereby informing you that we represent the Landlord as its agent. ELITE Rental Properties Inc. does not represent any other person other than the Landlord.\n*DISCLAIMER*\nAny and all information provided is deemed accurate but not guaranteed. It is up to the individual to conduct their own due diligence to insure the information provided is accurate.\nTO SCHEDULE A SHOWING GO TO: www.ELITETENANT.com\nTO SEE MORE PROPERTIES GO TO: www.eliterps.com\/inventory\nRental Terms\nRent: $1,795\nApplication Fee: $100\nSecurity Deposit: $1,795\nAvailable Now\nPet Policy\nCats allowed\nSmall dogs allowed\nUtilities\nWater\nSewer\nTrash\nHOA Fees\nLandscaping\nSnow Removal (Walkway Only)\nAppliances\nRefrigerator\nWasher\nDryer\nStove\nDishwasher\nMicrowave\n","num_images":4.0,"lat":40.2075,"lng":-75.5329,"attrs":"['2BR \/ 2Ba', '1092ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T04:32:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bi-level-two-bed\/7593130487.html","post_id":7593130487,"title":"Spacious Bi-Level, two bed, two bath unit in Strickland Row Condos","description":"Spacious Bi-Level, two bed, two bath unit in Strickland Row Condos with entrance through 1010 Spruce Street. A generous sized Living\/Dining Area greets you with a wall of windows, overlooking the shared courtyard. The open concept space boasts hardwood floors leading through the living, dining area, and kitchen. Convenient den\/home office just off the entry. On the lower level you will find a large primary bedroom with en suite bathroom. The second bedroom features new wood laminate flooring, and plenty of closet space and an additional bathroom. Down the hall is the convenient laundry area, and a linen closet. There are several shared landscaped courtyards, and an in-ground heated swimming pool to enjoy between May & September! Permit Parking is available on street. There is a common roof-deck on the 8th floor of the back building, with fantastic views of the city. This unit is available fully furnished. No Pets allowed. Close to Restaurants, BYOB's, Shopping, Whole Foods, Acme, Antique Row, Walnut Street & Forrest Theatre, Public Transportation, & Hospitals. 99% Walk Score! FEE INCLUDES: Heat, Electric for common areas (inside & outside), AC, water\/sewer, trash\/recycling removal, snow removal, master insurance, elevators, and pool. Electric (plug-in items and fans) is in addition to condominium fee.","num_images":23.0,"lat":39.946142,"lng":-75.158036,"attrs":"['2BR \/ 2Ba', '1227ft2', 'air conditioning', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-02-24T23:43:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-perfect-for-single-couple\/7593124606.html","post_id":7593124606,"title":"PERFECT FOR A SINGLE COUPLE! 1 BED\/1 BATH APARTMENT!!","description":"PERFECT FOR A SINGLE COUPLE! 1 BED\/1 BATH APARTMENT!! TExT:  show contact info\nSMALL BUT SWEET! NICELY RENOVATED 660SF BUNGALOW IS AN OPPORTUNITY TO LIVE AT THE BEACH! PERFECT FOR A SINGLE, CATHEDRAL CEILING FRONT ROOM WITH SUNNY WINDOWS & SLIDER TO DECK. APPLIANCES INCLUDE APT-SIZE ELECTRIC STOVE, REFRIGERATOR & DISHWASHER. SMALL BR WITH STACK WASHER & DRYER IN CLOSET. REMOD SHOWER\/BATHROOM. WRAP DECK, OFF STREET PARKING\n","num_images":3.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'application fee details: credit\/background check application fee $1 details', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-24T23:00:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-1st-fl-passyunk\/7593122225.html","post_id":7593122225,"title":"Modern 1st Fl Passyunk Square 2 Bed 2 Bath Apt! W\/D! C\/A! Yard! D\/W!!!","description":"NEWER AND MODERN 1ST FL 2 BEDROOM, 2 BATH PASSYUNK SQUARE APARTMENT! All recently redone in the past few years! Modern hardwood floors throughout, modern kitchen with stainless steel appliances, 2 full bathes, granite counter tops, central air, and more! Two bedrooms both with in-suite bathrooms and closets. Closet space, lots of windows and nice light, W\/D in unit. YARD! This place has it all! Come see it today! Tenant pays gas, electric, cold water\/sewer and cable\/internet. Sorry, no pets. First, last, and security deposit required at lease signing. 1 year lease minimum. Applicant must first fill out an application with two recent pay stubs\/some income verification, copy of photo ID, and non-refundable $105. Prospective Tenants apply online at Forrester Property Mgmt. Tenant is subject to credit check, criminal and eviction check. For gross monthly income, we look for 3x the rent. Available April 1, 2023. If approved, you will be charged a document preparation fee of $100.00. THIS FEE IS NON-REFUNDABLE. Each resident over the age of 18 must submit a separate rental application. For showings, please call\/text Mike Giordano at  show contact info\n!","num_images":14.0,"lat":39.931686,"lng":-75.158374,"attrs":"['2BR \/ 2Ba', '900ft2', 'available apr 1', 'air conditioning', 'application fee details: $105 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $100.00', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-02-24T22:45:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bedroom-two-story\/7593315686.html","post_id":7593315686,"title":"Gorgeous 3-Bedroom Two-Story Apartment","description":"Gorgeous 3-Bedroom Two-Story Apartment with Roof Deck in Graduate Hospital! Available NOW! - This 3-Bedroom\/2-Bathroom apartment is located on the second and third floors of a two-unit building in the heart of Graduate Hospital! Located just off of 20th and Christian, you will enjoy being within walking distance to everything Graduate Hospital has to offer while also having access to other great neighborhoods like Fitler Square and Rittenhouse Square! Arrive at the building and immediately fall in love with the charming brick exterior. Entry leads you into a shared foyer where you have a private staircase leading up to your apartment. At the top of the stairs you are met with the first of two large bathrooms, complete with marbled shower stall and great vanity lighting. In the rear of this level is one of the three bedrooms. It has enough space to fit a king-sized bed and complete bedroom set with ease and there is also a large closet which is perfect for storage and organization! This floor also includes the newly remodeled kitchen. Black Stainless Steel appliances are the highlight of the kitchen featuring granite countertops, great cabinet space and open layout. In the middle there is a breakfast bar with room for stools to create an additional dining area. In the front you are overlooking the city with large windows that allow tons of natural light to pour in and make the entire space feel incredibly bright and open. A built-in gas fireplace accents the hardwood flooring and adds the perfect pop of character to the space. The second floor of the apartment features two additional bedrooms with carpet flooring and enough space for queen-sized beds to fit comfortably. The front bedroom has great views of the skyline while the second bedroom has access to the large rooftop deck. This floor also has a bathroom with full-sized bathtub and marbled walls as well as a full-sized washer and dryer! Tenants responsible for all utilities in addition to rent each month.  pets allowed. Conveniently located in Graduate Hospital by Fitler Square. Just a quick walk to the Schuylkill River Boardwalk, Rittenhouse Square, South Street, Broad Street and much more! Easy access to Broad St., I-76, I-95, and I-676 which make commuting throughout the city a breeze. Application Qualifications: Minimum monthly income is 3 times the tenant's portion of the monthly rent, acceptable rental history, acceptable credit history and acceptable criminal history. More specific information provided with the application. To set up a showing send your number .","num_images":1.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '2000ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T14:28:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom-bath-in\/7593321420.html","post_id":7593321420,"title":"Renovated 1-bedroom, 1-bath in the heart of Old City!","description":"Renovated 1-bedroom, 1-bath in the heart of Old City. In-unit washer\/dryer. Elevator access to the common roof deck. Central A\/C; Cooling Fuel: Electric; Heating: Forced Air; Heating Fuel: Natural Gas; Hot Water: Electric; Water Source: Public; Sewer: Public Sewer. No Fireplace; Dishwasher, Dryer - Electric, Oven\/Range - Electric, Refrigerator, Washer; Accessibility Features: None; Common Laundry.\nIf you are interested in this property. Please send me your Email & Contact number. I will contact you as soon as possible.","num_images":4.0,"lat":39.999431,"lng":-75.208809,"attrs":"['1BR \/ 1Ba', '750ft2', 'available feb 28', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T14:42:00-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-parking-on-site\/7593342079.html","post_id":7593342079,"title":"PARKING ON SITE!","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Bocce ball field9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyard48-hour Maintenance CommitmentMarble master baths, some with deep linen storageFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingAlexa or Google Home Capable in all ApartmentsUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densState-of-the-art fitness center overlooking the Manayunk canalUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsGame Room with Billiards Table, Shuffle Board, and moreBBQ and deck areaCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/hhfteexf\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2023-02-25T15:32:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bocce-ball-field-48-hour\/7593344371.html","post_id":7593344371,"title":"Bocce ball field, 48-hour Maintenance Commitment, Bark park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Front Desk attendant during mornings and evenings to greet you and assist you with anything and everythingUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsOn-site bike storageMarble master baths, some with deep linen storageUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densBocce ball fieldJogging trail right outside your door9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingPet-friendly livingOnline Payments AvailableState-of-the-art fitness center overlooking the Manayunk canalCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/p63m53ij\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2023-02-25T15:38:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-appliances\/7593315640.html","post_id":7593315640,"title":"Updated appliances, automated window shades throughout the condo","description":"This City View condo has it all. Updated appliances, automated window shades throughout the condo, 1 full bathrooms, large bed room. The location is perfect - Whole Foods, Target, Starbucks, Wawa, CVS, RiteAid, Art City Vet, Fine Wine & Good Spirits, The Barnes Museum, dry cleaners, and many restaurants all within a two minute walk out the front door! Designated garage private parking for City View residents & fully staffed 24 hour security. There is a large pool available to City View residents and their guests, and a beautiful outdoor space to hang out with family & friends. Great gym in the building. Parking and utilities included in rent, just pay for cable\/internet. If parking space is not needed, price is negotiable. send your mail and number for schedule visit..","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '800ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T14:28:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modest-studio-apartment\/7593339840.html","post_id":7593339840,"title":"Modest Studio Apartment Becoming Available in Mid-May!!","description":"Sunny, studio apartment becoming available in mid-May for $950! Apartment features kitchenette w\/ microwave, large windows and 9 ft. ceilings. Ask about our NO SECURITY DEPOSIT program!! Cats are welcome (add'l fee)! All apartments are rented unfurnished.\nChancellor Apartments is a convenient high rise apartment community in an amazing location in Center City. We are close to most major schools and universities, public transportation, historical attractions, shopping, restaurants and theaters. Center City at its best!!\nRent includes: heat, hot\/cold water, 24-hour front desk attendant, free bike storage room, package acceptance service, 24-hour emergency maintenance service, on-site smart card laundry plus card access system and BuildingLink resident services portal access for all residents.\nThe Chancellor boasts several different studio and one bedroom floor plans. Apartments feature high ceilings, large bright windows, ceiling fans in most units, hardwood floors and breathtaking views of the Philadelphia skyline and Delaware River. Many apartments have large walk-in closets, too!\nWe have partnered with Optimal Sport Health Club to offer a generous discounted gym membership (we pay your initiation fee!). There are several off street parking lots and garages in the area, too!\nCHANCELLOR APARTMENTS\n206 S. 13th Street\nPhiladelphia, PA 19107\nshow contact info\nFranceina Thorne, REALTOR\nHours:\nMon. - Fri. 8:30 to 5:00\nSaturday - 10:00 to 3:00\nAppointments are highly recommended\nProfessionally Managed by: Chancellor Properties, Inc.\nwww.cpihome.com\n\"CONSUMER NOTICE\"\nChancellor Properties, Inc. hereby states that with respect to this property, they are acting in the following capacity: an agent of the owner\/landlord pursuant to a property management or exclusive leasing agreement.\nEQUAL HOUSING OPPORTUNITY\n","num_images":10.0,"lat":39.948681,"lng":-75.162197,"attrs":"['0BR \/ 1Ba', 'available may 13', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T15:26:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-views\/7593341518.html","post_id":7593341518,"title":"GREAT VIEWS!","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:State-of-the-art fitness center overlooking the Manayunk canalUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with dens48-hour Maintenance CommitmentAlexa or Google Home Capable in all ApartmentsJogging trail right outside your doorOn-site bike storageGame Room with Billiards Table, Shuffle Board, and moreMarble master baths, some with deep linen storageUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingPet-friendly livingCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/3bunjakr\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1180ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2023-02-25T15:30:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-love-this-building-love\/7593300816.html","post_id":7593300816,"title":"Love this building! Love this location! Amazing Stuff in Cool Area","description":"1335 Shelmire Ave\nPhiladelphia, PA 19111 | Fox Chase-Burholme\nEstimated payment $1,100\/month 935 Sq. Ft\nAbsolutely beautiful two bedroom twin on a quiet and desirable block . The front lawn leads into a light filled living room with dazzling, original hardwood flooring, an amazing kitchen with granite counters, dishwasher, built-in microwave and gas range. Continue into a totally upgraded bathroom with custom tile work, a very large main bedroom with tons of closet space and a second bedroom also with beautiful hardwood floors . The finished basement level is perfect for a third bedroom, office space, play room, man cave or mom’s hideout. There’s also a separate storage area with a laundry area and exit to a nice fenced back yard. Conveniently located near public transportation, shopping and schools.\nIf you are interested in this property. Please send me your Email & Contact number. I will contact you as soon as possible.","num_images":3.0,"lat":40.060869,"lng":-75.074965,"attrs":"['2BR \/ 2Ba', '935ft2', 'available feb 28', 'cats are OK - purrr', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T13:54:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-home-office-or-den\/7593315722.html","post_id":7593315722,"title":"1 Bedroom w\/ Home Office or Den","description":"Spacious 1 Bedroom w\/ Home Office or Den in The Heart of Bella Vista!!!!! - Wonderful 1 Bedroom plus Bonus Room which Can Be Used For A Small Bedroom, Home Office or Anything Else That You Can Create. There Is A Large Kitchen and Bedroom. There Is Also A Washer\/ Dryer In The Apartment. Walk Out Of Your Door and You Will Find An Amazing Neighbor - The Great Italian Market is Steps From The Apartment. The People Who Live In The Neighborhood Are Very Friendly. There Are Numerous Restaurants and Great Shopping","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T14:28:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-beautiful-bed-bath\/7593315197.html","post_id":7593315197,"title":"Amazing & Beautiful** 2 bed, 2 bath","description":"Trash, Cable TV, Internet Included Welcome home! Desert Palms 2 bedroom 2 bath apartments feature an attached garage with laundry hookups, and a private, fenced back patio that’s perfect for gatherings and BBQs.  Adishwasher, ample cabinet storage, and plenty of counter space. Water, trash, cable TV, and the internet are all free! Desert Palms is a short walk or drive from local restaurants, shops, and so much more. We welcome pets! new stylish luxury vinyl floors throughout, new sinks, faucets, and granite slab countertops in the kitchen and baths with new window blinds and light fixtures. If you interested please contact\nLocation= 1300 Fairmount Ave, Philadelphia, PA 19123\nReply with contact number is highly recommended","num_images":6.0,"lat":39.966528,"lng":-75.158284,"attrs":"['2BR \/ 2Ba', '1050ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T14:27:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7593322216.html","post_id":7593322216,"title":"Schedule a Tour, Granite Countertops, Playground","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Elevator\n* Credit Cards Accepted\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Community Lounge\n* Billiards\n* Bark Park\n* EV Charging\n* TV Lounge\n* Renters Insurance is Required\n* Controlled Access\n* Pet Salon\n* Outdoor Grill Area\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Long Term Lease Available\n* Short or Long Term Lease Available\n* Community Kitchen\n* Movie Theatre\n* Bike Racks\n* Dry Cleaning and Laundry Service\n* Garage Parking\n* Professionally Managed\n* Swimming Pool\n* Extra Storage\n* Fitness Studio\n* Non Smoking Community\n* After-Hours Emergency Maintenance\n* Landscaped Courtyards\n* Sun Deck\n* Easy Freeway Access\n* WiFi Access\n* Gaming Area\n* Minutes from Restaurants, Shopping, and Much More\n* Package Acceptance\n* Playground","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1075ft2', 'available mar 3', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T14:43:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7593313274.html","post_id":7593313274,"title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Swimming Pool\n* TV Lounge\n* Sun Deck\n* Bark Park\n* Outdoor Grill Area\n* Billiards\n* Community Lounge\n* Fitness Studio\n* Professionally Managed\n* Spa\n* Minutes from Restaurants, Shopping, and Much More\n* Yoga Lounge\n* Easy Freeway Access\n* Pet Salon","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-02-25T14:22:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-fitness-center-professionally\/7593309282.html","post_id":7593309282,"title":"Fitness Center, Professionally Managed, Lease Today","description":"The Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nWhen you call The Point at Exton home you will enjoy an amazing line up of amenities including a resort style pool, fashionable outdoor space, and a controlled access parking garage. Call now for a tour!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, walk-in closet, and a washer\/dryer!\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nApartment Features\n* Washer and Dryer in unit\n* Granite Countertops\n* Garden Tub\n* Stainless Steel Appliances\n* Quartz Countertops\n* Kitchen Island\n* Wood-Like Floors\n[#9601775]","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '668ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T14:13:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/move-in-now-private-storage-areas-pet\/7593306106.html","post_id":7593306106,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-beautiful-bedroom\/7593290481.html","post_id":7593290481,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-special-studio-1-apartment\/7593285193.html","post_id":7593285193,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/new-hope-village-ll-new-hope\/7593296171.html","post_id":7593296171,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-studio-apt-home\/7593276757.html","post_id":7593276757,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-two-bedroom-in\/7593280436.html","post_id":7593280436,"title":"Large Two Bedroom In Philadelphia, PA","description":"One of the first factory\/warehouse-to-residential apartment complexes in the Old City historic district, the Sugar Refinery plays “industrial chic” to the hilt. With roots going back to 1792, The Sugar Refinery offers 18th Century charm with 21st Century conveniences. 66 apartments feature vintage hardwood floors, exposed brick walls and cathedral ceilings, making this building a true gem in Old City.\nReply with contact number is highly recommended","num_images":5.0,"lat":39.962115,"lng":-75.161556,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T13:06:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-bed-2bath-available-soon\/7593294188.html","post_id":7593294188,"title":"2 bed\/2bath Available Soon!","description":"Apt. 5231 — Darby floor plan — 1,378 sq. ft. — $3,425\nThis luxurious 3rd floor, 2 bedroom\/2 bathroom with a den, apartment is the perfect size! This new construction apartment home boasts recessed lighting throughout, quartz countertops, central heat and air, a large laundry room with a full-size washer and dryer, stainless steel appliances, luxury plank flooring in the living areas, and plush carpeting in the bedrooms. This beautiful apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":22.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1378ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-02-25T13:38:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-deck2-bedroom\/7593289336.html","post_id":7593289336,"title":"Spacious deck!2 bedroom apartment available now at 46th and Market!","description":"Beautiful 2 bedroom 1 bathroom unit in West Philadelphia!\nRenovated 2 bedroom apartment available Now in University city. Washer and dryer in the building. Tenants responsible for electric and gas. 3 months to move in. 1 year lease.Hardwood floor. Pets friendly. Free parking. Near transportation. Extra storage space. Great opportunity!\nRental Terms\nRent: $1,450\nApplication Fee: $55\nSecurity Deposit: $1,450\nAvailable now\nPet Policy\nCats allowed\nSmall dogs allowed\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":15.0,"lat":39.958416,"lng":-75.213039,"attrs":"['2BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T13:27:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bathroom\/7593284438.html","post_id":7593284438,"title":"Beautiful 2 Bedroom 2 Bathroom Apt Home with Washer\/Dryer, Gym","description":"Apartment Home Features:\n* Combination washer and dryer\n* Unfurnished 2 bedroom 2 bathroom apartment home at 1902 on 19th floor\n* Large east-facing windows with Walnut Street view\n* Wood floors throughout living and dining room area\n* Abundant closet space\n* Beautiful kitchen open to living and dining room area\n* Granite kitchen counters\n* Dishwasher\n* Disposal\n* Microwave\n* Gas stove\n* 2 big beautiful bathrooms\n* All utilities included (except cable and internet)\nCommunity Features:\n* Top-of-the-line fitness center with park view\n* High-rise building on Rittenhouse Square\n* Mid-century modern building\n* Guest suites for the friends and family of current residents\n* Bicycle storage in the attached parking garage\n* Package lockers by Luxer One in 2nd floor package room\n* 8,000-square-foot lounge with pool table, conference room, kitchen, and more!\n* Fitness\/yoga studio\n* Sauna\n* Dog spa\n* Attached valet parking garage! Parking is not managed by the community, so the cost is separate.\n* 24-hour front door attendant\n* 24-hour front desk concierge\n* Laundry room on every floor\n* Large laundry room on the 3rd floor\n* Roof deck under renovation to open spring 2023! Check out our website and Facebook page for renderings!\nNearby Restaurants:\n* Pietro's\n* Rouge\n* Parc\nNearby Cafes:\n* La Colombe\n* K'Far Cafe\n* Ultimo\nNearby Grocery Stores and Food Markets:\n* Sue's Produce Market (1\/2 block away)\n* Venditore by Giordano (1\/2 block away)\n* Di Bruno Bros. (1 block away)\n* Rittenhouse Market (2 blocks away)\n* Target (2 blocks away)\n* Maxx's Produce (3 1\/2 blocks away)\n* Food & Friends (4 blocks away)\n* Spruce Food Market (4 blocks away)\n* Trader Joe's (5 1\/2 blocks away)\n* Giant (8 blocks away)\n* Reading Terminal Market (9 blocks away)\nNearby Stores:\n* Anthropologie\n* Brooklinen\n* Urban Outfitters\n* Lovesac\n* Athleta\n* lululemon\n* Indochino\n* Glossier\n* Vans\nSpecial! Apply today, reserve a Van Gogh two bedroom one bathroom apartment home or a Da Vinci two bedroom two bathroom apartment home, elect a 10 to 22 month lease term, sign your lease on or before February 28, 2023, and move in on or before March 31, 2023 to take $1,500.00 off your first month's rent. Limited time offer. Certain restrictions apply.\nTo see if this home is still available, go to our website at rittenhouseclaridge.com to see if 1902 is still listed under the Da Vinci floor plan. Please make an appointment to tour with Gabby or Michelle using ResMate, our chatbot concierge, on our website.\nWe can furnish a home for you over two weeks following rental application approval and after the home is made ready. Please note that there is a three-month lease term minimum for a furnished home. You would pay a furnished rent instead of an unfurnished rent. We can calculate this furnished rent for you based upon your choices. Additional pieces of furniture, furniture upgrades, housewares, and cable and internet are optional.\nPrice posted is for the 22 month lease term. Price depends upon lease term.\nFor an unfurnished home, we offer lease terms from 2 to 22 months. Check the price for every lease term based upon a move-in date on our website at rittenhouseclaridge.com!\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24.0,"lat":39.949737,"lng":-75.17056,"attrs":"['2BR \/ 2Ba', '1180ft2', 'available mar 31', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T13:15:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bristol-behold-this-3br-beaut\/7593262855.html","post_id":7593262855,"title":"Behold this 3BR Beaut","description":"This Bright and sunny home can be yours, where everything is simply cozy. living room has an open wall staircase, eat in updated kitchen with oak cabinets and microwave oven, updated windows, finished attic can be a 4th bedroom or loft space. Large rear yard","num_images":11.0,"lat":40.1159,"lng":-74.8536,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-02-25T12:29:13-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-available\/7593287586.html","post_id":7593287586,"title":"Large 2 bedroom available now at 5100 Walnut street!","description":"Spacious 2 bedroom apartment available now at 5100 Walnut street. Large living room comes with a balcony. 3 months to move in. $50 application fee. Pet friendly. Laundry room is in the building. Tenant pays all utilities.\nCall or text at  show contact info\nto schedule your showing today.\n","num_images":19.0,"lat":39.956707,"lng":-75.223538,"attrs":"['2BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T13:23:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-studio-available\/7593286036.html","post_id":7593286036,"title":"Updated studio available now at 35th and Spring garden!","description":"Affordable studio available now at 501 N 35th street. Hardwood floor. Window heat and AC. Pet friendly. $250 one time pet fee plus $25 pet rent. 1 year lease. $60 application fee. Security deposit, first and last month to move in. Must to have a good credit. Laundry room is in the building.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":6.0,"lat":39.962769,"lng":-75.192846,"attrs":"['0BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T13:19:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-bedroom-plus-den\/7593284578.html","post_id":7593284578,"title":"Great 1 bedroom plus den available now at 4722 Chestnut street!","description":"Great 2nd floor apartment with dark hardwood floors, great open layout kitchen with stainless steel appliances, nice tiled bathroom.\nWasher and dryer is in the basement. Central heat\/ Central Air. Tenant will be responsible for electric and gas.\nPet Policy: Cats allowed, Small dogs allowed\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":14.0,"lat":39.957305,"lng":-75.215764,"attrs":"['1BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T13:16:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-pet-friendly-poolw\/7593284559.html","post_id":7593284559,"title":"Pet Friendly, Pool,W\/D, Gym,Elevator BLDG, SS Appliances, Free Parking","description":"Apartment 818 is 1 Bedroom with a stainless steel appliances, breakfast bar and washer\/dryer in unit. Plush carpeting throughout and gets great daylight too! Make this your new apartment home today!\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nElevator Building\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Gian, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-5pm | S, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!\n","num_images":12.0,"lat":39.966575,"lng":-75.604026,"attrs":"['1BR \/ 1Ba', '731ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T13:16:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-your-cozy\/7593262552.html","post_id":7593262552,"title":"!!!Welcome to Your Cozy, Updated 1bed\/1bath Apartment For Rent!!!","description":"Great 1 bedroom in the heart of Manayunk. It is extremely close to public transportation and all that Manayunk has to offer. The unit also included a very nice balcony as an outdoor space and features Hardwood floors , wall to wall carpet, central heating and AC, gas range, white appliances, and garbage disposal. THERE ARE LOTS OF WINDOWS TO PROVIDE NATURAL LIGHT TROUGH OUT THE UNIT. THE UNIT ALSO FEATURES IN WALL CLOSETS. ONE CAR PARKING SPOT IS INCLUDED WITH THE APARTMENT. LAUNDRY IS ON SITE FOR CONVENIENCE AND SHARED OUTDOOR SPACE FOR ALL TENANTS. Lovely and quiet street and neighborhood. First, Last, and Security required to move in along with a $30 Application fee","num_images":4.0,"lat":40.0275,"lng":-75.2242,"attrs":"['1BR \/ 1Ba', '\\nmonday 2023-02-27\\n', '\\nfriday 2023-03-03\\n', '\\nmonday 2023-03-06\\n', 'EV charging', 'air conditioning', 'application fee details: $30 non-refundable credit\/background check', 'broker fee details: NO BROKER FFE!!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'listed by: Higgins & Welch Real Estate, Inc', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-02-25T12:28:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-port-richmond-bedroom-baths\/7593273767.html","post_id":7593273767,"title":"Port Richmond 2 Bedroom 1 1\/2 Baths","description":"Recently renovated with rear yard and basement\nAll hardwood floors\nNew washer\/dryer. LG.\nGas hot air heater","num_images":14.0,"lat":39.98702,"lng":-75.112356,"attrs":"['2BR \/ 1.5Ba', '850ft2', 'available mar 1', 'application fee details: 75.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-02-25T12:52:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bristol-behold-this-3br-beaut\/7593262682.html","post_id":7593262682,"title":"Behold this 3BR Beaut","description":"2808 Dixon Ave, Bristol, PA 19007 is a single family home that contains 1,288 sq ft and was built in 1929. It contains 2 bathrooms.","num_images":17.0,"lat":40.1159,"lng":-74.8536,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-02-25T12:28:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/leasing-now-green-roof-quartz\/7593267081.html","post_id":7593267081,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7593265117.html","post_id":7593265117,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-1018-sq-ft-bed-bath-our\/7593262088.html","post_id":7593262088,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/new-hope-village-ll-new-hope\/7593261220.html","post_id":7593261220,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-bedroom-bathroom-for-rent\/7593260613.html","post_id":7593260613,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7593253653.html","post_id":7593253653,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3br-rowhome-with-garage\/7593250039.html","post_id":7593250039,"title":"3BR Rowhome with garage and balcony","description":"Spacious three bedroom row home in East Mt. Airy available for rent. House has separate dining room, finished basement space, laundry, garage, off street parking and a balcony off the kitchen. House is on 300 block of Montana Street and is a quiet street with a center divide. Lots of kids around and house has been freshly painted, floors refinished and it's looking shiny and new.","num_images":4.0,"lat":40.055418,"lng":-75.178697,"attrs":"['3BR \/ 1Ba', '1300ft2', 'available mar 1', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T12:02:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-spacious-layout-with\/7593240233.html","post_id":7593240233,"title":"Spacious layout with private washer & dryer! 1178 SqFt 2 Bed, 2 Bath","description":"Millview ApartmentsLocated at: 100 Cobblestone Dr Coatesville, PA 19320Featured unit: 2 bed | 2 bath | 1178 sq ft Prices start at: $1600 - $2195\/month Call Today!  show contact info\nNestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!Wonderful Amenities!◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral BonusesApartment Features!◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In Closets  show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":10.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T11:40:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-near-parking-corner-1st-floor\/7593234125.html","post_id":7593234125,"title":"Near Parking, Corner\/1st Floor, PETS, Storage, 24\/7 Fitness Center","description":"🏠LOVE Your New HOME- Apply Now- Reduced Rent Special🏠\nApt #D-15 Corner, first floor apartment near parking. Newly renovated and close to the train!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 8:30 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":24.0,"lat":40.0,"lng":-75.276,"attrs":"['1BR \/ 1Ba', '663ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T11:25:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-furnished-units-available\/7593232432.html","post_id":7593232432,"title":"Furnished Units Available","description":"Apt. 1507 — Edgeware floor plan — 919 sq. ft. — $4,494\nLocated on the 5th floor, this fully-furnished 1-bedroom corporate has a great view from a private balcony! This apartment boats LVT flooring, central heat & air, a front-load washer & dryer, and upgraded stainless steel appliances. This apartment also comes equipped with a spacious living area and bathroom. This gorgeous apartment is within close proximity to our clubhouse—featuring a 24-hour fitness center, theatre, resort-style swimming pool, and so much more! Available for short-term lease at a 3-month minimum with utilities included!\nContact our leasing office to schedule a tour!  show contact info","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '919ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-02-25T11:21:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studio-apartment-home-on\/7593221486.html","post_id":7593221486,"title":"Studio Apartment Home on Rittenhouse Square, Package Room, Lounge","description":"Apartment Home Features:\n* Unfurnished studio apartment home on 8th floor\n* All utilities, except cable and internet, are included\n* Large south-facing windows with Chancellor Street view\n* Renovated kitchen\n* Granite kitchen counters\n* White kitchen cabinets\n* Gas stove\n* Microwave\n* Dishwasher\n* Disposal\n* Renovated bathroom\n* Neutral carpet\nCommunity Amenities:\n* Historic building on the park at Rittenhouse Square\n* Package lockers by Luxer One in 2nd floor package room\n* 8,000-square-foot lounge with cozy seating areas, vintage pool table, private conference room, and demonstration kitchen\n* Fitness center\n* Guest suites\n* Bicycle storage\n* Attendant at front door\n* Concierge at front desk\n* Sauna\n* Yoga studio\n* Dog spa\n* Laundry room on every floor\n* 3rd floor laundry room! No quarters!\n* Elevator building\n* Online resident portal RentCafe for maintenance requests, rent payments, lease renewals, and more!\n* On-site maintenance 24\/7\n* Attached valet parking garage! Parking spaces not managed by community, so the cost is separate.\n* Roof deck under renovation\nNearby Grocery Stores:\n* Sue's Produce Market\n* Venditore by Giordano\n* Di Bruno Bros.\n* Target\n* Rittenhouse Market\n* Trader Joe's\n* Giant\n* Reading Terminal Market\nNearby Retail Stores:\n* Lovesac\n* Athleta\n* lululemon\n* Indochino\n* Glossier\n* Vans\n* Madewell\n* Tiffany & Co.\n* Philadelphia Runner\n* allbirds\n* Vince\nWondering if this home is still available for rent? Visit our website at rittenhouseclaridge.com to check if 812 is still listed under the Dali floor plan! Please make an appointment to tour with Michelle or Gabby using ResMate at rittenhouseclaridge.com.\nRittenhouse Claridge\nPrice is for the 22 month lease term. For an unfurnished home, 2 to 22 month lease terms are available!\nPrice depends upon lease term as well as move-in date.\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24.0,"lat":39.94977,"lng":-75.170581,"attrs":"['0BR \/ 1Ba', '400ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T10:54:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bathroom\/7593217656.html","post_id":7593217656,"title":"Beautiful 2 Bedroom 2 Bathroom Apartment Home with Washer and Dryer","description":"Apartment Home Features:\n* Unfurnished 2 bedroom 2 bathroom apartment home on 24th floor\n* Combination washer and dryer\n* Large east-facing windows with Walnut Street view\n* Wood floors throughout living and dining room area\n* Abundant closet space\n* Beautiful kitchen open to living and dining room area\n* Granite kitchen counters\n* Dishwasher\n* Disposal\n* Gas stove\n* Microwave drawer\n* 2 big beautiful bathrooms with Italian tile\n* All utilities included (except cable and internet)\nCommunity Features:\n* Package lockers by Luxer One\n* 8,000-square-foot lounge with seating areas, pool table, TV room, printer\/copier, conference room, and kitchen\n* Top-of-the-line fitness center\n* High-rise building on Rittenhouse Square\n* Mid-century modern lobby and lounge\n* Guest suites\n* Fitness\/yoga studio\n* Dog spa\n* Bicycle storage\n* Attached valet parking garage! Parking is not managed by the community, so the cost is separate.\n* 24-hour front door attendant\n* 24-hour front desk concierge\n* Sauna\n* Laundry room on every floor and large laundry room on the 3rd floor\n* Roof deck under renovation\nNearby Coffee Shops:\n* La Colombe\n* K'Far Cafe\n* Vibrant\n* Ultimo\n* Alchemy\n* Bluestone Lane Walnut Street Café\n* Bluestone Lane Rittenhouse Café\n* Elixr\n* Bottega Rittenhouse\n* J'aime French Café\nNearby Grocery Stores:\n* Sue's Produce Market\n* Venditore by Giordano\n* Di Bruno Bros.\n* Rittenhouse Market\n* Target\n* Maxx's Produce\n* Food & Friends\n* Trader Joe's\n* Giant\nNearby Restaurants:\n* Rouge\n* Devon\n* Parc\n* The Love.\n* The Dandelion\n* Gran Caffe L'Aquila\n* Kura Sushi\n* Harper's Garden\n* Farina Pasta & Noodle\n* Marathon on the Square\n* Friday Saturday Sunday\nNearby Retail Stores:\n* Lovesac\n* Athleta\n* lululemon\n* Indochino\n* Glossier\n* Anthropologie\n* Tumi\n* Madewell\n* Outdoor Voices\n* J.Crew\n* Tiffany & Co.\nClose to Ice Cream and Gelato Shops:\n* Van Leeuwen\n* Jeni's\n* Gran Caffe L'Aquila\nTo see if this home is still available, go to our website at rittenhouseclaridge.com to see if 2402 is still listed under the Da Vinci floor plan. Please make an appointment to tour with Gabby or Michelle using ResMate, our chatbot concierge, on our website.\nVisit the Rittenhouse Claridge's website at rittenhouseclaridge.com for the most up-to-date availability!\nWe can furnish a home for you over two weeks following rental application approval and after the home is made ready. Please note that there is a three-month lease term minimum for a furnished home. You would pay a furnished rent instead of an unfurnished rent. We can calculate this furnished rent for you based upon your choices of home furnishings.\nPrice posted is for the 22 month lease term.\nFor an unfurnished home, we offer lease terms from 2 to 22 months.\nPrice depends upon lease term as well as move-in date. Check out our website for current pricing!\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24.0,"lat":39.949786,"lng":-75.170581,"attrs":"['2BR \/ 2Ba', '1180ft2', 'available apr 18', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T10:44:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-two-bedroom-in-the\/7593221654.html","post_id":7593221654,"title":"Large Two Bedroom In The Heart Of Historic Old City!","description":"One of the first factory\/warehouse-to-residential apartment complexes in the Old City historic district, the Sugar Refinery plays “industrial chic” to the hilt. With roots going back to 1792, The Sugar Refinery offers 18th Century charm with 21st Century conveniences. 66 apartments feature vintage hardwood floors, exposed brick walls and cathedral ceilings, making this building a true gem in Old City.\nSee more listings at brandywinecm.com!\n","num_images":6.0,"lat":39.950633,"lng":-75.144592,"attrs":"['2BR \/ 1Ba', '910ft2', 'available mar 11', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-02-25T10:55:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bathroom\/7593219658.html","post_id":7593219658,"title":"Beautiful 2 Bedroom 2 Bathroom Apartment Home, Washer and Dryer, Gym","description":"Apartment Home Features:\n* Unfurnished 2 bedroom 2 bathroom apartment home at 1202 on 12th floor\n* Combination washer and dryer\n* Large east-facing windows with Walnut Street view\n* Wood floors throughout living and dining room area\n* Abundant closet space\n* Newly renovated kitchen open to living and dining room area\n* Granite kitchen counters\n* Microwave drawer\n* Gas stove\n* Dishwasher\n* Disposal\n* 2 big beautiful bathrooms with Italian tile\n* All utilities included (except cable and internet)\nCommunity Features:\n* Top-of-the-line fitness center with park view\n* High-rise building on Rittenhouse Square\n* Guest suites for the friends and family of current residents\n* Bike storage in the attached parking garage\n* Package lockers by Luxer One in the 2nd floor package room\n* 8,000-square-foot lounge with seating areas, pool table, TV room, printer, conference room, kitchen, and places to work or study\n* Fitness\/yoga studio\n* Sauna\n* Dog spa\n* Attached valet parking garage! Parking is not managed by the community, so the cost is separate.\n* 24-hour front door attendant\n* 24-hour front desk concierge\n* Laundry room on every floor\n* Large laundry room on the 3rd floor\n* Roof deck under renovation\nNearby Restaurants:\n* Rouge\n* Devon\n* Parc\n* Barclay Prime\n* Via Locusta\n* Square on Square\n* Pietro's Coal Oven Pizzeria\n* a.kitchen\n* Farina Pasta & Noodle\n* Kura Sushi\nNearby Coffee Shops:\n* Bluestone Lane Walnut Street Café\n* La Colombe\n* K'Far Cafe\n* Konditori\n* Alchemy\n* Vibrant\n* Ultimo\n* Nook Bakery & Coffee Bar\n* Vernick Coffee Bar\nNearby Grocery Stores:\n* Venditore by Giordano (1\/2 block away)\n* Sue's Produce Market (1\/2 block away)\n* Di Bruno Bros. (1 block away)\n* Rittenhouse Market (2 blocks away)\n* Target (2 blocks away)\n* Maxx's Produce (3 1\/2 blocks away)\n* Trader Joe's (5 1\/2 blocks away)\n* Giant (8 blocks away)\nNearby Bakeries:\n* Metropolitan Bakery\n* The Bakeshop on 20th\nNearby Retail Stores:\n* Lovesac\n* Athleta\n* lululemon\n* Indochino\n* Tselaine\n* Anthropologie\n* Lagos\n* Outdoor Voices\n* Tiffany & Co.\n* Brooklinen\n* Kitchen Kapers\n* Salty Paws Rittenhouse Square\nSpecial! Apply today, reserve a Van Gogh two bedroom one bathroom apartment home or a Da Vinci two bedroom two bathroom apartment home, elect a 10 to 22 month lease term, sign your lease on or before February 28, 2023, and move in on or before March 31, 2023 to take $1,500.00 off your first month's rent. Limited time offer. Certain restrictions apply.\nTo see if this home is still available, go to our website at rittenhouseclaridge.com to see if 1202 is still listed under the Da Vinci floor plan. Please make an appointment to tour with Gabby or Michelle using ResMate, our chatbot concierge, on our website.\nVisit our website at rittenhouseclaridge.com for the most up-to-date availability and pricing!\nWe can furnish a home for you over two weeks following rental application approval and after the home is made ready. Please note that there is a three-month lease term minimum for a furnished home. You would pay a furnished rent instead of an unfurnished rent. We can calculate this furnished rent for you based upon your choices of home furnishings.\nPrice posted is for the 22 month lease term. Price depends upon lease term and move-in date. For an unfurnished home, we offer lease terms from 2 to 22 months. Check out the price for every lease term based upon your move-in date on our website.\nRental rates, availability, and apartment home features are subject to change without notice.\nRittenhouse Claridge\nWelcome home!","num_images":24.0,"lat":39.94977,"lng":-75.170581,"attrs":"['2BR \/ 2Ba', '1180ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-02-25T10:49:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-free-parking-d-gym-pet\/7593218431.html","post_id":7593218431,"title":"Free Parking, W\/D, Gym, Pet Friendly, Pool, Elevator BLDG, Balcony","description":"Apartment 927 is a 2 Bedroom with a stainless steel appliances, quartz countertops, washer\/dryer and a balcony! Make this your new apartment home today!\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes! Staying at home during all of this? No worries! Just ask your leasing agent about a personalized virtual tour instead to view all the great things we have to offer!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nElevator Building\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Gian, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-5pm | S, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!\n","num_images":11.0,"lat":39.966575,"lng":-75.604026,"attrs":"['2BR \/ 2Ba', '935ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-02-25T10:46:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-prime-location-in\/7593188117.html","post_id":7593188117,"title":"**PRIME LOCATION IN PHILADELPHIA PA **NEWLY 2BED 2BATH APART","description":"Ray is a place for art, the people who make it and the people who love it. Our apartments are really special (think huge windows, blonde oak floors, laundry in every unit) and so are the building's full-time artist studios and ground floor communal spaces. Whether you live here or just plan on hanging out, Ray makes sure art and culture are never far.","num_images":6.0,"lat":39.974084,"lng":-75.139895,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-02-25T09:18:29-0500"}]