[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562106978.html","post_id":7562106978,"result_date":"Mon Nov 28 2022 02:28:43 GMT+0000 ","title":"Lawncrest 2 BR Apt","description":"Improved 2nd floor 2 bedroom updated kitchen with GD.CFs each room window AC\/basement laundry area with washer & dryer\/Bathfiter bathroom olffstreet parking with attached garage. large fenced yard ideal for parbecuing and enjoyment","num_images":6,"lat":40.0343,"lng":-75.1213,"attrs":"['2BR \/ 1Ba', 'available jan 1, 2023', 'air conditioning', 'application fee details: 40.00', 'apartment', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T21:24:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562100150.html","post_id":7562100150,"result_date":"Mon Nov 28 2022 02:20:55 GMT+0000 ","title":"WILLOW GROVE 3 BEDROOM 1.5 BATH HOUSE","description":"Willow Grove 3 bedroom 1.5 bath Ranch with new Eat in Kitchen with gas cooking, microwave, dishwasher, food disposer, refrigerator. Living Room with picture window, three bedrooms, ceramic tile bath with shower over tub and vanity. Builder finished basement with Powder room and laundry area, garage entrance with door opener. There is a covered patio off from the kitchen. Nice yard, Upper Moreland School District. $1950 plus utilities, sorry no pets, ,no smoking Property has gas heat with central air conditioning, replacement windows, wall to wall carpeting.\nIf you interested, please text :  show contact info","num_images":1,"lat":40.1567,"lng":-75.1269,"attrs":"['3BR \/ 1.5Ba', 'house', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T20:54:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562104227.html","post_id":7562104227,"result_date":"Mon Nov 28 2022 02:16:07 GMT+0000 ","title":"2 bedroom 1.5 Bath Temple Apartment Bi-level $1800","description":"2 bedroom \/ 1.5 Baths  Bi-level Apartment is available for Temple students and faculty. $1800 a month\nNewly renovated floors, bathroom, kitchen cabinets and freshly painted. Ready for move-in.\n* Available for up to 3 tenants *\nLocated at 15th and Oxford street\n2nd floor front - 2 Bedroom , 1 bathroom apartment with a shared back yard, and in building a coin operated washer and dryer. Pet friendly, walking distance to Temple University only one block away and close to the city and public transportation.\nMr Jay’s Place Apartments are Awesome responsive private landlords!!\nTenants are responsible for all utilities (Electric, Gas, and cable Internet) “except” water\/sewer. Applicants must have acceptable credit, verifiable income and\/or co-signers (if needed), and decent rental history (if any). There is a $50 non-refundable application fee and it does not guarantee rental of unit.\nFirst, Last month & Security deposit due prior to move in ($5400 total). All Pets are at Landlord\/owner’s discretion and will require an additional $300 each security deposit.\nRenter’s Insurance is a must to cover your personal belongings and your own liability.\nPlease message me if you’re interested in This Temple town apartment @mrjaysplace","num_images":17,"lat":39.977581,"lng":-75.15996,"attrs":"['2BR \/ 1.5Ba', '1500ft2', 'available dec 1', 'air conditioning', 'application fee details: $50 per Person', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T21:12:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562101695.html","post_id":7562101695,"result_date":"Mon Nov 28 2022 02:05:29 GMT+0000 ","title":"2 bedroom Temple apartment $1500 with Yard","description":"2 bedroom Apartment is available for Temple students And faculty. Rent $1500 per month\nNewly renovated floors, bathroom, kitchen cabinets and freshly painted. Ready for move-in.\n* Available for up to two tenants *\nLocated at 15th and Oxford street\n1st floor Back  - 2 Bedroom , 1 bathroom apartment with direct access to shared back yard, and in building a coin operated washer and dryer. Pet friendly, walking distance to Temple University only one block away and close to the city and public transportation.\nMr Jay’s Place Apartments are Awesome responsive private landlords!!\nTenants are responsible for all utilities (Electric, Gas, and cable Internet) “except” water\/sewer. Applicants must have acceptable credit, verifiable income and\/or co-signers (if needed), and decent rental history (if any). There is a $50 non-refundable application fee and it does not guarantee rental of unit.\nFirst, 2 Security deposits due prior to move in ($4500 total). Pets are at owner’s discretion and will require an additional $300 security deposit.\nRenter’s Insurance is a must to cover your personal belongings and your own liability.\nPlease message me if you’re interested in This Temple town apartment @mrjaysplace","num_images":20,"lat":39.977597,"lng":-75.159992,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available dec 1', 'air conditioning', 'application fee details: $50 per person', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T21:01:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562095037.html","post_id":7562095037,"result_date":"Mon Nov 28 2022 01:49:31 GMT+0000 ","title":"2 bedroom, 2 bathrooms apartment at high rise! AC & Heat Included","description":"Luxury high-rise with the following amenities.\n-FREE shuttle bus service will take you to the grocery, mall or doctors appointments\n-Movie theater room available to use with your family\n-Gym on site\n-Swimming pool\n-BBQ outdoor area open year round\n-Security and door attendant\n-Gated community\n-WiFi in the lobby, library and social rooms\n- Free parking. Lots of spaces open. No extra charge for parking or guest parking.\n-Children's school bus comes into the community for pick up and drop off.\n-Walking distance to restaurants and stores.","num_images":6,"lat":40.1567,"lng":-75.1269,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available jan 12, 2023', '\\nsaturday 2022-12-03\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-27T20:32:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562091437.html","post_id":7562091437,"result_date":"Mon Nov 28 2022 01:21:19 GMT+0000 ","title":"Borough of West Chester Apt","description":"Small one bedroom apt perfect for one person!! Kitchen and living room combo , bathroom and bedroom with large closet. This is a quiet building.  Only 4 apts and 4 people. Enjoy living in a Victorian building on beautiful S. Church St.  Only 3 blocks to WCU and 3 blocks to uptown. You may enjoy the use of the front porch. The photos belong to a former tenant. Tenant pays water and sewer, elec, cable and heat supplement ($50 Oct through April) One parking spot is available.  ($80 value)  No dogs, except guide dog. One cat is fine with a $100, one time cat fee.\nOne tenant is reaching out to his co-workers.  Between us we hope to find the perfect fit for this building. Sorry, I do not have a student permit. A short term rental may be available for someone who needs an earlier move in date.\n","num_images":8,"lat":39.954228,"lng":-75.603061,"attrs":"['1BR \/ 1Ba', 'available jan 1, 2023', 'cats are OK - purrr', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T20:17:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562076552.html","post_id":7562076552,"result_date":"Mon Nov 28 2022 00:59:32 GMT+0000 ","title":"- 777 Ferry Road, :\">Cozy 2 Bd 1Ba 1150ft Apt <\":","description":"This Cozy 2 Bedroom 1 Bathroom 1150sqft Apartment Is Also Flooded With An Open Concept Living And Dining Area, An Upscale Kitchen With Stainless Steel Appliances And Marble Countertops, In-Suite Laundry, Large Bedrooms With Sliding Glass Closets, And A Walkout To A Large Fenced Backyard With A Deck. As For The Residence, This Apartment Features World-Class Facilities Modelled To Complement Your Contemporary Lifestyle. Located In Barrie, This Home Is Bound To Give You A High-Calibre Convenience Like Nothing You've Experienced Elsewhere. From Shopping Malls, Museums, Galleries, Parks, Gardens, Workplaces.\nIf you are interest please contract and give your number Albert will call you.\nThank You\n","num_images":4,"lat":40.319045,"lng":-75.173706,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'application fee details: $50 lease processing fee', 'broker fee details: $35................. Brokers Fee!!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', \"listed by: Pre-War Realty ONE MONTH'S RENT!!!\", 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T19:20:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562083907.html","post_id":7562083907,"result_date":"Mon Nov 28 2022 00:52:38 GMT+0000 ","title":"back yard to enjoy. 1 bed 11!!!","description":"Colorful 1 bedroom, 1 bath home that sits on a quiet, 2 bedroom is smaller than the other 1 - could also work as office space. Plenty of off-street parking and a large back yard to enjoy. Washer and dryer in unit along with storage space in basement. Tenant is responsible for electric, heat\/hot water (propane), snow removal and grounds maintenance. located in Rhode Island. ok smoking, ok pets.\n*If you are interested please send me your email. I will contact you soon.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nSome family come next year to visit me unfortunately I don't have room to take them with me so I'm looking for a fully furnished room with own bath for them Room must have 2 queen beds closet and TV They'll stay here for lees than 1 month (25 days) I can pay up $1,500 for the room with the expenses included Thank youI am 26, a gay actor and singer, eager to find my new home in LA. I moved here from NYC and am excited to find my next spot by December 23rd or Jan 1! I am a clean and respectful roommate, and love to have a sanctuary space at home, and appreciate bonding with those I live with but also respectful of privacy! Please get in touch! Feel free to text or call! My budget id $900I'm considering relocating to Los Angeles area and would like to look into renting a room off of public transit to LAX. I know I know. Maybe I'm crazy - but between flights I just want a grocery store and maybe gym nearby. I would love to not be car dependent. If you have a room available in your own place let's chat. I am on no specific timeline. Drug free environment preferred. Pet free environment preferred, allergic to cats, and mostly quiet small dogs ok. EricSo I’m coming to California for Christmas vacation and new year it going to be for three weeks I’m a gay Latino guy so I’m hoping to find somebody the same or is LGBT friendly I’m also looking for a private room I can do works like walking your dogs or cooking and cleaning for a room or I can pay for a room hoping is not too much maybe like $100 a week thank you for your time I hope to hear from someone I am a considerate and responsible, single professional wman searching for a new place to live and open to different locations in the Valley and nearby areas, including Glendale, Burbank, the Hills, the Canyons, northwest to Agoura. While renting apartments and a small home over the years, I have been a good tenant and always value and take care of my rentals as though they were my own. I'm exceptionally clean and will maintain your property with the greatest consideration daily. You will find me to be a quiet person and respectful of the privacy of others. I communicate politely at all times and will respect the terms of the lease agreement as you like. I do not smoke. I have one well-behaved indoor cat who will stay only in my private living space. I will maintain renter’s insurance. I love gardens and green spaces and would be happy to do any watering and simple gardening to be helpful around the home. Senior looking for private room in exchange house clean, or small work of most kinds. Quality Engineer prior pilot military veteran US Navy called to duty for Northrop Grumman in El Segundo from out of state and seeks Pvt room bath wifi off-street parking for rent I have an excellent credit score and always pay bills on time. I am a real person seeking a room. My Name is Byron from Texas two one zero seven one six two zero fur five. call or text I'll respond. Looking for property to rent. Something 4 bdr.+ Lower cost wise. Dealing fraud on my identity. So credit isn't best at moment. I just moved here and hotels are way more expensive than I choose to pay.rent would be a much better situation. Busco cuarto de renta para 2 personas en la area de El Valle. Puedo pagar nomas Asta mil Dolores gracias. Adultos Madre e hijo somos Hi. I'm looking for a minimum 650sq ft. guest house, townhouse or top floor\/corner apt. $2000 max. I'm open to areas from Calabasas to Hollywood. I have references, good credit and a job. I'm looking to move as soon as I find the right place. I currently rent a room in a shared house and I want to live alone. I'm ready to move. Please contact me here if you have a rental for me so we can move forward!I'm a 60yo nudist, seeking to rent a room or share a house\/apartment\/condo, preferably with other nudists. I'm employed full-time and financially stable. I'm looking for something in the San Gabriel Valley, preferably near the foothills (Duarte, Azusa, Glendora, San Dimas). Looking for an Airbnb -friendly landlord in California. I'm in the Airbnb business, where I lease\/rent a space and use it HUGE junior Two bedroom apartment available! This is literally the most beautiful, biggest one bedroom apartment you will see! 1 year sublet starts Jan 15th to Feb 1 (flexible) with possible earlier start date if you reach out ASAP monthly rent + utilities. The apartment is on the top floor facing a beautiful courtyard. It’s super quiet with amazing sunlight throughout the apartment. Elevator, trash\/recycling, washer\/dryer all included in the building, which is very well-kept. The apartment includes AC, dishwasher, and recently updated appliances. 2 minute walk to College. 5 minute walk to 2\/5. 10 minute walk to Q\/B. Don’t miss out on this perfect opportunity to live in the most gorgeous apartment in . Applicants must pass credit check and board approval. Please reach out with any questions.\n\n","num_images":3,"lat":39.7459,"lng":-75.5466,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T19:48:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561917812.html","post_id":7561917812,"result_date":"Sun Nov 27 2022 17:24:55 GMT+0000 ","title":"New Beginnings Here at Park Lane!!","description":"Available: 11\/30\/22\nBalmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-27T12:08:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561908430.html","post_id":7561908430,"result_date":"Sun Nov 27 2022 17:23:31 GMT+0000 ","title":"- GORGEOUS 3 Bed With 2 Bath HomE in Philadelphia","description":"This Garden District charmer is located just two blocks from Solomon Park and features a huge 0.92-acre lot with mature trees. The master bathroom has been freshly remolded with beautiful white tile and has a large walk-in shower. An additional 456 sf of space is found in the closed in garage and is not counted in the 1868 base square footage count. You'll also find extra space in the formal living room which would make a perfect study or home office. This home is move in ready and all appliances stay!","num_images":3,"lat":40.0568,"lng":-75.1379,"attrs":"['3BR \/ 2Ba', '1850ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-27T11:45:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561918876.html","post_id":7561918876,"result_date":"Sun Nov 27 2022 17:15:22 GMT+0000 ","title":"Yoga and Ballet Studio, Visit Your New Home, Leasing Now","description":"The Point at Glen Mills offers all of the amenities your looking for and some you didn't even know you wanted. Check out our two-story clubhouse-complete with flat screen TVs, a 24-hour fitness center and a pool table. Enjoy our on-site yoga studio or our outdoor putting green. Visit us today!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nApartment Features\n* Granite Countertops\n* Extra Storage\n* Full sized Washer and Dryer in unit\n* Wood-Like Floors\n* Private Patio or Private Balcony (on select apartments)\nCommunity Features\n* Bocce Ball\n* Easy Freeway Access\n* Professionally Managed\n* Community Lounge\n* Sun Deck\n* Fitness Studio\n* Yoga Lounge\n* Putting Green\n* Bark Park\n* TV Lounge\n* Pet Salon\n* Swimming Pool\n* Minutes from Restaurants, Shopping, and Much More\n* Outdoor Grill Area\n[#9497367]","num_images":18,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-27T12:11:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561914365.html","post_id":7561914365,"result_date":"Sun Nov 27 2022 17:04:55 GMT+0000 ","title":"HOUSE FOR RENT BUSTELTON AVE","description":"2 bedroom 1 bath125","num_images":10,"lat":40.072463,"lng":-75.048173,"attrs":"['2BR \/ 1Ba', '850ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T12:00:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561911098.html","post_id":7561911098,"result_date":"Sun Nov 27 2022 16:56:34 GMT+0000 ","title":"Fitness Center, Incredible Features, Central Location","description":"Be the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Swimming Pool\n* Professionally Managed\n* Community Lounge\n* Pet Salon\n* Outdoor Grill Area\n* Billiards\n* Minutes from Restaurants, Shopping, and Much More\n* TV Lounge\n* Bark Park\n* Easy Freeway Access\n* Sun Deck\n* Spa\n* Yoga Lounge\n* Fitness Studio","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '815ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T11:52:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561910125.html","post_id":7561910125,"result_date":"Sun Nov 27 2022 16:54:07 GMT+0000 ","title":"Newly Renovated 2 beds 1bath","description":"Fantastic and spacious 2 + 2 Fox Chase duplex! Newly renovated with brand new kitchen, bathrooms, and fresh paint. Endless upgrades including stainless appliances, subway tile backsplash and shaker cabinets in the kitchen. New luxury vinyl floors and refinished hardwood. Both units have inside access to the full basement with laundry area and 4 walk-in storage closets including 2 which are cedar-lined! Basement walkout access to the sun drenched rear yard. With some of the highest square footage in the area these large apartments will be great for living in or renting. Rent is asking $1550 each month. Utility not included. Need credit check. Moving require first, last and one month deposit.","num_images":0,"lat":40.045038,"lng":-75.101105,"attrs":"['2BR \/ 1Ba', '963ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T11:50:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561909154.html","post_id":7561909154,"result_date":"Sun Nov 27 2022 16:51:23 GMT+0000 ","title":"New Construction Rental","description":"Nestled between fishtown and temple is a fantastic, roof top entertaining 4 br, 3 full\/2 half bath chef's kitchen gem!!\nPerfect for professionals, upper classman temple students only 5 blocks from campus on east Cecil B. Moore.  One of Two homes nearing completion and available 1\/1 or a mutually negotiated start date.  These exquisite higher end townhomes have all the bells and whistles.  24\/7 ADT security, flowing floor plan and ample street parking. Principle tenants only, call Charlie to view.\n","num_images":4,"lat":39.97707,"lng":-75.14529,"attrs":"['4BR \/ 5Ba', 'townhouse', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T11:47:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561896573.html","post_id":7561896573,"result_date":"Sun Nov 27 2022 16:50:07 GMT+0000 ","title":"3 bed, 2 bath bi-level apartment available in Philadelphia.","description":"*Available now* Fantastic 3 bed, 2 bath bi-level apartment available in Graduate Hospital with high end finishes throughout and in great condition! Enter into a open concept kitchen and living area with pristine hardwood floors, recessed lighting and plenty of windows offering great natural light. The kitchen comes fit with granite countertops, natural wood cabinetry and stainless steel appliances for your cooking needs. The first spacious bedroom with its own closet and adjacent full bath are located towards the rear side of this level, secluded from any street noise. Upstairs, you will find two additional very spacious bedrooms, with the primary oriented towards the front of the residence with numerous large windows. There is a large hall laundry closet with plenty of storage space, as well as an additional full bath that mirrors the one on the first floor. Finally, this home is ideally located within walking distance to many popular attractions like Dock Street Brewery South, Loco Pez, Ultimo Coffee and more! You also can quickly access Washington Ave, Broad Street and neighboring areas like Rittenhouse Square, Center City and Fitler Square for more local entertainment. *Sorry, no pets.","num_images":3,"lat":39.940201,"lng":-75.176066,"attrs":"['3BR \/ 2Ba', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T11:14:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561905308.html","post_id":7561905308,"result_date":"Sun Nov 27 2022 16:41:18 GMT+0000 ","title":"Call for Details, Clubhouse with Game Room, Visit Your New Home","description":"Prepare to fall in love with The Point at Glen Mills! Kick back in our community lounge. Watch your furry friend frolic with his furry friends in our dog park. Challenge your friends to a game of golf on our outdoor putting green. Life is good at The Point at Glen Mills. Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nApartment Features\n* Granite Countertops\n* Extra Storage\n* Full sized Washer and Dryer in unit\n* Private Patio or Private Balcony (on select apartments)\n* Wood-Like Floors\nCommunity Features\n* Community Lounge\n* Yoga Lounge\n* TV Lounge\n* Pet Salon\n* Bocce Ball\n* Bark Park\n* Sun Deck\n* Swimming Pool\n* Putting Green\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access\n* Professionally Managed\n* Fitness Studio\n* Outdoor Grill Area","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-27T11:37:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561896535.html","post_id":7561896535,"result_date":"Sun Nov 27 2022 16:31:01 GMT+0000 ","title":"This recently renovated Passyunk Square home offers 1 bedroom, 1 bath","description":"This recently renovated Passyunk Square home offers 1 bedroom, 1 bathroom with Central Air and parking! Private on-street garage entrance includes a large storage closet. Just past the garage on the first floor, you will find a great space for a media room, home office, or extra storage along with laundry area and half bath. Upstairs, the open floor plan offers ample natural light, hardwood flooring, and recessed lighting. Continue to your brand new open kitchen outfitted with stainless appliances, granite countertops, and glass mosaic backsplash. The bedroom includes a large closet and ceiling fan while the bathroom includes a tub and plenty of storage. Steps away from Bok, East Passyunk Ave. , subway\/public transportation, shopping, and all of the new restaurants, bars, and coffee shops that continue to open in this thriving neighborhood, this home offers modern living and convenience for a great value.","num_images":17,"lat":39.92704,"lng":-75.15734,"attrs":"['1BR \/ 1Ba', '1232ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T11:14:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561899131.html","post_id":7561899131,"result_date":"Sun Nov 27 2022 16:24:36 GMT+0000 ","title":"Amazing views and serene living can be yours! 2 Bd, 2 Ba, 1088 SqFt!","description":"Millview Apartments 100 Cobblestone Dr Coatesville, PA 19320  show contact info\nUnit Information: 2 Bedroom | 2 Bath  Unit Size: 1088 sq ft  Monthly Rent: $1562- $2043 Lease Terms: Variable Unit Includes:◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In ClosetsProperty Description: Nestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!Property Amenities: ◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral Bonuses Website: https:\/\/www.apartmentsincoatesvillepa.com\/Call us today!  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMPet Ownership Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Proudly managed by Paradise Management, LLCEQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T11:20:36-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561898601.html","post_id":7561898601,"result_date":"Sun Nov 27 2022 16:23:14 GMT+0000 ","title":"CHECK NOW!! SPACIOUS 3BD HOUSE IN Philadelphia","description":"Quiet, private, secure. This single floor flat is a dream for the stay at home professionals. It boasts a private entrance, a master bedroom with a walk in dressing room, another large bedroom, 2 office spaces, dining room, living room, gourmet kitchen with pantry and new appliances, private washer\/dryer, chandeliers, hardwoods, new carpets, private porch\/sitting room, private entrance with security lighting. Easy access to Rt. 81 and Rt. 690. Within 1 mile of\nPhiladelphia University and all area hospitals, within 1 block of St. Joseph's hospital.\nPlease TEXT OR CALL: ( 7 1 6 ) 3 0 3- 3 7 5 3\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nSome family come next year to visit me unfortunately I don't have room to take them with me so I'm looking for a fully furnished room with own bath for them Room must have 2 queen beds closet and TV They'll stay here for lees than 1 month (25 days) I can pay up $1,500 for the room with the expenses included Thank youI am 26, a gay actor and singer, eager to find my new home in LA. I moved here from NYC and am excited to find my next spot by December 23rd or Jan 1! I am a clean and respectful roommate, and love to have a sanctuary space at home, and appreciate bonding with those I live with but also respectful of privacy! Please get in touch! Feel free to text or call! My budget id $900I'm considering relocating to Los Angeles area and would like to look into renting a room off of public transit to LAX. I know I know. Maybe I'm crazy - but between flights I just want a grocery store and maybe gym nearby. I would love to not be car dependent. If you have a room available in your own place let's chat. I am on no specific timeline. Drug free environment preferred. Pet free environment preferred, allergic to cats, and mostly quiet small dogs ok. EricSo I’m coming to California for Christmas vacation and new year it going to be for three weeks I’m a gay Latino guy so I’m hoping to find somebody the same or is LGBT friendly I’m also looking for a private room I can do works like walking your dogs or cooking and cleaning for a room or I can pay for a room hoping is not too much maybe like $100 a week thank you for your time I hope to hear from someone I am a considerate and responsible, single professional wman searching for a new place to live and open to different locations in the Valley and nearby areas, including Glendale, Burbank, the Hills, the Canyons, northwest to Agoura. While renting apartments and a small home over the years, I have been a good tenant and always value and take care of my rentals as though they were my own. I'm exceptionally clean and will maintain your property with the greatest consideration daily. You will find me to be a quiet person and respectful of the privacy of others. I communicate politely at all times and will respect the terms of the lease agreement as you like. I do not smoke. I have one well-behaved indoor cat who will stay only in my private living space. I will maintain renter’s insurance. I love gardens and green spaces and would be happy to do any watering and simple gardening to be helpful around the home. Senior looking for private room in exchange house clean, or small work of most kinds. Quality Engineer prior pilot military veteran US Navy called to duty for Northrop Grumman in El Segundo from out of state and seeks Pvt room bath wifi off-street parking for rent I have an excellent credit score and always pay bills on time. I am a real person seeking a room. My Name is Byron from Texas two one zero seven one six two zero fur five. call or text I'll respond. Looking for property to rent. Something 4 bdr.+ Lower cost wise. Dealing fraud on my identity. So credit isn't best at moment. I just moved here and hotels are way more expensive than I choose to pay.rent would be a much better situation. Busco cuarto de renta para 2 personas en la area de El Valle. Puedo pagar nomas Asta mil Dolores gracias. Adultos Madre e hijo somos Hi. I'm looking for a minimum 650sq ft. guest house, townhouse or top floor\/corner apt. $2000 max. I'm open to areas from Calabasas to Hollywood. I have references, good credit and a job. I'm looking to move as soon as I find the right place. I currently rent a room in a shared house and I want to live alone. I'm ready to move. Please contact me here if you have a rental for me so we can move forward!I'm a 60yo nudist, seeking to rent a room or share a house\/apartment\/condo, preferably with other nudists. I'm employed full-time and financially stable. I'm looking for something in the San Gabriel Valley, preferably near the foothills (Duarte, Azusa, Glendora, San Dimas). Looking for an Airbnb -friendly landlord in California. I'm in the Airbnb business, where I lease\/rent a space and use it for Airbnb purposes. Your property will invariably remain in excellent condition. I will be in charge of cleaning, maintenance, and other duties\/responsibilities. Please send me your terms, conditions, and pricing. I'm looking forward to our fantastic long-term partnership. Looking for an Airbnb arbitrage-friendly landlord in California. I'm in the Airbnb business, where I lease\/rent a space and use it for Airbnb purposes. Your property will invariably remain in excellent condition. I will be in charge of cleaning, maintenance, and other duties\/responsibilities. Please send me your terms, conditions, and pricing. I'm looking forward to our fantastic long-term partnership. I'm ready to begin renting right away. I’m a 31 year old looking for roommate \/ roommates to share a house on the west side ideally close to the beach. Budget 2-3k. Very easy going guy who likes to keep fit, enjoy LA night life, dining, music & film, and golf. Like keeping my place clean and am respectful of home as a place of peace and rest. Happy to provide additional information as roommate fit is critical and I want us both to have a great living experience. I have to move from the apartment where I’m living. I'm a senior , looking for a compatible roommate in same age range to LOOK FOR and share a 2bd apt. in the Los Angeles County area. I have to move from the apt. I’m in because the rent is being consistently raised and is now out of my range. I would prefer my half of the rent in the new place to be between $600 - $700\/mo. I am friendly and have a great sense of humor. I keep the apt. neat and clean and am looking for a roommate who will do the same. I do volunteer work for a non-profit org. I meditate and I'm somewhat of a writer. I have a friendly, adorable kitty and would prefer a kitty friendly roommate. Would love to hear from you if you think this is a situation that might work for you and discuss more details by phone or by personal email.Hello there, I am looking for a share house or an apartment where I can stay for a long term. I believe that I am clean, quiet, dependable, and easy-going. I have experience living in a share house. I have several fairly nerdy interests and I am also financially secure which I can prove with a current bank statement; I have excellent credit and can provide a shining reference from my current, long-time landlord. If you have a place or are looking for a roommate to find a place then we might be a good match. I sincerely wish all of you luck!\n","num_images":6,"lat":40.0018,"lng":-75.1179,"attrs":"['3BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T11:19:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561891344.html","post_id":7561891344,"result_date":"Sun Nov 27 2022 16:04:02 GMT+0000 ","title":"Spacious and bright 1 bedroom apartment in Philadelphia","description":"Spacious and bright 1 bedroom apartment in Philadelphia- The apartment features: Hardwood floors, king sized bedroom, ample closet space, large living room and separate kitchen. Pets are welcome. Surrounded by the best local bars, restaurants, cafes, and a short commute to Manhattan. Please contact Alexis for more info: show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nSome family come next year to visit me unfortunately I don't have room to take them with me so I'm looking for a fully furnished room with own bath for them Room must have 2 queen beds closet and TV They'll stay here for lees than 1 month (25 days) I can pay up $1,500 for the room with the expenses included Thank youI am 26, a gay actor and singer, eager to find my new home in LA. I moved here from NYC and am excited to find my next spot by December 23rd or Jan 1! I am a clean and respectful roommate, and love to have a sanctuary space at home, and appreciate bonding with those I live with but also respectful of privacy! Please get in touch! Feel free to text or call! My budget id $900I'm considering relocating to Los Angeles area and would like to look into renting a room off of public transit to LAX. I know I know. Maybe I'm crazy - but between flights I just want a grocery store and maybe gym nearby. I would love to not be car dependent. If you have a room available in your own place let's chat. I am on no specific timeline. Drug free environment preferred. Pet free environment preferred, allergic to cats, and mostly quiet small dogs ok. EricSo I’m coming to California for Christmas vacation and new year it going to be for three weeks I’m a gay Latino guy so I’m hoping to find somebody the same or is LGBT friendly I’m also looking for a private room I can do works like walking your dogs or cooking and cleaning for a room or I can pay for a room hoping is not too much maybe like $100 a week thank you for your time I hope to hear from someone I am a considerate and responsible, single professional wman searching for a new place to live and open to different locations in the Valley and nearby areas, including Glendale, Burbank, the Hills, the Canyons, northwest to Agoura. While renting apartments and a small home over the years, I have been a good tenant and always value and take care of my rentals as though they were my own. I'm exceptionally clean and will maintain your property with the greatest consideration daily. You will find me to be a quiet person and respectful of the privacy of others. I communicate politely at all times and will respect the terms of the lease agreement as you like. I do not smoke. I have one well-behaved indoor cat who will stay only in my private living space. I will maintain renter’s insurance. I love gardens and green spaces and would be happy to do any watering and simple gardening to be helpful around the home. Senior looking for private room in exchange house clean, or small work of most kinds. Quality Engineer prior pilot military veteran US Navy called to duty for Northrop Grumman in El Segundo from out of state and seeks Pvt room bath wifi off-street parking for rent I have an excellent credit score and always pay bills on time. I am a real person seeking a room. My Name is Byron from Texas two one zero seven one six two zero fur five. call or text I'll respond. Looking for property to rent. Something 4 bdr.+ Lower cost wise. Dealing fraud on my identity. So credit isn't best at moment. I just moved here and hotels are way more expensive than I choose to pay.rent would be a much better situation. Busco cuarto de renta para 2 personas en la area de El Valle. Puedo pagar nomas Asta mil Dolores gracias. Adultos Madre e hijo somos Hi. I'm looking for a minimum 650sq ft. guest house, townhouse or top floor\/corner apt. $2000 max. I'm open to areas from Calabasas to Hollywood. I have references, good credit and a job. I'm looking to move as soon as I find the right place. I currently rent a room in a shared house and I want to live alone. I'm ready to move. Please contact me here if you have a rental for me so we can move forward!I'm a 60yo nudist, seeking to rent a room or share a house\/apartment\/condo, preferably with other nudists. I'm employed full-time and financially stable. I'm looking for something in the San Gabriel Valley, preferably near the foothills (Duarte, Azusa, Glendora, San Dimas). Looking for an Airbnb -friendly landlord in California. I'm in the Airbnb business, where I lease\/rent a space and use it for Airbnb purposes. Your property will invariably remain in excellent condition. I will be in charge of cleaning, maintenance, and other duties\/responsibilities. Please send me your terms, conditions, and pricing. I'm looking forward to our fantastic long-term partnership. Looking for an Airbnb arbitrage-friendly landlord in California. I'm in the Airbnb business, where I lease\/rent a space and use it for Airbnb purposes. Your property will invariably remain in excellent condition. I will be in charge of cleaning, maintenance, and other duties\/responsibilities. Please send me your terms, conditions, and pricing. I'm looking forward to our fantastic long-term partnership. I'm ready to begin renting right away. I’m a 31 year old looking for roommate \/ roommates to share a house on the west side ideally close to the beach. Budget 2-3k. Very easy going guy who likes to keep fit, enjoy LA night life, dining, music & film, and golf. Like keeping my place clean and am respectful of home as a place of peace and rest. Happy to provide additional information as roommate fit is critical and I want us both to have a great living experience. I have to move from the apartment where I’m living. I'm a senior , looking for a compatible roommate in same age range to LOOK FOR and share a 2bd apt. in the Los Angeles County area. I have to move from the apt. I’m in because the rent is being consistently raised and is now out of my range. I would prefer my half of the rent in the new place to be between $600 - $700\/mo. I am friendly and have a great sense of humor. I keep the apt. neat and clean and am looking for a roommate who will do the same. I do volunteer work for a non-profit org. I meditate and I'm somewhat of a writer. I have a friendly, adorable kitty and would prefer a kitty friendly roommate. Would love to hear from you if you think this is a situation that might work for you and discuss more details by phone or by personal email.Hello there, I am looking for a share house or an apartment where I can stay for a long term. I believe that I am clean, quiet, dependable, and easy-going. I have experience living in a share house. I have several fairly nerdy interests and I am also financially secure which I can prove with a current bank statement; I have excellent credit and can provide a shining reference from my current, long-time landlord. If you have a place or are looking for a roommate to find a place then we might be a good match. I sincerely wish all of you luck!\n","num_images":1,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-27T11:00:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561862078.html","post_id":7561862078,"result_date":"Sun Nov 27 2022 15:58:50 GMT+0000 ","title":"Spacious Living And Dining Area Has A Gas Fireplace","description":"7250 Walnut St near PA\nBright and beautiful 1 Bedroom walkout basement suite in highly sought-after community Arbour Lake. Private entry from the beautifully landscaped and fully fenced back yard. Double closets in the bedroom.The ensuite bathroom has 2 third closet and a huge shower.The bright and spacious living and dining area has a gas fireplace with a fan to quickly warm you up in the cold winter days.Kitchen area is open and has plenty of cabinets. Close to bus stop, which is 5 minute to Crowfoot LRT Station. Water, Heat, Electricity are all included, and so is the high speed Internet. Only clean, quiet single will be considered (no couple or child please). No smoking,cats and dog allowed. Please Contact at:  show contact info\n7250 Walnut St cerca de Pensilvania\nLuminosa y hermosa suite de 1 dormitorio en el sótano de la paro en la comunidad muy buscada de Arbor Lake. Entrada privada desde el patio trasero bellamente diseñado y completamente cercado. Armarios dobles en el dormitorio. El baño privado tiene 2 terceros armarios y una gran ducha. La amplia y luminosa sala de estar y el comedor tienen una chimenea de gas con ventilador para calentarse rápidamente en los fríos días de invierno. El área de la cocina está abierta y tiene un montón de armarios. Cerca de la parada de autobús, que está a 5 minutos de la estación LRT de Crowfoot. El agua, la calefacción y la electricidad están incluidos, al igual que Internet de alta velocidad. Solo se considerarán solteros limpios y tranquilos (sin pareja o niño, por favor). No fumar, se admiten perros y gatos. Comuníquese al:  show contact info","num_images":4,"lat":39.9579,"lng":-75.2681,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T09:26:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561876842.html","post_id":7561876842,"result_date":"Sun Nov 27 2022 15:43:01 GMT+0000 ","title":"In demand loft space in a converted school building with assigned, ga","description":"In demand loft space in a converted school building with assigned, gated one car parking. Large, oversized windows facing north with the same incredible view as the roof at Bok. Has over 11 foot ceilings, new bathroom, in unit washer\/dryer, floating staircase leads to open loft bedroom space. New Bosch oven and cooktop in new kitchen, large open main floor living\/dining area with plenty of wall space for art, bookcases, etc. New window treatments complete this exceptional, ready to move in space.","num_images":11,"lat":39.938227,"lng":-75.154791,"attrs":"['1BR \/ 1Ba', '750ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T10:16:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561883679.html","post_id":7561883679,"result_date":"Sun Nov 27 2022 15:40:54 GMT+0000 ","title":"Great 1 bedroom available now at 4537 Osage ave!","description":"Cozy, affordable 1 bedroom available now at 45th and Osage. Great location! Building comes with shared backyard. Laundry room in the building.\n$50 application fee, 3 months to move in. 1 year lease.\nCall or text at  show contact info\nto schedule your showing today.\n","num_images":12,"lat":39.951144,"lng":-75.213282,"attrs":"['1BR \/ 1Ba', 'application fee details: 50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-11-27T10:36:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561882209.html","post_id":7561882209,"result_date":"Sun Nov 27 2022 15:36:27 GMT+0000 ","title":"Great 1 bedroom available now at 2254 Bryn Mawr ave!","description":"Great 1BR\/1BA apartment in Wynnefield available NOW! This unit features hardwood floor, full kitchen with granite countertop, microwave and dishwasher, big living room, a couple closets, tiled bathroom, a lot of natural light. Shared laundry. Secured entry. Pets are allowed with landlord's approval ($250 pet fee plus $25 pet rent). Free parking street parking. Call or text NOW at  show contact info\n( I usually respond on text messages within 10 min!) City Wide Realty 808 N 4th str Suite 1, Philadelphia, PA, 19123\n","num_images":14,"lat":39.992777,"lng":-75.226573,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T10:32:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561880521.html","post_id":7561880521,"result_date":"Sun Nov 27 2022 15:31:20 GMT+0000 ","title":"Great 1 bedroom available now at 5100 Walnut street!","description":"Great location! Cozy 1 bedroom available now. Laundry room is in the building. Tenant pays for all utilities. 1 year lease. $50 application fee. 3 months to move in. Must to have a good credit score and monthly income 3 times rent.\nCall Alena for showing at  show contact info","num_images":11,"lat":39.956738,"lng":-75.21402,"attrs":"['1BR \/ 1Ba', 'application fee details: 50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T10:27:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561874963.html","post_id":7561874963,"result_date":"Sun Nov 27 2022 15:27:20 GMT+0000 ","title":"This bright and airy third floor bi-level condo offers the ultimate in","description":"This bright and airy third floor bi-level condo offers the ultimate in city living. Imagine being just steps away from fresh produce, shopping, transportation, and entertainment. To live in this home means to live in the hub of the Italian Market, Passyunk Avenue, and Center City. Walk, bike, or drive anywhere with ease. I-95 and the Broad Street Line are both equally and easily accessible, too. Enjoy gorgeous hardwoods throughout, a modern kitchen and bathroom, custom built storage solutions, and tons of windows pouring in natural light. Become part of a close-knit community with only a handful of neighbors and the fabulous Bibou restaurant.","num_images":21,"lat":39.936846,"lng":-75.156696,"attrs":"['1BR \/ 1Ba', '495ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T10:10:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561872016.html","post_id":7561872016,"result_date":"Sun Nov 27 2022 15:05:18 GMT+0000 ","title":"Large upcoming renovated 3 bedroom house for rent","description":"If your looking to move but need a little time, this is the house for you. Who wouldn't want a fully renovated home. Be the first to live in this large beautiful 3 bedroom, 2 bathroom home. Property features 3 large bedrooms, 2 bathrooms, wall to wall Laminate, gray walls, a eat in kitchen, a large basement, a backyard and recessed lighting throughout living and dining room. Close to public transportation and shopping. Schedule a tour and secure your home today.","num_images":0,"lat":39.940623,"lng":-75.22841,"attrs":"['3BR \/ 2Ba', '1600ft2', 'available jan 16, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T10:01:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561868647.html","post_id":7561868647,"result_date":"Sun Nov 27 2022 15:00:21 GMT+0000 ","title":"Fully renovated 4 bedroom house for rent","description":"Beautiful large 4 bedroom home with finished basement that can be used for entertainment or storage. Home will feature a large kitchen, large dining room, living room and 4 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint, a large fireplace and brand new countertops and cabinets. Recessed lights throughout. Washer and dryer hookup up can be added. Down the street from boys Latin high school. Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. 3rd party vouchers and payments will not be accepted. First month, Last month and security deposit is required to move in. Serious inquiries only.","num_images":0,"lat":39.9448,"lng":-75.2288,"attrs":"['4BR \/ 1Ba', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T09:50:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561869830.html","post_id":7561869830,"result_date":"Sun Nov 27 2022 14:58:19 GMT+0000 ","title":"Luxury apartment in NoLibs","description":"Beautiful NEW CONSTRUCTION in the heart of all the Northern Liberties!\nWe are looking for someone to take on our lease in this BRAND NEW, spacious, pet-friendly luxury 2 bedroom\/2bathroom + walk-in closet apartment home right next to the Piazza starting in February 2023.\nAmenities include a scenic rooftop, on-site dog wash, and garage parking (for additional costs). The apartment is on the top floor (~1,000 sq feet) and it is perfect for a roommate\/share or a young couple. The apartment comes complete with brand-new stainless steel appliances and an in-unit washer\/dryer and the latest MIRROR FITNESS personal trainer AND 3 community PERSONAL work-from-home offices to get out of your apartment into a fresh clean workspace.\n","num_images":10,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', 'available feb 1, 2023', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-27T09:54:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561867514.html","post_id":7561867514,"result_date":"Sun Nov 27 2022 14:50:39 GMT+0000 ","title":"Updated home for rent","description":"Beautiful 3 bedroom home with finished basement that can be used for entertainment or storage. Home will feature kitchen, nice sized dining room, living room and 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint and brand new countertops and cabinets. If that wasnt enough, home also has a deck that you can walk straight into from the dining room. The living room and dining room has beautiful recessed lights that makes the room appear larger and brighter. There is also a attached garage that can be used as storage. The home is down the street from cobbs creek parkway. Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Serious inquiries only.","num_images":0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'available dec 20', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T09:46:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561866732.html","post_id":7561866732,"result_date":"Sun Nov 27 2022 14:47:58 GMT+0000 ","title":"Three bedroom house","description":"Beautiful 3 bedroom home for rent. Home will feature a large nice size kitchen, dining and living room along with 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the first floor, fresh paint, brand new countertops and cabinets with new gray carpets on the stairs and second floor. Washer and dryer hookup can be added. Minutes away from shopping and public transportation. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only.","num_images":0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T09:43:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561842559.html","post_id":7561842559,"result_date":"Sun Nov 27 2022 13:15:53 GMT+0000 ","title":"Where Luxury Meets Convenience!!","description":"Available: 11\/20\/22\nApt. 2510 — Oxford floor plan — 1,203 sq. ft. — $3,510\nThis 5th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-27T07:52:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561844610.html","post_id":7561844610,"result_date":"Sun Nov 27 2022 13:09:46 GMT+0000 ","title":"Newly renovated 1 bedroom\/1 bath unit in philadelphia","description":"Newly renovated 1 bedroom\/1 bath unit has washer dryer hookups, new flooring, new bathroom, stainless steel appliances, upstairs\/downstairs, and plenty of parking. $500.00  month includes monitor heating, water\/sewer, trash removal, snow removal, and landscaping. The tenant pays for elecpertricity. Cats OK , application fee $30. Rent: $500 deposit: $500, If you interested please contact:- jesy7755𝐆𝐦𝐚𝐢𝐥com\nADDESS:  Ellsworth Street, Little Saigon, South Philadelphia, Philadelphia","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T08:05:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561811040.html","post_id":7561811040,"result_date":"Sun Nov 27 2022 05:14:21 GMT+0000 ","title":"Condo 1BR philadelphia Downtown","description":"We have one Bedroom 1 bath newer looking condo on 6th floor in downtown Philadelphia for near by college or school students.\nVery neat and clean condo.\ncurrent rent is $1390, we are open to negotiate for 1year lease.\nCall or email for details.\n","num_images":0,"lat":40.100764,"lng":-74.982376,"attrs":"['1BR \/ 1Ba', 'available dec 1', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T00:10:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561801891.html","post_id":7561801891,"result_date":"Sun Nov 27 2022 04:30:26 GMT+0000 ","title":"Luxury 1 bed available in Rittenhouse","description":"Located in Center City Philadelphia, Rittenhouse Square is an upscale neighborhood teeming with luxury retailers, independent boutique stores, art galleries, theaters, cafes, bars, and a wide variety of restaurants. At the neighborhood’s core sits Rittenhouse Square, a tree-filled one-square-block park that hosts numerous festivals, fairs, and farmers markets.\nRittenhouse Square, the park, is one of the five original squares city founder William Penn planned in the late 17th century. Today, it is Philadelphia’s most popular town square, serving as a gathering place and a tranquil reprieve from its bustling surroundings.\n","num_images":4,"lat":39.944867,"lng":-75.166972,"attrs":"['1BR \/ 1Ba', '600ft2', 'available now', '\\nsaturday 2022-11-26\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-11-26T23:01:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561792207.html","post_id":7561792207,"result_date":"Sun Nov 27 2022 04:07:59 GMT+0000 ","title":"X-Lg: 800+ SF Condo! btn. *Pennypack Park, Northeast Philadelphia Airp","description":"Extra-large 800+ SF Condo with one bedroom and waterfront views and a separate office. The living room has crown molding and is very roomy and bright. A breakfast bar with enough for stools is located in the pleasant kitchen where you may enjoy a cup of coffee. You have a sizable balcony outside that faces the water, making it the ideal area to unwind. This building boasts a ton of amenities, such as safe parking, round-the-clock security and concierge, a pool, and a gym. The waterfront promenade, museums, water taxi, parks, stadiums, and restaurants are all close by. Great neighborhood. Enjoy a better life here!\n-Thank you :)\n","num_images":3,"lat":40.0634,"lng":-74.999,"attrs":"['1BR \/ 1Ba', '821ft2', 'available now', 'application fee details: $15 per adult', 'broker fee details: NO fee Neded for Broker', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-26T22:00:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561800896.html","post_id":7561800896,"result_date":"Sun Nov 27 2022 03:59:02 GMT+0000 ","title":"3 bd 1 bath","description":"Freshly painted, New rugs 2nd floor, Look like wood vinyl flooring 1st floor, Granite countertop, Built-in microwave, Disposal, Clean basement, Washer and dryer hook up. 2 window air conditioners included","num_images":15,"lat":39.9321,"lng":-75.1859,"attrs":"['3BR \/ 1Ba', '1000ft2', 'available dec 1', '\\nmonday 2022-11-28\\n', '\\ntuesday 2022-11-29\\n', '\\nwednesday 2022-11-30\\n', 'application fee details: Good credit,  $40 application fee', 'cats are OK - purrr', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T22:55:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562076588.html","post_id":7562076588,"result_date":"Mon Nov 28 2022 00:37:41 GMT+0000 ","title":"310 Farm Lane, ++Huge-Rental-4-People,-Updated,-2Bath-Great-Location++","description":"A must see! 4 bed+++office\/huge rec. room. Updated kitchen and baths. Property has fresh paint, cosmetic updates, 1 floors, large bedrooms with tons of closet space, two living areas, 2.5 baths, free laundry, dishwasher, gas fireplace, dining room, air conditioning, large deck, and fenced in backyard. Large living space at 3,200 sq. ft. with a great location in quiet Vilas neighborhood within walking distance to hospitals. Big enough for up to 5 people. Single rental property for owner so only priority..\nIf you are interest please contract and give your number Albert will call you.\nThank You\n","num_images":4,"lat":40.310734,"lng":-75.113738,"attrs":"['4BR \/ 2.5Ba', 'application fee details: $50 lease processing fee', 'broker fee details: $45................. Brokers Fee!!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', \"listed by: Pre-War Realty ONE MONTH'S RENT!!!\", 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T19:20:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562061745.html","post_id":7562061745,"result_date":"Sun Nov 27 2022 23:34:47 GMT+0000 ","title":"1 Bedroom Apartment Indiana and Richmond St.","description":"Cozy 1 Bedroom Apartment.  Newer bathroom and kitchen.   Separate bedroom.\nWell Qualified Applicants.   CS.   700 or higher\n","num_images":4,"lat":39.980595,"lng":-75.105976,"attrs":"['1BR \/ 1Ba', '650ft2', 'available dec 15', 'application fee details: $38', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T18:30:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562059170.html","post_id":7562059170,"result_date":"Sun Nov 27 2022 23:26:19 GMT+0000 ","title":"Luxury apartment for rent \/skyline view","description":"Luxury 2 bedroom , 2 bathroom apartment for rent . Breathtaking views. Walking distance of the El train, Broad st line and 30th st station. Also walking distance to Chimas restaurant and Ruth Chris. There is a pool (seasonal on premises) rooftop terrace and gym. parking is available for a fee. Kitchen is furnished. Washer and Dryer available in unit.","num_images":0,"lat":39.953405,"lng":-75.171884,"attrs":"['2BR \/ 2Ba', 'available now', 'air conditioning', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-11-27T18:22:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562052691.html","post_id":7562052691,"result_date":"Sun Nov 27 2022 23:05:32 GMT+0000 ","title":"Large 2 BR Apartment - Great Set up","description":"Large 2 bedroom Apartment, with 2 bathrooms !!! Newer Kitchen, Freshly renovated.\nCredit Application recommended. 650 or higher.\n","num_images":3,"lat":39.994211,"lng":-75.111369,"attrs":"['2BR \/ 2Ba', '900ft2', 'available dec 1', 'application fee details: 38', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T18:01:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562049980.html","post_id":7562049980,"result_date":"Sun Nov 27 2022 22:58:05 GMT+0000 ","title":"Nice 1 Bedroom Apartment Allegheny & Emerald","description":"Nice 1 Bedroom Apartment in a convenient location. Minutes from shopping and transportation.  Newer kitchen, Separate bedroom with laminate floors.\n650 or higher Credit Score. Credit Application recommended.","num_images":3,"lat":39.994211,"lng":-75.111369,"attrs":"['1BR \/ 1Ba', '700ft2', 'available dec 1', 'application fee details: $38', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T17:52:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562043918.html","post_id":7562043918,"result_date":"Sun Nov 27 2022 22:37:39 GMT+0000 ","title":"Looking for a beautiful space? You've come to the right place!","description":"Millview Apartments100 Cobblestone Dr Coatesville, PA 19320Pricing: $1634 - $2224\/Month*Bedrooms: 2  Bathrooms: 2 Square Footage: 1088 sq ft show contact info\nFeatures in this apartment home:❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In ClosetsAbout the community:  Our apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort-style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today. Amenities at our property:❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral BonusesAdditional information:Terms: VariablePets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Website: https:\/\/www.apartmentsincoatesvillepa.com\/Phone:  show contact info\nProfessionally managed by Paradise Management, LLC *Prices are subject to change without notice EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T17:33:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562039569.html","post_id":7562039569,"result_date":"Sun Nov 27 2022 22:25:16 GMT+0000 ","title":"Amazing Studios! - LEASING SPECIAL - $1000 SECURITY DEPOSIT","description":"DWELL 2nd Street Apartments\nshow contact info\n1300 N. 2nd Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', '\\nmonday 2022-11-28\\n', '\\ntuesday 2022-11-29\\n', '\\nwednesday 2022-11-30\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T17:21:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562029796.html","post_id":7562029796,"result_date":"Sun Nov 27 2022 21:57:49 GMT+0000 ","title":"A home for everyone - even your pets! Pet friendly 2 bed \/ 2 bath!","description":"Millview Apartments Bedroom: 2 | Bathroom: 2Square Footage: 1178 sq ftMonthly Rent: $1632 - $2221 show contact info\nCommunity Description  Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.    Community Amenities✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral BonusesUnit Features✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In Closets  Contact InformationVisit Us: 100 Cobblestone Dr Coatesville, PA 19320 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/   Additional DetailsPet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Lease Terms: VariableManagement Company: Paradise Management, LLC Price is subject to change without prior noticeEQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T16:53:49-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562013597.html","post_id":7562013597,"result_date":"Sun Nov 27 2022 21:47:35 GMT+0000 ","title":"Perfect Location Spacious 2*** bedroom apartment for rent","description":"It perfect Location In  Philadelphia, PA. Two-bedroom apartment for rent. The property features 2 bedrooms, 1 bathroom, spacious bedrooms, a living room, wall-to-wall carpet, and creme-painted walls. Minutes away from shopping and public transportation. If you are interested and would like to move forward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only. Third-party vouchers will not be accepted.","num_images":3,"lat":40.0568,"lng":-75.1379,"attrs":"['2BR \/ 1.5Ba', 'application fee details: No Broker Fee', 'broker fee details: $15 apply Fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T16:08:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562010408.html","post_id":7562010408,"result_date":"Sun Nov 27 2022 21:04:25 GMT+0000 ","title":"Incredible Features, Resort Style Pool, Upgraded Finishes Available","description":"The Point at West Chester is the perfect location for your new home. Explore our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, Den, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nApartment Features\n* Walk-in Closet\n* Full sized Washer and Dryer in unit\n* Lofty Vaulted Ceilings\n* Garden Tub\n* High Efficiency Lighting Fixtures\n* Granite Countertops\n* Pre-wired for internet and cable\n* Linen Closet\n* Private Patio or Private Balcony (on select apartments)\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Roommate Friendly Floor Plan\n* Disposal\n* Ceiling Fan\n* Window Coverings\n* Breakfast Bar\n* Pantry\n* Stainless Steel Appliances\n* Central Heat and Air\nCommunity Features\n* Playground\n* Short or Long Term Lease Available\n* Garage Parking\n* Sun Deck\n* Minutes from Restaurants, Shopping, and Much More\n* Community Lounge\n* Long Term Lease Available\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* WiFi Access\n* Movie Theatre\n* Outdoor Grill Area\n* Pet Salon\n* Landscaped Courtyards\n* Bike Racks\n* TV Lounge\n* Bark Park\n* Community Kitchen\n* Billiards\n* Elevator\n* After-Hours Emergency Maintenance\n* Extra Storage\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Dry Cleaning and Laundry Service\n* Fitness Studio\n* Swimming Pool\n* Package Acceptance\n* Gaming Area\n* Easy Freeway Access\n* Renters Insurance is Required\n* Controlled Access\n* Credit Cards Accepted\n* Non Smoking Community\n* EV Charging\n* Professionally Managed","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available dec 15', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T16:00:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561997971.html","post_id":7561997971,"result_date":"Sun Nov 27 2022 21:01:18 GMT+0000 ","title":"very nice -V] S 9th St &, Market St, Philadelphia, PA","description":">> Beautiful 1 bedroom single style home in Market Street Shopping District, This wonderful home offers an open concept living area with an updated kitchen with Granite counters, Copper sink with a window above, and newer Dark SS Appliances with the no fingerprint finish, to help keep things looking neat and clean! @@ ALL INFORMATION HERE> laylaemily749gmail.com |||","num_images":4,"lat":39.944995,"lng":-75.156536,"attrs":"['1BR \/ 1Ba', 'EV charging', 'air conditioning', 'application fee details: The application fee is $50  per\/adult refundablecover credit Screening', 'broker fee details: ON BROKER FEE ------------@@', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', \"listed by: * -- Pre-War Realty ONE MONTH'S RENT!!!\", 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-27T15:26:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562002165.html","post_id":7562002165,"result_date":"Sun Nov 27 2022 20:55:23 GMT+0000 ","title":"Fancy 4 bedroom house for rent","description":"Beautiful large 4 bedroom home with finished basement that can be used for entertainment or storage. Home will feature a large kitchen, large dining room, living room and 4 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint, a large fireplace and brand new countertops and cabinets. Recessed lights throughout. Washer and dryer hookup up can be added. Down the street from boys Latin high school. Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. 3rd party vouchers and payments will not be accepted. Serious inquiries only.","num_images":0,"lat":39.9448,"lng":-75.2288,"attrs":"['4BR \/ 1Ba', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T15:37:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562006642.html","post_id":7562006642,"result_date":"Sun Nov 27 2022 20:54:03 GMT+0000 ","title":"Two bedroom apartment","description":"Two bedroom apartment for rent. Property features 2 bedrooms, 1 bathroom, spacious bedrooms, a living room, wall to wall carpet and creme painted walls. Minutes away from shopping and public transportation. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only. Third party vouchers will not be accepted.","num_images":0,"lat":39.9612,"lng":-75.2303,"attrs":"['2BR \/ 1Ba', 'available jan 2, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T15:50:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562005662.html","post_id":7562005662,"result_date":"Sun Nov 27 2022 20:51:12 GMT+0000 ","title":"Spacious 2 bedroom apartment for rent","description":"Two bedroom apartment for rent. Property features 2 bedrooms, 1 bathroom, spacious bedrooms, a living room, wall to wall carpet and creme painted walls. Minutes away from shopping and public transportation. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only. Third party vouchers will not be accepted.","num_images":24,"lat":39.978156,"lng":-75.230813,"attrs":"['2BR \/ 1Ba', 'available jan 2, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T15:47:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7562001663.html","post_id":7562001663,"result_date":"Sun Nov 27 2022 20:51:02 GMT+0000 ","title":"Fancy 3 bedroom home for rent","description":"Beautiful 3 bedroom home with finished basement that can be used for entertainment or storage. Home will feature kitchen, nice sized dining room, living room and 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint and brand new countertops and cabinets. If that wasnt enough, home also has a deck that you can walk straight into from the dining room. The living room and dining room has beautiful recessed lights that makes the room appear larger and brighter. There is also a attached garage that can be used as storage. Washer and dryer hook up can be added. The home is down the street from cobbs creek parkway. Minutes away from shopping and yeadon. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. 3rd party payments and vouchers will not be accepted. Serious inquiries only.","num_images":0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T15:36:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561983945.html","post_id":7561983945,"result_date":"Sun Nov 27 2022 20:29:42 GMT+0000 ","title":"}{- All Appliances Are Included, *3Br\/*2Ba -1600ft2","description":"3 bedroom, 2 bath 1,600 sq. ft. home for rent, available now. All appliances are included. Walls and kitchen were recently repainted and floors are newly refinished. Flooring is hardwood throughout and there is central heating and air. Bug spraying (except for flea infestations) and lawn care is included in rent.\nNo smoking, no loud parties. Neighborhood conservation zoning. Renters insurance is required and proof must be shown when moves in.\nMust pass background check. Deposit ($500) required when lease is signed. First Month's Rent ($990), Last Month's Rent ($990), and Cleaning Fee ($150) required upon move in\nIf you interested this home, please send your phone number for more details. I will send you all info.\n","num_images":5,"lat":40.1868,"lng":-75.0071,"attrs":"['3BR \/ 2Ba', '1600ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T14:50:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561965086.html","post_id":7561965086,"result_date":"Sun Nov 27 2022 20:26:09 GMT+0000 ","title":"Winchester Walk’s spacious  -  apartments sit on 14 beautiful acres-","description":"Address : Welsh Rd, Philadelphia, PA 19152\nNortheast Philadelphia\n1 Bedroom (Roosevelt)\n$665 \/ Mo\n1 bed, 1 bath, 800 sq\/ft\nAvailable Now\nContact Info :\nMargaret German\nshow contact info\n100 + reviews\n⭐⭐⭐⭐⭐\nLight House Realtors, LLC\nOr , send your phone number.\nAbout Winchester Walk\nWinchester Walk’s spacious apartments sit on 14 beautiful acres in the heart of Northeast Philly. Located near Pennypack Park, I-95, and Route 1, Winchester Walk offers easy access to everywhere you need to be. Enjoy a one- or two-bedroom fully upgraded residence, complete with custom kitchen, stainless-steel appliances, washer and dryer, natural light, and more. Terrific amenities! Fur babies welcome.\nCommunity Amenities:\nPool\nFitness Center\nLaundry Facilities\nFurnished Units Available\nApartment Features:\nIn Unit Washer & Dryer\nAir Conditioning\nDishwasher\nWasher\/Dryer Hookup\nHigh Speed Internet Access\nHardwood Floors\nWalk-In Closets\nMicrowave","num_images":8,"lat":40.0606,"lng":-75.0471,"attrs":"['1BR \/ 1Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T14:03:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561993648.html","post_id":7561993648,"result_date":"Sun Nov 27 2022 20:19:03 GMT+0000 ","title":"Central Location, Upgraded Finishes Available, Pet Park","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\n[#9497388]","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1210ft2', 'available dec 4', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T15:15:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561974228.html","post_id":7561974228,"result_date":"Sun Nov 27 2022 19:30:07 GMT+0000 ","title":"Putting Green , Pet Spa, Clubhouse with Game Room","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nHome is where the heart is, and here at The Point at Glen Mills, it's never been easier to love where you live. Contact us today to schedule your tour. You'll be glad you did!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with granite countertops, stainless steel appliances and a breakfast bar. this unit also features a large entry closet, full sized washer\/dryer, linen closets, and a private balcony. The bedrooms features walk-in closets, and ensuite bathrooms.\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nApartment Features\n* Extra Storage\n* Full sized Washer and Dryer in unit\n* Private Patio or Private Balcony (on select apartments)\n* Granite Countertops\n* Wood-Like Floors","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1095ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-27T14:26:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561971569.html","post_id":7561971569,"result_date":"Sun Nov 27 2022 19:23:18 GMT+0000 ","title":"two bedrooms  in","description":"behing your locked door in larger house, you have a coat closet, then a full bathroom, then a bedroom with porch, then another bedroom with large closets, then a small living room, then an eating and sitting around a table room looking outaward from the third floor through a huge dormer. Except for the bathroom which has tile floors, the rest of the apartment has hardwood floors. on half acre including large fenced in yard where you could put a medium or small dog. very close to bus stop although also has offstreet parking. available immediately. If not for the fact that your kitchen is only a partial kitchen and you have to use mine for large amounts of cooking the rent would be over 1500 per month. So you are saving $500 per month with our $1000 per month rent. the whole house is over 2000 sq feet. your private apt area is 850 call now  show contact info","num_images":8,"lat":39.9863,"lng":-75.407,"attrs":"['2BR \/ 1Ba', '850ft2', 'available now', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T14:19:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561968840.html","post_id":7561968840,"result_date":"Sun Nov 27 2022 19:16:25 GMT+0000 ","title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-27T14:12:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561956242.html","post_id":7561956242,"result_date":"Sun Nov 27 2022 18:57:39 GMT+0000 ","title":"Online Payments Available, On-site bike storage, Bark park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Upgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsOnline Payments AvailableBark parkMarble master baths, some with deep linen storageAlexa or Google Home Capable in all ApartmentsGame Room with Billiards Table, Shuffle Board, and moreUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with dens48-hour Maintenance CommitmentBocce ball fieldPet-friendly livingState-of-the-art fitness center overlooking the Manayunk canalFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/u2jed7l2\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-27T13:41:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561952782.html","post_id":7561952782,"result_date":"Sun Nov 27 2022 18:41:22 GMT+0000 ","title":"2bd 1ba new house","description":"This is a clean house located in the 5600 block of Appletree st Phila pa 19139 with 1 bathroom ,kitchen and 2 nice size bedrooms , washer & dryer , big private backyard plenty of storage in the basement also newly rehab and is walking distance for market Frankford line , A bus stop that goes in every direction so it’s easy to get around also walking distance from McDonald’s , Wendy’s and other food market and shopping stores rent is do on the 1st of every month.\nAfter we check your name out and your approve\nit will be a $1,250 security deposit and 1st month $1,250 and last month $1,250 which is a total of $3,750 to move in , and also your Credit history or criminal record will not stop you from being approved we are mainly looking for are you a overall a good tenant.\nRequirements\n1)have to make atleast 3 times the rent which is $3,750 a month.\n2) it will be a 75$ application fee that need to be paid to complete application once you come out and your ready to proceed.\nContact me @\n(215)910-558 4\ntext messages between 9am and 9 PM\nCalls between 9am-5pm\nthank you\n","num_images":13,"lat":39.9612,"lng":-75.2303,"attrs":"['2BR \/ 1Ba', 'available dec 1', 'application fee details: 75$ details above in description box', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-27T13:33:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561949364.html","post_id":7561949364,"result_date":"Sun Nov 27 2022 18:41:22 GMT+0000 ","title":"Bark park, Online Payments Available","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Online Payments AvailableUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingJogging trail right outside your doorHuge walk-in closets with ample storage48-hour Maintenance CommitmentUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsMarble master baths, some with deep linen storageBocce ball fieldBBQ and deck areaGame Room with Billiards Table, Shuffle Board, and moreCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/tmjggii2\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1364ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-27T13:25:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561947123.html","post_id":7561947123,"result_date":"Sun Nov 27 2022 18:36:56 GMT+0000 ","title":"6730 N 18th St- 2BR -1.5 BA-from Rock Philadelphia!","description":"Check out this move in ready ranch located a stones throw from Rock Philadelphia. splash pad & Northwest Elementary. You'll be awestruck with the beautiful landscaping and curb appeal. Spacious fenced yard for all your entertaining needs. House is move in ready and offers one level living. Hardwood floors, open floor plan, ceiling fans, basement is framed & ready for finishing. Attached garage also offers the possibilities for additional living space. Save on fuel this winter - the woodstove alone can heat the first floor. Convenient location close to the Philadelphia & downtown.","num_images":4,"lat":40.056412,"lng":-75.147474,"attrs":"['2BR \/ 1.5Ba', 'available nov 30', '\\nthursday 2022-12-01\\n', 'application fee details: I take $28 app fee per adult for the app fee', 'broker fee details: ~~~~~~~!!$55 Broker Fee!--!!!!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'listed by: *** 1 MONTH RENT***', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-27T13:19:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561947034.html","post_id":7561947034,"result_date":"Sun Nov 27 2022 18:35:43 GMT+0000 ","title":"Bocce ball field, 48-hour Maintenance Commitment, BBQ and deck area","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Huge walk-in closets with ample storageJogging trail right outside your doorUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingPet-friendly livingState-of-the-art fitness center overlooking the Manayunk canalFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingOn-site bike storage9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyard48-hour Maintenance CommitmentBocce ball fieldMarble master baths, some with deep linen storageBark parkCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/njvlett3\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-27T13:19:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561944592.html","post_id":7561944592,"result_date":"Sun Nov 27 2022 18:17:34 GMT+0000 ","title":"Take a Deep Breath and Relax Here at Park Lane!","description":"Available: 11\/30\/22\nAscott floor plan — 1,230 sq. ft. — $3,275\nThis corner-unit apartment has so much to offer! Our brand-new construction includes quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This Ascott also features spacious walk-in closets with custom shelving. This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1230ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-27T13:13:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561936317.html","post_id":7561936317,"result_date":"Sun Nov 27 2022 18:12:41 GMT+0000 ","title":"Winning Location 62nd St! Near (Subway, Bus) Finished BSMT, Repainted!","description":"62nd Street is conveniently located close to public transportation (Subway or Bus), thus making a commute into center city a breeze. This property was recently updated with new cabinets, counters, fridge, carpeting, and paint throughout. There is a full bath on the first and second floor. This property has a finished basement great for additional living space or storage, which also has laundry hookups. Landlord will provide washer\/dryer for an additional $50 per month added to rent. Serious inquiries only. Minimum requirements listed in Lease description below.\nMinimum household income of 3x monthly rent ($4,350) required to apply. Credit score greater than 5500 is preferred, but not required. Credit and background report is required. First, Last, and Security Deposit due upfront.\nTenant pays all utilities. Monthly rent includes up to $50 per month of water. Tenant will reimburse for any overage.\nPets allowed. Additional  security deposits may be required\n","num_images":14,"lat":39.965606,"lng":-75.244049,"attrs":"['3BR \/ 2Ba', '1286ft2', 'available now', '\\nmonday 2022-12-05\\n', '\\nwednesday 2022-12-07\\n', '\\nfriday 2022-12-09\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T12:53:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561934383.html","post_id":7561934383,"result_date":"Sun Nov 27 2022 17:59:59 GMT+0000 ","title":"two bedroom","description":"renting a two-bedroom apartment. two stories with a sofa and a dining table, a queen size bed, and a full-size bed. Deposit, first and last. Year lease. Background and credit check. No pets","num_images":0,"lat":39.947354,"lng":-75.172889,"attrs":"['2BR \/ 1.5Ba', 'air conditioning', 'application fee details: 100', 'furnished', 'condo', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-27T12:48:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561930738.html","post_id":7561930738,"result_date":"Sun Nov 27 2022 17:57:07 GMT+0000 ","title":"Modern & Clean 3BR\/1.5BA Located just off N 33rd St Nr-Shop\/Park","description":"3 bed 1.5 bath home available Located just north of the progressive Brewery town area Philadelphia enjoy the easy accessibility of all that the city has to offer without being in the centre of town. Located just off of N 33rd St you can easily hop onto Kelly Drive do get into town or to get to work out of the city. With the Dell Centre a short walk away, you can easily catch live shows! Or head down to Girard Ave. and grab a coffee at The Monkey & The Elephant, or grab a bite a NINE Thai or Ryebread!\nSchedule an Appointment today at:  show contact info","num_images":7,"lat":39.985607,"lng":-75.185429,"attrs":"['3BR \/ 1Ba', '918ft2', 'available now', '\\ntuesday 2022-11-29\\n', '\\nwednesday 2022-11-30\\n', '\\nthursday 2022-12-01\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T12:40:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561926642.html","post_id":7561926642,"result_date":"Sun Nov 27 2022 17:34:20 GMT+0000 ","title":"Laundry in Unit, Central Location, Ideal Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nApartment Features\n* Walk-in Closet\n* Garden Tub\n* Kitchen Island\n* Private Patio or Private Balcony (on select apartments)\n* Linen Closet\n* Stainless Steel Appliances\n* Washer and Dryer in unit","num_images":23,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1110ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-27T12:30:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561925489.html","post_id":7561925489,"result_date":"Sun Nov 27 2022 17:31:27 GMT+0000 ","title":"1 bed 1 bath","description":"A great 19th century gothic style house located in the borough has a 1 bedroom 1 bathroom apartment on the 1st floor available for rent. This apartment has a large eat in kitchen, large livingroom, another room for office or quiet reading, and large bedroom with 3 closets and built in shelving. Also private entrance through the screened in porch. Included is water, hot water, heat, snow removal, trash. Coin operated laundry on the 2nd floor. Off street parking in the rear of the house with a partially fenced in community backyard. Available January 15th. I will be holding an open house by appointment only Sunday December 4th. Time will be from 11 am to 4 pm. Every half hour. If you would like to schedule a time email me with a time and your name. I will let you know if your time is good or if we will need to change it. Thank you.","num_images":7,"lat":39.966641,"lng":-75.600097,"attrs":"['1BR \/ 1Ba', '900ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-27T12:27:27-0500"}]