[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551889582.html","post_id":7551889582,"result_date":"2022-10-31T03:14:46.000Z","title":"Charming classic rowhome **Fully furnished** 3br 2ba","description":"FULLY FURNISHED. Available Dec 1. A modern update on a classic Philadelphia rowhome with custom details and vintage touches. This 3 bedroom\/2 bathroom home was meticulously rebuilt from the studs. Outdoor space on every floor, tons of natural light, close to Frankford Ave, and a 7 minute walk from the El. This block is quiet and full of families on the block.\nWalk through the oversized wood and glass vintage front door into a serene, light-filled living room, dining room, and kitchen thanks to windows on three sides of the home. Huge custom front window, craftsman-built metal staircase, concrete kitchen countertops and reclaimed wood cabinet fronts are just a few of the special features in this home that you won't find anywhere else. Central Air. Nest thermostat included.\nThis house has tons of character with countless special details throughout. A quiet residential block with easy access to Martha Bar, Zig Zag, Loco Pez, Atlantis: The Lost Bar, Philly Brewing Company, Franny Lou’s Porch, boutique shops and thrift stores, and all that Frankford Ave and Front Street have to offer. Plus, it’s just three blocks from the El.\nPictures available in direct messages.\n","num_images":0.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2Ba', 'available dec 1', 'furnished', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T23:10:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551884052.html","post_id":7551884052,"result_date":"2022-10-31T03:12:25.000Z","title":"Apartment for rent","description":"Nestled in the desirable East Passyunk area of South Philadelphia, this fully remodeled bi-level 2 bed 1 bathroom apartment will be available mid-November 2022. Accompanied by myriad upgrades including central air and a freshly painted foyer this enchanting apartment is waiting for you to call it home. As you enter this winsome apartment be welcomed by a spacious living room and kitchen area.  The kitchen boasts upgraded appliances and brand-new cabinets, and the bathroom has been gloriously remodeled to provide a modern vibe with built-in shelving for extra storage for your towels or personal belongings. The spacious master bedroom includes ample closet space and two huge windows allowing for the warmth of natural light. The versatile second bedroom could be used as an office or a den, or even a walk-in closet for the tenet with a heavy wardrobe. Only a short stroll from E. Passyunk Avenue, which is dotted with outstanding restaurants and quaint little shops that you will be sure to love. Conveniently located two blocks away from Snyder Station as well as easy access to major highways like 95 & 76. Don't miss the opportunity to make this charming new apartment listing, your new home. Schedule your tour today!","num_images":1.0,"lat":39.9207,"lng":-75.1595,"attrs":"['2BR \/ 1Ba', 'available nov 16', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T22:37:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551857932.html","post_id":7551857932,"result_date":"2022-10-31T00:37:46.000Z","title":"Wonderful 3 bedroom, 1 bath For Rent","description":"Large two-story apartment conveniently located to2000 Bowler St, Philadelphia, PA . Private entrance to storage space\/mudroom. Enter apartment to kitchen with separate dining area. Stove\/oven, refrigerator, microwave, dishwasher and abundance of cabinet space. Adjustable first floorplan: Family Room\/with Vermont wood burning stove. Sliders to brick patio. First floor main bedroom or library. First floor office or nursery. Full bathroom with shower over tub, vanity and full size washer\/dryer laundry facility. Second floor boasts huge vaulted master bedroom with walk-in closet and dormered storage\/shelving\/hanging closet space.\nIf you are interested please message with you number Alex will call you. Thanks\n","num_images":4.0,"lat":40.0903,"lng":-75.041,"attrs":"['3BR \/ 1Ba', 'application fee details: $20 per adult (credit & background)', 'broker fee details: Free Broker fee :😀 😃', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', \"listed by: Realtor fee equal to one month's rent\", 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T20:33:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551833170.html","post_id":7551833170,"result_date":"2022-10-30T23:06:08.000Z","title":"One Bedroom Apartment","description":"One bedroom newly renovated apartment in Fishtown.  Walking distance to many attractions.   Ten minute drive to center city.  Several colleges are near by.  Walking distance to Rivers Casino.  Septa public transportation stops down the street. Penn Treaty trails is down the block.","num_images":17.0,"lat":39.967466,"lng":-75.12773,"attrs":"['1BR \/ 1Ba', 'available nov 4', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T19:02:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551816722.html","post_id":7551816722,"result_date":"2022-10-30T22:09:23.000Z","title":"Three bedroom, One bath","description":"Large two-story apartment conveniently located to the Boro and 611\/202 Bypass.  Private entrance to storage space\/mudroom.  Enter apartment to kitchen with separate dining area.  Stove\/oven, refrigerator, microwave, dishwasher and abundance of cabinet space.  Adjustable first floorplan:  Family Room\/with Vermont woodburning stove.  Sliders to brick patio.  First floor main bedroom or library.  First floor office or nursery. Full bathroom with shower over tub, vanity and full size washer\/dryer laundry facility. Second floor boasts huge vaulted master bedroom with walk-in closet and dormered storage\/shelving\/hanging closet space.","num_images":8.0,"lat":40.3054,"lng":-75.1489,"attrs":"['3BR \/ 1Ba', 'available nov 1', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T18:05:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551791908.html","post_id":7551791908,"result_date":"2022-10-30T21:03:57.000Z","title":"Online Payments Available, Pet-friendly living, BBQ and deck area","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:48-hour Maintenance CommitmentOnline Payments AvailableAlexa or Google Home Capable in all Apartments9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsGame Room with Billiards Table, Shuffle Board, and moreBBQ and deck areaFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingBark parkHuge walk-in closets with ample storageState-of-the-art fitness center overlooking the Manayunk canalUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/si7yek6r\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-10-30T16:48:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551704794.html","post_id":7551704794,"result_date":"2022-10-30T17:01:38.000Z","title":"Small 1 bedroom","description":"Sublease this cute little one bedroom on 50th and Cedar in West Philly.\nThe lease ends July 28th and you can move in immediately.\nIt's on the second floor, separate bedroom from the kitchen area, and has great light through a bay window in the bedroom.\nThe bed in the pictures is full size and fit well. There's also room for a large dresser and desk in the room.\n(excuse the unpacking mess)\nIf you would like a video, let me know.\nCall\/text me if you're interested at  show contact info\nThanks!\n","num_images":5.0,"lat":39.949975,"lng":-75.222914,"attrs":"['1BR \/ 1Ba', '400ft2', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:57:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551697992.html","post_id":7551697992,"result_date":"2022-10-30T16:58:32.000Z","title":"Awesome 3BD for rent","description":"Great property available for RENT starting immediately! This single family home with a cozy covered front porch is located in Hatboro Borough, and features new carpeting and fresh paint throughout most of this home. The great room and kitchen are located in the rear, with soaring 2-story vaulted ceilings with skylights and new luxury vinyl plank floors, with sliding glass doors to the deck and fenced rear yard. The kitchen features oak cabinets, new stainless steel refrigerator and new stainless steel gas range, a built-in microwave oven and a dishwasher. The mud room is off the side entry and leads to the first floor laundry room, kitchen and living room. There are three bedrooms, two are located on the first floor, along with a full bathroom. The second floor features a large loft area, great for a home office or playroom, and a main bedroom suite with a private full bathroom, sitting room or office\/play area. Other features include gas heat and central air conditioning, full basement, gas cooking and a shed in the fenced rear yard. Great location in a great neighborhood, Hatboro\/Horsham school district, and just minutes to County Line Rd, York Rd and the PA Turnpike - and a short walk to downtown Hatboro! Pets allowed on a case by case basis.","num_images":10.0,"lat":40.188951,"lng":-75.10473,"attrs":"['3BR \/ 2Ba', '1494ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-10-30T12:39:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551701345.html","post_id":7551701345,"result_date":"2022-10-30T16:52:05.000Z","title":"RECENTLY UPDATED, 3 BD \/ 3 BA HOME LOCATED IN NORTHEAST PHILLY!!!","description":"⭐⭐⭐ RECENTLY UPDATED, 3 BEDROOMS AND 3 BATH HOME LOCATED IN NORTHEAST PHILLY!!! ⭐⭐⭐\nProperty Address\n9331 Neil Road | Unit A | Philadelphia, PA 19115\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ COMPLETELY UPDATED\n✔️ LARGE 3 BEDROOM AND 3 BATHS HOME LOCATED IN NORTH EAST!!!\n✔️ SPACIOUS BEDROOMS!!!\n✔️ LARGE CLOSETS!!!\n✔️ LARGE LIVING ROOM\n✔️ BRAND NEW KITCHEN WITH NEW APPLIANCES\n✔️ LAUNDRY HOOK-UP\n✔️ DRIVEWAY FOR PARKING\n✔️ CENTRAL AIR!!!\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nVIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=v2aX8Q4NGN5\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in. (1 months rent and 2 months security)\n- The tenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\n\nDetails\nBeds\/Baths: 3BD\/3.0BA\nSquare Feet: 1,500\nRental Terms\nRent: $2,500.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $5,000.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":16.0,"lat":40.084822,"lng":-75.042885,"attrs":"['3BR \/ 3Ba', '1500ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:48:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551692576.html","post_id":7551692576,"result_date":"2022-10-30T16:48:06.000Z","title":"This 1216 square foot single family home has 3 bedrooms and 1.0 bathrooms.","description":"This 1216 square foot single family home has 3 bedrooms and 1.0 bathrooms. This home is located at 1206 County Line Rd, Bryn Mawr, PA 19010.","num_images":9.0,"lat":40.027,"lng":-75.333,"attrs":"['3BR \/ 1Ba', '1216ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:25:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551699626.html","post_id":7551699626,"result_date":"2022-10-30T16:47:39.000Z","title":"2BR\/1BA near DREXEL, PENN, and ART MUSEUM | Located in UNIVERSITY CITY","description":"2BR\/1BATH near DREXEL, PENN, and ART MUSEUM | Located in UNIVERSITY CITY!\nProperty Address\n613 N 32nd St | Philadelphia, PA 19104\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ BEST VALUE APARTMENT ⭐⭐⭐⭐⭐\n✔️ LARGE 2 BEDROOMS AND 1 BATH LOCATED IN UNIVERSITY CITY\n✔️ WALKING DISTANCE FROM THE ART MUSEUM\n✔️ 2ND-FLOOR WALK-UP\n✔️ LARGE LIVING ROOM\n✔️ SPACIOUS BEDROOMS\n✔️ HIGH CEILINGS\n✔️ CEILING FANS\n✔️ LAMINATED FLOORING\n✔️ CABLE READY\n✔️ CITY LIVING WITH A SUBURBAN FEEL\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for electric, gas, and water\nBuild your credit! We report rent payments to Experian!\nTO SCHEDULE A SHOWING:\n⭐⭐⭐ https:\/\/redblock.com\/apartment\/⭐⭐⭐\n**** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING **** You must make an appointment by completing this form https:\/\/redblock.com\/properties-for-rent\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: Drexel, UPENN, Penn, Powelton, University City, campus, art museum, clean, renovated, hardwood, center city, West Philly, west Philadelphia, redblock realty inc, redblock, red block, center city,2 bedrooms, two-bedrooms, 2BD, two BD, bedroom, septa, high ceilings, clean, spacious, close to center city, septa, transportation, easy commute\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 900\nRental Terms\nRent: $1,300.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,600.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":10.0,"lat":39.964772,"lng":-75.188784,"attrs":"['2BR \/ 1Ba', '900ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:43:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551699465.html","post_id":7551699465,"result_date":"2022-10-30T16:47:18.000Z","title":"Central Location, Upgraded Finishes Available, Pet Park","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1190ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:43:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551699156.html","post_id":7551699156,"result_date":"2022-10-30T16:46:35.000Z","title":"Take a Deep Breath and Relax Here at Park Lane!","description":"Available: 11\/30\/22\nAscott floor plan — 1,230 sq. ft. — $3,275\nThis corner-unit apartment has so much to offer! Our brand-new construction includes quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This Ascott also features spacious walk-in closets with custom shelving. This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1230ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-30T12:42:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551699052.html","post_id":7551699052,"result_date":"2022-10-30T16:46:21.000Z","title":"Incredible Features, Resort Style Pool, Upgraded Finishes Available","description":"The Point at West Chester is the perfect location for your new home. Explore our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nApartment Features\n* Disposal\n* Central Heat and Air\n* Ceiling Fan\n* Walk-in Closet\n* Roommate Friendly Floor Plan\n* Window Coverings\n* Pre-wired for internet and cable\n* Granite Countertops\n* Full sized Washer and Dryer in unit\n* Pantry\n* Breakfast Bar\n* Lofty Vaulted Ceilings\n* Linen Closet\n* Garden Tub\n* Private Patio or Private Balcony (on select apartments)\n* High Efficiency Lighting Fixtures\n* Stainless Steel Appliances\n* Refrigerator, Microwave, Dishwasher & Electric Stove","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '786ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:42:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551697475.html","post_id":7551697475,"result_date":"2022-10-30T16:42:10.000Z","title":"Completely Updated 4BR in Oxford Circle \/w finished basement!","description":"Completely Updated 4BR in Oxford Circle \/w finished basement and guestroom\nProperty Address\n6059 Alma Street | Philadelphia, PA 19149\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ COMPLETELY UPDATED\n✔️ LARGE 4 BEDROOM AND 1.5 BATHS HOME LOCATED IN NORTH EAST!!!\n✔️ SPACIOUS BEDROOMS!!!\n✔️ LARGE CLOSETS!!!\n✔️ FORMAL DINING ROOM\n✔️ FINISHED BASMENT WITH GUEST ROOM\n✔️ LAUNDRY HOOK-UP\n✔️ REAR DRIVEWAY FOR PARKING\n✔️ CENTRAL AIR!!!\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nVIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=cu5G7v8nENH\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in. (1 months rent and 2 months security)\n- The tenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\ntags: northeast Philadelphia, Oxford Circle, Naval Support, SEPTA, renovated, three bedroom, 4BR, basement, castor, lawncrest, cottman, frankford, mayfair\n\nDetails\nBeds\/Baths: 4BD\/1.5BA\nSquare Feet: 1,300\nRental Terms\nRent: $1,800.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,600.00\n\n#nata\n","num_images":12.0,"lat":40.035646,"lng":-75.082254,"attrs":"['4BR \/ 1.5Ba', '1300ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:38:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551696165.html","post_id":7551696165,"result_date":"2022-10-30T16:38:43.000Z","title":"SPACIOUS 1 BEDROOM & 1 BATH LOCATED IN POWELTON VILLAGE!","description":"SPACIOUS 1 BEDROOM & 1 BATH LOCATED IN POWELTON VILLAGE! SHORT DISTANCE TO PENN & DREXEL!\nProperty Address\n524 N Preston St | Philadelphia, PA 19104\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️POWELTON VILLAGE!\n✔️BEST VALUE APARTMENT ⭐⭐⭐⭐⭐\n✔️Large 1 BEDROOM!!!!\n✔️Spacious living room\n✔️Updated kitchen, bath, floors, windows, and appliances!\n✔️1st fl Apartment, almost no steps!\n✔️Laminate flooring\n✔️Plenty of closets\n✔️Backyard access\n✔️Walk to Drexel and Penn\n✔️A short ride from USP\n✔️Close to public transportation\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- 3 months rent to move in.\n*** Income requirement of 3 times the rent ***\n*** Build your credit! We report rent payments to Experian! ***\ntags: 1 BD, 1 bedroom, one bath, 1BA, REDBLOCK REALTY INC, University of the Sciences, University of Pennsylvania School of Veterinary Medicine, University of Pennsylvania School of Nursing, Hospital of the University of Pennsylvania, Penn Museum, The Children's Hospital of Philadelphia, Drexel University, West Philadelphia High School, Cedar Park, University City, Center City, Springfield Ave, Squirrel Hill, Walnut Hill, Spruce Hill, Saunders Park, UPENN, PENN, Va Hospital: Schaefer William J, 19143, 19104, 19121, 19139, 19142, 19145, 19146, 19103, 19130, 19151\n\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 675\nRental Terms\nRent: $950.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,900.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":8.0,"lat":39.961814,"lng":-75.20388,"attrs":"['1BR \/ 1Ba', '675ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:34:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551694736.html","post_id":7551694736,"result_date":"2022-10-30T16:34:59.000Z","title":"LARGE 4 BEDROOMS AND 1 BATH HOME LOCATED IN OAKLANE!","description":"LARGE 4 BEDROOMS AND 1 BATH HOME LOCATED IN OAKLANE!\nProperty Address\n5031 N Marvine st | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED LARGE 4-BEDROOM HOUSE! ⭐⭐⭐⭐⭐\n✔️ LARGE KITCHEN\n✔️ RESTORED PARQUET FLOORING\n✔️ CUSTOM WOOD-TRIMMED LIVINGROOM\n✔️ CENTRAL HEATING\n✔️ OPEN LAYOUT\n✔️ LOTS OF CLOSET SPACE\n✔️ LARGE BASEMENT FOR STORAGE\n✔️ WASHER\/DRYER HOOK-UP\n✔️ BACKYARD\n✔️ SPACIOUS FRONT PATIO\n✔️ CLOSE TO SHOPPING\n✔️ SHORT WALK TO SEPTA\n✔️ EASY ACCESS TO MAJOR ROUTES\n✔️ EASY COMMUTE TO AND FROM THE CITY\n✔️ THIS PROPERTY WON'T LAST LONG, INQUIRE NOW!\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in.\n- Tenant pays for electricity, gas, and a water\n***VIDEO TOUR: https:\/\/my.matterport.com\/show\/?m=tvyEEWtMt7i\n*** Build your credit! We report rent payments to Experian! ***\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: Mt Airy, Germantown, Logan, Olney, Cheltenham, septa, parking, laundry, commuter, Cheltenham, west oak lane, oak lane, La Salle, Redblock, red block, Redblock Realty Inc, four bedrooms, 4br, einstein hospital, college of optometry, 19144, 19141,19126,19138,19119, 19120, Redblock realty, 4BR, 4 bedrooms, La Salle University, Ogontz, Mount Airy, Logan, Germantown, Olney, Route 309, spacious, buses, schools, Philadelphia, Broad Street, Albert Einstein Medical Center, Pennsylvania College of Optometry, SEPTA, commuter, Fern Rock Transportation Center, Gratz College, Philadelphia High School for Girls, Widener Memorial School, Lindley Academy Charter School, Delaware Valley Charter High School, Thurgood Marshall School, Lindley Playground\n\nDetails\nBeds\/Baths: 4BD\/1.0BA\nSquare Feet: 1,700\nRental Terms\nRent: $1,700.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,400.00\n\nPet Policy\nCats allowed\nDogs allowed\n#nata\n","num_images":13.0,"lat":40.029006,"lng":-75.142233,"attrs":"['4BR \/ 1Ba', '1700ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:30:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551692928.html","post_id":7551692928,"result_date":"2022-10-30T16:30:08.000Z","title":"UPDATED 1 BEDROOM AND 1 BATH APT LOCATED IN NORTHEAST\/TACONY AREA!","description":"⭐⭐⭐UPDATED 1 BEDROOM AND 1 BATH APARTMENT LOCATED IN NORTHEAST\/TACONY AREA!⭐⭐⭐\nProperty Address\n4831 Longshore Ave - 1F | Philadelphia, PA 19135\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n✔️ SPACIOUS 1 BEDROOM APARTMENT LOCATED IN TACONY AREA!\n✔️ BEST VALUE APARTMENT ⭐⭐⭐\n✔️ UPDATED KITCHEN W\/ TILES FOR EASY CLEANING\n✔️ KITCHEN IS EQUIPPED W\/ A STOVE, FRIDGE, AND MICROWAVE\n✔️ SPACIOUS LIVING ROOM SPACE\n✔️ LARGE BEDROOM\n✔️ LOCATED ON THE 1ST FL, NO STEPS!\n✔️ OPEN LAYOUT\n✔️ LAMINATE FLOORING THROUGHOUT\n✔️ CLOSE TO PUBLIC TRANSPORTATION\n✔️ EASY ACCESS TO I-95\n✔️ SHORT WALK TO DISSTON PARK\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in.\n- Tenant pays their own utilities plus a water fee.\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING ****\n*** Build your credit! We report rent payments to Experian! ***\nTags: 1BD, 1 bedroom, spacious, luxurious, 1st floor, apartment, private house, Tacony, Wissinoming, Mayfair, Frankford ave, Torresdale, Disston Park, Disston Recreation Center, I-95, highway, Vogt Playground, Delaware Expressway, Lardner's Point Park, Moss Park, Trenton Line, septa, train, commuter, easy access to the city, Franklin Towne Charter High School, REDBLOCK Realty inc, red block, 19135, 19136, 19124, 19149, 19137\nAvailability and pricing is subject to change.  Information Deemed Reliable But Not Guaranteed. All information is subject to errors, omissions, or withdrawal without notice.\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 700\nRental Terms\nRent: $900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,800.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":9.0,"lat":40.024291,"lng":-75.041996,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:26:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551690450.html","post_id":7551690450,"result_date":"2022-10-30T16:22:44.000Z","title":"Yoga and Ballet Studio, Visit Your New Home, Leasing Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills offers all of the amenities your looking for and some you didn't even know you wanted. Check out our two-story clubhouse-complete with flat screen TVs, a 24-hour fitness center and a pool table. Enjoy our on-site yoga studio or our outdoor putting green. Visit us today!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Full sized Washer and Dryer in unit\n* Granite Countertops\n* Wood-Like Floors\n* Extra Storage\n* Private Patio or Private Balcony (on select apartments)\nCommunity Features\n* Fitness Studio\n* Swimming Pool\n* Yoga Lounge\n* Community Lounge\n* TV Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Sun Deck\n* Putting Green\n* Outdoor Grill Area\n* Easy Freeway Access\n* Pet Salon\n* Professionally Managed\n* Bark Park\n* Bocce Ball\n[#9461887]","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-30T12:18:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551690132.html","post_id":7551690132,"result_date":"2022-10-30T16:21:51.000Z","title":"NEWLY RENOVATED, 2 BEDROOMS & 1 BATH APT LOCATED IN WEST PHILADELPHIA!","description":"⭐⭐⭐ NEWLY RENOVATED, 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WEST PHILADELPHIA!!! ⭐⭐⭐\nProperty Address\n1313 N 53rd St - 2F | Philadelphia, PA 19131\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT!!!!⭐⭐⭐\n✔️SPACIOUS! FULLY RENOVATED 2 BEDROOM & 1 BATH APARTMENT\n✔️BEAUTIFUL NEW KITCHEN WITH GRANITE COUNTERTOP ISLAND\n✔️ALL NEW! LARGE KITCHEN\/LIVING ROOM AREA!\n✔️NEW BAMBOO FLOORING THROUGHOUT\n✔️DESIGNER TILES\/BACKSPLASH\/ GRANITE COUNTERTOP TILED KITCHEN\n✔️EVERYTHING IS ELECTRIC\n✔️BRAND NEW STAINLESS STEEL STOVE\/FRIDGE\/MICROWAVE\n✔️MOVE-IN READY\n✔️LARGE BEDROOMS\n✔️WASHER\/DRYER HOOKUP\n✔️SHARED FRONT PORCH\n✔️DESIGNER PAINT\n✔️EASY ACCESS TO SEPTA\n✔️EASY ACCESS TO AND FROM THE CITY\n✔️WILL NOT LAST LONG! INQUIRE TODAY! REDBLOCK.COM\nVirtual Tour:  https:\/\/my.matterport.com\/show\/?m=aRx33RwBYbe\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 735\nRental Terms\nRent: $1,100.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,200.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":11.0,"lat":39.973166,"lng":-75.227588,"attrs":"['2BR \/ 1Ba', '735ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:17:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551689615.html","post_id":7551689615,"result_date":"2022-10-30T16:20:25.000Z","title":"Laundry in Unit, Central Location, Ideal Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nApartment Features\n* Washer and Dryer in unit\n* Stainless Steel Appliances\n* Walk-in Closet\n* Linen Closet\n* Private Patio or Private Balcony (on select apartments)\n* Garden Tub\n* Kitchen Island\nCommunity Features\n* TV Lounge\n* Billiards\n* Outdoor Grill Area\n* Pet Salon\n* Bark Park\n* Sun Deck\n* Professionally Managed\n* Spa\n* Swimming Pool\n* Easy Freeway Access\n* Minutes from Restaurants, Shopping, and Much More\n* Yoga Lounge\n* Community Lounge\n* Fitness Studio","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1186ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T12:16:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551689428.html","post_id":7551689428,"result_date":"2022-10-30T16:19:55.000Z","title":"Call for Details, Clubhouse with Game Room, Visit Your New Home","description":"Prepare to fall in love with The Point at Glen Mills! Kick back in our community lounge. Watch your furry friend frolic with his furry friends in our dog park. Challenge your friends to a game of golf on our outdoor putting green. Life is good at The Point at Glen Mills. Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-30T12:15:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551678541.html","post_id":7551678541,"result_date":"2022-10-30T15:50:48.000Z","title":"Fitness Center, Incredible Features, Central Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nBe the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '815ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T11:46:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551644652.html","post_id":7551644652,"result_date":"2022-10-30T15:43:45.000Z","title":"Stunning 4BD available for rent","description":"BRAND-NEW wall to wall carpeting JUST installed, last 8 pics show new carpeting!! Move right in to this charming 4 bedroom cape style house in Croydon! Spend the evenings relaxing on the covered porch on a very quiet street. Large driveway with plenty of parking.  Upstairs has been remodeled in to a master suite with full master bathroom. Large dining room with crown molding and open concept kitchen area with recessed lighting, oak cabinetry and beautiful center kitchen island. Full bath on main floor with laundry area. New windows and shed in the huge backyard.  Low taxes, close to State Park, NJ, I-95 and PA Turnpike.","num_images":24.0,"lat":40.0876,"lng":-74.901127,"attrs":"['4BR \/ 2Ba', '1688ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-10-30T10:03:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551664291.html","post_id":7551664291,"result_date":"2022-10-30T15:30:07.000Z","title":"**OFF-campus  3 bed 2 bath housing option known as Temple Park East**","description":"This luxury community offers modern amenities such as secure keyless entry, video intercoms and wall-mounted TV's! Enjoy having direct access to Temple main campus! Enter this spacious bi-level apartment to find two living areas, equally sized bedrooms, a galley style kitchen with an island and modern updates throughout.","num_images":7.0,"lat":39.980301,"lng":-75.146305,"attrs":"['3BR \/ 2Ba', 'available now', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-10-30T11:06:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551657523.html","post_id":7551657523,"result_date":"2022-10-30T15:29:13.000Z","title":"Cozy 2 Bedroom 1 Bath Apartment Available for rent","description":"Clean Location! Two Bedroom Apartment with modern kitchen and bath. Heat and hot water included in the rent! Our charming, air-conditioned apartments include: plush wall-to-wall carpeting, 2\" faux-woodgrain venetian window treatments, stainless steel appliances with microwave and dishwasher. Decorator designed hall entrances and on-site laundry. Just a minute walk to the Philadelphia Railroad Philadelphia Station gives you a convenient commute to Philadelphia! Near Philadelphia of Siena and SUNY Stonybrook. Great walkability score to Philadelphia Village shopping and restaurants! Close to scenic Nesconset waterway for canoeing\/kayaking. Near Route 25, Route 111 and Route 347. Philadelphia School District Elementary School: Philadelphia Elementary Middle School: Philadelphia Middle School High School: Philadelphia High School- If Interested Please Text: lucy58756𝐆𝐦𝐚𝐢𝐥com\nSe Renta Bonito & Impecable Departamento en la Colonia Nueva\nRenta $750 MN \/ mes + servicios\nSe necesita aval, 1 mes de renta & 1 mes de depósito\nEste departamento está por el Callejón Larroque y tiene mantenimiento reciente. Comparte el mismo lote que los departamentos que dan a la Avenida, pero solo se tienen acceso por la parte de atrás.\nSe recomienda para ejecutivo, máximo 2 adultos. . Si trabajas en Calexico o el Valle Imperial, este departamento es ideal para ti ya que está ubicado a 5 minutos de la garita del centro.\n- 2 recamaras\n- 1 baño completo (remodelado con sanitario & sink nuevo!)\n- cocineta impecable\n- estufa con campana\n- A\/C con mantenimiento reciente\n- boiler\n- refrigerador\n- conexiones para lavadora & secadora\n- estacionamiento cercado para 1 automóviles\n- mantenimiento reciente\nMárcanos o mándanos para agendar cita y mostrarte el departamento sin compromiso!\n","num_images":4.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-30T10:46:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551661418.html","post_id":7551661418,"result_date":"2022-10-30T15:24:42.000Z","title":"Bedrooms 2 Full Baths Handicapped House","description":"Built in 2008, a beautiful 2 story wheelchair accessible house with 1st floor bedroom & handicapped bathroom\n5 bedrooms 2 full baths\nGranite countertops, hardwood floors throughout, with w\/d hookup, and back yard\n$1995 per month\n322 North Edgewood Street, Phila., PA 19139","num_images":8.0,"lat":39.9612,"lng":-75.2303,"attrs":"['5BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-30T10:58:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551666579.html","post_id":7551666579,"result_date":"2022-10-30T15:16:42.000Z","title":"Charming 2 bedroom 1 bath in Media.","description":"Charming two bedroom one bath apartment for rent in Media. Rent includes heat, hot and cold water, sewer, trash and snow removal, and all outside maintenance. Laundry facilities are located in the basement. The apartment is a five minutes walk to Granit Run shops and a five minutes drive to the center of Media. Free parking is located in front of the building. Credit check, income verification,  as well as background check will be done.  Upon signing the lease first and last month's rent will be due as well as one month's security","num_images":6.0,"lat":39.914612,"lng":-75.424334,"attrs":"['2BR \/ 1Ba', '0937ft2', 'available nov 1', 'air conditioning', 'application fee details: 35', 'condo', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T11:12:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551663867.html","post_id":7551663867,"result_date":"2022-10-30T15:14:55.000Z","title":"Large 2 Bedroom Garden Style Apartments","description":"Contact info:Rental Agent | Woodbrook Lane Apartments |  show contact info\n| Woodbrook Lane Apartments7525 Devon St, Philadelphia, PA 19119$1275\/mo KEY FEATURESBedrooms:  2 BedBathrooms:  1 BathParking:  4+ Off street | Guest parkingLease Duration:  1 MonthPets Policy:  Cats & Dogs OKLaundry:  In UnitProperty Type:  ApartmentRENTAL FEATURESLiving roomDining roomWalk-in closetFamily roomStorage spaceBreakfast nookPantryRange \/ OvenRefrigeratorDishwasherGarbage disposalHeat: forced airCentral A\/CAir conditioningCable-readyHigh-speed internetIntercom systemHardwood floorTile floorCOMMUNITY FEATURESNew propertyControlled accessNear transportationGuest parkingOff-street parkingContact info: Property Manager:  show contact info\nWoodbrook Lane Apartments\n","num_images":1.0,"lat":40.065937,"lng":-75.191871,"attrs":"['2BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T11:04:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551653067.html","post_id":7551653067,"result_date":"2022-10-30T14:54:10.000Z","title":"**Spacious 2 bedroom 1 bath ranch style home**","description":"Originally built in 1973 as The Plaza Apartments, The Terrace has an iconic Philadelphia location and shape! Due to its round structure, each apartment has a spacious private balcony with sweeping views of Center City and the world beyond. Located just a few blocks to the towering Comcast headquarters and an easy walk to Philadelphia's business district and premier shopping and dining destinations.\nLocation-The Terrace on 18th St, # 1704, 1776 Benjamin Franklin Pkwy, Philadelphia, PA 19103\n","num_images":1.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '682ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T10:32:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551655656.html","post_id":7551655656,"result_date":"2022-10-30T14:50:32.000Z","title":"New Beginnings Here at Park Lane!!","description":"Available: 11\/30\/22\nBalmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-30T10:40:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551639054.html","post_id":7551639054,"result_date":"2022-10-30T13:47:35.000Z","title":"Buy A House No Money Down","description":"Buy a home with no money down, no upfront closing costs & No realtor.\nOwner Occupant only.\n12 Monthly on time payments.\nMust have minimum 680 credit score.\nMinimum 2 years on the job.\nMaximum 33% debt to income ratio.\nMust qualify 2% above current interest rates\n","num_images":0.0,"lat":40.3054,"lng":-75.1489,"attrs":"['3BR \/ 2Ba', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T09:43:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551638485.html","post_id":7551638485,"result_date":"2022-10-30T13:45:36.000Z","title":"Buy A House No Money Down","description":"Buy a home with no money down, no upfront closing costs & No realtor.\nOwner Occupant only.\n12 Monthly on time payments.\nMust have minimum 680 credit score.\nMinimum 2 years on the job.\nMaximum 33% debt to income ratio.\nMust qualify 2% above current interest rates\n","num_images":0.0,"lat":40.3054,"lng":-75.1489,"attrs":"['3BR \/ 2Ba', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T09:41:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551619645.html","post_id":7551619645,"result_date":"2022-10-30T13:11:10.000Z","title":"A charming1-2 bedroom apartments*with amenities","description":"7715 McCallum St, Philadelphia, PA 19118\nA charming1-2 bedroom apartments for rent with amenities designed to complement your busy lifestyle. Our grounds feature meticulous landscaping and artistic sculpture gardens, where you can relax and recharge. Our interiors are designed for your utmost comfort and convenience. Pets friendly (Cats & Dog). No smoking.\nFEATURES\n- Hardwood floors\n- Water, trash, gas and sewer included\n- Amenities: Refrigerator, Microwave, Dishwasher, Washer, Dryer, Range.\n- Monthly rental preferred\n- Heating: Forced Air, Other\n","num_images":1.0,"lat":40.057556,"lng":-75.208504,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T08:07:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551615479.html","post_id":7551615479,"result_date":"2022-10-30T12:00:16.000Z","title":"Where Luxury Meets Convenience!!","description":"Available: 11\/20\/22\nApt. 2510 — Oxford floor plan — 1,203 sq. ft. — $3,510\nThis 5th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-30T07:32:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551787751.html","post_id":7551787751,"result_date":"2022-10-30T20:40:15.000Z","title":"University City 3\/1 w\/1-Car parking-Nr City Ave\/Mints to Airport, DT !","description":"This beautiful and spacious Overbrook townhome is now available for immediate move in. This home features original hardwood floors throughout and plenty of storage space. The second floor offers 3 sunny bedrooms and 1 bathroom. This home comes generously equipped with a one car garage, rear deck, and a full finished basement. Conveniently located near public transportation, City Avenue and Lancaster Avenue, this home provides an easy commute to downtown Philadelphia, the airport, and University City.\nPets allowed. No Need checks Credit and background required.\nRenter is responsible for all utilities- gas, electricity and water.\nUniversity City\nCity Avenue\nLancaster Avenue\nPlenty of Storage Space\nRear Deck","num_images":17.0,"lat":39.977114,"lng":-75.253969,"attrs":"['3BR \/ 1Ba', '1110ft2', 'available now', '\\nwednesday 2022-11-02\\n', '\\nthursday 2022-11-03\\n', '\\nfriday 2022-11-04\\n', 'air conditioning', 'application fee details: No Need !', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T16:36:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551787211.html","post_id":7551787211,"result_date":"2022-10-30T20:38:38.000Z","title":"Oh my! What a gorgeous place! See this 2 bed, 2 bath for yourself!","description":"Come home to a great community - Millview Apartments!Address: 100 Cobblestone Dr Coatesville, PA 19320Beds: 2  \/ Baths: 2 \/ Size: 1178 sq ft   Monthly Rent: $1658 - $2225Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.Security Deposit: CallLength of Lease: Variable show contact info\nProperty Features: ➢ Business Center➢ On-Site Leasing Office➢ Pet-Friendly➢ Private Garages In Select Units➢ 24-Hour Emergency Maintenance➢ Coffee Bar Clubhouse Kitchen➢ Resident Referral BonusesApartment Amenities:➢ Built-In Microwave➢ Central Heat & Air Conditioning➢ Disability Access In Select Units➢ Dishwasher➢ Full-Size Washer & Dryer In Every Apartment➢ Mini Blinds On All Windows➢ Refrigerator\/Freezer With Ice Maker➢ Walk-In ClosetsPets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. Business Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMReady to Lease? Call our office at  show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/Proudly managed by Paradise Management, LLCEQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T16:34:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551783796.html","post_id":7551783796,"result_date":"2022-10-30T20:29:00.000Z","title":"Enjoy - Sunny 2Bed\/1Ba Apartment .W\/ Beautiful Kitchen!!","description":"Convenient one level living in Philadelphia, PA. Enjoy the easy living from this well maintained, 2 bedroom, one bath one level condo . Open, spacious & sunny! Enjoy the flexible floor plan with beautiful kitchen with lots of cabinets & counter space including breakfast bar overlooking dining\/living room. 9' ceilings throughout. Laundry\/utility room - great for extra storage. Large bedroom opens to full bath. Assigned underground parking. heat, central AC and hot water. Enjoy the fitness and meeting room on the 1st floor plus cozy lobby with sitting area and fireplace. Secured building, convenient location, walk to ALDI & Family Dollar .","num_images":4.0,"lat":40.0369,"lng":-75.0664,"attrs":"['2BR \/ 1Ba', 'application fee details: App fee- $5 every applicants (no credit & background) & $25 lease processing fee', 'broker fee details: No brokers fee!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', \"listed by: Pre-War Realty ONE MONTH'S RENT!!!\", 'attached garage', 'rent period: monthly']","posted_date":"2022-10-30T16:25:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551783158.html","post_id":7551783158,"result_date":"2022-10-30T20:27:23.000Z","title":"Ready to lease! Beautifully designed 2 bed 2 bath apartment","description":"2 Bedroom  2 Bathroom | 1018 sq ft | $1650 - $2215\/Month Millview Apartments100 Cobblestone Dr Coatesville, PA 19320 show contact info\nDescription: Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home. Apartment Amenities:➢ Built-In Microwave➢ Central Heat & Air Conditioning➢ Disability Access In Select Units➢ Dishwasher➢ Full-Size Washer & Dryer In Every Apartment➢ Mini Blinds On All Windows➢ Refrigerator\/Freezer With Ice Maker➢ Walk-In ClosetsOur Residents Enjoy:➢ Business Center➢ On-Site Leasing Office➢ Pet-Friendly➢ Private Garages In Select Units➢ 24-Hour Emergency Maintenance➢ Coffee Bar Clubhouse Kitchen➢ Resident Referral BonusesAdditional Details:Deposit: CallTerms: VariablePets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/EQUAL HOUSING OPPORTUNITY7252BEBBC7094AC\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1018ft2', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T16:23:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551781898.html","post_id":7551781898,"result_date":"2022-10-30T20:23:41.000Z","title":"Ready to lease! 1 bed 1 bath home. Check us out!","description":"Millview Apartments - A place to call home! Bed: 1 \/ Bath: 1  Sq. Footage: 845 sq ft Rent: $1570 - $2075\/MonthTerms: Variable show contact info\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Our Apartment Homes Feature:   ● Built-In Microwave● Central Heat & Air Conditioning● Disability Access In Select Units● Dishwasher● Full-Size Washer & Dryer In Every Apartment● Mini Blinds On All Windows● Refrigerator\/Freezer With Ice Maker● Walk-In Closets Our Residents Enjoy:  ● Business Center● On-Site Leasing Office● Pet-Friendly● Private Garages In Select Units● 24-Hour Emergency Maintenance● Coffee Bar Clubhouse Kitchen● Resident Referral BonusesContact Info: show contact info\n100 Cobblestone Dr Coatesville, PA 19320 Website: https:\/\/www.apartmentsincoatesvillepa.com\/Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. EQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T16:19:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551774249.html","post_id":7551774249,"result_date":"2022-10-30T20:02:26.000Z","title":"Lofty Olde Kensington 2bd w\/Spacious Shared Yard","description":"2106 North Orkney Street is less than a mile from Fishtown's booming Frankford Avenue and a multitude of independently-owned restaurants, bars and boutiques. SEPTA's Berks Street Station is just a few blocks away from an eight minute commute to City Hall. This modern space offers a lofty first floor with soaring ceilings stainless steel kitchen suite, front-loading washer\/dryer and an entire lot that is a shared yard space. The second floor features two bedrooms with a Jack and Jill bathroom between the two. There are hardwood floors throughout, ceiling fans in each room and central air\/heat. Renters pay for gas, water and electricity. Pets are negotiable with a 300 deposit per pet.\nVideo tour: https:\/\/youtu.be\/KWxwX0X3Zps\nPhillyLiving Management Group\n728 S. Broad St. Phila PA 19146\nshow contact info","num_images":12.0,"lat":39.982877,"lng":-75.141724,"attrs":"['2BR \/ 1Ba', '1400ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-10-30T15:58:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551772607.html","post_id":7551772607,"result_date":"2022-10-30T19:57:49.000Z","title":"On-site bike storage, BBQ and deck area, Pet-friendly living","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Alexa or Google Home Capable in all ApartmentsState-of-the-art fitness center overlooking the Manayunk canalPet-friendly livingOn-site bike storageBark parkGame Room with Billiards Table, Shuffle Board, and more9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingBBQ and deck area48-hour Maintenance CommitmentBocce ball fieldHuge walk-in closets with ample storageCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/cqhpgrmp\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1364ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-10-30T15:53:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551770874.html","post_id":7551770874,"result_date":"2022-10-30T19:56:56.000Z","title":"BBQ and deck area, Pet-friendly living, Online Payments Available","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Huge walk-in closets with ample storageGame Room with Billiards Table, Shuffle Board, and moreJogging trail right outside your door48-hour Maintenance CommitmentFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingBBQ and deck areaUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsBocce ball fieldAlexa or Google Home Capable in all ApartmentsUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingMarble master baths, some with deep linen storageUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/447q6wto\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-10-30T15:48:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551763129.html","post_id":7551763129,"result_date":"2022-10-30T19:54:42.000Z","title":"50Arbor Rd1009 plus utilities ~ complete remodel|Lots of rm to garden!","description":"$ 1009 plus utilities Conveniently located in the heart of philadelphia  ,quiet street, this adorable complete remodel, only blocks from shopping and restaurants! Featuring new interior\/exterior paint, lots of natural lighting, lots of character, high ceilings, beautifully cared for original hardwood floors, fireplace, kitchen is all new, flooring, quartz countertops, slow close cabinets and new stainless steel appliances, feature wall will wow you with countertop to ceiling tile, marble floating shelves and brass accents, cute dining nook and laundry\/pantry. 2 bedrooms with lots of natural light and a brand new bathroom. Finished basement has a Master Suite, egress window, large closet, double sink vanity, family room with electric fireplace. Lots of room to garden! Looking for ideal tenants, respectful, great credit score, great references. No smoking, vaping, or drugs, no pets.","num_images":6.0,"lat":40.1868,"lng":-75.0071,"attrs":"['3BR \/ 2Ba', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-10-30T15:27:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551768653.html","post_id":7551768653,"result_date":"2022-10-30T19:46:42.000Z","title":"On-site bike storage, Pet-friendly living, Bark park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Online Payments AvailableUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsAlexa or Google Home Capable in all ApartmentsUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densHuge walk-in closets with ample storageGame Room with Billiards Table, Shuffle Board, and moreState-of-the-art fitness center overlooking the Manayunk canalPet-friendly livingOn-site bike storageBocce ball fieldFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/itgm4ovr\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['1BR \/ 1Ba', '768ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-10-30T15:42:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551762081.html","post_id":7551762081,"result_date":"2022-10-30T19:38:49.000Z","title":"!!## brick home - at 79 Valley Dr !! fabulous bath\/shower\/closet! Avil","description":"This gorgeous property. move-in ready! A beautiful 3bed\/2bath brick home, +hardwood floors throughout, open living concept. Kitchen has granite, a long bar seating counter, all stainless steel appliances, gas stove, pantry & eat-in area. Master has tray ceilings & crown molding detail & fabulous bath\/shower\/closet! 2-car garage, NEW RV cover, NEW 30X30 barn with concrete path from house to barn. Barn has electric and water. Fenced area for livestock. Don't miss! ALL EMAILS MUST HAVE A CONTACT NUMBER. Messages WITHOUT PHONE NUMBERS WILL NOT GET A RESPONSE.","num_images":4.0,"lat":40.1868,"lng":-75.0071,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-30T15:24:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551743267.html","post_id":7551743267,"result_date":"2022-10-30T19:30:25.000Z","title":"Welcome to This Updated Multi-Family Home in Philadelphia","description":"Welcome to This Updated Multi-Family Home has Two Wonderfully cared for units w\/d Private access to each. The Bright First floor unit Features Two bedrooms, One bath w\/d a Large kitchen space, dining room & Living room, accessed through the Rear Entrance & staircase Leading to a Large kitchen w\/d Peninsula, Great as a Breakfast nook or Everyday dining.","num_images":5.0,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 1Ba', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-10-30T14:36:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551760510.html","post_id":7551760510,"result_date":"2022-10-30T19:24:34.000Z","title":"Putting Green , Pet Spa, Clubhouse with Game Room","description":"Home is where the heart is, and here at The Point at Glen Mills, it's never been easier to love where you live. Contact us today to schedule your tour. You'll be glad you did!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with granite countertops, stainless steel appliances and a breakfast bar. this unit also features a large entry closet, full sized washer\/dryer, linen closets, and a private balcony. The bedrooms features walk-in closets, and ensuite bathrooms.\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1095ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-10-30T15:20:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551752147.html","post_id":7551752147,"result_date":"2022-10-30T19:02:59.000Z","title":"Studio for rent","description":"Great studio space with kitchen and bathroom inside. Location is walking distance to shops\/ trail\/restaurants and train station. Serious inquiries only. No pets or smoking allowed","num_images":0.0,"lat":40.063194,"lng":-75.39093,"attrs":"['1BR \/ 1Ba', 'available now', 'house', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-30T14:58:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551749433.html","post_id":7551749433,"result_date":"2022-10-30T18:56:05.000Z","title":"2bedroom\/1bath","description":"Great location \/ available apartment for rent","num_images":0.0,"lat":40.00863,"lng":-75.498047,"attrs":"['2BR \/ 1Ba', 'available now', '\\nsaturday 2022-11-05\\n', '\\nmonday 2022-11-07\\n', '\\ntuesday 2022-11-08\\n', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-30T14:52:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551741223.html","post_id":7551741223,"result_date":"2022-10-30T18:35:13.000Z","title":"Parking Garage, Modern Amenities, Incredible Features","description":"The Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nAt The Point at Exton, you're exactly where you want to be in a place that brings out the best in life. Contact us today for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, walk-in closet, and a washer\/dryer!\nApartment Features\n* Granite Countertops\n* Garden Tub\n* Stainless Steel Appliances\n* Quartz Countertops\n* Kitchen Island\n* Washer and Dryer in unit\n* Wood-Like Floors","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '732ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-30T14:31:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551740943.html","post_id":7551740943,"result_date":"2022-10-30T18:34:34.000Z","title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"The Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-10-30T14:30:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551740233.html","post_id":7551740233,"result_date":"2022-10-30T18:32:44.000Z","title":"Package Room, Central Location, Ideal Location","description":"Our pet-friendly studio, one, two and three bedroom apartments in Exton deliver distinctive living in one of the area's most desired locations. The Point at Exton is the perfect community for your new home!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, ensuite bathrooms, walk-in closets, and a washer\/dryer!\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['2BR \/ 2Ba', '1248ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-30T14:28:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551739064.html","post_id":7551739064,"result_date":"2022-10-30T18:29:44.000Z","title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nWhen you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nApartment Features\n* Walk-in Closet\n* Breakfast Bar\n* Pantry\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Private Patio or Private Balcony (on select apartments)\n* High Efficiency Lighting Fixtures\n* Roommate Friendly Floor Plan\n* Stainless Steel Appliances\n* Granite Countertops\n* Lofty Vaulted Ceilings\n* Disposal\n* Full sized Washer and Dryer in unit\n* Window Coverings\n* Pre-wired for internet and cable\n* Linen Closet\n* Central Heat and Air\n* Ceiling Fan\n* Garden Tub\nCommunity Features\n* Community Kitchen\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Swimming Pool\n* Extra Storage\n* Bark Park\n* Community Lounge\n* Renters Insurance is Required\n* Playground\n* Dry Cleaning and Laundry Service\n* Package Acceptance\n* Fitness Studio\n* Sun Deck\n* Short or Long Term Lease Available\n* Professionally Managed\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Long Term Lease Available\n* Gaming Area\n* Outdoor Grill Area\n* Movie Theatre\n* EV Charging\n* After-Hours Emergency Maintenance\n* WiFi Access\n* Credit Cards Accepted\n* TV Lounge\n* Billiards\n* Pet Salon\n* Elevator\n* Landscaped Courtyards\n* Minutes from Restaurants, Shopping, and Much More\n* Bike Racks\n* Easy Freeway Access\n* Non Smoking Community\n* Controlled Access\n* Garage Parking\n[#9462016]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1202ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T14:25:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551730269.html","post_id":7551730269,"result_date":"2022-10-30T18:07:03.000Z","title":"Spacious 2 Bedroom single family home!!","description":"Recently updated 2nd floor 2 bedroom apartment located in Darby! Fresh paint, beautiful hardwood flooring, updated kitchen with subway tiles, and lots of natural light! Utilities are included. {8.5.9}{78O2.9.7.5}","num_images":1.0,"lat":39.9176,"lng":-75.2696,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-10-30T14:03:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551729769.html","post_id":7551729769,"result_date":"2022-10-30T18:05:47.000Z","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551713474.html","post_id":7551713474,"result_date":"2022-10-30T17:33:51.000Z","title":"Spacious Units! Walk-in closets! Floor to ceilings windows!","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Front Desk attendant during mornings and evenings to greet you and assist you with anything and everythingBark park9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardOnline Payments AvailableGame Room with Billiards Table, Shuffle Board, and moreUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densOn-site bike storageUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingPet-friendly livingBocce ball fieldHuge walk-in closets with ample storageJogging trail right outside your doorCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/skeatxag\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-10-30T13:19:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551713068.html","post_id":7551713068,"result_date":"2022-10-30T17:29:49.000Z","title":"Amazing 1bd 1ba Apartment","description":"This unit is newly renovated in 2021. Brand new kitchens with hard wood floors, stainless steel appliances, tile back splash,dishwasher and microwave. Brand new bathrooms with beautiful subway tile.  Laundry in unit and one storage locker.Close to Lincoln Drive, Carpenter Woods, Germantown Avenue and the Chestnut Hill West train line.\nContact owner for virtual video walk through and rental application\n","num_images":7.0,"lat":40.054998,"lng":-75.19631,"attrs":"['1BR \/ 1Ba', '500ft2', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T13:18:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7551677932.html","post_id":7551677932,"result_date":"2022-10-30T17:12:04.000Z","title":"Price Drop! Apartment Home w\/ All Appliances Included! Move-In Ready!","description":"Spacious 1 Bed, 1.5 Bath Apartment Available!\nGenerous closet space and free storage.\nWasher\/Dryer in Unit.\nConvenient to Suburban Station and Reading Terminal!\nIn-Person and Virtual Tours. Walk-Ins Welcome!\n. Spacious Floor Plan\n. Garbage Disposal\n. Microwave\n. Dishwasher\n. Washer\/Dryer in Unit\n. Pet Friendly (Restrictions Apply)\n. State-of-the-Art Fitness Center\n. Indoor Basketball Court\n. Roof Deck with Amazing City Views\n. Conference Room\n. Resident lounge\/Multi-Purpose Room\n. On Site Maintenance\n. 24\/7 Lobby Attendant\n. Convenient Location.........𝐓𝐞𝐱𝐭 :- ‪(9 4 9) 8 9 4-8 2 4 8‬  𝐟𝐨𝐫 𝐦𝐨𝐫𝐞 𝐢𝐧𝐪𝐮𝐢𝐫𝐲 (𝐩𝐥𝐞𝐚𝐬𝐞 𝐢𝐧𝐜𝐥𝐮𝐝𝐞 𝐲𝐨𝐮𝐫 𝐞𝐦𝐚𝐢𝐥 𝐚𝐧𝐝 𝐭𝐡𝐞 𝐡𝐨𝐮𝐬𝐞 𝐚𝐝𝐝𝐫𝐞𝐬𝐬 𝐲𝐨𝐮 𝐢𝐧𝐪𝐮𝐢𝐫𝐞 𝐟𝐨𝐫 𝐭𝐡𝐞 𝐛𝐞𝐬𝐭 𝐫𝐞𝐬𝐩𝐨𝐧𝐬𝐞).","num_images":5.0,"lat":39.9811,"lng":-75.174,"attrs":"['1BR \/ 1.5Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-10-30T11:45:04-0400"}]