[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-beautiful-large-bedroom\/7529655174.html","post_id":7529655174,"result_date":"2022-09-03 21:49","title":"Beautiful Large 2-bedroom 1 bathroom unbeatable Duplex in Philadelphia","description":"856 Square feet- Beautiful Large 2-bedroom 1 bathroom unbeatable Duplex in Philadelphia ! Washer\/dryer in unit. Enter the 2nd floor Kitchen Area and Large Living Room with Washer\/dryer. Nice Size Bedroom with closet and Full bathroom. A garage area, new windows, electricity, and lighting. In the past, it has been used for raising liveborn stock, with the pasture located behind the home. Most recently it has been used for the storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctive with no two views exactly alike. Move-in ready, freshly painted brick home w\/ NEW appliances included. Brand NEW ultra-durable luxury vinyl plank throughout, Credit check, and background check. This rental is pets friendly and offers off-street parking! If you are interested please TEXT ME AT:  show contact info","num_images":4,"lat":39.9375,"lng":-75.2637,"attrs":"['2BR \/ 1Ba', 'available now', 'apartment', 'laundry in bldg', 'detached garage', 'rent period: monthly']","posted_date":"2022-09-03T21:45:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7529648774.html","post_id":7529648774,"result_date":"2022-09-03 21:21","title":"Spacious 1 bedroom 1 bath apartment in Norwood, ST.","description":"Spacious 1 bedroom 1 bath apartment in Norwood, ST. Power, water, washer\/dryer, sewer and trash.. Your monthly rent already covers utilities so you do not have to pay extra charges for that. Pet are allowed as long as they are not destructive. Just contact me: sarah65895gmailcom One floor living with air conditioning! Enjoy 1175 square feet of living space to furnish and decorate as you wish. Washer\/dryer in unit. Enter the 2nd flr Kitchen Area and Large Living Room with Washer\/dryer. 3rd Flr has Nice Size Bedroom with closet and Full bathroom. A garage area, new windows, electricity and lighting. with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. GREAT DEAL For $500.00–Including Electric - 1 Bedroom Unit, Sunny, in good condition, beautiful fresh paint, beautiful hardwood floors, good windows almost new, Refrigerator, Oven and Fan, and Washer & Dryer in the Unit. Many power outlets and cable outlets throughout the apartment.*Remodeled kitchens with premium appliances, designer counters and cabinets (in select apartments) *High efficiency full size stackable washer dryer in every home *Private balcony\/patio*Spacious closets and extra storage *Fitness Center with cardio center, free weights and flat screens *Ample guest parking *Resort-like pool with resident activities *Beautifully landscaped.","num_images":4,"lat":40.0568,"lng":-75.1569,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T21:17:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2234-15th-st-bedroom-with\/7529642825.html","post_id":7529642825,"result_date":"2022-09-03 20:55","title":"2234 S 15th St, 3 bedroom with deck & basement","description":"Lovely and spacious Just renovated 2nd and 3rd floor and basement 3 bedroom 1 bathroom apartment with one bedroom on the 2nd floor and 2 bedrooms on the 3rd floor. New flooring throughout. New Kitchen and appliances. Brand new deck also located on the 3rd floor. Lots of natural light. Gas Heat and Electric. Tenants pay all utilities except for water and trash. Exclusive access to basement which has a Washer and Dryer. Conveniently close to public transportation and shopping. Located in a quiet neighborhood. Street Parking. Parking permits are available from the City Minimum credit score 680. First month's rent and two months security.","num_images":24,"lat":39.922919,"lng":-75.171739,"attrs":"['3BR \/ 1Ba', '1000ft2', 'available now', 'application fee details: $50 rental application fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T20:51:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-adorable-bedroom2\/7529641220.html","post_id":7529641220,"result_date":"2022-09-03 20:53","title":"Adorable 2 BEDROOM+2 BATHROOM~~Don't miss this incredible opportunity","description":"Beautiful farmette with a 2 bedroom ranch house on. Extremely well cared for property, exudes pride of ownership! Bank has 3 floors, 9 stables, a garage area, new windows, electricity and lighting. In the past it has been used for raising liveborn stock, The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctive with no two views exactly alike. could this be the new home of your business? The most adorable house has a custom made kitchen and bathroom cabinets, large eat in kitchen, 2 fireplaces...one in living room and one in family room downstairs. 2 large bedrooms, one being a walk thru. There is a whole house generator, Central Air, new gas boiler. If you have been searching for a property with multiple uses, a farmette, or just a great place to spread out....this is your new home. If you are interested, send your number.","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-09-03T20:44:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bedroom-bath\/7529634382.html","post_id":7529634382,"result_date":"2022-09-03 20:38","title":"Gorgeous 2 Bedroom 1 Bath Apartment For Rent","description":"Fully renovated 2 Bedroom 1 Bath Apartment. Close to public transportation, with driveway access for one vehicle included . Laundry facilities are located on the next block. Fully renovated in 2021. Utilities are included. In the past it has been used for raising liveborn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctiive with no two views exactly alike. Spacious with open concept kitchen, living room and dining room. AC, Electric. fridge, stove, dishwasher, microwave and pantry; Extremely well cared for property! Washer\/dryer in unit. The twisting design of the tower maximizes the window features and views in every suite.\nText me if interested:~ (six 4 six) 3 six 0-zero 4 three 8‬","num_images":5,"lat":40.0634,"lng":-74.999,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T20:17:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-renovated-1br-1ba\/7529629595.html","post_id":7529629595,"result_date":"2022-09-03 20:03","title":"Fully renovated 1br\/1ba apt in Dover + off street parking.","description":"Fully renovated 1br\/1ba apt in Dover + off street parking. For more info and to arrange a showing please massage TODAY  show contact info\nNEWER HARDWOOD FLOOR THROUGHOUT apartment. Living room and kitchen on the first floor. NEW WINDOWS THROUGHOUT! Off-street parking. Private yard. Nice eat-in kitchen with new appliances, gas fireplace, and large living\/dining room with large picture window looking out at beautiful magnolia tree in front yard. parking in the driveway. $530 all utilities included. Available for move in. New tankless water heater and A\/C system. Spacious with open concept kitchen, living room and dining room. AC, Electric. fridge, stove, dishwasher, microwave and pantry; Trex deck to watch wildlife from in the back yard. Other features of this great unit include hardwood floors and lots of closet space. Heat is included, and laundry and bike storage. Also included is the use of a large storage locker. Utilities are included. And because of this unique design, every suite is distinctiive with no two views exactly alike.\n","num_images":1,"lat":39.9788,"lng":-75.1262,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T19:59:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/warminster-lovely-bedroom-15-bath-ranch\/7529605461.html","post_id":7529605461,"result_date":"2022-09-03 18:53","title":"Lovely 3 Bedroom 1.5 Bath Ranch Home","description":"Located in desirable Centennial School District!  This home offers 3 nice bedrooms, Laundry right off the Kitchen, and Rear Family Room.  Newer Electric Service panel, natural gas heating,  many replacement windows.  Generac Generator included. Rear Storage Shed. Please talk to Madsen John via  madsenjn3507 ATG, M ailDTCM.\nPower, water, washer and dryer unit, sewer and trash. Your monthly rent already covers utilities so you do not have to pay extra charges for that. Pets are allowed.","num_images":7,"lat":40.1969,"lng":-75.1072,"attrs":"['3BR \/ 1.5Ba', '1338ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T18:37:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-guest-suites-quartz\/7529606696.html","post_id":7529606696,"result_date":"2022-09-03 18:49","title":"Guest Suites, Quartz Countertops, Flexible Lease Options","description":"Bedrooms: 0Bathrooms: 1Square Feet: 394Address: 1401 Arch StreetLocated in Philadelphia’s historic Center City neighborhood, One City offers modern elegance with timeless grandeur. With views of Philadelphia's City Hall and just steps away from iconic Philly locations such as the Pennsylvania Convention Center, Reading Terminal Market, and Love Park, One City offers sophisticated luxury in the heart of Philadelphia. One City offers the most discerning residents the ultimate living experience. Inside this historic building, located at 1401 Arch Street, each apartment residence holds unique original features coupled with contemporary sophistication. Thoughtful design details include custom built-in storage, stainless steel appliances, and modern connectivity offering luxury and convenience to a range of lifestyles. Control is always at your fingertips with your app-based smart home features including keyless entry. Amenities Include:Lobby Lounge                                                                                    Photo                                                                                                                                 Featured amenityInterior & Exterior Entertainment LoungesBike StorageFully Equipped Kitchens Stove Range with Microwave, Refrigerator with ice maker, Dishwasher, Food Waste Disposal, Under Cabinet LightingQuartz CountertopsRooftop SundeckPackage Receiving SystemProgrammable Smart Home Features App based compatibility with all virtual personal assistant systems; Including thermostats and other electrical components.Penthouse Hideaway                                                                                                                                Fully furnished bar and lounge area for BYO entertainment.                                                                                                                            Photo                                                                                                                                 Featured amenityAdditional Storage AvailableLVT Flooring Luxury Vinyl Tile flooring throughoutGuest SuitesCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/qnmp3dze\/one-city\n","num_images":9,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '394ft2', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-09-03T18:41:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bedroom-bath\/7529601829.html","post_id":7529601829,"result_date":"2022-09-03 18:30","title":"Gorgeous 2 Bedroom 1 Bath Apartment For Rent","description":"Fully renovated 2 Bedroom 1 Bath Apartment. Close to public transportation, with driveway access for one vehicle included . Laundry facilities are located on the next block. Fully renovated in 2021. Utilities are included. In the past it has been used for raising liveborn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctiive with no two views exactly alike. Spacious with open concept kitchen, living room and dining room. AC, Electric. fridge, stove, dishwasher, microwave and pantry; Extremely well cared for property! Washer\/dryer in unit. The twisting design of the tower maximizes the window features and views in every suite. Please text me  show contact info","num_images":4,"lat":39.9523,"lng":-75.1638,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T18:26:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beds-baths-very-open-and\/7529599958.html","post_id":7529599958,"result_date":"2022-09-03 18:24","title":"!!!3 Beds 2 Baths Very open and spacious!!!","description":"Very open and spacious ranch in poplar Maple Knoll! Home Feat: Huge open gourmet kitchen & breakfast room open to great room perfect for entertaining! Popular split bdrm floor plan,\nIf you are interested kindly send me your number.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nYou can enjoy relaxing by the pool or entertaining friends at our picnic and BBQ area.\nThis two bedroom apartment features a spacious living room with private patio or balcony.\n*Remodeled kitchens with premium appliances, designer counters and cabinets (in select apartments)\n*High efficiency full size stackable washer dryer in every home\n*Private balcony\/patio\n*Plush wall to wall carpeting\n*Spacious closets and extra storage\n*Fitness Center with cardio center, free weights and flat screens\n*Bark Park with waste stations\n*Ample guest parking\n*Resort-like pool with resident activities\n*Beautifully landscaped\n*Picnic and play areas\n*Less than 2 miles to the new Tech Center plaza\nRental rates, availability, deposits, apartment features and specials are subject to change without notice.\nWelcome to Acacia Park Apartments, located at the foot of the philadelphia  mountains, across from Cal-State University, philadelphia . We offer spacious one and two bedrooms with the option to rent or bring your own washer\/dryer and\/or refrigerator. We welcome small pets upon approval. Our beautifully landscaped community has a resort-style pool, BBQ area, tennis courts, volleyball sand court, and a fitness center for all of our residents to enjoy.","num_images":5,"lat":40.1166,"lng":-75.0198,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T18:20:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beds-baths-best-special-in\/7529599925.html","post_id":7529599925,"result_date":"2022-09-03 18:24","title":"@@3 Beds 2 Baths Best special in philadelphia@@","description":"Welcome home to this well maintained 3bed 2bath home in philadelphia  .This home boasts quartz counter tops, slate floors, and a terrific floor plan. The master has vaulted ceilings, a double sink.\nIf you are interested kindly send me your number.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nYou can enjoy relaxing by the pool or entertaining friends at our picnic and BBQ area.\nThis two bedroom apartment features a spacious living room with private patio or balcony.\n*Remodeled kitchens with premium appliances, designer counters and cabinets (in select apartments)\n*High efficiency full size stackable washer dryer in every home\n*Private balcony\/patio\n*Plush wall to wall carpeting\n*Spacious closets and extra storage\n*Fitness Center with cardio center, free weights and flat screens\n*Bark Park with waste stations\n*Ample guest parking\n*Resort-like pool with resident activities\n*Beautifully landscaped\n*Picnic and play areas\n*Less than 2 miles to the new Tech Center plaza\nRental rates, availability, deposits, apartment features and specials are subject to change without notice.\nWelcome to Acacia Park Apartments, located at the foot of the philadelphia  mountains, across from Cal-State University, philadelphia . We offer spacious one and two bedrooms with the option to rent or bring your own washer\/dryer and\/or refrigerator. We welcome small pets upon approval. Our beautifully landscaped community has a resort-style pool, BBQ area, tennis courts, volleyball sand court, and a fitness center for all of our residents to enjoy.","num_images":3,"lat":40.1166,"lng":-75.0198,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T18:20:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-in\/7529593904.html","post_id":7529593904,"result_date":"2022-09-03 18:06","title":"Beautiful 3 Bedroom in Manayunk!","description":"Welcome to this bright and updated rowhome located in the heart of Manayunk! This charming home is conveniently located within walking distance of Manayunk's Main Street, full of popular restaurants, shops, and more. Numerous parks, schools, and gyms are also just a walk away. Enter this charming home into a spacious living area with plenty of natural lighting, hardwood floors, and a staircase leading to the second floor. A lovely dining room connects to the updated kitchen past the stairs. The kitchen features granite countertops, beautiful cabinetry, a tiled backsplash, and even more natural lighting. A backdoor leads to the quaint, fenced-in backyard with patio space and privacy. The second floor of this home features a full bathroom, a small room that could be used as an office or playroom, and the main bedroom, which offers plenty of space and a large closet. The third floor includes another two bedrooms with closet space. This home also has an unfinished basement perfect for storage and laundry.","num_images":15,"lat":40.031094,"lng":-75.228142,"attrs":"['3BR \/ 1Ba', '1425ft2', 'available nov 1', 'air conditioning', 'application fee details: $30\/per application', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T18:02:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bedroom\/7529578912.html","post_id":7529578912,"result_date":"2022-09-03 17:30","title":"Newly Renovated 1 bedroom 1bath apartment for rent","description":"Available for move in. Beautifully renovated single-level 1 bedroom 1 bathroom apartment with central air and in-unit laundry in a fantastic location that's a couple of blocks away from the -street bus line stop, School, University and Philadelphia Hospital. This charming courtyard building is meticulously-maintained and lovingly-cared for. Other features of this great unit include hardwood floors and lots of closet space. Heat is included, and laundry and bike storage. Also included is the use of a large storage locker. Fully renovated in 2021. Utilities are included. In the past it has been used for raising liveborn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctiive with no two views exactly alike. Spacious with open concept kitchen, living room and dining room. AC, Electric. fridge, stove, dishwasher, microwave and pantry; Extremely well cared for property! Washer\/dryer in unit. The twisting design of the tower maximizes the window features and views in every suite. $635\/month + utilities. No broker\/agent\/application fees. Tenant must have strong documented income, excellent credit history and background check free of problems. Pets considered on a case-by-case basis with additional deposit. For more information and to arrange a showing please text TODAY at shaniya3599gmail,com","num_images":7,"lat":40.0092,"lng":-75.132,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T17:19:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-unique-place-to-live-month\/7529563162.html","post_id":7529563162,"result_date":"2022-09-03 17:13","title":"Unique place to live! ** month to month lease  **off street parking","description":"This building was originally built as a grand hotel with lots of character and is a unique place to live!\nThere are shared restrooms in the hall (men’s and women’s each with a few stalls, an enclosed shower and an enclosed bathtub\/shower) and no kitchen available.\nEach apartment has a sink and closet. Tenants are welcome to bring in a fridge, hot plate and\/or microwave.\nThere are coin-op washer and dryers available.\n","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T16:38:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-with-the-free-month-rent\/7529397775.html","post_id":7529397775,"result_date":"2022-09-03 10:51","title":"With the free month, rent averages out to $2520 a month","description":"1 MONTH FREE for a move in by October 1. With the free month, rent averages out to $2520 a month. This completely renovated apartment is just steps away from the historic Rittenhouse Sq Park and offers central air and an in-unit washer\/dryer. Pristine hardwood floors flow throughout the unit. The separate kitchen is outfitted with oak cabinets, granite countertops, and a new dishwasher, and microwave. Adjacent to the kitchen is an absolutely huge living room. The three bathrooms all come with upgraded vanities and showers. First year lease ends July 31 to get it back on the summer schedule, but then you can renew for a full year going forward.\n1936 Spruce St #1B","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['4BR \/ 3Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T10:47:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-month-free-for-move-in-by\/7529396754.html","post_id":7529396754,"result_date":"2022-09-03 10:48","title":"1 MONTH FREE for a move in by October 1!","description":"1 MONTH FREE for a move in by October 1. With the free month, rent averages out to $2520 a month. Beautifully renovated bi-level 4 bedroom 3 bathroom apartment with central air and in-unit laundry in a fantastic location that's a couple of blocks away from the Walnut-Locust broad street line stop, Whole Foods and ACME and Jefferson University. The gourmet kitchens boast granite counter-tops, stainless steel appliances, and beautiful cabinets. Appliances include a microwave, dishwasher, and garbage disposal. The bathrooms are nicely renovated and contain stunning subway tile, a bathtub, and a striking vanity. The outside walls are lined with double pane windows that help insulate the apartment. Pristine hardwood flooring flows through the unit. First year lease ends July 31 to get it back on the summer schedule, but then you can renew for a full year going forward.\n1104 Spruce St #3R","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['4BR \/ 3Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T10:44:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-bathroom\/7529396114.html","post_id":7529396114,"result_date":"2022-09-03 10:47","title":"Large 4 bedroom\/2 bathroom with private backyard!","description":"Large 4 bedroom\/2 bathroom with private backyard. Quick, easy walk to Drexel and Penn campuses, grocery stores, and subway lines. Dishwasher, laundry in-unit, pets OK.\" Central air, $100 one-time fee per pet.\n4216 Powelton Ave","num_images":3,"lat":39.9597,"lng":-75.2024,"attrs":"['4BR \/ 2Ba', '2000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T10:43:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-car-wash-area-private\/7529392375.html","post_id":7529392375,"result_date":"2022-09-03 10:38","title":"Car Wash Area, Private Patio or Balcony, Extra Storage","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Disability AccessState-of-the-Art Fitness CenterGas FireplacesPicnic AreaWireless & High Speed Internet Access9' Ceilings w\/ Crown MoldingBuilt-in Microwave OvensCeiling FansExclusive & Newly Renovated ClubhouseCable\/Satellite TVFull Size Washer and Dryer in All UnitsPrivate Patio or BalconyCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/fje2ppum\/JeffersonatWestTown\n","num_images":9,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1124ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: weekly']","posted_date":"2022-09-03T10:34:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-call-this-bedroom-bath\/7529382980.html","post_id":7529382980,"result_date":"2022-09-03 10:36","title":"Call this 3-bedroom, 1-bath Bella Vista gem home!","description":"Call this 3-bedroom, 1-bath Bella Vista gem home! Blending vintage original details with a recent renovation and upgrades throughout, this home is on a quiet, postcard-perfect block that is just steps away from some of the city's best offerings. The first floor features two rooms that can be used interchangeably as either living or dining rooms depending on your preference, followed by a separate eat-in kitchen with enough space for a breakfast table. With Carrara marble floors and detailing, stainless steel appliances, a durable quartz countertop, and a decorative iron-lattice window, this kitchen is both spacious and well-appointed. Stairs lead up to the second floor where a roomy guest bedroom with its own closet, a renovated bathroom, and an extra open space that easily be used as an office, playroom, or den, with a convenient linen closet await. The large master bedroom with closet and a charming second guest bedroom top off the property on the third floor. Remote controlled ceiling fans and mid-century-style fixtures in the 3 bedrooms and living spaces add smart, efficient flare paired with contemporary hardware and original inlaid floors. Washer and dryer are provided in the unfinished basement, which also has plenty of room for storage. Four AC units are also provided for the renter's convenience. This residential family-friendly block is convenient to schools, as well as Whole Foods and Acme supermarkets, the 9th Street Market, and South Street. Saloon Restaurant and brunch favorite Fitzwater Cafe are right around the corner, as is John's Water Ice, Fiorella, Nomad Pizza, The Good King, Rally Coffee Shop, and so many more places to explore.\n708 Clymer St","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1Ba', '1174ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T10:11:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-wind-down-in-your-new\/7529384197.html","post_id":7529384197,"result_date":"2022-09-03 10:27","title":"Wind down in your new apartment home today!!","description":"Available: 10\/11\/22\nApt. 2410 — Oxford floor plan — 1,203 sq. ft. — $3,460\nThis 4th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-09-03T10:14:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-available\/7529385050.html","post_id":7529385050,"result_date":"2022-09-03 10:20","title":"Spacious 2 bedroom available now at 4157 Ridge ave!","description":"Very spacious 2 bedroom available now near The Kelly Drive. Parking lot. Laundry room is in the building. Pet friendly. $250 one time pet fee, plus $25 pet rent. Tenants pay all utilities. 1 year lease. $50 application fee.\nCall Alena for showing at  show contact info","num_images":9,"lat":40.008368,"lng":-75.192798,"attrs":"['2BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T10:16:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-home-is-dream-city\/7529378743.html","post_id":7529378743,"result_date":"2022-09-03 10:18","title":"This home is a DREAM city-dwelling, through and through!","description":"AMAZING, NEW, LUXURIOUS - three words to describe this tri-level condo unit in a spectacular location in Fishtown. This home is a DREAM city-dwelling, through and through! Located on the first floor, so carrying in groceries & bags is a BREEZE. Enter into the unit to find an expansive open first floor with top of the line amenities. You'll absolutely love the modern kitchen with Carrera style counter tops, stand alone island with ample seating, and stainless steel appliances. Floor to ceiling windows in the living\/dining room combination allow for an extra sun-soaked space. Through the sliding glass doors you'll find an EXTRA LARGE outdoor space that is RARE in the city. The space includes an expansive deck and patio furniture for entertaining friends and your furry loved ones. This is a dog-owners DREAM space! Upstairs you'll find a powder room, perfect for guests to use when you're entertaining. On the top floor is a SPACIOUS bedroom with walk-in closet and en-suite bathroom. The shower is spacious and includes a bench. This bathroom is totally updated with modern finishes, and the bedroom is big enough for a sleeping space AND an office. On the way downstairs, you'll find extra storage containers - you won't run out of room in this city condo! Downstairs you'll find another extra large bedroom with a huge window for sunlight, which could also double as a sleeping space + office - or even a home gym! Double closet and another ensuite bathroom are included down here. This space is PERFECT for roommates, as you'll each have extra privacy and your own bathrooms. The laundry room is also located downstairs, with a newer washer\/dryer. This home is walking distance to Frankford Avenue and all Fishtown has to offer. Penn Treaty park is directly across the street (did we say dog-friendly?!) -- and street parking is a breeze around here as no permits are required! This one is hard to beat - schedule your showing today!\n321 E Allen St #2","num_images":4,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 2.5Ba', '1534ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T10:00:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-bedroom-available\/7529383597.html","post_id":7529383597,"result_date":"2022-09-03 10:17","title":"Great 1 bedroom available now at 3412 Spring garden!","description":"Great, 1 bedroom available now at 3412 Spring garden! Gated community, 24 hours camera system. 1 year lease. 3 months to move in. Pet friendly, $250 one time pet fee, $25 pet rent.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":11,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T10:13:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-all-apartments-offer\/7529374850.html","post_id":7529374850,"result_date":"2022-09-03 10:15","title":"All apartments offer Brazilian oak hardwood flooring","description":"The all-new Piazza Alta has been designed from the ground up to be a truly elevating city living experience. We offer studios to penthouses in a variety of layouts and stunning finishes. All apartments offer Brazilian oak hardwood flooring, oversized windows allowing abundant natural sunlight, ceiling fans in every room, washer\/dryer in unit, plenty of closet space. Kitchens include custom cabinetry with soft-close drawers throughout, quartz counters, slab backslashes and mood setting under cabinet lighting. Bathrooms feature an exhilarating waterfall rain shower head with hand-held spray wands and body jets, shower benches and glass doors, illuminated medicine cabinets and storage vanities. Apartments can be found in the dark modern scheme Sleek design, the bright contemporary Scandinavian design or the warm Timeless design. There is absolutely no wrong way to live luxurious. Now let’s talk amenities. First, to say we have a pool would be modest. The Aqua Foro pool club is a 25k sq ft rooftop aquatic paradise. Lap and lounge pools, hot tubs, kitchens, cabanas and even a splash pad for the kids. Our 15k sq ft fitness and recovery center features state of the art equipment, Peloton bikes, a massive outdoor terrace, and residents can enjoy regular complimentary trainer-led fitness classes. Also, the fitness center offers relaxing “his and her” spas with high pressure showers, dry saunas, steam rooms, stand up tanning, and hydro massage beds. If you're looking for a refreshing atmosphere to finish up some work at home or meet up with friends look no further than our 5k sq ft cafe & lounge area. Enjoy a cup of coffee at the stylish diner booths, kick back on a comfortable couch with friends or take in beautiful city views from the outdoor terrace. Located in the beating heart of Northern Liberties just steps away from supermarkets, restaurants, bowling alleys, live music and comedy club venues. A few minutes from nearby highways granting quick and easy access to concerts, sporting events, shopping malls and everything downtown center city has to offer. From sunrise to sunset The Piazza Alta delivers a luxurious and invigorating lifestyle. Take the first step towards your own dream space by visiting us today. *LIMITED TIME PROMOS AVAILABLE. PHOTOS OF MODEL UNIT. PARKING AVAILABLE AT AN ADDITIONAL COST. CALL FOR DETAILS\n1099 Germantown Ave #S-D","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['0BR \/ 1Ba', '480ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T09:51:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom\/7529382494.html","post_id":7529382494,"result_date":"2022-09-03 10:14","title":"Renovated 1 bedroom available now at 35th and Spring garden!","description":"Very spacious 1 bedroom apartment available now at 35th and Spring garden. It’s located on the 3rd floor. Cold water is included, tenant pay for electric and gas. Laundry room is in the building. 1 year lease, $55 application fee.3 months to move in. Pet friendly, $250 one time pet fee, plus $25 pet rent.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":15,"lat":39.962769,"lng":-75.192846,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T10:10:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7529367052.html","post_id":7529367052,"result_date":"2022-09-03 10:13","title":"Spacious 1 Bedroom apartment in a landmark building!!!","description":"FREE MONTH SPECIAL FOR APPLICATIONS SUBMITTED BY 8\/31!!! $500 Security Deposit - Limited Time Move In Special!! Spacious 1 Bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block away from Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit in the building.\n1411 Walnut St #805","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '684ft2', 'available oct 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T09:29:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500-security-deposit-for\/7529368016.html","post_id":7529368016,"result_date":"2022-09-03 10:13","title":"$500 security deposit for a limited time!!!","description":"$500 security deposit for a limited time!!! 1600 Walnut is surrounded by the performing arts and numerous other cultural venues. One of the best values in Center City. Secure entry, Gym, Bike room! Bright and sunny units with hardwood floors, large windows, marble baths and open layouts with great closet space. Known for its popular restaurants and nightlife spots, Just steps away from some of Philadelphia's best culinary experiences Midtown Philadelphia is a fun and exciting place to live. Pictures are of a similar unit.\n1600 Walnut St #504","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '475ft2', 'available oct 25', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T09:32:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-laundry-in-unit-lease\/7529381984.html","post_id":7529381984,"result_date":"2022-09-03 10:12","title":"Laundry in Unit, Lease Today, Convenient Location","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nLooking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!","num_images":18,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T10:08:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-full-size-washer-and-dryer\/7529381840.html","post_id":7529381840,"result_date":"2022-09-03 10:12","title":"Full Size Washer and Dryer in All Units, Picnic Area, Garages","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Cable ReadyCable\/Satellite TVExecutive Business CenterPlaygroundGaragesDisability AccessIndividual Intrusion AlarmsResort-Style Swimming PoolGas FireplacesDishwasherOnline Payments AvailableCeiling FansCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/6ndjai64\/JeffersonatWestTown\n","num_images":9,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1124ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: weekly']","posted_date":"2022-09-03T10:08:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-terrific-bedroom-full-bath\/7529370408.html","post_id":7529370408,"result_date":"2022-09-03 10:11","title":"Terrific 2 Bedroom, 2 Full Bath 17th Floor Unit!","description":"Don't Miss Out on This Fantastic Opportunity to Live in One of the Hottest Areas Along the River! Terrific 2 Bedroom, 2 Full Bath 17th Floor Unit in the Regatta Building at Waterfront Square! Unit Features: Foyer Entry with Coat Closet, Hardwood Floors, Custom Kitchen with Upgraded Cabinetry, Ceramic Tile Backsplash, Granite Countertops, Sleek Fixtures & Stainless Steel Appliances, Double Door Closet for Extra Storage, Master Bedroom with En Suite Bathroom with Granite & Marble Thru-Out, Soaking Tub & Separate Shower and Walk In Closet, 2nd Bedroom\/Den has Exit to Private Balcony. Amazing Northeastern View of the Delaware River with Floor to Ceiling Windows & Additional Exit to Private Balcony Overlooking the Water, Laundry Area Inside Unit. Deeded Parking Spot Included in Monthly Rent & So Much More! Waterfront Square Offers Some of the Best Amenities in the City, Such As: Semi-Olympic Size Pool w\/Lap Lines, Shuttle Service to Center City (Runs Between 2nd Street to 30th Street), Riverfront Sundeck Overlooking Benjamin Franklin Bridge & Delaware River, State of the Art Fitness Center, 24-Hour Security, Doorman, Concierge, Dog Run & 2 Dog Parks, Putting Green, Walking\/Jogging Trail, Landscaped Park, Unparalleled Views, Community Rooms are Available for Meetings, Events, Get Togethers and Functions. Conveniently Located-Just Minutes From Major Roadways, Fine Dining, Entertainment, Quality Shopping, Sports Complexes, Philadelphia International Airport & SO Much More! Ultimate in Privacy and Security-Luxury Living at its Finest.. Landlord Pays Monthly Association! First Month's Rent & Two Month's Security Deposit Due by Move In.\n901 N Penn St #R1706","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1177ft2', 'available oct 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:39:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom\/7529378805.html","post_id":7529378805,"result_date":"2022-09-03 10:08","title":"Renovated 1 bedroom available now at 4800 Brown street!","description":"Experience forward-thinking urban living.\n1, 2 & 3 bedroom luxury loft-style apartments located in an affordable up-and-coming district just north of University City make up this 34-unit complex. We offer thoughtful architecture and design creating a contemporary feel in an old factory setting. Elevator access, stainless steel appliances including a dishwasher and garbage disposal, a multi-camera security system, intercom system with remote door buzzer, on-site laundry, high ceilings, custom cabinetry with self-closing hardware, granite counters, kitchen pantry, exposed brick & concrete in many units, tile flooring, central heat & air, LED lighting, extra large commercial sized windows, large closets and large bright common hallways will be more than enough to make you want to come home!\nLive the uptown urban lifestyle you crave!\nAmenities:\n-Water $35.00 per month\n-Elevator\n-Assigned gated parking available for car and scooters ($150 per space, coming Summer 2021)\n-Multi-camera security system\n-Intercom system with electronic door opener\n-On-site laundry\n-Choice of Comcast or Verizon\n-Full-size stainless steel appliances\n-Bus line at corner\n-Garbage disposal\n-High ceilings\n-Large closets\n-Custom cabinetry with self closing cabinet doors & drawers\n-Sinks with magnetic retractable faucet hose\n-Granite counters\n-Pantries\n-Exposed ductwork, brick & concrete floors\/ceilings (in some units)\n-Central air and heat\nIn addition to monthly rent, tenant is responsible for their own electricity bill, a water fee of $35 & a liability insurance fee of $9.50\nCall Alena fro showing at  show contact info\nCity wide realty\n","num_images":7,"lat":39.966337,"lng":-75.216657,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T10:00:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-renovated-this\/7529372492.html","post_id":7529372492,"result_date":"2022-09-03 10:02","title":"Recently renovated, this 3rd (top) floor","description":"Recently renovated, this 3rd (top) floor, 1 bedroom efficiency unit on 18th and South offers modern comforts and rustic charm with gorgeous wood floors and exposed brick with plenty of light. Upgraded kitchen with new cabinets, new stainless-steel appliances, dishwasher, gas cooking. Completely renovated bathroom is spacious and fresh. Unit has it's own private laundry! (on 2nd floor at bottom of stairs, behind door.) Top floor living with street access shared by one other unit in building. Available 10\/1\/20. Tenant pays electric, gas, and water (historically very low). First month, last month, and security.\n1743 South St #3","num_images":4,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '1595ft2', 'available oct 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T09:45:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-perfectly-located-where\/7529377647.html","post_id":7529377647,"result_date":"2022-09-03 10:02","title":"Perfectly located where Bella Vista meets Washington Square West","description":"Welcome home to this stunning two bedroom, one bath unit at the LeFleur Condominum. This immaculately maintained home features 10 ft ceilings, gorgeous hardwood floors, and oversized windows that fill the home with natural light. A gourmet kitchen showcases modern cabinetry, sleek granite counters, stainless steel appliances, glass tilework, and a convenient custom concrete island\/breakfast bar. The open layout floor plan is perfect for entertaining and the home has been upgraded with a smart lighting system and custom window treatments. The master bedroom includes a walk-in closet, and the spa-like full bathroom features modern fixtures and a beautiful tiled bath surround. Perfectly located where Bella Vista meets Washington Square West, this home is in a boutique condominium centrally located for easy access to the best of Center City living (Whole Foods and ACME, Seger and Palumbo Parks, the 13th St Restaurant corridor, South Street and the Italian Market are steps away), and is convenient to public transportation, Jefferson, Pennsylvania Hospital, and more!\n1233-35 Bainbridge St #D","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '962ft2', 'available oct 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T09:58:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-space-value-and-light\/7529366863.html","post_id":7529366863,"result_date":"2022-09-03 10:01","title":"Great space value and light","description":"Great space value and light in this fantastic value priced studio in the heart of it all. Just minutes from Avenue of the Arts, Jefferson Hospital, Pennsylvania Hospital, and the Reading Terminal Market. Walking Score 110!\n201 S 13th St #712","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['0BR \/ 1Ba', 'available oct 22', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T09:29:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-watch-as-spring-arts\/7529371686.html","post_id":7529371686,"result_date":"2022-09-03 10:00","title":"Watch as Spring Arts develops right before your very eyes","description":"FOMO no mo' with views of one of the Rail Park right from your bedroom windows...you'll never miss the action in this rapidly growing neighborhood. Watch as Spring Arts develops right before your very eyes. Just outside your front door, you'll find an abundance of entertainment options at Love City Brewing, Union Transfer, Under Ground Arts, Trestle Inn, and Prohibition Tap Room to name a few. The Lofts at Spring Arts offer easy living in a stylishly appointed building with decked out common areas, secured keypad entry, an elevator, bike storage, and a workout room. This particular unit is a spacious 2 bedroom 1 bath layout! There is plenty of natural light and room to move about the cabin. In addition to the application, the following items and criteria must be met: 1. Photo ID (gov't issued) 2. SSN or require double security deposit 3. Income requirement. 36 x rent. If not met, require co-signer 48 x rent 4. 1 month of pay stubs 5. FICO score minimum of 600. ONE FREE month on a 12 month lease or TWO FREE on an 18 month lease. Additional specials available for longer leases. Listed price reflects a 12 month lease with current special amortized for advertising purposes only. Base rent is $1250. Please check with agent as specials are subject to change without notice\n1021-27 Ridge Ave #103","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '676ft2', 'available nov 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:43:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-bedroom-available\/7529376335.html","post_id":7529376335,"result_date":"2022-09-03 09:59","title":"Great 1 bedroom available now at 5100 Walnut st!","description":"Great location! Cozy 1 bedroom available after September 15th. Laundry room is in the building. Tenant pays for all utilities. 1 year lease. $50 application fee. 3 months to move in. Must to have a good credit score and monthly income 3 times rent.\nCall Alena for showing at  show contact info","num_images":10,"lat":39.956707,"lng":-75.223538,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:55:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-renovated-loft\/7529376170.html","post_id":7529376170,"result_date":"2022-09-03 09:58","title":"Beautifully renovated loft!","description":"Beautifully renovated loft in the heart of the Loft District - available NOW! As you walk into this unit you are instantly greeted by tall windows that allows sunlight to pour in. This unit has gorgeous original hardwood floors, a beautiful brick wall, exposed beams, and high ceilings. The kitchen features a moveable island, tons of cabinet and countertop space, and stainless steel appliances. The bathroom has just been remodeled and features a brand new washer and dryer. The bedroom is spacious and features two closets. Best yet, there is an additional loft space which can be used as an additional bedroom, office, or simply just storage space! This is an elevator building that features bike storage and an on-site garage. Parking spot available for an additional fee. This unit oversees the Rail Park and is just a short walk to Cafe Lift, Prohibition Taproom, Underground Arts and Union Transfer concert venues, Reading Terminal Market, and much more!\n428 N 13th St #5G","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '1090ft2', 'available sep 20', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T09:54:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-make-this-luxury-center\/7529373515.html","post_id":7529373515,"result_date":"2022-09-03 09:51","title":"Make this Luxury Center City Philadelphia High Rise your home today!","description":"Make this Luxury Center City Philadelphia High Rise your home today! Brand New Modern Finishes and Luxury Amenities. Blocks away from Rittenhouse Square and historic Art Museum area - live in one of the most exciting Philadelphia neighborhoods. Completely re-defined and re-finished Luxury Apartments that offer the most desirable attractions the city has to offer. Select apartments are outfitted with all-new finishes in the kitchens and bathrooms. Kitchens have been redesigned with large, white-finish maple cabinets, ceramic tile backsplashes, GE stainless steel appliances and granite counters. Bathrooms feature maple vanities, subway tile bath surrounds, new fixtures and lighting. Hardwood Floors, Extra large bedrooms with walk in closets, extra space for Den\/Office and a washer\/dryer inside the unit. Come home to stylish living in the heart of Center City. Amazing brand new amenities creating a truly expanse living experience. All-new rooftop social deck with lounge seating, music, free Wi-Fi, flat-screen TVs and a gas fireplace, surrounded by glass windscreens. Updated fitness center with 1500 extra square feet and new LifeFitness equipment with personal TVs, plus larger windows for fantastic views of Center City. Every home is steps from Center City Comforts. Enjoy the convenience of having street-level shops, restaurants, a convenience store and ATM right in your building. Nearby Trader Joes and several neighborhood grocery stores. And to add to your amazing Center City Philadelphia living experience The Sterling's 24-hour concierge service help you with reservations, transportation arrangements and package acceptance. Walking distance to 30th Street Station, Public transportation, FREE Shuttle to take you around the city, proximity to Universities, Hospitals and Offices. Easy accessibility to Major Highways, Museums, Restaurants and Night-life. Monthly rent amount & availability varies based on move-in date and lease term and subject to change on a daily basis. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** pet fee $250 ** Parking may be available for additional fee **\n1817 John F Kennedy Blvd #0B1BA","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '430ft2', 'available oct 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:47:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-equally-sized-spacious\/7529356653.html","post_id":7529356653,"result_date":"2022-09-03 09:44","title":"Two equally sized spacious bedrooms","description":"The first-floor unit has a private entrance and occupies the first floor and the back half of the second floor of this duplex. You enter the unit through a wide foyer\/hallway with a powder room and large coat closet on the right. The hallway opens to a spacious living and dining area and a full kitchen with open island. This living space easily accommodates a full dining area and living room space. Wide glass sliding doors open to an outdoor patio space. The stairwell leads from the entry hall to the wide second floor hallway. Upstairs is a full bath with laundry area and two equally sized spacious bedrooms. One offers a full walk-in closet and the other a large closet area. More like a house than an apartment with spacious patio, central air and a wonderful central Fairmount location. TO SCHEDULE A SHOWING>>>>>>>Text  show contact info\n763 N Ringgold St","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1.5Ba', '1920ft2', 'available sep 15', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T08:55:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1200ft2-awesome-bedroom\/7529369706.html","post_id":7529369706,"result_date":"2022-09-03 09:41","title":"1200ft2 - Awesome 2 bedroom apartment","description":"Awesome 2 bedroom apartment in Philadelphia location! One floor living with air conditioning! Enjoy 1200 square feet of living space to furnish and decorate as you wish. Washer\/dryer in unit. Enter the 2nd flr Kitchen Area and Large Living Room with Washer\/dryer. 3rd Flr has Nice Size Bedroom with closet and Full bathroom. A garage area, new windows, electricity and lighting. In the past it has been used for raising live barn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. GREAT DEAL For $788.00 –Including Electric - 2 Bedroom Unit, Sunny, in good condition, beautiful fresh paint, beautiful hardwood floors, good windows almost new, Refrigerator, Oven and Fan, and Washer & Dryer in the Unit. Many power outlets and cable outlets throughout the apartment. Off Street car parking, and visitors parking. Kitchen windows overlooks the gorgeous pond and garden. Downstairs you'll find a family room, another full bath, xtra large and canning room, a shop area, and an outside stairway with a door. There is a whole house generator, Central Air, new gas boiler with 2 zones. 2 solar panels on roof are owned, not leased. If you have been searching for a property with multiple uses, or just a great place to spread out....this is your new home. Please note there are 2 tracts of land on attached deed, totaling the 8.539 acres. TEXT:::::(5one8) 33six-5six45","num_images":7,"lat":40.0547,"lng":-75.1866,"attrs":"['2BR \/ 1Ba', 'EV charging', 'apartment', 'w\/d hookups', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T09:37:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-your-sunny-3rd\/7529369449.html","post_id":7529369449,"result_date":"2022-09-03 09:40","title":"Welcome to your sunny 3rd-floor apartment in a prime location!","description":"Welcome to your sunny 3rd-floor apartment in a prime location! This unit features 2 bedrooms and 2 full bathrooms. The spacious layout is ideal for roommates or a couple looking for some extra room. This top floor unit has no upstairs neighbors and gets awesome sunlight (a plant lover’s dream)! Your generously sized common space features parquet flooring, while the bright kitchen is complete with a dishwasher, decorative tile flooring and plenty of cabinet space. Each bedroom has hardwood flooring, a ceiling fan and plenty of closet space, and both of the full bathrooms have windows. Enjoy the convenience of having access to coin-operated laundry in the basement of the building. Situated on the cusp of Bella Vista and Queen Village, you’ll have access to all that both these wonderful neighborhoods have to offer. You’re just steps away from local favorites like Square Pie, Lorenzo's, Ralph's, and more. You’re within walking distance to the Italian market, Whole Foods, Acme, South Street shopping and Center City. Schedule your showing today!\n625 Catharine St #3","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '3138ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:36:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7529369432.html","post_id":7529369432,"result_date":"2022-09-03 09:40","title":"Lease Today, Playground, Luxurious Bathrooms","description":"Schedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Minutes from Restaurants, Shopping, and Much More\n* Sun Deck\n* Gaming Area\n* Long Term Lease Available\n* Professionally Managed\n* Playground\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Garage Parking\n* Pet Salon\n* Elevator\n* Community Kitchen\n* Package Acceptance\n* Dry Cleaning and Laundry Service\n* Bark Park\n* Renters Insurance is Required\n* Easy Freeway Access\n* EV Charging\n* Bike Racks\n* TV Lounge\n* Community Lounge\n* Billiards\n* WiFi Access\n* After-Hours Emergency Maintenance\n* Fitness Studio\n* Swimming Pool\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Short or Long Term Lease Available\n* Movie Theatre\n* Extra Storage\n* Controlled Access\n* Outdoor Grill Area\n* Landscaped Courtyards\n* Credit Cards Accepted\n* Non Smoking Community","num_images":22,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:36:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7529368676.html","post_id":7529368676,"result_date":"2022-09-03 09:38","title":"Pets Welcome, Lease Today, Quiet Community","description":"The Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '789ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:34:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enjoy-living-in-this\/7529368400.html","post_id":7529368400,"result_date":"2022-09-03 09:37","title":"Enjoy living in this fantastic and well designed TWO BEDROOMS","description":"Enjoy living in this fantastic and well designed TWO BEDROOM residence boasts all hardwood floors, separate kitchen with white cabinets, gracious living and dining area, large bedrooms, and all tile bath. Enjoy living in the fantastic , elevator doorman building, in the HEART OF CENTER CITY, and just minutes from some of the best dining and night life, in Philadelphia!!!!Walking score a 110!!! Photo's are of model unit.\n235 S 15th St #601","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', '800ft2', 'available oct 27', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T09:33:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-master-bedroom-has-closets\/7529368080.html","post_id":7529368080,"result_date":"2022-09-03 09:36","title":"@@*****@@*****Master bedroom has 3 closets *****@@*****@@","description":"Beautiful and completely renovated private aprt for rent in a sought after neighborhood, on a very quiet street. apartments has decent size living room with update recessed LED lighting, seperate large dining room, kitchen updated with top of the line stainless steel appliances. Two full bathrooms completely redone from top to bottom. The are 3 sunny and large sized bedrooms with plenty of closet space. Master bedroom has 3 closets to add extra storage space. Basement is recently finished with additional fridge, new flooring and room. New washer and dryer. ........................................................Inquire About this Property\nif you interested call here.... show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nYou can enjoy relaxing by the pool or entertaining friends at our picnic and BBQ area.\nThis two bedroom apartment features a spacious living room with private patio or balcony.\n*Remodeled kitchens with premium appliances, designer counters and cabinets (in select apartments)\n*High efficiency full size stackable washer dryer in every home\n*Private balcony\/patio\n*Plush wall to wall carpeting\n*Spacious closets and extra storage\n*Fitness Center with cardio center, free weights and flat screens\n*Bark Park with waste stations\n*Ample guest parking\n*Resort-like pool with resident activities\n*Beautifully landscaped\n*Picnic and play areas\n*Less than 2 miles to the new Tech Center plaza\nRental rates, availability, deposits, apartment features and specials are subject to change without notice.\nVIEW OUR WEBSITE:\nhttp:\/\/morganproperties.com\/monarchcrossing\nMonarch Crossing Apartment Homes, managed by Morgan Properties\n13302-B Garden State Drive\nNewport News, VA 23602\nApartment Features\n* GE Appliances\n* Dishwasher\n* Refrigerator\n* Central Heat and Air\n* Linen Closet\n* Disposal\n* Private Patio or Private Balcony (on select apartments)\n* Air Conditioning\n* Stainless Steel Appliances\n* Full sized Washer and Dryer in unit\n* Energy Star Appliances\n* Whirlpool Appliances\n* Pre-wired for internet and cable\n* Vertical Blinds\n* Electric Stove\n* Walk-in Closet\nif you interested call here.... show contact info","num_images":5,"lat":40.0018,"lng":-75.1179,"attrs":"['1BR \/ 1Ba', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:32:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-flat-level-bedroom-in\/7529366992.html","post_id":7529366992,"result_date":"2022-09-03 09:33","title":"Flat-level 1 Bedroom in Ultra-Modern Building","description":"Flat-level 1 Bedroom in Ultra-Modern Building Welcome to The Magnet 1141 N Front Street! This building is designed with modern amenities and warm finishes as it features great amenities including a shared common roof deck with center city views, bike room, elevator, and parking. This apartment is a 1 bedroom\/1 bathroom. It offers vinyl flooring throughout with large windows for natural lighting. This apartment features all appliances including a microwave and an in-unit washer and dryer. With an awareness of the vibrant, surrounding neighborhood, the builder took great care to provide high-quality sound reducing windows and walls to provide a relaxing home environment. Parking is limited and at an additional cost. Currently offering $1,640 for 18-month lease. $1,690 for 12 month lease. About Fishtown and Northern Liberties: Located in the heart of Fishtown, just a half block off of Girard Ave and two blocks from Frankford Ave. 1141-49 N. Front is walking distance to the best dining and entertainment around: The Fillmore, Fette Sau, Frankford Hall, Johnny Brenda's, Mulherin's, Sugarhouse, the Piazza at Schmidt's, and much, much more. Steps to public transit options - the Market-Frankford Line, the Girard trolley, and SEPTA buses as well as quick access to I-95 and Columbus Ave.\n1141 N Front St #305","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '33516ft2', 'available oct 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T09:29:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fantastic-spacious-bedroom\/7529366803.html","post_id":7529366803,"result_date":"2022-09-03 09:32","title":"Fantastic spacious 2 Bedroom, 2 Bathroom Bi-Level Apartment","description":"Fantastic spacious 2 Bedroom, 2 Bathroom Bi-Level Apartment w\/Parking & Garden In The Heart Of The Art Museum Area! Hardwood Floors, Upgraded Kitchen w\/Dishwasher + Washer\/Dryer. No Pets Allowed. First month, last month & security deposit due at lease signing. Listing agent will provide rental application and prepare the lease. $50 application fee per applicant.\n2307 Fairmount Ave","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1.5Ba', '2328ft2', 'available sep 10', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:28:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1536-frazier-stpa-br-bt-23\/7529365210.html","post_id":7529365210,"result_date":"2022-09-03 09:27","title":"1536 N Frazier St~*PA!! BR-2 BT-2**3 floors apt","description":"Gorgeous 2 bedroom 1 bath apartment on 1536 N Frazier St, Philadelphia, PA, Extremely well cared for property, exudes pride of ownership! Bank has 3 floors, 9 stables, a garage area, new windows, electricity and lighting. In the past it has been used for raising livebarn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctiive with no two views exactly alike. Beautiful with open concept kitchen, living room and dining room. AC, Electric Ceiling Property is zoned for Business Enterprise....could this be the new home of your business? The most adorable house has a custom made kitchen and bathroom cabinets, large eat in kitchen, 2 fireplaces...one in living room and one in family room downstairs. 2 large bedrooms, one being a walk thru. If you have been searching for a property with multiple uses, a farmette, or just a great place to spread out....this is your new home. If you are interested then Come for a faster response, best to text your number","num_images":5,"lat":39.975572,"lng":-75.234322,"attrs":"['2BR \/ 2Ba', '1050ft2', '\\nsunday 2022-09-04\\n', '\\ntuesday 2022-09-06\\n', '\\nfriday 2022-09-09\\n', 'application fee details: NO application fee!!', 'broker fee details: NO broker fee!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:23:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1436-55th-stpa-two-15-bt\/7529364991.html","post_id":7529364991,"result_date":"2022-09-03 09:27","title":"1436 N 55th St,,,(PA) Two\/1.5\/BT- For Rent! First Month Free!","description":"2 bed, 1.5 bath, located in west PHILADELPHIA. Close to public transportation, with driveway access for one vehicle included at no extra fee per month. Laundry facilities are located on the next block. Fully renovated in 2019. Utilities not included. In the past it has been used for raising livebarn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctive with no two views exactly alike. Spacious with open concept kitchen, living room and dining room. AC, Electric. fridge, stove, dishwasher, microwave and pantry; Extremely well cared for property! Washer\/dryer in unit. The twisting design of the tower maximizes the window features and views in every suite. If you are interested in renting or have questions please email me with your inquiries.","num_images":5,"lat":39.974295,"lng":-75.231303,"attrs":"['2BR \/ 1.5Ba', 'application fee details: NO application fee!!', 'broker fee details: NO broker fee!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:23:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-prime-location-just\/7529360083.html","post_id":7529360083,"result_date":"2022-09-03 09:20","title":"Prime location just minutes from Rittenhouse Square!!","description":"Welcome to 621 S 18th located in the heart of Graduate Hospital Prime location just minutes from Rittenhouse Square!! This Unit is 1 Full Floor located on the 1st floor with 2 generously sized bedrooms and 1 bath full bathroom. The apartment also has an open floor plan and kitchen that flows nicely to the spacious private out door patio, great for cooking on the grill or creating your own out door lifestyle. Located on 18th and Kater Streets Just a short walk to Rittenhouse Square Parc, Barclay Prime, Rouge and many more. Close to all the convenient restaurants and shops along South St and close proximity to Fitler Sq and University City. Schedule your tour today!\n621 S 18th","num_images":4,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '2394ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:06:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-residents-of-parc\/7529358603.html","post_id":7529358603,"result_date":"2022-09-03 09:18","title":"Residents of Parc Rittenhouse enjoy world class amenities","description":"Parc Rittenhouse, Unit 1504 is a tastefully updated one bedroom on a high floor featuring lots of natural light and hardwood floors throughout most of the home. Enter into a foyer with ample closet space that sits adjacent to a well-equipped kitchen boasting stainless steel appliances, white shaker cabinetry with brass drawer pulls, granite countertops and a breakfast bar that overlooks the living\/dining area. The bright and cheery bedroom enjoys use of great closet space and a marble-appointed hall bathroom with a single vanity and shower\/tub combination. Residents of Parc Rittenhouse enjoy world class amenities and services including a 24 hour doorman; an amenities suite including a state-of-the-art fitness center and resident lounge with pantry; outdoor pool club with a large pool deck and full size pool; garage parking below the building for an additional fee, subject to availability; and three amazing restaurants on the ground floor, Stephen Starr’s Parc, Devon Seafood and Via Locusta.\n219-29 S 18th St #1504","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '505ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T09:01:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-superb-washington-square\/7529357445.html","post_id":7529357445,"result_date":"2022-09-03 09:18","title":"Superb Washington Square townhome!","description":"Superb Washington Square townhome with iconic kitchen, close to everything. This 3\/4 bedroom, 2-bath townhome features a recently remodeled main level with hardwood floors, oodles of storage, a fireplace (decorative only) and an iconic kitchen with Trilium counters and white Chef appliances including double oven, microwave, gas range and a dishwasher that could have been torn from the pages of a design magazine. There is also a deck off the main floor overlooking the central courtyard. The top level boasts a partially subdivided space which could be two bedrooms or a large primary bedroom oasis with full bathroom. The third level has two additional bedrooms, full bathroom and laundry room. Entry to the townhome is directly off of Rodman Street through a vestibule which provides space for coats, shoes, bikes and the like. Just steps from new public tennis courts and a playground. Close to Pennsylvania Hospital, Jefferson, grocery shopping, restaurants and so much more!\n1119 Rodman St #14","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', '1500ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T08:58:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-we-offer-studios-to\/7529362140.html","post_id":7529362140,"result_date":"2022-09-03 09:17","title":"We offer studios to penthouses in a variety of layouts","description":"The all-new Piazza Alta has been designed from the ground up to be a truly elevating city living experience. We offer studios to penthouses in a variety of layouts and stunning finishes. All apartments offer Brazilian oak hardwood flooring, oversized windows allowing abundant natural sunlight, ceiling fans in every room, washer\/dryer in unit, plenty of closet space. Kitchens include custom cabinetry with soft-close drawers throughout, quartz counters, slab backslashes and mood setting under cabinet lighting. Bathrooms feature an exhilarating waterfall rain shower head with hand-held spray wands and body jets, shower benches and glass doors, illuminated medicine cabinets and storage vanities. Apartments can be found in the dark modern scheme Sleek design, the bright contemporary Scandinavian design or the warm Timeless design. There is absolutely no wrong way to live luxurious. Now let's talk amenities. First, to say we have a pool would be modest. The Aqua Foro pool club is a 25k sq ft rooftop aquatic paradise. Lap and lounge pools, hot tubs, kitchens, cabanas and even a splash pad for the kids. Our 15k sq ft fitness and recovery center features state of the art equipment, Peloton bikes, a massive outdoor terrace, and residents can enjoy regular complimentary trainer-led fitness classes. Also, the fitness center offers relaxing his and her spas with high pressure showers, dry saunas, steam rooms, stand up tanning, and hydro massage beds. If you're looking for a refreshing atmosphere to finish up some work at home or meet up with friends look no further than our 5k sq ft cafe & lounge area. Enjoy a cup of coffee at the stylish diner booths, kick back on a comfortable couch with friends or take in beautiful city views from the outdoor terrace. Located in the beating heart of Northern Liberties just steps away from supermarkets, restaurants, bowling alleys, live music and comedy club venues. A few minutes from nearby highways granting quick and easy access to concerts, sporting events, shopping malls and everything downtown center city has to offer. From sunrise to sunset The Piazza Alta delivers a luxurious and invigorating lifestyle. Take the first step towards your own dream space by visiting us today. *LIMITED TIME PROMOS AVAILABLE. PHOTOS OF MODEL UNIT. PARKING AVAILABLE AT AN ADDITIONAL COST. CALL FOR DETAILS*\n1118 N Hancock St #S","num_images":4,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '480ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:13:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-25-bathroom-duplex\/7529361962.html","post_id":7529361962,"result_date":"2022-09-03 09:17","title":"3 bedroom 2.5 bathroom Duplex in Philadelphia!","description":"3 bedroom, 2.5 bathroom 2 story Duplex on a quiet street in NE Philadelphia. One car attached garage. Gas fireplace. Pantry in kitchen. Washer\/dryer hookups in upstairs laundry room. Walk-in closet in master bedroom. Double sink vanity in master bathroom. Bonus loft area attached to front bedroom. Fenced backyard with grass. None smoking unit. One dog up to 30 lbs with application and pet interview OK. No cats.Extremely well cared for property! Washer\/dryer in unit. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctive with no two views exactly alike. Most recently it has been used for storage of cars, boats,and tools. Wide open spaces on over a 1\/2 acre lot in Hazel Green & Lynn Fanning school district. Move-in ready, freshly painted brick home w\/ NEW appliances included. Brand NEW ultra-durable luxury vinyl plank throughout, attached 2-car garage.GREAT DEAL For $1100.00 –Including Electric - 2 Bedroom Unit, Sunny, in good condition, beautiful fresh paint, beautiful hardwood floors, good windows almost new, Refrigerator, Oven and Fan, and Washer & Dryer in the Unit.Many power outlets and cable outlets throughout the apartment. Off Street car parking, and visitors parking.Kitchen windows overlooks the gorgeous pond and garden. Downstairs you'll find a family room, another full bath, extra large laundry and canning room, a shop area, and an outside stairway with a belch door. There is a whole house generator, Central Air, new gas boiler with 2 zones. 2 solar panels on roof are owned, not leased. If you have been searching for a property with multiple uses, a farmstead, or just a great place to spread out....this is your new home. Please note there are 2 tracts of land on attached deed, totaling the 8.539 acres.Online applications can be submitted at Please contact piterms32574𝐆𝐦𝐚𝐢𝐥com for more information!","num_images":5,"lat":39.9597,"lng":-75.2024,"attrs":"['3BR \/ 2.5Ba', '1565ft2', 'dogs are OK - wooof', 'townhouse', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T09:13:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-immediately\/7529361636.html","post_id":7529361636,"result_date":"2022-09-03 09:15","title":"***AVAILABLE IMMEDIATELY***","description":"***AVAILABLE IMMEDIATELY*** Welcome to 612 S 3rd St., where a cozy two-bedroom, one-bathroom open floor-plan Queen Village apartment, bordering Society Hill and a seven-minute walk from the Delaware River Waterfront awaits you. Although this unit may be best suited for someone who only needs one bedroom, the 2nd bedroom can be appropriately used as either a home-office, or for its intended use- a 2nd bedroom. You’ll find no shortage of natural light throughout this 2nd floor walk-up. The newly rehabbed unit features central air, original wood floors, an exposed brick wall and a wood-burning fireplace with a wooden mantle. The cozy apartment also contains LED light fixtures while the eat-in kitchen includes brand new energy-efficient appliances as well as a brand new energy-efficient in-unit stackable washer and dryer tucked into a laundry closet. The smoke-free courtyard in the rear of the building provides a relaxing environment to take advantage of those days and evenings when the weather’s too good to enjoy from indoors. The basement provides ample storage where tenants have their designated space for their personal items. Whether its comfort you’re seeking, or simply a desire to be near a plethora of cafes, dining, drinking, shopping plus a vibrant nightlife, in addition to a popular waterfront, or maybe a combination of some or all the aforementioned that charming Queen Village offers, then this is the place for you! Go ahead-make your appointment to tour today! ABSOLUTELY NO SMOKING!\n612 S 3rd St #2","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '600ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:11:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-awesome-bedroom-apartment\/7529361138.html","post_id":7529361138,"result_date":"2022-09-03 09:14","title":"Awesome 2 bedroom apartment","description":"Awesome 2 bedroom apartment in Philadelphia  location! One floor living with air conditioning! Enjoy 1200 square feet of living space to furnish and decorate as you wish. Washer\/dryer in unit. Enter the 2nd flr Kitchen Area and Large Living Room with Washer\/dryer. 3rd Flr has Nice Size Bedroom with closet and Full bathroom. A garage area, new windows, electricity and lighting. In the past it has been used for raising live barn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. GREAT DEAL For $788.00 –Including Electric - 2 Bedroom Unit, Sunny, in good condition, beautiful fresh paint, beautiful hardwood floors, good windows almost new, Refrigerator, Oven and Fan, and Washer & Dryer in the Unit. Many power outlets and cable outlets throughout the apartment. Off Street car parking, and visitors parking. Kitchen windows overlooks the gorgeous pond and garden. Downstairs you'll find a family room, another full bath, xtra large and canning room, a shop area, and an outside stairway with a door. There is a whole house generator, Central Air, new gas boiler with 2 zones. 2 solar panels on roof are owned, not leased. If you have been searching for a property with multiple uses, or just a great place to spread out....this is your new home. Please note there are 2 tracts of land on attached deed, totaling the 8.539 acres. Call Here :(2-1-0) 7-3-9-6-8-8-5","num_images":5,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available now', 'EV charging', 'apartment', 'w\/d hookups', 'no smoking', 'carport', 'rent period: monthly']","posted_date":"2022-09-03T09:10:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-renovated-br-1bth\/7529361135.html","post_id":7529361135,"result_date":"2022-09-03 09:14","title":"Recently renovated 3 BR, 1Bth Expanded Cape","description":"Recently renovated 3 BR, 1Bth Expanded Cape in Philadelphia Trees Schools. Garage is oversized; Yard is oversized. Beautiful trek deck in backyard. Beautiful and modern light grey engineered flooring on main level. Lots of windows for sunlight. Brand new appliances in kitchen. 5 New energy efficient air conditioners. Kitchen has bump-out for added space. 200 AMP service for house with additional sep. electric outside for electric car charging. This home is move-in ready. **If you are interested, please text number::arima93761𝐆𝐦𝐚𝐢𝐥com\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nYou can enjoy relaxing by the pool or entertaining friends at our picnic and BBQ area.\nThis two bedroom apartment features a spacious living room with private patio or balcony.\n*Remodeled kitchens with premium appliances, designer counters and cabinets (in select apartments)\n*High efficiency full size stackable washer dryer in every home\n*Private balcony\/patio\n*Plush wall to wall carpeting\n*Spacious closets and extra storage\n*Fitness Center with cardio center, free weights and flat screens\n*Bark Park with waste stations\n*Ample guest parking\n*Resort-like pool with resident activities\n*Beautifully landscaped\n*Picnic and play areas\n*Less than 2 miles to the new Tech Center plaza\nRental rates, availability, deposits, apartment features and specials are subject to change without notice.\nhen. Your new spacious kitchen features all appliances, and plenty of cabinet\nhttp:\/\/morganproperties.com\/monarchcrossing\nMonarch Crossing Apartment Homes, managed by Morgan Properties\n13302-B Garden State Drive\nNewport News, VA 23602\nApartment Features\n* GE Appliances\n* Dishwasher\n* Refrigerator\n* Central Heat and Air\n* Linen Closet\n* Disposal\n* Private Patio or Private Balcony (on select apartments)\n* Air Conditioning\n* Stainless Steel Appliances\n* Full sized Washer and Dryer in unit\n* Energy Star Appliances\n* Whirlpool Appliances\n* Pre-wired for internet and cable\n* Vertical Blinds\n* Electric Stove\n* Walk-in Closet\nBrought to you by Conrad Mazeika at CRMLS - eXp Realty of Long Island ,NY, Inc.\nGreat opportunity to make this BEAUTIFUL HOME yours! Recently renovated 2 bedroom and 1 bath with a nice size patio and a screened lanai. This spacious floor plan has high vaulted ceilings, living-dining room combo, and breakfast bar off the kitchen. Your new spacious kitchen features all appliances, and plenty of cabinets and counter space. Master bedroom has a large walk-in closet and a separate entry to the bathroom. Washer and Dryer hook up inside. Fantastic location, adjacent to Elementary and Middle School, and 4 blocks from Sickles High School. This property is literally just down the street from Citrus Park Mall and close to Veteran's Expressway making it convenient to get to the airport, beaches, and Tampa Bay Area Metropolis. Also, a few minutes drive to restaurants, banks, grocery stores and much more!!! Amazing neighborhood with community pool, NO CDD’s and a low quarterly HOA.\n","num_images":6,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T09:10:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-updated-studio\/7529360951.html","post_id":7529360951,"result_date":"2022-09-03 09:13","title":"Beautifully updated studio on a high floor","description":"Beautifully updated studio on a high floor of The Dorchester at Rittenhouse Square! This residence features parquet wood floors throughout; an updated kitchen with stainless steel appliances, decorative backsplash and wood cabinetry; and a large dressing area that leads to a full hall bathroom with an oversized single vanity and a shower\/tub with white subway tiling. Rent includes a twenty-four hour doorman and all utilities, including basic cable. Use of the building’s state-of-the-art fitness center, seasonal rooftop pool club, and valet parking in the building’s underground garage are available for an additional fee, subject to availability. No pets.\n224 W Rittenhouse Sq #3004","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '573ft2', 'available oct 8', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T09:09:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-br-newly-renovated\/7529360910.html","post_id":7529360910,"result_date":"2022-09-03 09:13","title":"Bright 2 BR, newly renovated, oak floors, central-air","description":"• Beautifully renovated apartment. Spacious and sunny.\n• High Efficiency Central air\n• 10' ceilings\n• Open-plan kitchen and living room\n• New oak floors throughout\n• Fridge, built-in microwave and gas range included\n• Laundry in the building\n• Water included; tenant pays for their own gas and electricity\n• No smoking\nAvailable from October 1st\nIn Kensington on North 5th Street at Cumberland (Unit 2 – second floor)\nEasy access to Fishtown, Northern Liberties, Temple University and I95.\nFirst month, last month and security deposit required to move in.\n","num_images":9,"lat":39.989303,"lng":-75.140755,"attrs":"['2BR \/ 1Ba', 'available oct 1', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:09:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedrooms-with\/7529359323.html","post_id":7529359323,"result_date":"2022-09-03 09:08","title":"Two bedrooms with California Custom Closets","description":"Enter the gated community from Wildey Street and park in the rear of your new home. Enter that home into the modern equipped kitchen with SS Whirlpool Appliance Package, 4 seat kitchen island. Adjoining the kitchen is the spacious dining and living room area. The full finished basement is setup for a media \/ game room with extra space for plenty of additional storage. The second floor consists of two bedrooms with California Custom Closets and shared bathroom while the third floor has the master suite or owner suite. The owner suite will have a pvt entrance separate from the roof top deck access. The master suite boasts large walk in custom closets, dual vanity master bathroom with linen closet and dual shower stall. Full finished roof top deck with lighting system and built in gardening shed. Rooftop Furniture Included in rental! Use the roof top deck all year round! This gated community is in a great location near the restaurant district of Girard Ave and Frankford Ave (Lloyd, Kraftwork, Johnny Brenda's, Frankford Hall, E.G.G. and much more), Planet Fitness, CVS, Dunkin Donuts, Wawa are all close by and a short walking distance to The Piazza at Schmidt's. Convenient access to I95 and the Frankford Blue Line. Must See!\n1103 E Berks St","num_images":4,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2.5Ba', '1696ft2', 'available oct 1', 'apartment', 'laundry in bldg', 'carport', 'rent period: monthly']","posted_date":"2022-09-03T09:04:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-huge-mother-in-law\/7529358636.html","post_id":7529358636,"result_date":"2022-09-03 09:06","title":"Huge Mother-in-Law Apartment with New Kitchen and Balcony","description":"The apartment is a mother-in-law suite, which means you go through the owners house to get to the apartment. Because of that, we are being really careful who we rent to. We would prefer a couple or single person, who loves their own space, but will respect our space as they go through. No parties are allowed. The rent is lower than normal for this size apartment.\nHuge One bedroom apartment with an extra room that can be curtained off or used as a den. The apartment has tons of gorgeous natural light. There are six closets in the apartment so it has a lot of storage. Hardwood floors through out. Balcony overlooking the corner of 48th and Cedar.\nNew kitchen with granite countertops, subway tile, and appliances. Garage disposal too.\nCats are ok, but no dogs. We have a dog though so you must like dogs.\nThere is a Washer and Dryer in the building. Tenants pay electrical and gas. Gas bill is only for the stove.\nThis apartment is a block from Baltimore Avenue, 4 blocks from Clark Park, a block from Mariposa Grocery store, Local Pez, Gold Standard, and near many restaurants and bars. Its a great family friendly neighborhood with large trees.\nCall Mike to set up an appointment. No calls before 9 am or after 9 pm\n","num_images":12,"lat":39.949487,"lng":-75.218994,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T09:02:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-pet-friendly-ranovated\/7529356401.html","post_id":7529356401,"result_date":"2022-09-03 08:58","title":"Pet Friendly Ranovated Townhome with New Kitchen and yardy","description":"Welcome to this beautiful cozy townhome with old world charm and character at the end of a cul-de-sac. Great two-bedroom property with complete privacy right in the middle of the city.\nThis house has original heart of pine wooden floors and features a spiral staircase. Exposed brick accent wall in the living room with plenty of natural light. Brand new bathroom and renovated kitchen in 2021. Built in washer and dryer unit on the first floor and plenty of storage in the basement.\nSpacious brick back patio with a large Magnolia tree that gives this back yard shade and privacy in the summer.\nThis house is pet friendly.\nThe house is only two blocks from the market street El, which gives easy access to Center City and elsewhere. Easy walking distance to University of Pennsylvania, Drexel University, Clark Park, playgrounds, shopping and grocery stores. Additionally, there are multiple dining and entertainment options within walking distance. Major highways and access to center city and the airport is just minutes away.\nPhone interviews first before touring.\nFor the safety of everyone, mask must be warn when touring the property and hand sanitizer.\nBackground checks are done with National Tenant Network for all candidates. There is a security deposit and background check fee.\nLease ends August 30, 2023.\n","num_images":10,"lat":39.956465,"lng":-75.207102,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T08:54:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-with-the-free-month-rent\/7529355615.html","post_id":7529355615,"result_date":"2022-09-03 08:55","title":"With the free month, rent averages out to $2520 a month","description":"1 MONTH FREE for a move in by October 1. With the free month, rent averages out to $2520 a month. This completely renovated apartment is just steps away from the historic Rittenhouse Sq Park and offers central air and an in-unit washer\/dryer. Pristine hardwood floors flow throughout the unit. The separate kitchen is outfitted with oak cabinets, granite countertops, and a new dishwasher, and microwave. Adjacent to the kitchen is an absolutely huge living room. The three bathrooms all come with upgraded vanities and showers. First year lease ends July 31 to get it back on the summer schedule, but then you can renew for a full year going forward.\n1936 Spruce St #1B","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['4BR \/ 3Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T08:51:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-month-free-for-move-in-by\/7529355100.html","post_id":7529355100,"result_date":"2022-09-03 08:53","title":"1 MONTH FREE for a move in by October 1!","description":"1 MONTH FREE for a move in by October 1. With the free month, rent averages out to $2520 a month. Beautifully renovated bi-level 4 bedroom 3 bathroom apartment with central air and in-unit laundry in a fantastic location that's a couple of blocks away from the Walnut-Locust broad street line stop, Whole Foods and ACME and Jefferson University. The gourmet kitchens boast granite counter-tops, stainless steel appliances, and beautiful cabinets. Appliances include a microwave, dishwasher, and garbage disposal. The bathrooms are nicely renovated and contain stunning subway tile, a bathtub, and a striking vanity. The outside walls are lined with double pane windows that help insulate the apartment. Pristine hardwood flooring flows through the unit. First year lease ends July 31 to get it back on the summer schedule, but then you can renew for a full year going forward.\n1104 Spruce St #3R","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['4BR \/ 3Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T08:49:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-bathroom\/7529354135.html","post_id":7529354135,"result_date":"2022-09-03 08:49","title":"Large 4 bedroom\/2 bathroom with private backyard!","description":"Large 4 bedroom\/2 bathroom with private backyard. Quick, easy walk to Drexel and Penn campuses, grocery stores, and subway lines. Dishwasher, laundry in-unit, pets OK.\" Central air, $100 one-time fee per pet.\n4216 Powelton Ave","num_images":3,"lat":39.9597,"lng":-75.2024,"attrs":"['4BR \/ 2Ba', '2000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T08:45:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-for-rent-first\/7529353269.html","post_id":7529353269,"result_date":"2022-09-03 08:46","title":"1 bed, 1 bath for rent! first month free!","description":"1 bed, 1 bath, located in west PHILADELPHIA. Close to public transportation, with driveway access for one vehicle included at no extra fee per month. Laundry facilities are located on the next block. Fully renovated in 2019. Utilities not included. In the past it has been used for raising livebarn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctiive with no two views exactly alike. Spacious with open concept kitchen, living room and dining room. AC, Electric. fridge, stove, dishwasher, microwave and pantry; Extremely well cared for property! Washer\/dryer in unit. The twisting design of the tower maximizes the window features and views in every suite.","num_images":6,"lat":39.975852,"lng":-75.233544,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T08:42:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-house-in-ne\/7529349033.html","post_id":7529349033,"result_date":"2022-09-03 08:33","title":"Beautiful House in NE - 4 Bdrm+2 Bath+Central Air+Garage+Fenced Yard","description":"This beautiful 4 bedroom\/ 2 bathroom house will be ready for new tenants 11\/15\/2022\nMain Floor - Large bright living room with dining area and great kitchen with granite countertop and refrigerator. 3 large bedrooms with closets and brand new 3 pieces hall bathroom with tub.  There are hardwood floor in the living\/dining and all bedrooms and tile in the kitchen and bathroom.\nGround Floor - Huge (double size) bedroom (which can be use as a family room) with 2 windows, walk -in closet and  3 pieces hall bathroom with stall shower, and separated laundry area with washer\/dryer.\nThere is a garage and fenced back yard.\nThe location is great. You don't have to drive to buy groceries, clothes, furniture and other necessities of life because they are within reach at Roosevelt Mall and Target store nearby.\nGood credit and proof of income - must.\nWe run credit report and verify the employment.\nPlease call  show contact info\nfor Cecilia to set up a time to view the house.","num_images":16,"lat":40.0606,"lng":-75.0471,"attrs":"['4BR \/ 2Ba', 'available nov 15', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T08:23:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bedroom-bath\/7529350066.html","post_id":7529350066,"result_date":"2022-09-03 08:32","title":"Gorgeous 2 bedroom 1 bath apartment on philadelphia, PA","description":"Gorgeous 2 bedroom 1 bath apartment on philadelphia, PA,. Extremely well cared for property, exudes pride of ownership! Bank has 3 floors, 9 stables, a garage area, new windows, electricity and lighting. In the past it has been used for raising livebarn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctiive with no two views exactly alike. Beautiful with open concept kitchen, living room and dining room. AC, Electric Ceiling Property is zoned for Business Enterprise....could this be the new home of your business? The most adorable house has a custom made kitchen and bathroom cabinets, large eat in kitchen, 2 fireplaces...one in living room and one in family room downstairs. 2 large bedrooms, one being a walk thru. If you have been searching for a property with multiple uses, a farmette, or just a great place to spread out....this is your new home. If you are interested then Come for a faster response, best to text your number","num_images":3,"lat":40.0568,"lng":-75.1379,"attrs":"['2BR \/ 1Ba', '1050ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T08:28:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-perfect-beds-and-bath\/7529337617.html","post_id":7529337617,"result_date":"2022-09-03 07:47","title":"PERFECT 3 BEDS AND 1 BATH HOUSE FOR RENT","description":"Newly renovated townhome in the Castor Gardens section of Philadelphia! Newly finished hardwood floors and freshly painted walls. Brand new heating system and central AC. Brand new open kitchen with stainless steel appliances, all hardwood floors, finished basement with laundry and one car garage.","num_images":8,"lat":40.063,"lng":-75.08,"attrs":"['3BR \/ 1Ba', '1253ft2', 'air conditioning', 'application fee details: $50 per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T07:16:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-where-luxury-meets\/7529339629.html","post_id":7529339629,"result_date":"2022-09-03 07:42","title":"Where Luxury Meets Convenience","description":"Available: 10\/11\/22\nApt. 2410 — Oxford floor plan — 1,203 sq. ft. — $3,460\nThis 4th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-09-03T07:31:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-awesome-bedroom-apartment\/7529337430.html","post_id":7529337430,"result_date":"2022-09-03 07:34","title":"**Awesome 3 bedroom apartment in unbeatable Philadelphia, PA location!","description":"Looking for a new place to call home but can't find the perfect one at the right price? Look no further, this marvelously renovated home on the outskirts of Philadelphia has it all! as you walk in through the front door, you are welcomed in by a spacious entryway that can function in multiple ways, such as a coat room, a room to relax and bathe in the sun,  & many more.  Upon walking through the entryway you will also be greeted by a naturally lit open concept floor plan, featuring your living room,  updated powder room,  & updated kitchen with quartz countertops. The second floor of this home features a primary bedroom with 3 large windows providing ample natural light throughout the day, two nice sized secondary bedrooms, and a breathtaking full bath accessed via barn door.  Located conveniently off of Cobbs creek parkway,  you can find yourself  minutes away from key locations such as university city, the Philadelphia International Airport, The Lincoln Financial Field, and many others. Don't miss this great opportunity, schedule your showing today!\n#CONTACT TEXT ME : show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nYou can enjoy relaxing by the pool or entertaining friends at our picnic and BBQ area.\nThis two bedroom apartment features a spacious living room with private patio or balcony.\n*Remodeled kitchens with premium appliances, designer counters and cabinets (in select apartments)\n*High efficiency full size stackable washer dryer in every home\n*Private balcony\/patio\n*Plush wall to wall carpeting\n*Spacious closets and extra storage\n*Fitness Center with cardio center, free weights and flat screens\n*Bark Park with waste stations\n*Ample guest parking\n*Resort-like pool with resident activities\n*Beautifully landscaped\n*Picnic and play areas\n*Less than 2 miles to the new Tech Center plaza\nRental rates, availability, deposits, apartment features and specials are subject to change without notice.\nWelcome to Acacia Park Apartments, located at the foot of the San Bernardino mountains, across from Cal-State University, San Bernardino. We offer spacious one and two bedrooms with the option to rent or bring your own washer\/dryer and\/or refrigerator. We welcome small pets upon approval. Our beautifully landscaped community has a resort-style pool, BBQ area, tennis courts, volleyball sand court, and a fitness center for all of our residents to enjoy.\nWe have a 2-bedroom available for SEPTEMBER move in. Call today for application details.\n*PRICES CHANGE DAILY*\nOur office is opened everyday, including Sundays, from 9AM - 6PM.\nStop by for a tour. We are located at:\n5280 N. Little Mountain Dr. San Bernardino, CA. 92407\nWe look forward to meeting you!\nMonarch Crossing Apartment Homes, managed by Morgan Properties\nPhiladelphia, PA 19142\nApartment Features\n* GE Appliances\n* Dishwasher\n* Refrigerator\n* Central Heat and Air\n* Linen Closet\n* Disposal\n* Private Patio or Private Balcony (on select apartments)\n* Air Conditioning\n* Stainless Steel Appliances\n* Full sized Washer and Dryer in unit\n* Energy Star Appliances\n* Whirlpool Appliances\n* Pre-wired for internet and cable\n* Vertical Blinds\n* Electric Stove\n* Walk-in Closet\nBrought to you by Saman Nasir at CRMLS - eXp Realty of California, Inc. CA DRE#01878277\nWalk Into this Traditional Home in Valley Village with a Large Lot. Great Property to Live in and add an ADU to the Detached Garage. High Vaulted Wood Ceilings in the Living Room and Bedrooms, Hardwood Floors, Extra Large Closets, Large Bedrooms. Kitchen with Formal Dining Room. This home has a lot of Character and could be completely upgraded or move in. Patio converted into Third Bedroom\/office or Den with Permits (Previous Seller) and Separate Laundry Room, Beautiful Back yard with Pool and Spa and Waterfall. Front Porch is Nice to Sit out on with Large Landscaped front Yard with Tree Lined Ficas that will Grow and Create full Privacy. Wonderful Family Neighborhood, Tree Lined Street, Colfax Charter Elementary highly ranked school, Walking distance to many places in Valley Village and Studio City, Open Saturday and Sunday 12-3pm.\n","num_images":0,"lat":39.9223,"lng":-75.2338,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T07:14:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gas-heat-included-washer\/7529334427.html","post_id":7529334427,"result_date":"2022-09-03 06:49","title":"GAS\/HEAT INCLUDED! WASHER\/DRYER IN UNITS!!","description":"GAS\/HEAT INCLUDED! WASHER\/DRYER IN UNITS!!\nYour own private getaway of lush gardens directly off the bustling and quaint Germantown Ave\/Chestnut Hill shopping and dining area. Close to houses of worship, schools - you are at the heart of it all. This is a promotion price that wont last! All units come with hardwood floors throughout, updated kitchens and ceramic tile bathrooms. Loads of windows create a bright, sunny living experience.If you would like a showing please text-30 351 573 78\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n. . You can enjoy relaxing by the pool or entertaining friends at our picnic and BBQ area. This two bedroom apartment features a spacious living room with private patio or balcony. *Remodeled kitchens with premium appliances, designer counters and cabinets (in select apartments) *High efficiency full size stackable washer dryer in every home *Private balcony\/patio *Plush wall to wall carpeting *Spacious closets and extra storage *Fitness Center with cardio center, free weights and flat screens *Bark Park with waste stations *Ample guest parking *Resort-like pool with resident activities *Beautifully landscaped *Picnic and play areas *Less than 2 miles to the new Tech Center plaza Rental rates, availability, deposits, apartment features and specials are subject to change without notice. hen. Your new spacious kitchen features all appliances, and plenty of cabinet http:\/\/morganproperties.com\/monarchcrossing Monarch Crossing Apartment Homes, managed by Morgan Properties 13302-B Garden State Drive Newport News, VA 23602 Apartment Features * GE Appliances * Dishwasher * Refrigerator * Central Heat and Air * Linen Closet * Disposal * Private Patio or Private Balcony (on select apartments) * Air Conditioning * Stainless Steel Appliances * Full sized Washer and Dryer in unit * Energy Star Appliances * Whirlpool Appliances * Pre-wired for internet and cable * Vertical Blinds * Electric Stove * Walk-in Closet Brought to you by Conrad Mazeika at CRMLS - eXp Realty of California, Inc. CA DRE#01878277 Great opportunity to make this BEAUTIFUL HOME yours! Recently renovated 2 bedroom and 1 bath with a nice size patio and a screened lanai. This spacious floor plan has high vaulted ceilings, living-dining room combo, and breakfast bar off the kitchen. Your new spacious kitchen features all appliances, and plenty of cabinets and counter space. Master bedroom has a large walk-in closet and a separate entry to the bathroom. Washer and Dryer hook up inside. Fantastic location, adjacent to Elementary and Middle School, and 4 blocks from Sickles High School. This property is literally just down the street from Citrus Park Mall and close to Veteran's Expressway making it convenient to get to the airport, beaches, and Tampa Bay Area Metropolis. Also, a few minutes drive to restaurants, banks, grocery stores and much more!!! Amazing neighborhood with community pool, NO CDD’s and a low quarterly HOA.","num_images":5,"lat":40.061687,"lng":-75.192187,"attrs":"['1BR \/ 1Ba', '700ft2', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T06:45:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-bedroom-apt-bath\/7529327605.html","post_id":7529327605,"result_date":"2022-09-03 05:16","title":"Lovely 2 Bedroom Apt- 2 Bath - Apt - Only $900","description":"Lovely Completely renovated and painted (2) Bedroom Apt- 2 Bath - Apt. # 3, First Floor of Retro Building in Philadelphia . Newly renovated Kitchen and bath. Heat and Hot water included, Clean Polished Hardwood Floors, clean and quiet area and building.\nLaundry facility in Building.\nNear Transportation (1) block to Boulevard and 3 blocks to shopping. Buses are 1 block away on Kennedy Blvd, nearby shopping , near highways. About 10 blocks to Journal Square and 10 min. to Holland or Lincoln Tunnels. Looking for clean, quiet professional person or couple. NO SMOKING\/DRUGS AND PETS OK! Picture coming home every day to the warm embrace of meticulous landscaping, comfortable homes, and thoughtful amenities tailored to enhance your life. Give your mail i will contact you Very Soon,  show contact info\nText me.\n","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '1000ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T05:04:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2br-15ba-new-bathrooms\/7529325198.html","post_id":7529325198,"result_date":"2022-09-03 04:38","title":"🐕🐕🐕2BR x 1.5Ba new bathrooms-apartment🐕🐕🐕","description":"Sprawling 2 Bedroom, 1.5 Baths + Den available for rent in October 2022. Start date to be determined as renovations are still being completed.\nThis first floor apartment, about 1300 square feet features a full new kitchen, new bathrooms, LVP flooring throughout, soaring high ceilings, recessed lighting, and ample closet space. Washer and dryer can be provided by landlord, hookups for stackable washer\/dryer available.\nPets are welcome. Pet fee's and restrictions apply. $300 one time, non-refundable pet fee and an additional $25\/mo. pet rent per pet. Landlord will consider pet meet and greet. Renters insurance required. Residents must have minimum credit score of 400 .\n","num_images":4,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 1.5Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T04:14:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newlyrenovated-bed-bath\/7529320934.html","post_id":7529320934,"result_date":"2022-09-03 03:17","title":"Newly~renovated 2 Bed 1 Bath Apartment in Philadelphia, PA !!","description":"Lovely Completely renovated and painted (2) Bedroom Apt- 1 Bath - Apt. # 3, First Floor of Retro Building in Philadelphia, PA  , . Newly renovated Kitchen and bath. Heat and Hot water included, Clean Polished Hardwood Floors, clean and quiet area and building.\nLaundry facility in Building.\nNear Transportation (1) block to Boulevard and 3 blocks to shopping. Buses are 1 block away on Kennedy Blvd, nearby shopping , near highways. About 10 blocks to Journal Square and 10 min. to Holland or Lincoln Tunnels. Looking for clean, quiet professional person or couple. NO SMOKING\/DRUGS AND PETS OK! Picture coming home every day to the warm embrace of meticulous landscaping, comfortable homes, and thoughtful amenities tailored to enhance your life. Give your mail i will contact you Very Soon, lindapoole974gmail.com","num_images":3,"lat":39.9845,"lng":-75.2282,"attrs":"['2BR \/ 1Ba', '640ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T02:59:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-very-nice-bedr00m-bathrm\/7529314254.html","post_id":7529314254,"result_date":"2022-09-03 01:36","title":"*Very nice 3 bedr00m 2 bathrm house for rent**","description":"Beautifully renovated 3 bedroom 2 bathroom house. Includes: linoleum floors throughout and in kitchen and bathroom, refrigerator and stove\/range, double kitchen sinks, bathtub\/ shower, blinds, 2 car garage, driveway, and a big backyard. View and experience with in-person walk-through showing. Not virtual on-screen tour. Section 8 is welcome. All veterans and veteran programs welcomed.\n####CALL ME AT;;;;  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nYou can enjoy relaxing by the pool or entertaining friends at our picnic and BBQ area.\nThis two bedroom apartment features a spacious living room with private patio or balcony.\n*Remodeled kitchens with premium appliances, designer counters and cabinets (in select apartments)\n*High efficiency full size stackable washer dryer in every home\n*Private balcony\/patio\n*Plush wall to wall carpeting\n*Spacious closets and extra storage\n*Fitness Center with cardio center, free weights and flat screens\n*Bark Park with waste stations\n*Ample guest parking\n*Resort-like pool with resident activities\n*Beautifully landscaped\n*Picnic and play areas\n*Less than 2 miles to the new Tech Center plaza\nRental rates, availability, deposits, apartment features and specials are subject to change without notice.\nhen. Your new spacious kitchen features all appliances, and plenty of cabinet\nMonarch Crossing Apartment Homes, managed by Morgan Properties\nApartment Features\n* GE Appliances\n* Dishwasher\n* Refrigerator\n* Central Heat and Air\n* Linen Closet\n* Disposal\n* Private Patio or Private Balcony (on select apartments)\n* Air Conditioning\n* Stainless Steel Appliances\n* Full sized Washer and Dryer in unit\n* Energy Star Appliances\n* Whirlpool Appliances\n* Pre-wired for internet and cable\n* Vertical Blinds\n* Electric Stove\n* Walk-in Closet\nBrought to you by Conrad Mazeika at CRMLS - eXp Realty of California, Inc. CA DRE#01878277\nGreat opportunity to make this BEAUTIFUL HOME yours! Recently renovated 2 bedroom and 1 bath with a nice size patio and a screened lanai. This spacious floor plan has high vaulted ceilings, living-dining room combo, and breakfast bar off the kitchen. Your new spacious kitchen features all appliances, and plenty of cabinets and counter space. Master bedroom has a large walk-in closet and a separate entry to the bathroom. Washer and Dryer hook up inside. Fantastic location, adjacent to Elementary and Middle School, and 4 blocks from Sickles High School. This property is literally just down the street from Citrus Park Mall and close to Veteran's Expressway making it convenient to get to the airport, beaches, and Tampa Bay Area Metropolis. Also, a few minutes drive to restaurants, banks, grocery stores and much more!!! Amazing neighborhood with community pool, NO CDD’s and a low quarterly HOA.\nCALL ME NOW ...(8.5.5) 9.6.0-5.8.5.7","num_images":1,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T01:32:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bed-bath\/7529570150.html","post_id":7529570150,"result_date":"2022-09-03 17:00","title":"Beautiful 1 Bed 1 Bath apartment for rent in philadelphia","description":"Beautiful 1 Bed 1 Bath apartment for rent in philadelphia . $650 all utilities included. NEWER HARDWOOD FLOOR THROUGHOUT apartment. Living room and kitchen on the first floor. One bedrooms and bathroom on second floor. NEW WINDOWS THROUGHOUT! Off-street parking. Private yard. .The twisting design of the tower maximizes the window features and views in every suite. Available for move in. Other features of this great unit include hardwood floors and lots of closet space. Heat is included, and laundry and bike storage. Also included is the use of a large storage locker. Utilities are included. And because of this unique design, every suite is distinctiive with no two views exactly alike. Spacious with open concept kitchen, living room and dining room. AC, Electric. fridge, stove, dishwasher, microwave and pantry; Extremely well cared for property! Washer\/dryer in unit. The twisting design of the tower maximizes the window features and views in every suite. If interested please massage me @  show contact info","num_images":3,"lat":39.8359,"lng":-91.7538,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T16:56:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/doylestown-short-term-house-for-rent\/7529569483.html","post_id":7529569483,"result_date":"2022-09-03 16:58","title":"Short term house for rent","description":"We're looking to rent our house from January to May.\nIt's four bedrooms, three bathrooms, partially finished basement, large yard, deck and hot tub.\nCentral Bucks school district.  If you're in the market for a house while you're waiting for settlement, or your home to be built, this could work for you.  Fully furnished.\n","num_images":1,"lat":40.3054,"lng":-75.1489,"attrs":"['4BR \/ 3Ba', '2300ft2', 'available jan 9, 2023', 'furnished', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T16:54:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-beautifully-renovated\/7529546526.html","post_id":7529546526,"result_date":"2022-09-03 16:56","title":"Beautifully renovated 2 bedroom 1 bathroom Apartment","description":"Beautifully renovated 2 bedroom 1 bathroom Apartment Riverfront Penthouse Suite in Philadelphia. Includes: linoleum floors throughout and in kitchen and bathroom, refrigerator and stove\/range, double kitchen sinks, bathtub\/ shower, blinds, 2 car garage, driveway, and a big backyard. View and experience with in-person walk-through showing. The Yale Shuttle stops just across the street from our front door. The live in Property Manager maintains the property to perfection and is available around the clock to take care of emergencies and repy suite. And because of this unique design, every suite is distinctive with no two views exactly alike. Move-in ready, freshly painted brick home w\/ NEW appliances included. Brand NEW ultra-durable luxury vinyl plank throughout, Credit check, and background check. This rental is pets friendly and offers off-street parking! Text me if interested:~  show contact info","num_images":3,"lat":39.9579,"lng":-75.2681,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T15:58:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3bd-1br-first-floor\/7529563142.html","post_id":7529563142,"result_date":"2022-09-03 16:53","title":"3bd\/1br First Floor Reserved parking  -Fantastic newer home","description":"Is 1 floor living something you have been dreaming of and thinking it just doesn't exist? Well you have found it here!! This charming 3 bed 1 bath home is all on 1 floor. With this you also get an attached oversized 2 car garage. WAIT! We are not done, as a bonus you get your very own separate oversized indoor chicken coop.","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T16:38:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-newly-renovated\/7529560736.html","post_id":7529560736,"result_date":"2022-09-03 16:36","title":"Spacious newly renovated 1-Bed Apt in Philadelphia@@","description":"Spacious newly renovated 1-Bed 1 Bath Apt in Downtown Philadelphia. Beautiful and spacious home. Please text at the number provided in this post to learn more:  show contact info\nThe apartment has been newly renovated, new floors, new kitchen cabinets countertops, faucets, stove. Freshly painted. It has a kitchen, living room, bathroom, and one bedroom. Utilities are included in this price. There is on street permit parking. The apartment is available immediately. A garage area, new windows, electricity and lighting. In the past it has been used for raising livebarn stock, with the pasture located behind the home. Full bath, xtra large laundy and canning room, a shop area, and an outside stairway with a belco door. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctiive with no two views exactly alike. Spacious with open concept kitchen, living room and dining room. AC, Electric. The most adorable house has a custom made kitchen and bathroom cabinets, large eat in kitchen, 1 fireplaces...one in living room 1 large bedroom, one being a walk thru. Closet and cabinets are aplenty, you won't run out of storage! Kitchen windows overlooks the gorgeous pond and garden.Please text at the number provided in this post to learn more:  show contact info","num_images":3,"lat":40.0018,"lng":-75.1179,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T16:32:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ardmore-mini-efficiency\/7529558652.html","post_id":7529558652,"result_date":"2022-09-03 16:31","title":"Mini efficiency","description":"Private entrance and private bath.","num_images":4,"lat":40.002,"lng":-75.2966,"attrs":"['1BR \/ 1Ba', '225ft2', 'available sep 6', '\\ntuesday 2022-09-06\\n', '\\nsunday 2022-09-18\\n', '\\nmonday 2022-09-26\\n', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T16:27:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/skippack-bedroom-apartment\/7529558066.html","post_id":7529558066,"result_date":"2022-09-03 16:29","title":"1 Bedroom Apartment","description":"Quaint one bedroom barn apartment located in Skippack Township.  Hardwood floors. Washer\/Dryer Hook-up.\nApartment is move-in ready, neat and clean.  Off-street parking.  Tenant responsible for electric and oil heat.  Landlord pays for trash removal and sewer. No Pets. Please call Mark for a showing at  show contact info\n.\n","num_images":5,"lat":40.207164,"lng":-75.397325,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T16:25:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-quiet-1br-ca-fp-private\/7529554828.html","post_id":7529554828,"result_date":"2022-09-03 16:21","title":"Quiet 1BR, CA, FP, Private Deck, GD, DW","description":"Rare 2-story apartment in the prettiest part of Society Hill. The second floor of this charming space features a large, private deck with a view.... Lovely pre-Civil War building; solid oak floors, 2 wood-burning Fireplaces. TWO bathrooms, eat-in kitchen, private deck, central air\/heat.\nLiving room level connects to bedroom level via circular stair.\nSunny rooms, hardwood floors. Located in the quiet rear of the building. Walking distance to everything you need - garage rental, shopping, transportation. This apartment features central air\/heat; 2 working wood-burning fireplaces, an eat-in kitchen, a private terrace, and 2 bathrooms (one on each floor). References required. Available September 18.\n","num_images":21,"lat":39.943335,"lng":-75.147189,"attrs":"['1BR \/ 1.5Ba', '960ft2', 'available sep 18', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T16:17:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2br-2ba-condo-located-in\/7529528798.html","post_id":7529528798,"result_date":"2022-09-03 16:17","title":"2BR\/2BA condo located in desirable Bakers Bay.","description":"2BR\/2BA condo located in desirable Bakers Bay. This condo has new carpets, fresh paint, a newer hot water heater & is move in ready! The spacious living room has 2 sliding doors that lead to a relaxing patio with storage closet. A fireplace is the focal point of the living room surrounded by built in shelving. The main bedroom includes a nice sized bathroom with a stall shower, dressing area and spacious closet. There is also a sliding door from the main bedroom leading to the patio. Bakers Bay is a Gated Community located in the East Torresdale Section of NE Philadelphia. Your monthly condo fee of $471 includes a gated entrance to the property, 2 pools indoor\/outdoor (both heated), hot tub, sauna rooms, 2 tennis courts, library, river view observation deck, card room, ping pong, billiards, fitness center, organized activities, your monthly water fee is included, trash pick up, snow removal, common area maintenance, lawn service, basic Comcast cable w\/one box & building insurance.","num_images":7,"lat":40.0634,"lng":-74.999,"attrs":"['2BR \/ 2Ba', '1381ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T15:17:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-high-speed-internet-access\/7529552882.html","post_id":7529552882,"result_date":"2022-09-03 16:16","title":"High Speed Internet Access, Built-in Microwave Ovens, Air Conditioning","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Resort-Style Swimming PoolSpeakeasy Wine RoomState-of-the-Art Fitness CenterGas FireplacesWireless & High Speed Internet AccessDisability AccessPicnic AreaFull Size Washer and Dryer in All UnitsOversized ClosetsOnline Payments AvailableAir ConditioningDog ParkCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/tcnz2pgm\/JeffersonatWestTown\n","num_images":9,"lat":39.9441,"lng":-75.5882,"attrs":"['3BR \/ 2Ba', '1394ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: weekly']","posted_date":"2022-09-03T16:12:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-two-bedroom-apartment-in\/7529545067.html","post_id":7529545067,"result_date":"2022-09-03 15:59","title":"Two Bedroom Apartment w\/ In Home Washer & Dryer","description":"The Glen at Lafayette Hill Bedroom: 2 | Bathroom: 2Square Footage: 1043 sq ftMonthly Rent: $2229 - $2692 show contact info\nCommunity Description  Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.    Community Amenities− Business Center− Cardio Machines− Conference Room− Elevator− Furnished Units Available− Gated, Controlled Access− Package Service− Planned Social Activities− Recycling− Renters Insurance Program− BBQ Picnic Garden− Billiards, Club Lounge, Cafe Area, Library and Community Room− Fitness Center w\/ Free Weights, Weight Machines− Message Therapist Practice On-site− Outdoor Cafe & Coffee Bar− Outdoor Patio Lounge− Sprinkler System− Storage Space− Wi-Fi at ClubhouseUnit Features− Air Conditioning & Heating− Cable Ready− Carpet− Ceiling Fans (Select Floor Plans)− Dining Room− Heating− Refrigerator, Freezer and Ice Maker− Tub\/Shower− Wi-Fi− Window Coverings− Dishwasher− High Speed Internet Access− Linen Closet− Microwave− Storage Units− Tile Floors− Trash Compactor− Walk-In Closets (Select Floor Plans)− Washer\/Dryer− Wheelchair Accessible (Rooms)  Contact InformationVisit Us: 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.com   Additional DetailsPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthManagement Company: Paradise Management, LLC Price is subject to change without prior noticeAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7FEB687AB31D403\n","num_images":16,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1042ft2', 'available oct 14', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-09-03T15:55:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-24-hour-fitness-center\/7529535530.html","post_id":7529535530,"result_date":"2022-09-03 15:36","title":"24 Hour Fitness Center, Game Lounge, Walk in Closets, Island Kitchens","description":"Bedrooms: 1Bathrooms: 1Square Feet: 796Date Available: 2022-09-22Address: 1000 South Broad Street\nExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/w7h4a7ie\/lincoln-square\n","num_images":1,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '796ft2', 'available sep 22', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-09-03T15:32:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-individual-intrusion\/7529533667.html","post_id":7529533667,"result_date":"2022-09-03 15:32","title":"Individual Intrusion Alarms, Dishwasher, Newly Renovated Interiors","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:GaragesPicnic AreaCar Wash AreaNewly Renovated InteriorsHigh Speed Internet AccessOnline Payments AvailablePlaygroundResort-Style Swimming PoolGas FireplacesFull Size Washer and Dryer in All UnitsCable ReadyIndividual Intrusion AlarmsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/3h7zve73\/JeffersonatWestTown\n","num_images":9,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1271ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: weekly']","posted_date":"2022-09-03T15:28:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-awesome-nice-bedroom\/7529529869.html","post_id":7529529869,"result_date":"2022-09-03 15:23","title":"Awesome & Nice!! 2 bedroom apartment in unbeatable Philadelphia","description":"Awesome & Nice!! 2 bedroom apartment in unbeatable Philadelphia location! One floor living with air conditioning! Enjoy 1028 square feet of living space to furnish and decorate as you wish.Washer\/dryer in unit. Enter the 2nd flr Kitchen Area and Large Living Room with Washer\/dryer. 3rd Flr has Nice Size Bedroom with closet and Full bathroom. A garage area, new windows, electricity and lighting. In the past it has been used for raising livebarn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. GREAT DEAL For $650.00–Including Electric - 2 Bedroom Unit, Sunny, in good condition, beautiful fresh paint, beautiful hardwood floors, good windows almost new, Refrigerator, Oven and Fan, and Washer & Dryer in the Unit. Many power outlets and cable outlets throughout the apartment.*Remodeled kitchens with premium appliances, designer counters and cabinets (in select apartments) *High efficiency full size stackable washer dryer in every home *Private balcony\/patio *Plush wall to wall carpeting *Spacious closets and extra storage *Fitness Center with cardio center, free weights and flat screens *Bark Park with waste stations *Ample guest parking *Resort-like pool with resident activities *Beautifully landscaped *Picnic and play areas *Less than 2 miles to the new Tech Center plaza.If you are interested text me here:  show contact info","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T15:19:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-built-in-microwave-ovens\/7529520367.html","post_id":7529520367,"result_date":"2022-09-03 15:03","title":"Built-in Microwave Ovens, Resort-Style Swimming Pool, Playground","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:PlaygroundCar Wash AreaDog ParkDishwasherSerene Wooded ViewExclusive & Newly Renovated ClubhouseCeiling FansDisability AccessOnline Payments AvailableBuilt-in Microwave OvensOversized ClosetsGas FireplacesCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/5i2lkzjr\/JeffersonatWestTown\n","num_images":9,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1124ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: weekly']","posted_date":"2022-09-03T14:59:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-were-confident-that-after\/7529514465.html","post_id":7529514465,"result_date":"2022-09-03 14:50","title":"We're confident that after one tour you will want to live here!","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1050Date Available: 2022-09-03Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.Call:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/gnjbyzvo\/lincoln-square\n","num_images":1,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '1050ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-09-03T14:46:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7529510879.html","post_id":7529510879,"result_date":"2022-09-03 14:42","title":"Schedule a Tour, Granite Countertops, Playground","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com","num_images":22,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1210ft2', 'available oct 29', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T14:38:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-incredible-amenities\/7529502795.html","post_id":7529502795,"result_date":"2022-09-03 14:25","title":"Incredible Amenities, Stylish Features, Lease Today","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nLease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Wood-Like Floors\n* Granite Countertops\n* Full sized Washer and Dryer in unit\n* Extra Storage\nCommunity Features\n* Yoga Lounge\n* TV Lounge\n* Community Lounge\n* Outdoor Grill Area\n* Easy Freeway Access\n* Sun Deck\n* Putting Green\n* Fitness Studio\n* Pet Salon\n* Bark Park\n* Minutes from Restaurants, Shopping, and Much More\n* Professionally Managed\n* Bocce Ball\n* Swimming Pool","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T14:21:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-duplex-bedroom-bathroom\/7529497291.html","post_id":7529497291,"result_date":"2022-09-03 14:14","title":"Duplex 1 bedroom& 1 bathroom Apartment IN philadelphia","description":"An exceptional farmette with a 1 bedroom& 1 bathroom Apartment . Extremely well cared for property, exudes pride of ownership! Bank has 3 floors, 9 stables, a garage area, new windows, electricity and lighting. In the past it has been used for raising livebarn stock, with the pasture located behind the home. Most recently it has been used for storage of cars, boats, and tools. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctiive with no two views exactly alike. Spacious with open concept kitchen, living room and dining room. AC, Electric Ceiling Property is zoned for Business Enterprise....could this be the new home of your business? The most adorable house has a custom made kitchen and bathroom cabinets, large eat in kitchen, 2 fireplaces...one in living room and one in family room downstairs. Closet and cabinets are aplenty, you won't run out of storage! Kitchen windows overlooks the gorgeous pond and garden. Downstairs you'll find a family room, another full bath, xtra large laundy and canning room, a shop area, and an outside stairway with a belco door. There is a whole house generator, Central Air, new gas boiler with 2 zones. 2 solar panels on roof are owned, not leased. If you have been searching for a property with multiple uses, a farmette, or just a great place to spread out....this is your new home If you are interested please TEXT ME AT: show contact info","num_images":3,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T14:10:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7529495877.html","post_id":7529495877,"result_date":"2022-09-03 14:12","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"When you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Bark Park\n* Yoga Lounge\n* TV Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* Sun Deck\n* Professionally Managed\n* Fitness Studio\n* Spa\n* Community Lounge\n* Billiards\n* Outdoor Grill Area\n* Easy Freeway Access\n* Swimming Pool","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T14:08:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-indoor-parking-shopping\/7529493799.html","post_id":7529493799,"result_date":"2022-09-03 14:07","title":"Indoor Parking, Shopping Onsite, 24 HR Concierge, Dog Park","description":"Bedrooms: 1Bathrooms: 1Square Feet: 648Date Available: 2022-09-03Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.Call:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/ttp4cjjh\/lincoln-square\n","num_images":1,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '648ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-09-03T14:03:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bath\/7529488340.html","post_id":7529488340,"result_date":"2022-09-03 13:57","title":"Beautiful !! 1 Bedroom 1 Bath Apartment for rent in Philadelphia","description":"Beautiful !! 1 Bedroom 1 Bath Apartment for rent in Philadelphia !! The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctiive with no two views exactly alike. Beautiful with open concept kitchen, living room and dining room. AC, Electric Ceiling Property is zoned for Business Enterprise.... Downstairs you'll find a family room, another full bath, xtra large laundy and canning room, a shop area, and an outside stairway with a belco door. There is a whole house generator, Central Air, new gas boiler with 2 zones. Washer and Dryer hook up inside. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctive with no two views exactly alike. Most recently it has been used for storage of cars, boats, and tools. Wide open spaces on over a 1\/2 acre lot in Hazel Green & Lynn Fanning school district. Move-in ready, freshly painted brick home w\/ NEW appliances included. Brand NEW ultra-durable luxury vinyl plank throughout, attached 2-car garage. beautiful fresh paint, beautiful hardwood floors, good windows almost new, Refrigerator, Oven and Fan, and Washer & Dryer in the Unit.Master bedroom has a large walk-in closet and a separate entry to the bathroom. Washer and Dryer hook up inside. The twisting design of the tower maximizes the window features and views in every suite. And because of this unique design, every suite is distinctive with no two views exactly alike. Most recently it has been used for storage of cars, boats, and tools. Brand NEW ultra-durable luxury vinyl plank throughout, attached 2-car garage. beautiful fresh paint, beautiful hardwood floors, good windows almost new, Refrigerator, Oven and Fan, and Washer & Dryer in the Unit. Many power outlets and cable outlets throughout the apartment. Central Air, new gas boiler with 2 zones. If you are interested, please send a TEXT:","num_images":4,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T13:53:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-fantastic-location\/7529485191.html","post_id":7529485191,"result_date":"2022-09-03 13:50","title":"Fantastic Location, Beautiful Amenities, Luxury Living","description":"Available: 10\/15\/22\nApt. 1109 — Buckingham floor plan — 810 sq. ft. — $2,335\nLocated on the 1st floor, this 1-bed\/1-bath apartment has an open floor plan with the kitchen looking into an abundant living\/dining room. The bedroom is spacious, well-lit, and has ample closet space. It boasts central air and heat, a front-loading washer and dryer, and the bathroom is full-sized with a tub. The bedroom is also large with access to the balcony, and has a large walk-in closet! This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool and more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '810ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-09-03T13:46:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-art-museum-studio\/7529484815.html","post_id":7529484815,"result_date":"2022-09-03 13:49","title":"Art Museum Studio","description":"Charming 1st floor studio condo in this renovated 8 unit lo-rise condo building.  Lots of original details from this 1860 Queen Ann style Victorian mansion.  Hardwood Floors, High Ceilings, Marble tiled bath, Laundy in basement, storage area in basement\nApplicant screening based on credit, income and rental history.  $50 Application fee.  Cats OK with Pet Deposit.  No dogs.\n","num_images":8,"lat":39.964869,"lng":-75.169852,"attrs":"['0BR \/ 1Ba', '392ft2', 'available nov 1', 'application fee details: $50 application fee - credit, income & landlord check', 'cats are OK - purrr', 'condo', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T13:45:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-charming-bed-bath-with\/7529482773.html","post_id":7529482773,"result_date":"2022-09-03 13:45","title":"Charming 1 bed \/ 1 bath with great character! 845 Sq Feet","description":"Millview Apartments 100 Cobblestone Dr Coatesville, PA 19320  show contact info\nUnit Information: 1 Bedroom | 1 Bath  Unit Size: 845 sq ft  Monthly Rent: $1595 - $2087 Lease Terms: Variable Unit Includes:➢ Built-In Microwave➢ Central Heat & Air Conditioning➢ Disability Access In Select Units➢ Dishwasher➢ Full-Size Washer & Dryer In Every Apartment➢ Mini Blinds On All Windows➢ Refrigerator\/Freezer With Ice Maker➢ Walk-In ClosetsProperty Description: Our apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort-style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Property Amenities: ➢ Business Center➢ On-Site Leasing Office➢ Pet-Friendly➢ Private Garages In Select Units➢ 24-Hour Emergency Maintenance➢ Coffee Bar Clubhouse Kitchen➢ Resident Referral Bonuses Website: https:\/\/www.apartmentsincoatesvillepa.com\/Call us today!  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMPet Ownership Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Proudly managed by Paradise Management, LLCEQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":12,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'available sep 9', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T13:41:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-start-living-large-youll\/7529481714.html","post_id":7529481714,"result_date":"2022-09-03 13:43","title":"Start living large! You'll love our 2 bed, 2 bath! 1178 Sq Ft!","description":"Millview Apartments Leasing Office:  100 Cobblestone Dr Coatesville, PA 19320 show contact info\nTake a look at what Millview Apartments has to offer! Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.Rental Information: 2 Bedroom \/ 2 Bathroom \/ 1178 sq ft \/ $1750 - $2340\/Month  Lease Terms: VariableApartment Amenities:❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In ClosetsAdditional Information:❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral Bonuses Leasing Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM show contact info\nPet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. Website: https:\/\/www.apartmentsincoatesvillepa.com\/  Management Company: Paradise Management, LLC EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":14,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available sep 24', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T13:39:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-bright-clean-and-ready-for\/7529480716.html","post_id":7529480716,"result_date":"2022-09-03 13:41","title":"Bright, clean, and ready for you! Tour today!","description":"Millview ApartmentsLocated at: 100 Cobblestone Dr Coatesville, PA 19320Featured unit: 1 bed | 1 bath | 771 sq ft Prices start at: $1508 - $1984\/month Call Today!  show contact info\nNestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!Wonderful Amenities!◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral BonusesApartment Features!◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In Closets  show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.EQUAL HOUSING OPPORTUNITY27A7057C58A14CE\n","num_images":12,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '771ft2', 'available sep 9', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T13:37:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-is-modern-bi-level\/7529469424.html","post_id":7529469424,"result_date":"2022-09-03 13:36","title":"This is a modern bi-level 3 bedroom \/ 2 bathroom apartment!!","description":"This is a modern bi-level 3 bedroom \/ 2 bathroom apartment offering a spacious interior with lovely finishes throughout. Enter into the 1st floor where hardwood floors, recessed lighting, and modern touches stretch the length of the entire space. There is a giant window at the front for natural light and the space flows nicely back past your dining area and into your galley style kitchen. Kitchen features include granite countertops, two-tone cabinetry for tons of storage, stainless steel appliances, and lovely tile backsplash. Continue past the kitchen into your 1st bedroom, which is very spacious with a ceiling fan and a full wall of windows including sliding glass doors that lead to your outside space. A walk-through closet includes your stacked washer & dryer for added convenience, and a door to the full bathroom on this level. The gorgeous Jack & Jill bathroom boasts a glass shower stall and lighted vanity with access from the dining area as well. Downstairs, you will find a large den area your 2nd & 3rd bedrooms and full bathroom. This large living space can serve well as a den, playroom, office, or home gym and the 2 bedrooms at the back are sizable with closet space.\nText me for more details:  lorrihanna84 (at)_gmail_(dot)com","num_images":6,"lat":39.9487,"lng":-75.1593,"attrs":"['3BR \/ 2Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T13:14:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bath-home-located\/7529467527.html","post_id":7529467527,"result_date":"2022-09-03 13:32","title":"2 bedroom, 2 bath home located in the highly desirable !!","description":"2 bedroom, 2 bath home located in the highly desirable Point Breeze neighborhood! This sleek home features dark hardwood flooring throughout, a modern kitchen with granite countertops, contemporary tile backsplash and access to an enclosed backyard patio area. The second floor has one nicely sized bedroom as well as a spacious full bathroom with updated fixtures, stand up shower, and a double sink vanity. There's also a large master bedroom across the hall with 2 bright windows, filling the space with natural light. Schedule your showing today! All square footage numbers are approximate and should be verified by the buyer.\nContact us for more information: mroselicsw00 (at)_gmail_(dot)com","num_images":3,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T13:11:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-pa-thanks-for-looking-and\/7529463946.html","post_id":7529463946,"result_date":"2022-09-03 13:30","title":">PA >Thanks for looking, And need a 2 bedroom..","description":"If you are coming to ..4300 Wayne Ave, Philadelphia, .. and need a 2 bedroom temporary furnished Apartment while working here for the Fall, please get in touch with your information and for how long and what dates. Off Street Parking for 1 car limited to mid-size vehicles or smaller. Parking cannot accommodate full size vehicles and they must park on the Street. Very nicely furnished and clean. Please get in touch with me by email and I will get back to you ASAP.. Thanks for looking,\nCall today to schedule a showing;;;;","num_images":5,"lat":40.018378,"lng":-75.157621,"attrs":"['2BR \/ 1.5Ba', '800ft2', 'air conditioning', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T13:04:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-online-payments-available\/7529468037.html","post_id":7529468037,"result_date":"2022-09-03 13:16","title":"Online Payments Available, Car Wash Area, Executive Business Center","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:High Speed Internet AccessDishwasherExecutive Business CenterOversized ClosetsNewly Renovated InteriorsAir ConditioningCeiling FansCable ReadyWireless & High Speed Internet AccessCable\/Satellite TVPicnic AreaOnline Payments AvailableCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/xgihhdtq\/JeffersonatWestTown\n","num_images":9,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1271ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: weekly']","posted_date":"2022-09-03T13:12:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/clifton-heights-house-for-rent\/7529455773.html","post_id":7529455773,"result_date":"2022-09-03 13:15","title":"House for Rent","description":"Beautiful 3 bed 1 bath house available in Clifton heights. Loads of natural sunlight and living space.\nNewly renovated kitchen\nWasher and dryer unit\nLarge front porch with yard\nLarge backyard\n","num_images":6,"lat":39.9218,"lng":-75.2876,"attrs":"['3BR \/ 1Ba', 'available now', 'application fee details: Application fee $38', 'townhouse', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:48:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-walking-trail-dog-park\/7529467077.html","post_id":7529467077,"result_date":"2022-09-03 13:14","title":"Walking Trail, Dog Park, Golf Simulator, Parking, 24 HR Concierge","description":"Bedrooms: 0Bathrooms: 1Square Feet: 473Date Available: 2022-10-21Address: 1000 South Broad Street\nExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/sdmzgomq\/lincoln-square\n","num_images":1,"lat":39.9379,"lng":-75.1794,"attrs":"['0BR \/ 1Ba', '473ft2', 'available oct 21', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-09-03T13:10:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-mid-sized-studios\/7529459595.html","post_id":7529459595,"result_date":"2022-09-03 13:00","title":"Mid-sized Studios Available in Mid-October! Heat and Water Included!!","description":"Sunny, studio apartments becoming available in mid-October!!! Apartments feature upgraded kitchens and baths, large windows and 9 ft. ceilings. Ask about our NO SECURITY DEPOSIT program!! Cats are welcome (add'l fee)! All apartments are rented unfurnished.\nChancellor Apartments is a convenient high rise apartment community in an amazing location in Center City. We are close to most major schools and universities, public transportation, historical attractions, shopping, restaurants and theaters. Center City at its best!!\nRent includes: heat, hot\/cold water, 24-hour front desk attendant, free bike storage room, package acceptance service, 24-hour emergency maintenance service, on-site smart card laundry plus card access system and BuildingLink resident services portal access for all residents.\nThe Chancellor boasts several different studio and one bedroom floor plans. Apartments feature high ceilings, large bright windows, ceiling fans in most units, hardwood floors and breathtaking views of the Philadelphia skyline and Delaware River. Many apartments have large walk-in closets, too!\nWe have partnered with Optimal Sport Health Club to offer a generous discounted gym membership (we pay your initiation fee!). There are several off street parking lots and garages in the area, too!\nCHANCELLOR APARTMENTS\n206 S. 13th Street\nPhiladelphia, PA 19107\nshow contact info\nFranceina Thorne, REALTOR\nHours:\nMon. - Fri. 8:30 to 5:00\nSaturday - 10:00 to 3:00\nAppointments are highly recommended","num_images":20,"lat":39.948681,"lng":-75.162197,"attrs":"['0BR \/ 1Ba', 'available oct 15', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:56:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/north-wales-cook-up-great-meal-this\/7529456242.html","post_id":7529456242,"result_date":"2022-09-03 12:53","title":"Cook up a great meal! This apartment includes a full kitchen","description":"Hunt Club ApartmentsVisit Our Community Today!10 Hunt Club Trl North Wales, PA 19454  show contact info\nExceptional Apartment Living!  Located just off Route 63 and a half mile from English Village Shopping Center, The Hunt Club offers spacious apartment homes in North Wales, PA. Residents love the beautiful setting and the convenient amenities that can only be found at our community. With our combination of great floor plans and lavish features, The Hunt Club offers the best North Wales apartment rentals. Choose from a great selection of one, two or three bedroom homes that delight any lifestyle. Our apartments in North Wales, PA offer private entrances to provide you with a more unique setting. Convenience can be found with a washer & dryer in each unit making your day-to-day routine a breeze. All of our rentals also come with a private patio or balcony for you to take in the scenic country views right from the comfort of your North Wales, PA home. Routes 309 and 202 are just a mile away making your travel needs quick and easy. The Hunt Club is near the Northeast Extension of the PA Turnpike so you will never be far from great dining, shopping and entertainment venues. Our North Wales apartment homes offer a wealth of community features that include a fitness center, business center, basketball & tennis courts and a playground. You can also enjoy a peaceful afternoon stroll around the beautiful nature trail. Schedule a tour with our on-site management team and let us show you why The Hunt Club offers the best apartments in North Wales, PA.Bedrooms: 2 |  Bathrooms:  2  Square Footage: 932 sq ft Rental Pricing: $2601\/Month  Our Residents Enjoy:  ◾ Barbecue & Picnic Area◾ Basketball & Tennis Courts◾ Car Wash Area◾ Clubhouse & Lounge◾ Coffee Bar◾ Courtyard◾ Free Weights, Weight & Cardio Machines◾ Onsite Management◾ Planned Social Activities◾ Swimming Pool & Sundeck◾ 1\/2 Mile from English Village Shopping Center◾ 24 Hour Availability◾ Abundant Parking◾ Adjacent to Oxford Park◾ Corporate Suites◾ Less than 1 Mile to Route 309 and 202◾ Online Payment Options◾ Recycling◾ Renters Insurance Program◾ Wi-Fi at Pool and Clubhouse This Unit Comes With: ◾ Carpet◾ Dishwasher◾ High Speed Internet Access◾ Kitchen◾ Range\/Oven◾ Refrigerator\/Freezer◾ Tub\/Shower◾ Views◾ Washer\/Dryer◾ Wheelchair Accessible (Rooms)◾ Cable-Ready◾ Central Air Conditioning◾ Full-size Washer And Dryer◾ Individual Patio or Balcony◾ Private Entrance◾ Storage Spaces (select homes)◾ Upgraded Kitchens (select homes)◾ Walk-In Closets (select homes)◾ Wood Burning Fireplaces (select homes)Website: https:\/\/www.huntclubnorthwales.com\/ Phone-Number:  show contact info\nPet-Policy: Breed Restriction The Hunt Club is a pet-friendly apartment community. We welcome cats and dogs (breed restrictions apply). Exotic pets are approved on a case by case basis. You may have two pets per apartment. There is a monthly pet rent of $35 for 1 pet and $50 for 2 pets. There is also a one-time, non-refundable fee of $350 for 1 pet and $500 for 2 pets.Lease-Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthCall for Directions  All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYC824461F1FAF4C1\n","num_images":16,"lat":40.211229,"lng":-75.235922,"attrs":"['2BR \/ 2Ba', '932ft2', 'available oct 21', 'air conditioning', 'application fee details: $60 application fee per applicant', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:49:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7529451153.html","post_id":7529451153,"result_date":"2022-09-03 12:43","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nFind yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, and a private balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Walk-in Closet\n* Disposal\n* Granite Countertops\n* Full sized Washer and Dryer in unit\n* Stainless Steel Appliances\n* Central Heat and Air\n* Linen Closet\n* Pre-wired for internet and cable\n* Roommate Friendly Floor Plan\n* Pantry\n* Ceiling Fan\n* Garden Tub\n* Window Coverings\n* Breakfast Bar\n* High Efficiency Lighting Fixtures\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Lofty Vaulted Ceilings","num_images":22,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1202ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:39:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-renovated-br-1bth\/7529436027.html","post_id":7529436027,"result_date":"2022-09-03 12:34","title":"Recently renovated 3 BR, 1Bth Expanded Cape","description":"Recently renovated 3 BR, 1Bth Expanded Cape in Philadelphia Trees Schools. Garage is oversized; Yard is oversized. Beautiful trek deck in backyard. Beautiful and modern light grey engineered flooring on main level. Lots of windows for sunlight. Brand new appliances in kitchen. 5 New energy efficient air conditioners. Kitchen has bump-out for added space. 200 AMP service for house with additional sep. electric outside for electric car charging. This home is move-in ready. ❦════•⊰❂𝐈𝐟 𝐲𝐨𝐮 𝐚𝐫𝐞 𝐢𝐧𝐭𝐞𝐫𝐞𝐬𝐭𝐞𝐝, Please Text me::-   show contact info\n❂⊱•════❦","num_images":6,"lat":40.0547,"lng":-75.1866,"attrs":"['3BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-09-03T12:08:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-and-15-bath\/7529444491.html","post_id":7529444491,"result_date":"2022-09-03 12:29","title":"Large 3 bedroom and 1.5 bath home located in Lawncrest!","description":"Large 3 bedroom and 1.5 bath home located in Lawncrest!\nProperty Address\n994 Anchor Street | Philadelphia, PA 19124\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Updated Home!⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 1.5 bath.\n✔️Updated Kitchen w\/ newer appliances!\n✔️Spacious Kitchen\n✔️Beautiful laminate flooring throughout\n✔️Parking in rear of the property\n✔️Open layout, plenty of closet space.\n✔️Finished Basement\n✔️CLOSE TO PUBLIC TRANSPORTATION!\n✔️EASY ACCESS TO MAJOR ROUTES!\n✔️Close to shopping\n✔️Short walk to SEPTA\n✔️This property won't last long, inquire now!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant pays own Utilities\n*** Build your credit! We report rent payments to Experian! ***\n**** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING **** You must make an appointment by completing this form https:\/\/redblockrentals.com\/showing\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\ntags: 3 bedrooms, three, basement, bd, finished basement, powder room, redblock realty inc, red block, house, North East, Oxford, Castor, Lawncrest, Route 1, Roosevelt Blvd, Naval Support Activity Philadelphia, Benjamin Franklin School, Samuel Fels High School, Northeast Tower Center, Adams Ave, Friends Hospital, Frankford, NE, Walmart,  OXFORD CIRCLE\/ CASTOR, LAWNCREST, 19124, 19149, 19152, 19111, 19149\n\nDetails\nBeds\/Baths: 3BD\/1.5BA\nSquare Feet: 1,200\nRental Terms\nRent: $1,600.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,400.00\n\nPet Policy\nCats allowed\nDogs allowed\n#nata\n","num_images":15,"lat":40.032661,"lng":-75.087136,"attrs":"['3BR \/ 1.5Ba', '1200ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:25:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-salt-water-pool-with\/7529444252.html","post_id":7529444252,"result_date":"2022-09-03 12:28","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"You will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-09-03T12:24:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-rent-an-affordable-br\/7529443982.html","post_id":7529443982,"result_date":"2022-09-03 12:28","title":"Rent an affordable 1 BR apartment close to campus!","description":"The Glen at Lafayette Hill Visit our community today! 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nUnit Rates:  $1729 - $2088\/month Unit Type: 1-BR 1-BA Unit Size: 648 sq ftLease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.What you’ll find in our community: ✓ Business Center✓ Elevator✓ Furnished Units Available✓ Gated, Controlled Access✓ Multi-Use Room✓ Package Service✓ Pet Friendly✓ Pet Play Area✓ Planned Social Activities✓ Renters Insurance Program✓ BBQ Picnic Garden✓ Billiards, Club Lounge, Cafe Area, Library and Community Room✓ Fitness Center w\/ Free Weights, Weight Machines✓ Message Therapist Practice On-site✓ Outdoor Cafe & Coffee Bar✓ Outdoor Patio Lounge✓ Sprinkler System✓ Storage Space✓ Wi-Fi at ClubhouseDescription: Our residents enjoy luxurious amenities including an amazing outdoor cafe area, a clubhouse with flat screen TVs, and a full kitchen and fitness center. Open-concept floor plans accompanied by a variety of upscale features define the one-of-a-kind luxury lifestyle only found at our Lafayette Hill apartments.This unit comes with: ✓ Cable Ready✓ Carpet✓ Ceiling Fans (Select Floor Plans)✓ Dining Room✓ Heating✓ Range, Oven, Disposal, Oven✓ Refrigerator, Freezer and Ice Maker✓ Tub\/Shower✓ Wi-Fi✓ Window Coverings✓ Dishwasher✓ High Speed Internet Access✓ Linen Closet✓ Microwave✓ Storage Units✓ Trash Compactor✓ Vaulted Ceiling (Select Floor Plans)✓ Walk-In Closets (Select Floor Plans)✓ Washer\/Dryer✓ Wheelchair Accessible (Rooms)Call or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.comProperty Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYF383D5FEDB994E05\n","num_images":16,"lat":40.0896,"lng":-75.2601,"attrs":"['1BR \/ 1Ba', '750ft2', 'available oct 14', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-09-03T12:24:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-updated-bd-ba\/7529441951.html","post_id":7529441951,"result_date":"2022-09-03 12:24","title":"RECENTLY UPDATED, 2 BD \/ 1 BA APARTMENT LOCATED IN CARROLL PARK!","description":"⭐⭐⭐ RECENTLY UPDATED, 2 BEDROOM AND 1 BATH APARTMENT LOCATED IN CARROLL PARK!!! ⭐⭐⭐\nProperty Address\n639 N 52nd Street - 1F | Philadelphia, PA 19131\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ LOCATED IN CARROLL PARK!\n✔️ RECENTLY RENOVATED!\n✔️ STUNNING 2 BEDROOM AND 1 BATH APARTMENT!\n✔️ NEW FLOORING THROUGHOUT\n✔️ BRAND NEW KITCHEN EQUIPPED W\/ STOVE, REFRIGERATOR, MICROWAVE\n✔️ COMPLETELY RENOVATED BATH WITH DESIGNER TILES\n✔️ NICE SIZED BEDROOMS\n✔️ NICE SIZED LIVINGROOM\n✔️ UNFINISHED BASEMENT - PERFECT FOR STORAGE\n✔️ RECESSED LIGHTING THROUGHOUT\n✔️ SMALL REAR YARD\n✔️ CITY LIVING WITH A SUBURBAN FEEL\n✔️ MINUTES AWAY FROM CENTER CITY\n✔️ LOTS OF SHOPPING AROUND\n✔️ CLOSE TO MAJOR ROADS\n✔️ EASY ACCESS TO PUBLIC TRANSPORTATION\n✔️ WILL NOT LAST LONG, INQUIRE TODAY!!! ****\nGo to https:\/\/my.matterport.com\/show\/?m=aguHvWUSM2A for a virtual tour.\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant pays for electricity, gas, and water.\n*** Build your credit! We report rent payments to Experian! ***\n***Please apply online at https:\/\/redblock.com\/apartment\/\nDO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 700\nRental Terms\nRent: $1,200.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,400.00\n\n#nata\n","num_images":11,"lat":39.970279,"lng":-75.225565,"attrs":"['2BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:20:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated-bd-ba\/7529439742.html","post_id":7529439742,"result_date":"2022-09-03 12:19","title":"Completely Renovated 3 Bd \/ 2 Ba Home, Central Air, Private Rear Deck","description":"Completely Renovated 3 Bedroom 2 Bath Home, Central Air, Private Rear Deck, brand new rehab in Elmwood Park\/Kingsessing\nProperty Address\n6345 Kingsessing Ave | Philadelphia, PA 19142\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Stunning renovation in Elmwood Park\/Kingsessing! ⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 2 Bath\n✔️Updated Kitchen w\/ custom designer backsplash\n✔️Master Bedroom has a Private brand new full bath\n✔️Located just minutes to schools, parks, and University City\n✔️All New Appliances\n✔️Hardwood flooring throughout\n✔️Recessed Lighting\n✔️Spacious bedrooms\n✔️Open layout, plenty of closet space.\n✔️Large basement perfect for storage\n✔️Central Air\n✔️Private Rear Deck\n✔️Washer\/Dryer Hookup\n✔️Located just minutes to schools, parks, and University City\n✔️Easy commute to and from the city\n✔️This property won't last long, inquire now!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1330\nRental Terms\nRent: $1700\nApplication Fee: $35\nSecurity Deposit: $3400\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nVirtual Tour: https:\/\/my.matterport.com\/show\/?m=xG8QmjAkkCh\nStunning renovation in Elmwood Park\/Kingsessing! This immaculate home has been completely renovated from top to bottom! Located just minutes to schools, parks, and University City. Brand new renovation! Steps to UPENN, Drexel, USciences, Center City CHOP, and Hospital of the University of Pennsylvania. Home features 3 bedrooms, 2 baths! Central air! Private Rear Deck! Washer\/dryer hookup! Absolutely everything here is brand new!\nFor security purposes, all of our properties are under live video and audio surveillance. All access and showings are recorded and monitored remotely\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,332\nRental Terms\nRent: $1,500.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,000.00\n\nPet Policy\nCats allowed\nDogs not allowed\n#nata\n","num_images":17,"lat":39.928403,"lng":-75.236155,"attrs":"['3BR \/ 2Ba', '1332ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:15:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-extra-storage-disability\/7529438197.html","post_id":7529438197,"result_date":"2022-09-03 12:16","title":"Extra Storage, Disability Access, 9' Ceilings w\/ Crown Molding","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Picnic AreaExtra StorageDisability AccessGas FireplacesCable\/Satellite TVHigh Speed Internet Access9' Ceilings w\/ Crown MoldingIndividual Intrusion AlarmsDishwasherCeiling FansExecutive Business CenterBuilt-in Microwave OvensCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/qdmvcqez\/JeffersonatWestTown\n","num_images":9,"lat":39.9441,"lng":-75.5882,"attrs":"['1BR \/ 1Ba', '754ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: weekly']","posted_date":"2022-09-03T12:12:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bd-ba-apt\/7529437707.html","post_id":7529437707,"result_date":"2022-09-03 12:15","title":"SPACIOUS 2 BD & 1 BA APT W\/BACKYARD LOCATED IN UNIVERSITY CITY!","description":"AMAZING VALUE! SPACIOUS 2 BEDROOMS & 1 BATH APARTMENT W\/BACKYARD LOCATED IN UNIVERSITY CITY!\nProperty Address\n613 N 32nd St | Philadelphia, PA 19104\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ BEST VALUE APARTMENT!\n✔️ JUST A MILE AWAY FROM THE ART MUSEUM AT 1\/2 THE PRICE!\n✔️ SPACIOUS 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN UNIVERSITY CITY!\n✔️ 1ST- FLOOR APARTMENT IN A TRIPLEX\n✔️ EAT-IN KITCHEN\n✔️ OPEN KITCHEN\/LIVING ROOM LAYOUT\n✔️ LOTS OF NATURAL LIGHT\n✔️ LAMINATE FLOORING\n✔️ HIGH CEILINGS\n✔️ DESIGNER COLORS\n✔️ SPACIOUS BEDROOMS\n✔️ CEILING FANS\n✔️ CENTRAL AIR\/HEAT\n✔️ SPACIOUS BACKYARD\n✔️ CLOSE COMMUTE TO CENTER CITY\n✔️ CLOSE TO DREXEL, PENN, HUP, CHOP, USP\n✔️ EASY ACCESS TO SEPTA, MAJOR ROUTES I-95,  I-76, I-676\nLink to Virtual Tour:  https:\/\/my.matterport.com\/show\/?m=SdacbFAGf9M\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant is responsible for electric, gas, and water fee\nBuild your credit! We report rent payments to Experian!\n***Please apply online at https:\/\/redblock.com\/apartment\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: Drexel, UPENN, Penn, Powelton, University City, campus, art museum, clean, renovated, hardwood, center city, west Philly, west Philadelphia, redblock realty inc, redblock, red block, center city,2 bedroom, two-bedroom, 2BD, two BD, bedroom, septa, high ceilings, clean, spacious, close to center city, septa, transportation, easy commute\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 950\nRental Terms\nRent: $1,200.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,400.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":13,"lat":39.964772,"lng":-75.188784,"attrs":"['2BR \/ 1Ba', '950ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:11:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7529435923.html","post_id":7529435923,"result_date":"2022-09-03 12:12","title":"Private Balcony, Quiet Community, Move In Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Kitchen Island\n* Garden Tub\n* Stainless Steel Appliances\n* Private Patio or Private Balcony (on select apartments)\n* Walk-in Closet\n* Linen Closet\n* Washer and Dryer in unit","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1363ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:08:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-updated-4br-in\/7529435806.html","post_id":7529435806,"result_date":"2022-09-03 12:12","title":"Completely Updated 4BR in Oxford Circle \/w finished basement","description":"Completely Updated 4BR in Oxford Circle \/w finished basement and guestroom\nProperty Address\n6059 Alma Street | Philadelphia, PA 19149\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ COMPLETELY UPDATED\n✔️ LARGE 4 BEDROOM AND 1.5 BATHS HOME LOCATED IN NORTH EAST!!!\n✔️ SPACIOUS BEDROOMS!!!\n✔️ LARGE CLOSETS!!!\n✔️ FORMAL DINING ROOM\n✔️ FINISHED BASMENT WITH GUEST ROOM\n✔️ LAUNDRY HOOK-UP\n✔️ REAR DRIVEWAY FOR PARKING\n✔️ CENTRAL AIR!!!\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nVIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=cu5G7v8nENH\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in. (1 months rent and 2 months security)\n- The tenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\ntags: northeast Philadelphia, Oxford Circle, Naval Support, SEPTA, renovated, three bedroom, 4BR, basement, castor, lawncrest, cottman, frankford, mayfair\n\nDetails\nBeds\/Baths: 4BD\/1.5BA\nSquare Feet: 1,300\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n\n#nata\n","num_images":12,"lat":40.035646,"lng":-75.082254,"attrs":"['4BR \/ 1.5Ba', '1300ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:08:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedrooms-and-bath\/7529432909.html","post_id":7529432909,"result_date":"2022-09-03 12:06","title":"LARGE 4 BEDROOMS AND 1 BATH HOME LOCATED IN OAKLANE!","description":"LARGE 4 BEDROOMS AND 1 BATH HOME LOCATED IN OAKLANE!\nProperty Address\n5031 N Marvine st | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED LARGE 4-BEDROOM HOUSE! ⭐⭐⭐⭐⭐\n✔️ LARGE KITCHEN\n✔️ RESTORED PARQUET FLOORING\n✔️ CUSTOM WOOD-TRIMMED LIVINGROOM\n✔️ CENTRAL HEATING\n✔️ OPEN LAYOUT\n✔️ LOTS OF CLOSET SPACE\n✔️ LARGE BASEMENT FOR STORAGE\n✔️ WASHER\/DRYER HOOK-UP\n✔️ BACKYARD\n✔️ SPACIOUS FRONT PATIO\n✔️ CLOSE TO SHOPPING\n✔️ SHORT WALK TO SEPTA\n✔️ EASY ACCESS TO MAJOR ROUTES\n✔️ EASY COMMUTE TO AND FROM THE CITY\n✔️ THIS PROPERTY WON'T LAST LONG, INQUIRE NOW!\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in.\n- Tenant pays for electricity, gas, and a water\n***VIDEO TOUR: https:\/\/my.matterport.com\/show\/?m=tvyEEWtMt7i\n*** Build your credit! We report rent payments to Experian! ***\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: Mt Airy, Germantown, Logan, Olney, Cheltenham, septa, parking, laundry, commuter, Cheltenham, west oak lane, oak lane, La Salle, Redblock, red block, Redblock Realty Inc, four bedrooms, 4br, einstein hospital, college of optometry, 19144, 19141,19126,19138,19119, 19120, Redblock realty, 4BR, 4 bedrooms, La Salle University, Ogontz, Mount Airy, Logan, Germantown, Olney, Route 309, spacious, buses, schools, Philadelphia, Broad Street, Albert Einstein Medical Center, Pennsylvania College of Optometry, SEPTA, commuter, Fern Rock Transportation Center, Gratz College, Philadelphia High School for Girls, Widener Memorial School, Lindley Academy Charter School, Delaware Valley Charter High School, Thurgood Marshall School, Lindley Playground\n\nDetails\nBeds\/Baths: 4BD\/1.0BA\nSquare Feet: 1,700\nRental Terms\nRent: $1,800.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,600.00\n\nPet Policy\nCats allowed\nDogs allowed\n#nata\n","num_images":13,"lat":40.029006,"lng":-75.142233,"attrs":"['4BR \/ 1Ba', '1700ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T12:02:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-48-hour-maintenance\/7529424285.html","post_id":7529424285,"result_date":"2022-09-03 12:03","title":"48-hour Maintenance Commitment, Bark park, On-site bike storage","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Upgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingBBQ and deck areaBark parkFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingBocce ball fieldState-of-the-art fitness center overlooking the Manayunk canalMarble master baths, some with deep linen storageUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsJogging trail right outside your door48-hour Maintenance CommitmentPet-friendly livingOnline Payments AvailableCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/7dh53c3n\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-09-03T11:44:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-bedroom-bath-apt\/7529429202.html","post_id":7529429202,"result_date":"2022-09-03 11:59","title":"UPDATED 1 BEDROOM \/ 1 BATH APT LOCATED IN NORTHEAST\/TACONY AREA!","description":"⭐⭐⭐UPDATED 1 BEDROOM AND 1 BATH APARTMENT LOCATED IN NORTHEAST\/TACONY AREA!⭐⭐⭐\nProperty Address\n4831 Longshore Ave - 1F | Philadelphia, PA 19135\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n✔️ SPACIOUS 1 BEDROOM APARTMENT LOCATED IN TACONY AREA!\n✔️ BEST VALUE APARTMENT ⭐⭐⭐\n✔️ UPDATED KITCHEN W\/ TILES FOR EASY CLEANING\n✔️ KITCHEN IS EQUIPPED W\/ A STOVE, FRIDGE, AND MICROWAVE\n✔️ SPACIOUS LIVING ROOM SPACE\n✔️ LARGE BEDROOM\n✔️ LOCATED ON THE 1ST FL, NO STEPS!\n✔️ OPEN LAYOUT\n✔️ LAMINATE FLOORING THROUGHOUT\n✔️ CLOSE TO PUBLIC TRANSPORTATION\n✔️ EASY ACCESS TO I-95\n✔️ SHORT WALK TO DISSTON PARK\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in.\n- Tenant pays their own utilities plus a water fee.\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING ****\n*** Build your credit! We report rent payments to Experian! ***\nTags: 1BD, 1 bedroom, spacious, luxurious, 1st floor, apartment, private house, Tacony, Wissinoming, Mayfair, Frankford ave, Torresdale, Disston Park, Disston Recreation Center, I-95, highway, Vogt Playground, Delaware Expressway, Lardner's Point Park, Moss Park, Trenton Line, septa, train, commuter, easy access to the city, Franklin Towne Charter High School, REDBLOCK Realty inc, red block, 19135, 19136, 19124, 19149, 19137\nAvailability and pricing is subject to change.  Information Deemed Reliable But Not Guaranteed. All information is subject to errors, omissions, or withdrawal without notice.\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 700\nRental Terms\nRent: $950.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,900.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":9,"lat":40.024291,"lng":-75.041996,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T11:55:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-fully-renovated-bd\/7529425643.html","post_id":7529425643,"result_date":"2022-09-03 11:51","title":"LARGE FULLY RENOVATED 2 BD & 1 BA LOCATED IN OAKLANE\/LOGAN AREA!!","description":"⭐⭐⭐ LARGE FULLY RENOVATED 2 BEDROOMS & 1 BATH LOCATED IN OAKLANE\/LOGAN AREA!!!! ⭐⭐⭐\nProperty Address\n4830 N 12th St - 2F | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT!!!!⭐⭐⭐⭐⭐\n✔️HUGE!!! FULLY RENOVATED 2 BEDROOM AND 1 BATH\n✔️BEAUTIFUL NEW KITCHEN WITH ISLAND\n✔️LARGE KITCHEN\/LIVING ROOM AREA!\n✔️NEW FLOORING THROUGHOUT\n✔️TILED KITCHEN\n✔️EVERYTHING IS ELECTRIC\n✔️BRAND NEW STOVE\/FRIDGE\/MICROWAVE\n✔️CABLE READY\n✔️MOVE-IN READY\n✔️LARGE BEDROOMS\n✔️LARGE COMPLETELY RENOVATED CONTEMPORARY BATHROOM\n✔️SHARED FRONT PORCH\n✔️DESIGNER PAINT\n✔️CONVENIENTLY LOCATED\n✔️EASY ACCESS TO SEPTA\n✔️EASY ACCESS TO AND FROM THE CITY\n✔️WILL NOT LAST LONG!!!! INQUIRE TODAY!!!!\nLINK TO VIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=tX7pmFvXWn8\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 1100\nRental Terms\nRent: $1300\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2600\nPet Policy\nCats allowed\nDogs not allowed\nNotic\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nTAGS: 2 bedroom, 2 bd, 1 bath, large apartment, spacious, cozy, Logan, Oak Lane, West Oak Lane, Philly, Philadelphia, Pa, Pennsylvania, house, apartment, septa, Philadelphia County Assistance Office District F Glendale, Logan Library, LOGAN Hope School, Logan Station, Einstein Medical Center Philadelphia Emergency Medicine, Central High School, La Salle University, Widener Memorial School, Fern Rock Transportation Center Station, Community College of Philadelphia - Northwest Regional Center, Eye Institute of Penna College, City Of Philadelphia Office Of Supportive Housing, 19144, 19138, 19126, 19141, 19140, 19120\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 1,100\nRental Terms\nRent: $1,200.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,400.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":10,"lat":40.026118,"lng":-75.143684,"attrs":"['2BR \/ 1Ba', '1100ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T11:47:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-fully-renovated-bd\/7529423887.html","post_id":7529423887,"result_date":"2022-09-03 11:47","title":"LARGE FULLY RENOVATED 2 BD & 1 BA LOCATED IN OAKLANE\/LOGAN AREA!","description":"⭐⭐⭐ LARGE FULLY RENOVATED 2 BEDROOMS & 1 BATH LOCATED IN OAKLANE\/LOGAN AREA!!!! ⭐⭐⭐\nProperty Address\n4830 N 12th St - 1F | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT!!!!⭐⭐⭐⭐⭐\n✔️HUGE!!! FULLY RENOVATED 2 BEDROOM AND 1 BATH\n✔️LOCATED ON THE 1ST FL, PROVIDING EASY ACCESS\n✔️BEAUTIFUL NEW KITCHEN WITH ISLAND\n✔️LARGE KITCHEN\/LIVING ROOM AREA!\n✔️NEW FLOORING THROUGHOUT\n✔️TILED KITCHEN\n✔️EVERYTHING IS ELECTRIC\n✔️BRAND NEW STOVE\/FRIDGE\/MICROWAVE\n✔️CABLE READY\n✔️MOVE-IN READY\n✔️LARGE BEDROOMS\n✔️LARGE COMPLETELY RENOVATED CONTEMPORARY BATHROOM\n✔️UNFINISHED BASEMENT PERFECT FOR STORAGE\n✔️WASHER\/DRYER HOOKUP\n✔️REAR YARD\n✔️SHARED FRONT PORCH\n✔️DESIGNER PAINT\n✔️CONVENIENTLY LOCATED\n✔️EASY ACCESS TO SEPTA\n✔️EASY ACCESS TO AND FROM THE CITY\n✔️WILL NOT LAST LONG!!!! INQUIRE TODAY!!!!\nLINK TO VIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=THbFKiM2RFR\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 1100\nRental Terms\nRent: $1400\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs not allowed\nNotic\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nTAGS: 2 bedroom, 2 bd, 1 bath, large apartment, spacious, cozy, Logan, Oak Lane, West Oak Lane, Philly, Philadelphia, Pa, Pennsylvania, house, apartment, septa, Philadelphia County Assistance Office District F Glendale, Logan Library, LOGAN Hope School, Logan Station, Einstein Medical Center Philadelphia Emergency Medicine, Central High School, La Salle University, Widener Memorial School, Fern Rock Transportation Center Station, Community College of Philadelphia - Northwest Regional Center, Eye Institute of Penna College, City Of Philadelphia Office Of Supportive Housing, 19144, 19138, 19126, 19141, 19140, 19120\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 1,100\nRental Terms\nRent: $1,300.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,600.00\n\nPet Policy\nCats allowed\n#nata\n","num_images":10,"lat":40.026118,"lng":-75.143684,"attrs":"['2BR \/ 1Ba', '1100ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T11:43:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-baths-apartment-in\/7529422365.html","post_id":7529422365,"result_date":"2022-09-03 11:44","title":"3 Bedroom, 1 Baths Apartment in University City!","description":"3 Bedroom, 1 Baths Apartment in University City, steps away from University Of Science\nProperty Address\n4723 Kingsessing Ave | Philadelphia, PA 19143\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ Spacious 3BR \/ 1Bath in University City\n✔️ BRIGHT \/ SUNNY!!\n✔️ Spacious bedrooms\n✔️ Plenty of closet space\n✔️ Hardwood flooring throughout!\n✔️ Ceiling Fans\n✔️ Central Heating\n✔️ Close to Septa\n✔️ Close to Baltimore Ave\n✔️ Close to University of Pennsylvania (UPENN)\n✔️ Close to Drexel University\n✔️ Close to USciences\n✔️ Close to CENTER CITY\nVIRTUAL TOUR: https:\/\/my.matterport.com\/show\/?m=GCYnAVPyQi4\nProfessionally Managed\n- Yearly leases only\n- 3 Months rent to move in\n- Full Background Check Required\n- Tenant pays own utilities.\n- Build your credit, we report rent payments to Experian ***\n**** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING\nTo Schedule a Showing:\nYou must complete this form -http:\/\/www.redblockrealty.com\/request-a-showing - and we will contact you if you are qualified.\ntags: 3bd, 1 bedroom, REDBLOCK Realty inc, red block, University of Science, University City, 19104, 19143, 19139, 19146, kingsessing, walnut hill, Drexel, Penn, Kingsessing Park, Comegys Benjamin B School, SEPTA, Light Rail, West Philadelphia, philly, phila, Kingsessing Recreation Center, The Children's Hospital of Philadelphia, University of Pennsylvania School of Veterinary Medicine, Wharton,University of Pennsylvania School of Dental Medicine, Baltimore ave\n\nAmenities\n3 Bedrooms\nrefrigerator\nstove\nmicrowave\nceiling fans\nplenty of closet space\n1 bath\nDetails\nBeds\/Baths: 3BD\/1.0BA\nSquare Feet: 950\nRental Terms\nRent: $1,400.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,800.00\n\n#nata\n","num_images":9,"lat":39.944683,"lng":-75.212982,"attrs":"['3BR \/ 1Ba', '950ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T11:40:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-updated-large-bd-and\/7529420984.html","post_id":7529420984,"result_date":"2022-09-03 11:41","title":"NEWLY UPDATED, LARGE, 2 BD AND 1 1\/2 BA APT LOCATED IN WYNNEFIELD!","description":"⭐⭐⭐ NEWLY UPDATED, LARGE, 2 BEDROOMS AND 1 1\/2 BATH APARTMENT w\/ FINISHED BASEMENT, LOCATED IN WYNNEFIELD!!! ⭐⭐⭐\nProperty Address\n5963 Woodcrest Ave - 1F | Philadelphia, PA 19131\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ LOCATED IN WYNNEFIELD!\n✔️ NEWLY UPDATED!\n✔️ LARGE 2 BEDROOM AND 1 1\/2 BATH APARTMENT!\n✔️ RESTORED PARQUET FLOORING\n✔️ UPDATED KITCHEN EQUIPPED W\/ STOVE, REFRIGERATOR, MICROWAVE\n✔️ LARGE BEDROOMS\n✔️ LARGE LIVING ROOM\n✔️ SPACIOUS BEDROOMS\n✔️ CEILING FANS\n✔️ FINISHED BASEMENT\n✔️ LOTS OF STORAGE SPACE\n✔️ WALK-IN CLOSET IN THE BASEMENT\n✔️ WASHER\/DRYER HOOK UP\n✔️ CITY LIVING WITH A SUBURBAN FEEL\n✔️ MINUTES AWAY FROM CENTER CITY\n✔️ LOTS OF SHOPPING AROUND\n✔️ CLOSE TO MAJOR ROADS\n✔️ EASY ACCESS TO PUBLIC TRANSPORTATION\nGo to https:\/\/my.matterport.com\/show\/?m=pefktTfMeqE for video tour.\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant pays electric, gas, and water.\n*** Build your credit! We report rent payments to Experian! ***\nTAGS: Wynnefield, Belmont Village, Saint Joseph's University, Overbrook Park, Merion Park, Fairmount Park, James J. Maguire '58 Campus, Science Leadership Academy at Beeber, The Mann Center, Overbrook Farms, Bala, Philadelphia College of Osteopathic Medicine, Belmont Water Treatment Plant, Edgely Ultimate Fields, Simpson House, Underground Railroad Museum, Bala Golf Club, Shofuso Japanese House and Garden, Two bedrooms, 2 bedrooms, duplex, too, public transportation, septa, major road, schools, private school, basement, finished basement\n19066, 19131, 19151, 19004,\n\nDetails\nBeds\/Baths: 2BD\/1.5BA\nSquare Feet: 1,100\nRental Terms\nRent: $1,600.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,200.00\n\nPet Policy\nCats allowed\nDogs not allowed\n#nata\n","num_images":9,"lat":39.986538,"lng":-75.243216,"attrs":"['2BR \/ 1.5Ba', '1100ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-09-03T11:37:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-state-of-the-art-fitness\/7529420593.html","post_id":7529420593,"result_date":"2022-09-03 11:40","title":"State-of-the-Art Fitness Center, Disability Access, Picnic Area","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Executive Business CenterOversized ClosetsWireless & High Speed Internet AccessIndividual Intrusion AlarmsPlaygroundDishwasherResort-Style Swimming PoolSpeakeasy Wine RoomState-of-the-Art Fitness CenterCeiling FansExclusive & Newly Renovated ClubhouseCable ReadyCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/ncvnwiqt\/JeffersonatWestTown\n","num_images":9,"lat":39.9441,"lng":-75.5882,"attrs":"['3BR \/ 2Ba', '1394ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: weekly']","posted_date":"2022-09-03T11:36:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-resort-style-swimming-pool\/7529403636.html","post_id":7529403636,"result_date":"2022-09-03 11:04","title":"Resort-Style Swimming Pool, Individual Intrusion Alarms, Extra Storage","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Serene Wooded ViewResort-Style Swimming PoolCar Wash AreaPlaygroundExtra StorageNewly Renovated InteriorsPrivate Patio or BalconyGaragesDisability AccessDishwasherSpeakeasy Wine RoomFull Size Washer and Dryer in All UnitsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/ahhokry6\/JeffersonatWestTown\n","num_images":9,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1124ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: weekly']","posted_date":"2022-09-03T11:00:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-private-patio-or-balcony\/7529400430.html","post_id":7529400430,"result_date":"2022-09-03 10:57","title":"Private Patio or Balcony, Oversized Closets, Car Wash Area","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Serene Wooded ViewDisability AccessIndividual Intrusion AlarmsFull Size Washer and Dryer in All UnitsPrivate Patio or BalconyGaragesCar Wash AreaAir ConditioningWireless & High Speed Internet AccessPicnic AreaCable ReadyHigh Speed Internet AccessCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/meeoo7dj\/JeffersonatWestTown\n","num_images":9,"lat":39.9441,"lng":-75.5882,"attrs":"['1BR \/ 1Ba', '836ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: weekly']","posted_date":"2022-09-03T10:53:27-0400"}]