[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-is-beautiful-amazing\/7606193698.html","post_id":7606193698,"title":"This is beautiful amazing 3 Bedroom 2 Bath House with a Front Porch.","description":"show contact info\nThis is beautiful amazing 3 Bedroom 2 Bath House with a Front Porch. Hardwood Flooring throughout. The Kitchen has Granite Countertops with Stainless Appliances: Refrigerator, Stove, Microwave, and Dishwasher and a Bonus Room off the Kitchen useful for Storage, Pantry. Basement Access and a Fenced Concrete Private Backyard. 2 Full Bathrooms one on the Main Floor of the House.\nText for Application link and authorize credit and background checks , prior to viewing.\nGood credit required Credit check text for more info.\nApplication fee $65 Refundable\nText house owner for more information and to get the application form.  show contact info\n2355 N Bouvier St, Philadelphia, PA 19132\nSerious inquiries only!!\nThanks.\n","num_images":12.0,"lat":39.989443,"lng":-75.161534,"attrs":"['3BR \/ 2Ba', '1036ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: Background & credit check', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T21:21:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-1st-fl-bed-bath\/7606186234.html","post_id":7606186234,"title":"Modern 1st Fl 1 Bed 1 Bath Passyunk Square Apt! Yard! W\/D! Come by!","description":"Modern 1st fl. 1 Bedroom 1 Bath Passyunk Square Apt. with H\/W floors and private Yard! Great size! Large Living Room\/Dining Room\/Kitchen combination with hardwood floors, tile floors, good granite countertop and cabinet space and is great for entertaining with kitchen including gas range and refrigerator. Nice-sized bedroom with closet space. Modern 3-piece bathroom! There is a nice-sized rear yard! Access to the unfinished basement with W\/D. The yard and basement are exclusive to the first floor apt. Nice windows with lots of natural light!  Cats and small quiet dogs (less than 25 lbs.) are OK with non-refundable pet fee. First, last, and security deposit required at lease signing. Applicant must first fill out an application with two recent pay stubs\/some income verification, copy of photo ID, and non refundable $75 application fee. Tenant is subject to credit check, criminal and eviction check. For gross monthly income, we look 3x the rent. Tenant pays gas, electric, and cable\/internet. Landlord pays cold water\/sewer. Available now! For showings, please call\/text Mike Giordano at  show contact info\n!","num_images":12.0,"lat":39.927012,"lng":-75.163718,"attrs":"['1BR \/ 1Ba', '1000ft2', 'available now', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T20:50:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-available\/7606196620.html","post_id":7606196620,"title":"Spacious 2 bedroom available now at 35th and Spring garden!","description":"Updated kitchen. Spacious living room. Hardwood floors. Laundry room is in the building. Tenant pay for electric and gas. Cold water is included. 1 year lease. $60 application fee. 3 months to move in. $250 pet fee plus $25 pet rent.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":11.0,"lat":39.962769,"lng":-75.192846,"attrs":"['2BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T21:34:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3br-1976ft2-home-is\/7606179700.html","post_id":7606179700,"title":"3br -1976ft2 - Home is available now and ready for immediate move-in!","description":"Gorgeous 3-Bedroom Twin Home in Lansdowne! Available NOW! - This 3Bedroom\/2Bathroom Twin Home is located on a quiet, residential street in Lansdowne. Surrounded by plenty of restaurants, shops, and entertainment, you will love this location! You will also enjoy having easy access to Baltimore Pike which makes commuting into Philadelphia a breeze. This home is available now and ready for immediate move-in!Entry into the home leads you into a sunroom which acts as the perfect space for storing your coats, boots, and other items. The living room is spacious and includes wide-plank flooring which gives the appearance of hardwood. It also includes tall ceilings, decorative wall sconces, and large windows which allow tons of natural light to pour in and make the entire space feel incredibly open and bright.The wide-plank flooring flows continuously into the dining room which is large enough to accommodate a six-seat dining set with ease! It is located directly off of the kitchen which makes preparing and serving meals a breeze. The kitchen has been beautifully renovated and includes tile flooring, light oak cabinets with dark hardware, a four-burner electric range, and full-sized refrigerator. There is plenty of storage throughout the cabinets and enough counterspace to prepare any meal you can imagine! There is also enough space for a moveable island or a small bistro set if you'd like to create an eat-in kitchen.All three bedrooms are located on the second floor of the home and are a comfortable size.Must include full name and telephone number for a response.","num_images":10.0,"lat":39.9597,"lng":-75.2024,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly']","posted_date":"2023-04-02T20:22:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-bedroom-in\/7606185225.html","post_id":7606185225,"title":"Luxury 3 Bedroom in Fairmount with Private Roofdeck","description":"This luxury condo in the heart of Fairmount is now available! With 3 bedrooms, 3 full bathrooms, in unit washer\/dryer and a PRIVATE ROOFTOP with unobstructed views of the city skyline, this unit has it all! The massive, upgraded kitchen on the first floor is open to the living and dining areas. It contains quartz countertops, a large island Kohler Purist black fixtures, and VIKING stainless steel appliances.\nThe first floor features one of the three large bedrooms and full bathroom down the hall. Make your way upstairs to find two additional oversized bedrooms each with large closets and en-suite full bathrooms. There is a wet bar with beverage center located at the staircase heading up to the rooftop. Well located to shops and restaurants along Fairmount Avenue such as Urban Saloon, Fare, Tela's Market and Fairmount attractions such as the Philadelphia Art Museum and The Eastern State Penitentiary.\nPets OK with $60 monthly pet rent. Case by Case Basis\nListing courtesy of BHHS Fox & Roach Realtors\n","num_images":20.0,"lat":39.968099,"lng":-75.168374,"attrs":"['3BR \/ 3Ba', '1600ft2', 'available now', 'air conditioning', 'application fee details: $40', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T20:45:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom\/7606182033.html","post_id":7606182033,"title":"Renovated 1 bedroom available now at 4800 Brown street!","description":"Experience forward-thinking urban living.\n1, 2 & 3 bedroom luxury loft-style apartments located in an affordable up-and-coming district just north of University City make up this 34-unit complex. We offer thoughtful architecture and design creating a contemporary feel in an old factory setting. Elevator access, stainless steel appliances including a dishwasher and garbage disposal, a multi-camera security system, intercom system with remote door buzzer, on-site laundry, high ceilings, custom cabinetry with self-closing hardware, granite counters, kitchen pantry, exposed brick & concrete in many units, tile flooring, central heat & air, LED lighting, extra large commercial sized windows, large closets and large bright common hallways will be more than enough to make you want to come home!\nLive the uptown urban lifestyle you crave!\nAmenities:\n-Water $35.00 per month\n-Elevator\n-Assigned gated parking available for car and scooters ($150 per space, coming Summer 2021)\n-Multi-camera security system\n-Intercom system with electronic door opener\n-On-site laundry\n-Choice of Comcast or Verizon\n-Full-size stainless steel appliances\n-Bus line at corner\n-Garbage disposal\n-High ceilings\n-Large closets\n-Custom cabinetry with self closing cabinet doors & drawers\n-Sinks with magnetic retractable faucet hose\n-Granite counters\n-Pantries\n-Exposed ductwork, brick & concrete floors\/ceilings (in some units)\n-Central air and heat\nIn addition to monthly rent, tenant is responsible for their own electricity bill, a water fee of $35 & a liability insurance fee of $9.50\nCall Alena fro showing at  show contact info\nCity wide realty\n","num_images":10.0,"lat":39.966337,"lng":-75.216657,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T20:32:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-available\/7606180820.html","post_id":7606180820,"title":"Large 2 bedroom available now at 5100 Walnut street!","description":"Spacious 2 bedroom apartment available now at 5100 Walnut street. Large living room comes with a balcony. 3 months to move in. $50 application fee. Pet friendly. Laundry room is in the building. Tenant pays all utilities.\nCall or text at  show contact info\nto schedule your showing today.\n","num_images":18.0,"lat":39.956707,"lng":-75.223538,"attrs":"['2BR \/ 1Ba', 'application fee details: 50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T20:27:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom\/7606179428.html","post_id":7606179428,"title":"Beautiful 1 bedroom available in June at 4900 Pine street!","description":"Great Location. Renovated One bedroom.\nRenovated one bedroom at Cedar Park.\nRosewood hardwood floors, SS appliances, ceiling fan. Shared laundry in the building.\nPets are conditional with a $250 per pet.\nResidents are responsible for gas and electric.\nRental Terms\nRent: $1,195\nApplication Fee: $55\nSecurity Deposit: $1,195\nAvailable now.\nPet Policy\nCats allowed\nSmall dogs allowed\nCall Alena for showing at  show contact info\nCity Wide Realty\n","num_images":14.0,"lat":39.952792,"lng":-75.220295,"attrs":"['1BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T20:21:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ardmore-this-bedroom-full-bathroom-twin\/7606178721.html","post_id":7606178721,"title":"This 2 bedroom, 2 full bathroom twin is waiting for you!","description":"Beautifully renovated with prime location, this 2 bedroom, 2 full bathroom twin is waiting for you! Between 2016 and the present the entire home has been remodeled and it is absolutely beautiful. The twin home sits up proudly on a small hill with just a few steps to the covered front porch. Enjoy many mornings and evenings sipping coffee or enjoying dinner out here. The porch leads you right into the main floor of the home where you will find a beautiful open floor plan of family room, kitchen and dining that all flow into one another. The kitchen was renovated to give you views of the whole level with a large island, tons of cabinetry & natural light, granite counters and a slider to the back deck.","num_images":6.0,"lat":40.002,"lng":-75.2966,"attrs":"['2BR \/ 2Ba', '1242ft2', 'available now', '\\nsunday 2023-04-02\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T20:18:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-studio-available-now\/7606177877.html","post_id":7606177877,"title":"Great studio available now at 3412 Spring garden!","description":"Affordable studio available now at 501 N 35th street. Hardwood floor. Window heat and AC. Pet friendly. $250 one time pet fee plus $25 pet rent. 1 year lease. $60 application fee. Security deposit, first and last month to move in. Must to have a good credit. Laundry room is in the building.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":9.0,"lat":39.962769,"lng":-75.192846,"attrs":"['0BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T20:15:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-available\/7606175977.html","post_id":7606175977,"title":"Spacious 1 bedroom available now at 4704 Chestnut st!","description":"Great, beautiful 1 bedroom available now. Dark hardwood floors. Spacious living room and a good size bedroom. Laundry room is in the building. Tenant pays for electricity and gas. Cold water is included. $60 application fee. 3 months to move in. 1 year lease.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":17.0,"lat":39.957259,"lng":-75.215396,"attrs":"['1BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T20:08:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/fort-washington-beautiful-2bd-1bth\/7606142752.html","post_id":7606142752,"title":"Beautiful 2BD\/1BTH House for rent","description":"2 bedroom 1 bath townhouse with fenced yard. Newly renovated kitchen with new appliances, new tiles, and real brick accents. Large windows, high ceilings fill the entire home. New hardwood floors and new vanity in the bathroom. Credit score must be 650 or above. Proof of income and credit check is required. Unfortunately pets are on a case by case basis small dogs under 20 lbs might be considered.","num_images":8.0,"lat":40.158394,"lng":-75.219805,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T18:12:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-central-location-upgraded\/7606040311.html","post_id":7606040311,"title":"Central Location, Upgraded Finishes Available, Pet Park","description":"The Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nCommunity Features\n* Package Acceptance\n* Outdoor Grill Area\n* Credit Cards Accepted\n* WiFi Access\n* Extra Storage\n* Gaming Area\n* Pet Salon\n* Renters Insurance is Required\n* Elevator\n* Controlled Access\n* Bike Racks\n* TV Lounge\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Billiards\n* Long Term Lease Available\n* Fitness Studio\n* Community Kitchen\n* EV Charging\n* After-Hours Emergency Maintenance\n* Short or Long Term Lease Available\n* Garage Parking\n* Playground\n* Movie Theatre\n* Dry Cleaning and Laundry Service\n* Non Smoking Community\n* Community Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Professionally Managed\n* Swimming Pool\n* Landscaped Courtyards\n* Easy Freeway Access\n* Sun Deck\n* Bark Park","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1075ft2', 'available apr 9', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T13:27:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-bedroom-full-bathroom\/7606040191.html","post_id":7606040191,"title":"New 2-bedroom, 2 full bathroom condo","description":"New 2-bedroom, 2 full bathroom condo with open-concept kitchen and living room. Brand-new, stainless-steel appliances in the kitchen. Washer and dryer included. Wet-bar and private roof deck with grill that overlooks the Delaware River. Just outside of Northern Liberties and walking distance to major public transit lines.We DO NOT respond to texts, if you want more information.text your contact number.","num_images":9.0,"lat":39.968425,"lng":-75.147709,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T13:27:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studio-in-squirrel-hill\/7605998252.html","post_id":7605998252,"title":"🏵️ Studio in Squirrel Hill 🏵️","description":"The Florence Flats Is A Well Maintained And Affordable Building In Squirrel Hill. We Have Spacious Studio, One Bedroom, And Two Bedroom Apartments Conveniently Located Near Shopping, Public Transportation, University City, Major Highways, Restaurants, Easy Access To Center City, And So Much More.\nBeautifully Updated Kitchens\nCentral Heat & Air\nClose Proximity To Upenn\nEasy Digital Leasing Process\nFree Storage Unit With Each Apartment\nPet Friendly\nShopping And Restaurants\nTiled Bathrooms","num_images":7.0,"lat":40.014,"lng":-75.187,"attrs":"['0BR \/ 1Ba', 'available may 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T11:30:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/north-wales-check-out-our-amazing\/7606037706.html","post_id":7606037706,"title":"Check out our amazing location! 2 bed 1 bath Hunt Club Apartments!","description":"Hunt Club Apartments Leasing Office:  10 Hunt Club Trl North Wales, PA 19454 show contact info\nTake a look at what Hunt Club Apartments has to offer! Exceptional Apartment Living!  Hunt Club Apartments offers unique one bedroom, two bedroom, and three bedroom apartment homes in a beautiful setting that combines the comfort of home with exceptional resident services and outstanding community amenities. Options like fireplaces and storage spaces help you choose one of the apartment homes and create a style that is perfect for you. You will enjoy the convenience of living just minutes from major highways (Routes 63, 309, 202, & the PA Turnpike) and having easy access to transportation, employers, fine dining, parks and recreational areas, cultural events, historic attractions and shopping! By living luxuriously with a maintenance free lifestyle, you will find the serenity and convenience of Hunt Club Apartments to be your refreshing paradise. Schedule a tour of our beautiful North Wales apartments today and see why residents love coming home to Hunt Club.Rental Information: 2 Bedroom \/ 1 Bathroom \/ 841 sq ft \/ $2234\/Month  Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthApartment Amenities:➢ Accent Walls➢ Dishwasher➢ Heating➢ High Speed Internet Access➢ Linen Closet➢ Refrigerator\/Freezer➢ Satellite TV➢ Tub\/Shower➢ Wheelchair Accessible (Rooms)➢ Window Coverings➢ Cable-Ready➢ Central Air Conditioning➢ Full-size Washer And Dryer➢ Individual Patio or Balcony➢ Private Entrance➢ Storage Spaces (select homes)➢ Upgraded Kitchens (select homes)➢ Walk-In Closets (select homes)➢ Wood Burning Fireplaces (select homes)Additional Information:➢ Barbecue & Picnic Area➢ Business Center➢ Car Wash Area➢ Clubhouse & Lounge➢ Courtyard➢ Free Weights, Weight & Cardio Machines➢ Furnished Units Available➢ Onsite Management➢ Swimming Pool & Sundeck➢ Walking\/Biking Trails➢ 1\/2 Mile from English Village Shopping Center➢ 24 Hour Availability➢ Abundant Parking➢ Adjacent to Oxford Park➢ Corporate Suites➢ Located on Route 63➢ Online Payment Options➢ Recycling➢ Wi-Fi at Pool and Clubhouse➢ Within 10 Miles of the Northeast Extension of the PA Turnpike Leasing Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM show contact info\nPet Policy: Breed Restriction The Hunt Club is a pet-friendly apartment community. We welcome cats and dogs (breed restrictions apply). Exotic pets are approved on a case by case basis. You may have two pets per apartment. There is a monthly pet rent of $35 for 1 pet and $50 for 2 pets. There is also a one-time, non-refundable fee of $350 for 1 pet and $500 for 2 pets. Website: https:\/\/www.huntclubnorthwales.com\/ All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITY5C36A345C5D24E3\n","num_images":18.0,"lat":40.211229,"lng":-75.235922,"attrs":"['2BR \/ 1Ba', '841ft2', 'available jun 30', 'application fee details: $60 application fee per applicant', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T13:20:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-patio-balcony-large-closets\/7606034601.html","post_id":7606034601,"title":"Patio\/Balcony*, Large Closets with Organizing Systems, Selected","description":"Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Call Now:  show contact info\nx 87OR Text 87 to  show contact info\nto chat!Visit This Website to See More:https:\/\/mack.touraptnow.com\/932u34This is a 1 Bedroom, 1 Bath, Approximately 632 Sq. Ft.Features - Patio\/Balcony*  - Selected  - Premium Stainless Steel Appliance Package  - Custom Subway Tile Backsplashes  - Stone Counters  - Tons of Natural Lighting Throughout  - Cable Ready  - Flush Mount Sinks with Goose Neck Faucets  - Large Closets with Organizing Systems  - Washer\/Dryer  - Hardwood Style Flooring  - Dishwasher  - Disposal  - Gas Range  - Air Conditioner  - Electronic Thermostat *In Select Apartment Homes Community Amenities - Garage  - Covered Parking  - On-Site Maintenance  - Courtyard  - Off Street Parking  - BBQ\/Picnic Area  - Fitness Center  - Free Weights  - Multiple, Expansive Outdoor Spaces  - Elevator  - Multiple Co-Working Studios  - Selected  - Parisian Style Café with Demonstration Kitchen  - Playground  - Smoke-Free Community  - Sundeck  - On-Site Management  - Rooftop Dog Park  - Tennis Court Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMThe Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Equal Housing Opportunity 3hy9QZKf2P\n","num_images":15.0,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '632ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T13:12:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/flourtown-newer-home-with-spacious-3bd\/7606026501.html","post_id":7606026501,"title":"Newer Home with spacious 3BD\/2.5BTH House for rent","description":"Newer Home with spacious modern floor plan. 3 bedroom with large closets, 2\/1 baths, field finished hardwood floors throughout. white eat in kitchen w granite countertops and island. stainless appliances. full basement for storage. private parking spaces.","num_images":16.0,"lat":40.09351,"lng":-75.213521,"attrs":"['3BR \/ 2.5Ba', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T12:49:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-new-beginnings-here-at-park\/7606028982.html","post_id":7606028982,"title":"New Beginnings Here at Park Lane!!","description":"Apt. 5111 — Ascott floor plan — 1,230 sq. ft. — $3,275\nThis 1st floor corner-unit apartment has so much to offer! Our brand-new construction includes white quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This Ascott also features spacious walk-in closets with custom shelving and ample living\/dining room space. This beautiful apartment home is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1230ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T12:56:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-laundry-in-unit-central\/7606022257.html","post_id":7606022257,"title":"Laundry in Unit, Central Location, Ideal Location","description":"The Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nCommunity Features\n* Yoga Lounge\n* Community Lounge\n* Professionally Managed\n* Spa\n* Sun Deck\n* Swimming Pool\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* Bark Park\n* Easy Freeway Access\n* Outdoor Grill Area\n* Billiards\n* Fitness Studio\n* TV Lounge","num_images":23.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1239ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T12:38:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fitness-center-incredible\/7606021696.html","post_id":7606021696,"title":"Fitness Center, Incredible Features, Central Location","description":"Be the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Kitchen Island\n* Washer and Dryer in unit\n* Stainless Steel Appliances\n* Walk-in Closet\n* Garden Tub\n* Private Patio or Private Balcony (on select apartments)\n* Linen Closet","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '815ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T12:36:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-package-room-central-location\/7606017705.html","post_id":7606017705,"title":"Package Room, Central Location, Ideal Location","description":"The Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nOur pet-friendly studio, one, two and three bedroom apartments in Exton deliver distinctive living in one of the area's most desired locations. The Point at Exton is the perfect community for your new home!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, ensuite bathrooms, walk-in closets, and a washer\/dryer!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['2BR \/ 2Ba', '1248ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T12:25:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-tv-lounge-incredible-features\/7606017315.html","post_id":7606017315,"title":"TV Lounge, Incredible Features, Central Location","description":"The Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nJust minutes from the Exton Train Station and area highways, The Point at Exton gives you easy access to King of Prussia and Center City Philadelphia while also keeping you close to the area's top outdoor trails and nature destinations. Lease now!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, coat closet, walk-in closet, and a washer\/dryer!\nApartment Features\n* Kitchen Island\n* Granite Countertops\n* Quartz Countertops\n* Wood-Like Floors\n* Stainless Steel Appliances\n* Washer and Dryer in unit\n* Garden Tub","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '876ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T12:24:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-in-nolibs-available-may\/7606003706.html","post_id":7606003706,"title":"1 Br in NoLibs available May 10th","description":"Best Kept Secret Of Northern Liberties! Enjoy Easy Access To Fantastic Shopping And Restaurants In A Relaxing \"Park-Like\" Atmosphere. Spacious And Bright Studio - 3 Bedroom Apartments In This Fantastic Gated Community.\n24 Hour Emergency Maintance\nBike Parking\nCentral Courtyard With Picnic Tables & Bbq Grills\nCharming Views\nDesigner Kitchen\nEasy Digital Leasing Process\nGated Community\nHard Wood Floors\nPet Friendly\nSmart Card Operated Laundry\nTiled Bath\nTranquil Outdoor Space\n","num_images":4.0,"lat":40.014,"lng":-75.187,"attrs":"['1BR \/ 1Ba', 'available may 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T11:46:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-custom-built-1480sf-split\/7605997959.html","post_id":7605997959,"title":"@Custom built 1480SF~ Split Level House@~3BDrm--2.5Bath@","description":"Custom built 3 bedroom, 2 1\/2 bath, 1480sq. ft. energy efficient split level house. Attention to detail throughout. From the low-E glass windows, high efficiency furnace, heat pump hot water tank, and the HRV (high recovery ventilation system), this home was built with energy savings in mind. Open kitchen\/living room has raised panel cabinets, granite counter tops, stainless refrigerator, dishwasher, range, and micro hood. Laundry room in lower level!! If you are more interested. Send me your contact number. I will discuss my property with you.. Thanks!!!","num_images":3.0,"lat":39.9845,"lng":-75.5962,"attrs":"['3BR \/ 2.5Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T11:29:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-huge-bedroom-with-parking\/7606002917.html","post_id":7606002917,"title":"Huge 2 Bedroom with Parking in Olde Kensington\/Northern Liberties","description":"Take advantage of this opportunity to rent this beautiful 2-bedroom, 2-bathroom unit, perfectly suited for entertaining, with designated parking. This well-maintained newer construction condo is sure to impress! Enter this main floor unit from 5th Street through a shared entryway.\nLocated on this level you will find a bedroom with ample closet space, spacious 3-piece hall bath, and coat closet. The heart of this unit is the open kitchen with stainless steel appliances, two toned cabinetry, subway tile backsplash, with white granite countertops that provide counter seating.\nThe large living\/dining room combo offers rear access to your assigned parking located directly outside your back door (utilize the outside outlet to charge your electric car). The lower level provides extra living space, storage, laundry room and over-sized primary suite with full bath offering a walk-in glass door shower and a double-sink vanity. Throughout the unit you will find hardwood floors, high ceilings, recessed lighting, and large windows that provide ample natural light.\nAn on-site community dog park is available for residents to make time with their furry family members an added luxury. Perfectly located within walking distance of all the fantastic dining, nightlife, coffee shops, boutique & name brand shopping that Northern Liberties, Fishtown and Olde Kensington areas have to offer… the Piazza, Jerry’s Bar, Standard Tap, Johnny Brenda’s, Frankford Hall, Fette Sau, La Colombe, Suraya, Evil Genius, Human Robot, and Suttons. Enjoy easy access to public transportation, the Girard Avenue corridor, local bridges, major highways and only minutes away from Center City.\nListing provided by Keller Williams Philadelphia\n","num_images":21.0,"lat":39.97047,"lng":-75.144952,"attrs":"['2BR \/ 2Ba', '1550ft2', 'available now', 'air conditioning', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T11:44:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-landlord-tenant-law-are\/7605998971.html","post_id":7605998971,"title":"Landlord Tenant Law. Are you having issues with your Landlord?","description":"Hello\nI am an attorney whom specializes in Tenants rights. If you are having issues with your landlord, please email me.\n","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['1BR \/ splitBa', 'apartment', 'no laundry on site', 'no parking', 'rent period: daily']","posted_date":"2023-04-02T11:32:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-freshly-renovated-bedroom\/7605992052.html","post_id":7605992052,"title":"Freshly Renovated 2 Bedroom in South Philly","description":"Freshly renovated home in Point Breeze! Enter the home to find an open living room, dining room, kitchen and half bath for convenience on the first floor. The kitchen features quarts countertops, a tiled backsplash, and stainless steel appliances. Out back is a patio perfect for entertaining family and friends or relaxing solo.\nUpstairs are 2 bedrooms and a huge full bathroom complete with dreamy soaking tub, double vanity, and shower. Downstairs is a clean basement for storage with a washer and dryer. Luxury vinyl floors and natural light throughout. Conveniently located to: American Sardine Bar, Dock Street Brewery South, Wharton Square Playground, Target, Sprouts Farmers Market, and Septa bus routes.\nListing is courtesy of Space & Company\n","num_images":13.0,"lat":39.932472,"lng":-75.180387,"attrs":"['2BR \/ 1.5Ba', '948ft2', 'available now', 'air conditioning', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T11:11:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fishtown-house-for-rent\/7606002132.html","post_id":7606002132,"title":"Fishtown House for rent.","description":"Lovely 2 bedroom house for rent on the best street in fishtown large yard close to all activities, public transportation, quiet, available June 1st. On street parking. First month, last month and a month security. Good credit, rental references. Open houses will be planned soon with photos.\nSmall pet ok!\n","num_images":0.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1.5Ba', '925ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T11:42:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-attractive-bedroom\/7605981509.html","post_id":7605981509,"title":"Attractive 2 Bedroom 1 Bathroom Available Now in Affordable Price!","description":"Attractive 2 Bedroom 1 Bathroom Duplex Condo Unit For Rent in Affordable Price. The kitchen offers plenty of cabinet space with stainless steel appliances. The bedroom is spacious with a large walk-in closet. You will find another closet across from the bathroom. All room in hardwood floors throughout. Large size bedroom. Great size closet. Private balcony. new windows, and new AC Unit. As if that wasn't enough, Full size washer\/dryer, in unit. Attached garage parking. Your pets are welcome. Walking distance to local coffee shops, bus station restaurants School, highway, and much more. Don't miss this opportunity!\nOnly serious enquiries please contact at  show contact info\nthis number\n","num_images":9.0,"lat":39.9845,"lng":-75.2282,"attrs":"['2BR \/ 1Ba', '1120ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T10:36:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-incredible-features-resort\/7605997772.html","post_id":7605997772,"title":"Incredible Features, Resort Style Pool, Upgraded Finishes Available","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester is the perfect location for your new home. Explore our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, Den, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Fitness Studio\n* Short or Long Term Lease Available\n* Easy Freeway Access\n* Package Acceptance\n* Sun Deck\n* Pet Salon\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Landscaped Courtyards\n* TV Lounge\n* Non Smoking Community\n* Bark Park\n* Elevator\n* Movie Theatre\n* Extra Storage\n* Dry Cleaning and Laundry Service\n* Credit Cards Accepted\n* EV Charging\n* Swimming Pool\n* Garage Parking\n* WiFi Access\n* Outdoor Grill Area\n* Community Lounge\n* Community Kitchen\n* Minutes from Restaurants, Shopping, and Much More\n* Gaming Area\n* After-Hours Emergency Maintenance\n* Long Term Lease Available\n* Bike Racks\n* Playground\n* Renters Insurance is Required\n* Controlled Access\n* Professionally Managed\n* Billiards\n[#9638720]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available apr 9', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T11:29:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-very-large-bedroom-in\/7605996163.html","post_id":7605996163,"title":"Very Large 1 Bedroom in Center City","description":"Gorgeous one bedroom\/one bathroom unit available in the heart of the city! This unit features an open living room\/kitchen\/dining space with hardwood floors, decorative fireplace, large bedroom, and washer\/dryer in unit!\nPets OK. Central Air. Dishwasher\nListing is courtesy of BHHS Fox & Roach Realtors","num_images":14.0,"lat":39.947041,"lng":-75.165194,"attrs":"['1BR \/ 1Ba', '850ft2', 'available now', 'air conditioning', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T11:24:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-bedroom-apartment\/7605994881.html","post_id":7605994881,"title":"NEW , 1 bedroom apartment , University city - LOVELY apartment !","description":"Lovely apartment , perfect Location.\n1st floor In a Triplex setting.\nbrand new construction completed  on November  2022 .\nBrand new Kitchen , with new appliances, real wood modern cabinets.\nreal wood . modern floors .\nrecessed lights.\nlarge bedroom with brand new bathroom.\nstorage aria in the back.\naccess to a private, fenced  large back yard.\nperfect setting for a single person, student, or a couple.\npriced to rent fast.\nFor more information , and or to schedule showing please\nreply to this post with your direct contact information.\nor\nCall \/ TEXT to\nshow contact info\nand ask for Moses.\nMove in required.\nFirst and Last month , along with a security deposit\n(total 3 Month Rent)","num_images":11.0,"lat":39.955834,"lng":-75.225907,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T11:20:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-stop-by-our-comfortable-and\/7605983980.html","post_id":7605983980,"title":"Stop By Our Comfortable and Quiet Community Today!","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4.0,"lat":39.869632,"lng":-75.367584,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T10:45:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-gorgeous-bedroom-available-today\/7605983700.html","post_id":7605983700,"title":"Gorgeous 1 Bedroom Available Today","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4.0,"lat":39.869698,"lng":-75.367928,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T10:44:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-wallingford-estates-apartments\/7605983158.html","post_id":7605983158,"title":"Wallingford Estates Apartments Has Availability","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4.0,"lat":39.86973,"lng":-75.367756,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T10:42:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-come-home-to-wallingford\/7605982892.html","post_id":7605982892,"title":"Come Home to Wallingford Estates Apartments","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4.0,"lat":39.869698,"lng":-75.368099,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T10:41:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-life-just-got-better\/7605983463.html","post_id":7605983463,"title":"Life Just Got Better","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4.0,"lat":39.869566,"lng":-75.368185,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T10:43:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-take-deep-breath-and-relax\/7605985298.html","post_id":7605985298,"title":"Take a Deep Breath and Relax Here at Park Lane!","description":"Apt. 1401 — Trafalgar floor plan — 1,452 sq. ft. — $3,945\nThis large 4th floor corner apartment has so much to offer! This apartment home includes LVT flooring throughout the spacious living area, central heat and air, a spacious laundry room, stainless steel appliances, a large private balcony, and ample storage space. The master bedroom is equipped with a spacious walk-in closet and generously-sized bathroom with double vanity sinks. The guest bedroom and bathroom are spacious, as well! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T10:49:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-multiple-co-working-studios\/7605983178.html","post_id":7605983178,"title":"Multiple Co-Working Studios, Disposal, Off Street Parking","description":"Call Now -  show contact info\nx 86OR Text 86 to  show contact info\nto contact our team.This is a 2 Bedroom, 2 Bath, Approximately 1130 Sq. Ft. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Features: Tons of Natural Lighting Throughout, Air Conditioner, Large Closets with Organizing Systems, Selected, Cable Ready, Premium Stainless Steel Appliance Package, Dishwasher, Custom Subway Tile Backsplashes, Hardwood Style Flooring, Washer\/Dryer, Gas Range, Patio\/Balcony*, Disposal, Stone Counters, Electronic Thermostat, Flush Mount Sinks with Goose Neck Faucets  *In Select Apartment Homes Community Amenities: Smoke-Free Community, Free Weights, Covered Parking, Multiple Co-Working Studios, Fitness Center, Rooftop Dog Park, BBQ\/Picnic Area, Tennis Court, Off Street Parking, Playground, Selected, Elevator, Sundeck, Courtyard, Multiple, Expansive Outdoor Spaces, Garage, On-Site Management, Parisian Style Café with Demonstration Kitchen, On-Site Maintenance Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. More unit details at:https:\/\/mack.touraptnow.com\/w372d9Equal Housing Opportunity JF4d03MX\n","num_images":16.0,"lat":40.0118,"lng":-75.2342,"attrs":"['2BR \/ 2Ba', '1130ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T10:42:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-washer-dryer-in-unit-wood\/7605963772.html","post_id":7605963772,"title":"Washer\/Dryer in Unit, Wood Burning Fireplace, Sparkling Swimming Pool","description":"Professionally Managed by Cirrus Asset Management, Inc., TX - License # 9003183\n-Covered Parking\n-On-Site Management\n-24 Hour Emergency Maintenance\n-Carpeting\n-Dishwasher\n-Vaulted Ceilings\n-Carport\n-Handrails\n-Resurfaced Cabinets\n-Brushed Nickel Fixtures\n-Faux Wood Blinds\n-Clubhouse\n","num_images":4.0,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 1Ba', '930ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T09:31:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-stop-by-our-comfortable-and\/7605945408.html","post_id":7605945408,"title":"Stop By Our Comfortable and Quiet Community Today!","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T07:38:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-immediate-move-in-contact-us\/7605945525.html","post_id":7605945525,"title":"Immediate Move In - Contact Us for More Information","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T07:39:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-college-manor\/7605953817.html","post_id":7605953817,"title":"College Manor","description":"832 Pine Street Unit -4B is a 350 square foot studio apartment available 4\/7\/23 for $1,300.00. The Unit offers a newer kitchen with stainless-steel appliances, a washer dryer and wood floors. The heat is included.  There is a shared rooftop deck.  Walk to both Pennsylvania and Jefferson hospital, public transportation, restaurants, large markets, Penn's Landing, Old City, South Street and Center City. Great Location!","num_images":15.0,"lat":39.944512,"lng":-75.156644,"attrs":"['0BR \/ 1Ba', '350ft2', 'available apr 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T08:40:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/audubon-brand-new-renovation-3bd-15bth\/7605945553.html","post_id":7605945553,"title":"Brand new renovation 3BD\/1.5BTH House for rent","description":"This 3-Bedroom 1-1\/2-Bathroom Home is located on a quiet, tree-lined street in Norristown. With easy access to Main Street and plenty of shops, restaurants, and entertainment, you will absolutely love this location! This home is available NOW and ready for immediate move-in! Enter the home and fall in love with the spacious living room complete with wide-plank flooring that gives the appearance of beautiful hardwood flooring. There is a large window which allows tons of natural light to pour in and make the entire space feel incredibly open and bright! The living room is located directly off of the kitchen which is perfect for when you're entertaining guests or hosting holidays. The kitchen has been completely renovated and looks absolutely stunning. It includes white shaker-style cabinets with dark hardware, granite countertops, stainless steel refrigerator and four-burner gas range. The kitchen is large enough to accommodate a moveable island or a four-seat dining set if you'd like to create an eat-in kitchen! There is also an opening into the living room which makes both spaces feel connected. This home includes four bedrooms which is very rare to find! They vary in size but every bedroom is large enough to accommodate at least a full-sized bed and complete bedroom set with ease. They also include the same wide-plank flooring that is seen on the first floor of the home! There are one and a half bathrooms in the house and they are equally stunning. They have both been renovated and include high-end features throughout! The first bathroom in particular has a full-sized bathtub\/shower with an incredible tile surround that feels like having a spa inside your own home! In addition to all of the great features throughout the home, there is also a walkout basement that goes out to a large backyard which is perfect for outdoor games, hosting barbecues, or just enjoying some fresh air! There is certainly no shortage of space throughout this property. Conveniently located in Norristown by the Schuylkill River and a mile away from Bridgeport. Easy access to the Norristown Transportation Center, I-76, I-476, Rt. 202, Rt. 30, Rt. 422, and all the beauty Montgomery County has to offer!","num_images":19.0,"lat":40.112469,"lng":-75.331118,"attrs":"['3BR \/ 1.5Ba', 'available now', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T07:39:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-green-forest-apartments-has\/7605945077.html","post_id":7605945077,"title":"Green Forest Apartments Has Availability","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1.5Ba', '1050ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T07:35:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-stop-by-our-comfortable-and\/7605945799.html","post_id":7605945799,"title":"Stop By Our Comfortable and Quiet Community Today!","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.869729,"lng":-75.367906,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T07:42:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-immediate-move-in-for-bedroom\/7605945291.html","post_id":7605945291,"title":"Immediate Move In For 2 Bedroom \/ 1 Bathroom","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T07:37:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-tour-today-move-in-tomorrow\/7605946086.html","post_id":7605946086,"title":"Tour Today, Move In Tomorrow!","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.869787,"lng":-75.367949,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T07:44:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/spacious-and-sunny-bed-bath-apt-easy\/7605940523.html","post_id":7605940523,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-stop-looking-we-have-your-new\/7605945723.html","post_id":7605945723,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-come-home-to-wallingford\/7605945988.html","post_id":7605945988,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-wallingford-estates-apartments\/7605945643.html","post_id":7605945643,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-bed-15-bath-townhome\/7605940593.html","post_id":7605940593,"title":"3 BED, 1.5 BATH TOWNHOME AVAILABLE FOR RENT IN PHOENIXVILLE, PA!!~","description":"3 bedroom, 1.5 bathroom townhome available for rent in Phoenixville, PA. This home features a spacious living room, granite countertops, stainless steel appliances, washer and dryer, a finished basement, fenced patio area and 2 dedicated parking spaces. It is conveniently located less than a mile away from Bridge St so you can enjoy all of the restaurants and community events Phoenixville has to offer!","num_images":5.0,"lat":40.1267,"lng":-75.5272,"attrs":"['3BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T06:47:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-shop-eat-sleep-and-more-at\/7605944998.html","post_id":7605944998,"title":"Shop, Eat, Sleep and More at Park Lane!!","description":"Apt. 2410 — Oxford floor plan — 1,203 sq. ft. — $3,460\nThis 4th floor 2-bedroom\/2-bathroom apartment home has much to offer! It comes upgraded with hardwood LVT flooring, central heat and air, upgraded stainless steel appliances, and a lovely tile backsplash! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive living area is perfect for hosting! This gorgeous apartment has a beautiful view of the Philadelphia skyline. It is also within close proximity to our Clubhouse — featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T07:35:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-renovated\/7605937864.html","post_id":7605937864,"title":"Beautifully renovated trinity home in Bella Vista","description":"Beautifully renovated trinity home in Bella Vista with hardwood floors, designer kitchen with granite countertops and upgraded stainless steel appliances, in-unit washer and dryer, and heat & a\/c.\nConvenient location to the best that the Italian market has to offer (my favorite part about this home is that you can see and smell Isgro's amazing Italian bakery from your window), close to great restaurants, shopping, expressways and public transportation. Short walk to Jefferson university and local grocery stores. Parking garage available about a block away.\nTenant responsible for gas and electric.\nIF YOU ARE INTERESTED, PLEASE SEND ME YOUR NUMBER, I WILL TEXT YOU AS SOON AS POSSIBLE!!\n","num_images":1.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T06:05:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-immediate-housing\/7605938519.html","post_id":7605938519,"title":"IMMEDIATE Housing Available! 3 Bedroom 2 Bathroom","description":"If you are interested in the property give your phone number.I will contact you as soon as possible!\n* The Condominium is on the beachfront, incredibly decorated, with spectacular views of the Bay of Banderas, the mountains of the Sierra Madre and spectacular sunsets.\n* It is located just 10 minutes from the International Airport.\n* The entrance to the complex is through Plaza Peninsula.\n* Outside the complex you can find a taxi stand, or ask for an UBER at the lobby door, or walk to the bus stop just 3 minutes from the entrance of the complex.\nThe space\nUpon entering the Condominium, the first thing you see is the incredible view of the Ocean from the door of the house, and the further you go inside it, the closer you get to the sea.\nYou can be preparing your favorite breakfast and have a spectacular view of Banderas Bay, or have a coffee in the morning while watching the dolphins play or the whales jump; or if you prefer, have a glass of wine watching the sunset. All this from one of the balconies.\nJust as you can contemplate different views from each balcony of the house.\nFrom every corner of the Condominium you can hear the pleasant and relaxing sound of the ocean.\nIn addition to seeing the beauty of the ocean, the beach, the mountains, the river and the entire port, from practically all the rooms and of course, from all the balconies.\n","num_images":4.0,"lat":40.1166,"lng":-75.0198,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T06:16:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-immediate-housing\/7605936561.html","post_id":7605936561,"title":"##IMMEDIATE Housing Available! 3 Bedroom 2 Bathroom##!","description":"Text us for more information: show contact info\nWe'll find you the perfect Apartment Rental.\n* The Condominium is on the beachfront, incredibly decorated, with spectacular views of the Bay of Banderas, the mountains of the Sierra Madre and spectacular sunsets.\n* It is located just 10 minutes from the International Airport.\n* The entrance to the complex is through Plaza Peninsula.\n* Outside the complex you can find a taxi stand, or ask for an UBER at the lobby door, or walk to the bus stop just 3 minutes from the entrance of the complex.\nThe space\nUpon entering the Condominium, the first thing you see is the incredible view of the Ocean from the door of the house, and the further you go inside it, the closer you get to the sea.\nYou can be preparing your favorite breakfast and have a spectacular view of Banderas Bay, or have a coffee in the morning while watching the dolphins play or the whales jump; or if you prefer, have a glass of wine watching the sunset. All this from one of the balconies.\nJust as you can contemplate different views from each balcony of the house.\nFrom every corner of the Condominium you can hear the pleasant and relaxing sound of the ocean.\nIn addition to seeing the beauty of the ocean, the beach, the mountains, the river and the entire port, from practically all the rooms and of course, from all the balconies.\n","num_images":4.0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 2Ba', '1200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T05:40:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-classic-duplex-oak\/7605930759.html","post_id":7605930759,"title":"classic duplex w\/-oak hardwood floors","description":"charming, and classic duplex unit in the coveted. friendly Neighborhood. This unit is always rented, so don’t miss your chance to get it while you can! Spacious with beautiful oak hardwood floors. Very open, bright, and cheery with great natural light (lots of windows and a skylight by the entryway)! Large and attractive open kitchen. Spacious bedroom with great closet, and nice large closet near entry. Good-sized basement includes a laundry room with washer and dryer. Possible large basement storage room available as well. Fantastic landscaping! All yard care inclusive with a modest fee. Nice shared back deck. Locked gate entrance to the back area. Cute front porch, small front yard, and a nice fenced side yard.\nNo smoking.and friendly pet considered.\nPlease contact us through your number must be if interested...!!! or if you have any questions. In your inquiry, Let us know why this property seems like a good fit for you, and what you’re looking for!","num_images":12.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T03:31:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-start-living-your-best\/7605919734.html","post_id":7605919734,"title":"START LIVING YOUR BEST CITY LIFE!!! Welcome to the condo","description":"built in 2017. Take advantage of this opportunity to rent this beautiful 1-bedroom, 2-bathroom unit, perfectly suited for entertaining, with designated parking. This well-maintained newer construction condo is sure to impress! Enter this main floor unit from 5th Street through a shared entryway. Located on this level you will find a bedroom with ample closet space, spacious 3-piece hall bath, and coat closet.\n1223 N 5th St #1,\nPhiladelphia, PA 19122\n","num_images":4.0,"lat":39.978,"lng":-75.1459,"attrs":"['1BR \/ 2Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T00:46:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-backyard-is-true-outdoor\/7605923958.html","post_id":7605923958,"title":"Backyard is a true outdoor oasis with garden beds","description":"Text us with your number for  more information: We'll find you the perfect Apartment Rental.\n* The Condominium is on the beachfront, incredibly decorated, with spectacular views of the Bay of Banderas, the mountains of the Sierra Madre and spectacular sunsets.\n* It is located just 10 minutes from the International Airport.\n* The entrance to the complex is through Plaza Peninsula.\n* Outside the complex you can find a taxi stand, or ask for an UBER at the lobby door, or walk to the bus stop just 3 minutes from the entrance of the complex.\nThe space\nUpon entering the Condominium, the first thing you see is the incredible view of the Ocean from the door of the house, and the further you go inside it, the closer you get to the sea.\nYou can be preparing your favorite breakfast and have a spectacular view of Banderas Bay, or have a coffee in the morning while watching the dolphins play or the whales jump; or if you prefer, have a glass of wine watching the sunset. All this from one of the balconies.\nJust as you can contemplate different views from each balcony of the house.\nFrom every corner of the Condominium you can hear the pleasant and relaxing sound of the ocean.\nIn addition to seeing the beauty of the ocean, the beach, the mountains, the river and the entire port, from practically all the rooms and of course, from all the balconies.\n","num_images":1.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T01:34:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-bedroom\/7605910538.html","post_id":7605910538,"title":"Charming 3 bedroom","description":"Newly updated 3 bedroom home.\nWalking distance to supermarket.\nClose to public transportation.\nFront & back porch.\nApril move in\nSpring move in Special\nFirst month rent free for qualified applicants.\n$30.00 application fee","num_images":0.0,"lat":39.9612,"lng":-75.2303,"attrs":"['3BR \/ 1Ba', 'townhouse', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T23:27:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-for-rent\/7605902215.html","post_id":7605902215,"title":"House for rent","description":"This is a beautiful single family home in a great location. Reach out to Bohdan on  show contact info\nif you're truly interested in renting my property. You will definitely love this home.","num_images":10.0,"lat":40.0596,"lng":-75.0818,"attrs":"['3BR \/ 1.5Ba', '1051ft2', '\\nsunday 2023-04-09\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'listed by: Mark WeinbergCompass Pennsylvania LLC Compass', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T22:33:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-3bd-home-for-rent\/7606166002.html","post_id":7606166002,"title":"Lovely 3bd Home for rent in Beautiful neighborhood","description":"Welcome to this beautiful 3 bedroom, 1 full bathroom home in Port Richmond! It features everything from open concept living space, a modern kitchen\/bathroom, and in-unit laundry, to three spacious bedrooms and one full bathroom. Head out to the private patio that can fit a grill, chairs, and patio table, perfect for hangouts or gardening. The large, clean basement will be excellent for storage, a full basement with a washer and dryer, and more.\nThe house has big cozy rooms with a high ceilings. Hardwood floors throughout, lots of storage and lovely built-ins, modern kitchen, private back patio perfect for grilling, Very cool home, a must-see home. New large new Anderson windows throughout the house with a lot of natural light.Close to public transportation and I-95. Nearly Heitzman Recreation Park and just blocks away from all the shopping on Aramingo Avenue. Close to plenty of restaurants!\nDon't Miss Out !!\nSchedule a showing today!\n","num_images":19.0,"lat":39.998502,"lng":-75.101523,"attrs":"['3BR \/ 1Ba', '1086ft2', 'available apr 7', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T19:32:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/levittown-bedroom-bath-single-family\/7606163072.html","post_id":7606163072,"title":"5 Bedroom 2 Bath Single Family Home For Rent!","description":"This five bedroom, two full bathroom is perfect. Take walks through the neighborhood, sit outback on the deck in the nice size, quiet backyard, sit out front where you will find well groomed homes . This home is partially furnished with very nice , smoke free furniture ( call agent for furniture details) Central air conditioning is being installed , heat pump being installed ( no worrying about heating oil deliveries ) , new hot water heater , The enclosed back porch will have a new split heater and air conditioning system to keep you cool in the summer and warm in the winter while enjoying the backyard . Bring your cat , bring your dog . There is a one time pet fee, no monthly fee for pets This five bedroom , two full bathroom house is ready for country living. So many eateries, shops of all kinds and attractions like Sesame Place, malls , Bounce zones, supermarkets , easy access to major highways to New York and Center City Philadelphia and more . Do not delay , make your appointment today . More pictures will be uploaded soon","num_images":4.0,"lat":40.1483,"lng":-74.8371,"attrs":"['5BR \/ 2Ba', '1596ft2', 'available may 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T19:22:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-ba-apt-in-center-city\/7606160048.html","post_id":7606160048,"title":"2 BR \/ 2 BA Apt in Center City Philadelphia","description":"Bi-level 2 Bedroom Apt with 2 Full Bathrooms in Washington Square West area of Center City Philadelphia.\nUnique layout with warm Living room with exposed brick and gray hardwood flooring.\nFull kitchen with all Appliances provided for convenience (w\/d, d\/w, g\/d).\nFull size washer\/dryer in unit.\n2 full size bedrooms and 2 full bathrooms.\nThe bedroom on the second level is open loft style with access to a private outdoor deck.\nExposed brick throughout and high ceilings. Central Air Conditioning.\nApartment is within a private gated courtyard entrance.\nGreat downtown location near shopping, restaurants, colleges, Univ. of Arts, Jefferson Univ. hospital, Graduate Hospital, near the Broad St. Line, near Whole Foods, Acme, CVS, etc...\nPets are welcome.\nAvailable July 1.\nPlease email reply to ad if interested.\nShowings by appointment preferably in mornings or early afternoon.\nMichael J. Blaine, Licensed Realtor in PA","num_images":12.0,"lat":39.944009,"lng":-75.159984,"attrs":"['2BR \/ 2Ba', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-02T19:11:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/fort-washington-newly-renovated-1bd\/7606135820.html","post_id":7606135820,"title":"Newly renovated 1BD\/1BTH House for rent","description":"One bedroom, one bath, kitchen, living room, on the second floor of large Victorian House in old Fort Washington. Newly renovated. Available immediately. One-year lease. After the year, two months' notice. Washer and dryer in basement. No pets.","num_images":7.0,"lat":40.13838,"lng":-75.20815,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T17:50:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedroom-house\/7606138577.html","post_id":7606138577,"title":"Two bedroom House","description":"2 BEDROOM HOUSE\nLIVINGROOM\nDINING ROOM\nKITCHEN\nCARPET UP STAIRS\nCLOSET SPACE UPSTAIRS\nUNFINISHED BASEMENT\nYARD\nYou pay ur own Utilities\nGAS\/ELECTRIC\/WATER\n& RENTAL INSURANCE\n1ST\/LAST\/SECURITY TO MOVE IN($3300)\n# show contact info\nWHEN U SERIOUSLY n READY I CAN B REACH AT\n(TEXT IS BETTER)\n","num_images":8.0,"lat":39.99448,"lng":-75.152213,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T17:59:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/willow-grove-this-charming-3bd-2bth\/7606109763.html","post_id":7606109763,"title":"This Charming 3BD\/2BTH House for rent","description":"Charming 3 bedroom 2 full bath first floor home is the one you have been looking for. The house features a living room with hardwood floors and a fireplace, dining room with hardwood floors leading into a full kitchen with new quartz countertops, gas stove, new built in microwave, dishwasher and garbage disposal. The main bedroom is large with 2 huge closets and an en suite bathroom. The 2nd & 3rd bedrooms are good sized with a hall full bathroom for everyone. All the bedrooms and hall ways have new carpet. This is one floor living at its best. There is a large basement with a washer & dryer & wood working station. The yard is spacious, there is a 1 car carport and 4 car parking on the private driveway. Conveniently located near restaurants, transportation, highways & Willow Grove Mall. Call today to schedule a showing! Open House April 2, 2023, 2PM-4PM","num_images":17.0,"lat":40.13678,"lng":-75.116031,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T16:32:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-immediate-occupancy-for\/7606122081.html","post_id":7606122081,"title":"Immediate Occupancy for this Small Dog Friendly Townhome in Fireside","description":"2400 sqft 2 bedroom 1 bath house built in 2022. a quality-built home with nice original woodwork and finishing touches. 2 levels of living space. large brick living room fireplace. vaulted living room ceiling. also, separate chimney flue with first floor woodstove. living room and bedroom sky lights. All rooms have separate zoned baseboard heat. house has no water issues and basement is dry. foundation plumbing electric and deck are all in good condition. granite counter tops with new appliances. best amenities filled community in the Poconos, which has two ski lanes, indoor and outdoor pools, indoor and outdoor tennis courts, lakes, playground, fitness center, restaurant, clubhouse, kayaking, canoeing and other year-round activities. all is about one mile from house. Home is fairly priced compared to similar homes in the same community. Look at the rest when comparing this home at this price listed. must add your phone number so i can contact immediate with you","num_images":4.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T17:08:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-renovated\/7606102661.html","post_id":7606102661,"title":"Beautifully renovated trinity home in Bella Vista with hardwood floors","description":"Beautifully renovated trinity home in Bella Vista with hardwood floors, designer kitchen with granite countertops and upgraded stainless steel appliances, in-unit washer and dryer, and heat & a\/c.\nConvenient location to the best that the Italian market has to offer (my favorite part about this home is that you can see and smell Isgro's amazing Italian bakery from your window), close to great restaurants, shopping, expressways and public transportation. Short walk to Jefferson university and local grocery stores. Parking garage available about a block away.\nTenant responsible for gas and electric.\nIF YOU ARE INTERESTED, PLEASE SEND ME YOUR NUMBER, I WILL TEXT YOU AS SOON AS POSSIBLE!!\n","num_images":1.0,"lat":40.0596,"lng":-75.0818,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T16:12:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-spacious-bedroom-in-chester\/7606079766.html","post_id":7606079766,"title":"Spacious 2 Bedroom in Chester","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T15:12:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-immediate-move-in-for-bedroom\/7606080254.html","post_id":7606080254,"title":"Immediate Move In For 2 Bedroom \/ 1 Bathroom","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T15:13:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-ba-home-rent\/7606095840.html","post_id":7606095840,"title":"2 BR & 2 BA Home Rent!!","description":"5077 Rosewood Dr\nBuckingham Township, PA 18902\nFEATURES:\nBedrooms: 2 Bedrooms\nBathrooms: 2 Bathrooms\nGarage: 1-Car\nBasement: Finished Basement\nProperty Type: End Unit Townhome\nDESCRIPTION:\nSmall dog pet friendly and immediate occupancy for this 2 bedroom, 2 bath townhome in Buckingham Township. Located in the sought after Fireside development this home has gleaming hardwood flooring that flow through the living room, dining room, powder room and family room. Eat-in kitchen has ample cabinet and counter space, dishwasher, disposal, double oven range, custom backsplash and a large 10.2’ X 8.4’ dining area. Inviting family room with soaring 2-story ceiling is highlighted by the fireplace and a stunning wall of windows that overlook the deck and wooded rear yard. Master bedroom has 2 closets (including a walk-in closet) and a private bath with soaking tub, corner set shower and ceramic inlay tile floor. The home has newer carpeting, finished basement, garage, convenient 2nd floor laundry, 2 tier rear deck, alarm system, gas heating, and central air all in the award-winning Central Bucks School District. Small dogs allowed on a case-by-case basis.\nAir conditioning * Gas Heat * Deck * Hardwood floors * Garage parking * Off-street parking * Dishwasher * 2 Story Family Room * Ceiling Fans * Clothes Dryer Included * Clothes Washer Included * Eat-in Kitchen * Family Room * Finished Basement * Fireplace * Garage * Hardwood Floors * Master Suite * Refrigerator Included * Walk-in Closet\n","num_images":4.0,"lat":39.9954,"lng":-75.1698,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T15:55:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-looking-for-studio\/7606080409.html","post_id":7606080409,"title":"Looking for a Studio?","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['0BR \/ 1Ba', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T15:14:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-the-right-place-for-you\/7606103176.html","post_id":7606103176,"title":"The right place for you! Beautiful 2 bed \/ 2 bath - prime location!","description":"Millview ApartmentsLocated at: 100 Cobblestone Dr Coatesville, PA 19320Featured unit: 2 bed | 2 bath | 1178 sq ft Prices start at: $1746\/month Call Today!  show contact info\nTHE BEST APARTMENTS IN COATESVILLE, PA\nIf you're looking for the best apartments in Chester County, look no further than Millview Apartment Homes. Our world-class amenities, including a resort-worthy swimming pool, sauna, and clubhouse are better than any in the Coatesville area. Our professional leasing staff is eager to welcome you home to a carefree lifestyle. Please schedule a tour and come home to the best Coatesville, PA apartments.Wonderful Amenities!● Business Center● On-Site Leasing Office● Pet-Friendly● Private Garages In Select Units● 24-Hour Emergency Maintenance● Coffee Bar Clubhouse Kitchen● Resident Referral BonusesApartment Features!● Built-In Microwave● Central Heat & Air Conditioning● Disability Access In Select Units● Dishwasher● Full-Size Washer & Dryer In Every Apartment● Mini Blinds On All Windows● Refrigerator\/Freezer With Ice Maker● Walk-In Closets  show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available jun 20', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T16:13:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-great-place-to-kick-back\/7606102131.html","post_id":7606102131,"title":"A great place to kick back and relax! Beautiful floor plans!!","description":"Millview ApartmentsRENT: $1713 - $2280 \/ MONTH SIZE: 1178 sq ft  BEDROOMS: 2 BATHROOMS: 2 LEASE TERMS: Variable show contact info\nUNIT FEATURES:   ➢ Built-In Microwave➢ Central Heat & Air Conditioning➢ Disability Access In Select Units➢ Dishwasher➢ Full-Size Washer & Dryer In Every Apartment➢ Mini Blinds On All Windows➢ Refrigerator\/Freezer With Ice Maker➢ Walk-In ClosetsMillview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.PROPERTY FEATURES: ➢ Business Center➢ On-Site Leasing Office➢ Pet-Friendly➢ Private Garages In Select Units➢ 24-Hour Emergency Maintenance➢ Coffee Bar Clubhouse Kitchen➢ Resident Referral Bonuses PET POLICY: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.VISIT OR CALL US TODAY!  100 Cobblestone DrCoatesville, PA 19320 show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available may 13', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T16:11:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-immediate-occupancy-for\/7606095807.html","post_id":7606095807,"title":"Immediate Occupancy for this Small Dog Friendly Townhome in Fireside","description":"2400 sqft 2 bedroom 1 bath house built in 2022. a quality-built home with nice original woodwork and finishing touches. 2 levels of living space. large brick living room fireplace. vaulted living room ceiling. also, separate chimney flue with first floor woodstove. living room and bedroom sky lights. All rooms have separate zoned baseboard heat. house has no water issues and basement is dry. foundation plumbing electric and deck are all in good condition. granite counter tops with new appliances. best amenities filled community in the Poconos, which has two ski lanes, indoor and outdoor pools, indoor and outdoor tennis courts, lakes, playground, fitness center, restaurant, clubhouse, kayaking, canoeing and other year-round activities. all is about one mile from house. Home is fairly priced compared to similar homes in the same community. Look at the rest when comparing this home at this price listed.","num_images":4.0,"lat":39.9954,"lng":-75.1698,"attrs":"['2BR \/ 1Ba', '2400ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T15:55:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-stunning-bedroom-bath-home-for\/7606101571.html","post_id":7606101571,"title":"Stunning 4 Bedroom 2 1\/2 Bath Home For Rent!  Must See!","description":"Brand NEW Never Lived in Luxury 2 Story Single Family home For Lease. This home is a stunner w\/ over $78,650 in Enhancements, Upgrades & Options! The Burlington by Cornerstone Premier Homes is a Craftsman Design featuring exceptional architectural exterior appointments which includes a covered front entry, peaked roof lines, multiple elevation textures & finishes - culture stone, water shelves, horizonal board & batten & cedar impression siding styles that combine to be eye catching & strikingly attractive! The Burlington floor plan layout provides for today sophisticated, leasee offers all of the at-home living areas & amenities like - 1st floor Flex Rm, Great\/Family Rm for the household to gather appointed w\/ gas fireplace to cozy up on those cold winter nights, Gourmet Island Kitchen & breakfast bar for meals on the go, Dining\/Breakfast Rm, Butler’s Pantry, walk-in pantry closet, Pocket Office Nerve Center Enhancement, super convenience of a 2nd floor Laundry Rm, Primary Suite is a sweet get-a-way from the hustle & bustle of the household activities, Entry Hall opens to a tray volume ceiling Primary BR that incorporates a cathedral ceiling Flex Rm as a Den, Sitting, Exercise Rm or Studio, duel WIC’s, private Bath is CT w\/ a double bowel vanity & volume ceiling, 3 additional BedRms & Hall CT Bath. Energy efficient propane gas heat & central AC provides w\/ year around climate control comfort living. Two-car side entry Carriage House style Garage w\/ seamless entry & the luxury & convenience of auto-garage door openers. Cornerstone Premier Home’s Millwork Package & Trademark Amenities offers 2-piece crown, chair rail, in selected areas, oversized baseboards, cased windows & openings a custom millwork package that includes, oak stairs cases w\/ oak newel posts & hand railings, shaker two panel interior doors, Century’s Carriage House custom Kitchen, Butler’s Pantry & Bath cabinetry & enriched oak planked hardwood flooring throughout the 1st floor & 2nd floor Hallway. CT baths, satin nickel hardware & faucet sets. Simonton windows - energy efficient, durable, insulated integrated grilled glass, maintenance free & tilt in for easy upkeep. Nestled on approximately ½ an acre & offering an outdoor oasis in a parklike scenic setting & secluded yard areas for outdoor entertainment, playtime, barbeque or just to kick-up & relax! Walnut Knoll is nearby to Lansdale & Ambler’s downtown districts, shopping centers, malls, schools, major highway networks, R-5 train to Philadelphia & Doylestown, & the quaint Villages of Skippack & Lederach. This home is not expected to last, so inquire now before it’s gone! GPS address: 1109 Vilsmeier Road, Lansdale, Pa. Act now before it’s too late! Tenant requirements: 2 YEAR Lease Min, 1st month’s, Last month’s and a month of rent as Security get you in the door, NO PETS, NO SMOKING, Tenant also responsible for all utilities, lawn and snow removal.","num_images":16.0,"lat":40.2378,"lng":-75.2955,"attrs":"['4BR \/ 2.5Ba', '2740ft2', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T16:10:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-two-bedroom-two-bathroom\/7606100799.html","post_id":7606100799,"title":"Two Bedroom, Two Bathroom Available- Come Find Your Home at Millview!","description":"Millview Apartments - A place to call home! Bed: 2 \/ Bath: 2  Sq. Footage: 1088 sq ft Rent: $1710 - $2337\/MonthTerms: Variable show contact info\nComplete with a resort style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Our Apartment Homes Feature:   ➢ Built-In Microwave➢ Central Heat & Air Conditioning➢ Disability Access In Select Units➢ Dishwasher➢ Full-Size Washer & Dryer In Every Apartment➢ Mini Blinds On All Windows➢ Refrigerator\/Freezer With Ice Maker➢ Walk-In Closets Our Residents Enjoy:  ➢ Business Center➢ On-Site Leasing Office➢ Pet-Friendly➢ Private Garages In Select Units➢ 24-Hour Emergency Maintenance➢ Coffee Bar Clubhouse Kitchen➢ Resident Referral BonusesContact Info: show contact info\n100 Cobblestone Dr Coatesville, PA 19320 Website: https:\/\/www.apartmentsincoatesvillepa.com\/Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'available may 6', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T16:08:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apartment-for-rent\/7606097284.html","post_id":7606097284,"title":"Apartment for rent","description":"Junior one bedroom apartment. Rent include utilities and use of all amenities.  Indoor and outdoor pool and state of the art gym. Renovated kitchen. Balcony with great Art Museum view. Garage and bike storage for additional fee.\nApartment can be rented furnished if needed.\n","num_images":1.0,"lat":39.965905,"lng":-75.178031,"attrs":"['1BR \/ 1Ba', '670ft2', 'available jun 15', 'air conditioning', 'application fee details: Credit check.', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T15:59:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-single-home-for-the-price-of\/7606089159.html","post_id":7606089159,"title":"A single home for the price of a condo!! No association fees and LOW t","description":"A single home for the price of a condo!! No association fees and LOW taxes!! This adorable one bedroom, one bath home is located in the desirable Plymouth Township and has plenty of space to expand! The first floor features hardwood flooring throughout the living room and bedroom.","num_images":12.0,"lat":40.107008,"lng":-75.313626,"attrs":"['1BR \/ 1Ba', '594ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T15:36:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-perfect-location-leasing-now\/7606079996.html","post_id":7606079996,"title":"Perfect Location, Leasing Now","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1.5Ba', '1050ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T15:12:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-house-rent\/7606095838.html","post_id":7606095838,"title":"1 Bed 1 Bath house Rent!!","description":"Turnkey Commercial building approximately 5000 sf building\nNumerous contiguous vacant commercial parcels.\nSizable paved truck parking lot for 25 plus vehicles and easy dual access off fifth Ave or fourth Ave Lower level 2500 sf with a drive in garage with work areas and his and her rest rooms. Lower level also has a large handicap restroom, separate ground floor walk out\/entry, large office\/conference room, 1 additional storage rooms, Furnace and utility room.\nUpper level has 2500 sf professional \/ Office space. 7-8 Individual offices. Large Receptionist area. Small kitchen area and 1 large rest room dual entrances complete upper level.\nAdditionally Property has 25+- parking spaces in rear which could be expanded on vacant contiguous parcels landlord owns currently grass lawn. Easy access to and from the building. Close to all major highways, Rt 295, Rt 42 and NJ Turnpike. Great location with many commercial possibilities. Landlord pays all real estate taxes Tenant pays everything else\n","num_images":3.0,"lat":39.9954,"lng":-75.1698,"attrs":"['1BR \/ 1Ba', '2500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T15:55:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fishtown-house-for-rent\/7606089691.html","post_id":7606089691,"title":"Fishtown House for rent","description":"Lovely 2 bedroom house for rent on the best street in fishtown large yard close to all activities, public transportation, quiet, available June 1st. On street parking. Small pet ok!\nIf you really like it and interested to rent please reply with your number.\nThanks\n","num_images":3.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T15:38:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedrooms-in\/7606092761.html","post_id":7606092761,"title":"Two Bedrooms in Philadelphia! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N American St Suite 101\nPhiladelphia Pa 19122\nBedrooms:2\nBathrooms:2\nSquare Footage:1088-1261 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 2BR floor-plans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":10.0,"lat":39.971179,"lng":-75.140092,"attrs":"['2BR \/ 2Ba', '1128ft2', 'available now', '\\nsunday 2023-04-02\\n', '\\nmonday 2023-04-03\\n', '\\ntuesday 2023-04-04\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T15:46:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-spacious-bedroom-bath-twin\/7606092656.html","post_id":7606092656,"title":"Spacious 2 Bedroom 2 Bath Twin!","description":"Spacious two bedroom, two bathroom apartment in the heart of Lansdale. This is a first and second floor apartment that boasts new flooring, large living room, dining room, eat-in kitchen, covered front porch, and on-site laundry. Rent includes water, sewer, and trash. Tenant pays for gas, electric, and internet services. Applicants must have satisfactory credit and solid work history. Security deposit and last month required. Available immediately. This is a smoke free building and pets are not permitted. Great location within North Penn School District and within walking distance of SEPTA regional rail, bus lines, and all that downtown Lansdale has to offer.","num_images":11.0,"lat":40.2378,"lng":-75.2955,"attrs":"['2BR \/ 2Ba', '1600ft2', 'available may 1', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T15:46:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-make-yourself-at-home-at-green\/7606080135.html","post_id":7606080135,"title":"Make Yourself at Home at Green Forest Apartments","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.867294,"lng":-75.366091,"attrs":"['2BR \/ 1Ba', '850ft2', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T15:13:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/oreland-very-nice-bedroom-bath-apt-with\/7606088627.html","post_id":7606088627,"title":"Very Nice 2 Bedroom 1 Bath Apt with Central AC!","description":"Welcome to this lovely unit of 980 sq ft. in Oreland that you will want to call home. Such a welcoming and cozy feeling You arrive to a well taken care of apartment that has hardwood floors throughout the space. They shine because they have just been refinished.. Large windows that allow all the sunlight in. Newly fresh kitchen with gas cooking a large refrigerator. Remodeled bathroom that is all white and feels like a spa. Two spacious bedrooms perfect for 2 people. Large closets for plenty of storage. The landlord has made sure that all the comforts of a home has not been missed. You have your own washer and dryer in the lower level for each unit along with extra storage area for you to put your extra holiday decor, or the need for more storage. You will want to call this place home . This unit is a show stopper with great shopping and transportation near by great little restaurants. It is a must see!","num_images":9.0,"lat":40.1132,"lng":-75.1869,"attrs":"['2BR \/ 1Ba', '980ft2', 'available may 1', 'air conditioning', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T15:35:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-no-smoking-studio\/7606076768.html","post_id":7606076768,"title":"@@@ No Smoking Studio Apartment & utilities included","description":"Studio Apartment 1bathroom all utilities included. Independent entry, off street parking. Fully furnished. No animals no smoking. One months deposit required.","num_images":9.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '950ft2', 'available now', 'air conditioning', 'furnished', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T15:04:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedrooms-in\/7606080761.html","post_id":7606080761,"title":"One Bedrooms in Philadelphia! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:760-800 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":10.0,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '767ft2', 'available now', '\\nsunday 2023-04-02\\n', '\\nmonday 2023-04-03\\n', '\\ntuesday 2023-04-04\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T15:15:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-professionally-managed\/7606070948.html","post_id":7606070948,"title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nWhen you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1217ft2', 'available apr 9', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T14:49:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-bedroom-full-bathroom\/7606059547.html","post_id":7606059547,"title":"New 2-bedroom, 2 full bathroom condo with open-concept kitchen and liv","description":"New 2-bedroom, 2 full bathroom condo with open-concept kitchen and living room. Brand-new, stainless-steel appliances in the kitchen. Washer and dryer included. Wet-bar and private roof deck with grill that overlooks the Delaware River. Just outside of Northern Liberties and walking distance to major public transit lines. If you are really interested please send me Text :::  show contact info","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T14:19:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studios-in-philadelphia\/7606069216.html","post_id":7606069216,"title":"Studios in Philadelphia! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":4.0,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', '\\nsunday 2023-04-02\\n', '\\nmonday 2023-04-03\\n', '\\ntuesday 2023-04-04\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-02T14:44:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-recently-updated-2bd\/7606042945.html","post_id":7606042945,"title":"Recently updated 2BD\/1.5BTH House for rent","description":"First time offered. Freshly painted bright and airy 2 bedroom 1 1\/2 bath carriage house in a private yet convenient location. Island kitchen with brand new appliances . Living room and kitchen with doors to the yard and covered patio. This home is a short stroll to shopping such as The Market at Lafayette Hill and several restaurants. Situated on an acre lot with plenty of parking. Landlord will be responsible for lawn cutting and plowing snow in driveway. The utilities between the front house 648 and the rear house 642 will be adjusted between the two tenants 2\/3 648 and 1\/3 642.","num_images":9.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 1.5Ba', 'air conditioning', 'house', 'w\/d in unit', 'carport', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T13:34:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-great-bedroom-available\/7606058423.html","post_id":7606058423,"title":"Great 1 Bedroom Available","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.869776,"lng":-75.367933,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T14:16:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-gorgeous-bedroom-available-today\/7606057576.html","post_id":7606057576,"title":"Gorgeous 1 Bedroom Available Today","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.869818,"lng":-75.36789,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T14:14:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-need-1-bedroom-come-to\/7606058119.html","post_id":7606058119,"title":"Need a 1 Bedroom? Come to Wallingford Estates Apartments TODAY!","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.869785,"lng":-75.367869,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T14:16:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-available-now-beautiful-bedroom\/7606057857.html","post_id":7606057857,"title":"Available Now – Beautiful 1 Bedroom \/ 1 Bathroom","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.869752,"lng":-75.367901,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T14:15:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-beautiful-bedroom\/7606057324.html","post_id":7606057324,"title":"Beautiful 1 Bedroom","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St E213, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":0.0,"lat":39.869785,"lng":-75.367858,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T14:13:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-incredible-amenities\/7606055738.html","post_id":7606055738,"title":"Incredible Amenities, Stylish Features, Lease Today","description":"Lease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nCommunity Features\n* Bark Park\n* Professionally Managed\n* Outdoor Grill Area\n* Yoga Lounge\n* Sun Deck\n* TV Lounge\n* Bocce Ball\n* Fitness Studio\n* Easy Freeway Access\n* Pet Salon\n* Community Lounge\n* Swimming Pool\n* Putting Green\n* Minutes from Restaurants, Shopping, and Much More","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-02T14:09:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-stainless-steel-appliances\/7606060608.html","post_id":7606060608,"title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\n[#9638865]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-02T14:22:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-putting-green-pet-spa\/7606057676.html","post_id":7606057676,"title":"Putting Green , Pet Spa, Clubhouse with Game Room","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nHome is where the heart is, and here at The Point at Glen Mills, it's never been easier to love where you live. Contact us today to schedule your tour. You'll be glad you did!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with granite countertops, stainless steel appliances and a breakfast bar. this unit also features a large entry closet, full sized washer\/dryer, linen closets, and a private balcony. The bedrooms features walk-in closets, and ensuite bathrooms.\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1095ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-02T14:14:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-yoga-and-ballet-studio\/7606056548.html","post_id":7606056548,"title":"Yoga and Ballet Studio, Visit Your New Home, Leasing Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills offers all of the amenities your looking for and some you didn't even know you wanted. Check out our two-story clubhouse-complete with flat screen TVs, a 24-hour fitness center and a pool table. Enjoy our on-site yoga studio or our outdoor putting green. Visit us today!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Granite Countertops\n* Wood-Like Floors\n* Extra Storage\n* Full sized Washer and Dryer in unit\nCommunity Features\n* Putting Green\n* Bocce Ball\n* Fitness Studio\n* Yoga Lounge\n* Swimming Pool\n* Minutes from Restaurants, Shopping, and Much More\n* Bark Park\n* Pet Salon\n* Professionally Managed\n* Easy Freeway Access\n* Outdoor Grill Area\n* TV Lounge\n* Community Lounge\n* Sun Deck","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-02T14:11:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-call-for-details-clubhouse\/7606056062.html","post_id":7606056062,"title":"Call for Details, Clubhouse with Game Room, Visit Your New Home","description":"Prepare to fall in love with The Point at Glen Mills! Kick back in our community lounge. Watch your furry friend frolic with his furry friends in our dog park. Challenge your friends to a game of golf on our outdoor putting green. Life is good at The Point at Glen Mills. Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Extra Storage\n* Full sized Washer and Dryer in unit\n* Wood-Like Floors\n* Granite Countertops\n[#9638708]","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-02T14:10:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wilmington-this-newly-remodeled-home-is\/7606040619.html","post_id":7606040619,"title":"@@This newly remodeled home is completely move in ready","description":"This newly remodeled home is completely move in ready! Coming with 2 beds 1 full bath and plenty of space.  An open concept and plenty of natural lighting really makes this Rancher stand out.  Notable upgrades include; stainless steel appliances, new siding, new roof, new flooring throughout, new kitchen (cabinets, appliances & countertops), New bathrooms (tile, shower & cabinets, new windows, and new AC Unit. As if that wasn't enough, a large open back yard that is perfect for hosting your next event or your furry friends! Contact:  show contact info","num_images":4.0,"lat":39.7378,"lng":-75.5497,"attrs":"['2BR \/ 1Ba', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T13:28:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-parking-garage-modern\/7606055477.html","post_id":7606055477,"title":"Parking Garage, Modern Amenities, Incredible Features","description":"At The Point at Exton, you're exactly where you want to be in a place that brings out the best in life. Contact us today for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, walk-in closet, and a washer\/dryer!\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nApartment Features\n* Stainless Steel Appliances\n* Kitchen Island\n* Quartz Countertops\n* Granite Countertops\n* Wood-Like Floors\n* Garden Tub\n* Washer and Dryer in unit","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '732ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-02T14:09:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-salt-water-pool-with\/7606055435.html","post_id":7606055435,"title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nYou will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-02T14:09:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-laundry-in-unit-lease\/7606054956.html","post_id":7606054956,"title":"Laundry in Unit, Lease Today, Convenient Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nLooking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-02T14:07:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-simply-stunning\/7606043424.html","post_id":7606043424,"title":"Available 4\/10 - Simply Stunning East Falls Studio ✨","description":"Rent: $1299 per month\nType: Apartment\nBedrooms: Studio\nBathrooms: 1 full\nSpace: 516 sq. ft.\nDeposit: $1299\nAvailable: April 10th\nCentral Heat & Air Conditioning\nIn Unit Washer \/ Dryer In Select Units\nOpen Concept Kitchens With Designer Appliance Package & Custom Quartz Counter Tops\nOver Sized Windows Offer Breathtaking Views From The Highest Point In East Falls\nSpa Inspired Bathrooms With Soaking Tubs Or Invigorating Showers\nStylish Loft Aesthetic With Historic Accents\nWalk In Closets\nWide Plank Floors Throughout Each Apartment Home\n","num_images":5.0,"lat":40.014,"lng":-75.187,"attrs":"['0BR \/ 1Ba', 'available apr 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-02T13:35:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bd-rm-efficiency\/7606044454.html","post_id":7606044454,"title":"1 bd rm efficiency","description":"1st flr 1bedroom efficiency\nPrivate ent. Private bathroom& kitc\nAll utilities included (elec,water,heat)\n$800 month rent $1600 deposit $2400 move in\nPaper paystubs req.\nSean  show contact info","num_images":11.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'available may 1', 'apartment', 'no laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2023-04-02T13:38:45-0400"}]