[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-memphis-st-massive-beds\/7480935486.html","post_id":7480935486,"result_date":"2022-05-07 22:58","title":"Memphis St,, Massive 3 beds 2 baths home available rent to own","description":"See life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in your gated community, from the inviting swimming pool to the inspiring fitness center. Take a peek at our photo gallery to see more of what’s waiting for you.\nR-E_NT___2___0W+N BAD CREDIT IS NO PROBLEAM\nCALL US AT； show contact info\nPR0PERTY ID‒347569812\n","num_images":1.0,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 2Ba', '1144ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T22:54:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-waterfront\/7480927263.html","post_id":7480927263,"result_date":"2022-05-07 22:54","title":"Welcome to Waterfront Square.","description":"Welcome to Waterfront Square, a resort like condo community located right on the Delaware River! Waterfront Square has arguably some of the best amenities in the city, from: valet parking, a giant sun deck right on the river, an indoor\/outdoor pool with hot tub, a fitness center that rivals some of the private clubs in the city, 24\/7 security, and a shuttle service that runs through Center City. This 1 bedroom 1 bath unit in the Peninsula building has beautiful hardwood flooring, and open concept floor plan, a modern\/spacious kitchen, views of the Delaware River, an in-unit washer & dryer, a large bedroom with great closet space, and tons of natural light. Waterfront Square has an awesome location with full access to the waterfront, Northern Liberties, & public transportation. It's also conveniently located near the Ben Franklin bridge and major roadways making all commutes that much easier. 1-car parking","num_images":7.0,"lat":39.961714,"lng":-75.136093,"attrs":"['1BR \/ 1Ba', '828ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T22:11:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/new-hope-cozy-garden-condo\/7480926018.html","post_id":7480926018,"result_date":"2022-05-07 22:40","title":"Cozy Garden Condo.","description":"Cozy Garden Condo. This community is situated high on the hill above the Historic Town of New Hope and Delaware River. Enter this one bedroom home through your own private courtyard, surrounded by privacy fence, gate and flower beds filled with perennial plants and flowers, a perfect spot to hang out with your summer morning coffee. This first floor garden condo has an open floorplan concept where the living room, kitchen and dining area flows together. The spacious living room is painted in warm colors with a small step up into kitchen area, offering a large oversized countertop, perfect for the Chef in the family to try that new recipe while your guests seated in the bar stools can rate your new culinary creations. There is room for a small dining table in the kitchen area, but some prefer the use of dining room, living room combination instead. The bedroom has a wall of closets and large windows overlooking the woods and your private garden room. The garden room was recently weather proofed with a new ceiling, a great spot for an evening barbecue or a lazy afternoon, maybe with your latest read or simply watching the local wildlife. The community offers resort style pools and amenities and is within walking distance to New Hope, Lambertville and the Delaware River, no need to find a parking spot. The area offers so many fabulous Restaurants, shops as well as theatre and music, the area has for a long time been home to many respected artists and writers as well as many other renowned artists, you will see why once you start to explore the area. This is a great home. if you commute the buses will take you right into Manhattan, you are never far from all the major Northeast roadways to get you either south towards Philadelphia (50 min) or North towards Manhattan (90 min) and Boston.","num_images":7.0,"lat":40.3556,"lng":-74.9839,"attrs":"['1BR \/ 1Ba', '654ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T22:05:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-3br-house-in\/7480912783.html","post_id":7480912783,"result_date":"2022-05-07 22:37","title":"Charming 3BR House in Fabulous Location! Utilities included!","description":"**PLEASE NOTE: Rent is $650\/week. House is only available 5\/15 - 6\/28. This is for the full house only.**\nOur historic 3 bedroom home is on a gorgeous block just next to the famous Italian Market. A quick stroll to happening E. Passyunk Ave, and not too far from the shopping of Rittenhouse and culture & history of Old City, it's a perfect base to explore Philly! Nearly any university is very easily accessible from the location.\nWe love that we're directly (literally!) across the street from a family friendly park, and that we're surrounded by some of the best pizza in the city. There's good coffee everywhere, a dog park a few blocks away, and many of the best restaurants in the city - Italian, Thai, Vietnamese...and lots more!\nWe're a ten minute walk from the subway and right on multiple bus lines. This is also a perfect place if you're a walker or biker! Street parking in the neighborhood isn't bad either. Our street is clean, quiet, and very friendly.\nOne thing we love about our home is its openness compared to other homes of the same era + the whole place gets wonderful natural light. The first floor features a fully equipped kitchen open to the living room as well as a small back patio - perfect for a morning coffee. The second floor has the full bathroom, an office, a baby's room (crib and full bed) that can easily be temporarily converted to another space, a roof deck, and a hidden reading nook!\nThe third floor has another two rooms - the master bedroom (queen bed) and a guest room\/office. We have amazing views of City Hall & the Philly skyline, and a home theater, complete with surround sound!\nWe have a partially finished basement with a half-bath. It's got a washer and dryer and good storage.\n","num_images":7.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1.5Ba', '1550ft2', 'available may 15', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'street parking', 'rent period: weekly']","posted_date":"2022-05-07T21:04:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cool-old-funky-house-for\/7480927873.html","post_id":7480927873,"result_date":"2022-05-07 22:18","title":"Cool, Old, Funky house for rent","description":"I'm purchasing this old home to preserve history. It's a 3000sq.ft. Gothic Victorian Home in fair condition. It has a lot of character, to say the least. Large side yard. 5 bedrooms, etc. It's livable. New heater. I want someone, (persons) that will maintain, care, and possibly fix up for a better quality of life in exchange for cheap rent? This is awesome property for the right couple or family that wants their own space. You would be responsible for all utilities. Rent would be based on commitment and abilities. I need a minimum of $1500 per month. Only citizens of the community, decency, need apply. Best, TIM","num_images":5.0,"lat":40.033413,"lng":-75.161377,"attrs":"['5BR \/ 2.5Ba', '3000ft2', 'available jun 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'house', 'laundry in bldg', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-07T22:14:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-home-available-for-rent\/7480923000.html","post_id":7480923000,"result_date":"2022-05-07 21:54","title":"New Home Available for Rent","description":"This house is fully renovated and available for rent. Hardwood floor throughout the house. The new kitchen features granite countertops and appliances (stove\/oven, dishwasher, microwave, garbage disposal, & refrigerator). This house also offers ceiling fans, A\/C & heating unit, 3 bedrooms, their closets, 2 full bathrooms (one inside master bedroom), a washer\/dryer in the basement, a deck on 2nd floor, and a 1 car garage. It is located near all shops on Aramingo, dining\/shopping in center city, transportation, 95, and local colleges. If interested in renting, schedule your viewing today!","num_images":13.0,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 2Ba', 'available now', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T21:50:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-prsitine-gliittering-bed\/7480893520.html","post_id":7480893520,"result_date":"2022-05-07 21:33","title":"PRSITINE GLIITTERING 2 BED ON 2709 W Jefferson St #1,","description":"Welcome to 2709 W. Jefferson Street, Unit 1! One hundred (100) feet away from the largest green space in Brewerytown, a five (5) acre park and playground at historic Jefferson Ballfields. Enter to an open foyer with wood floors ample natural light. The perfect place to hang a coat, store shoes, or leave an umbrella. Ahead find a powder room perfect for washing hands and the convenience of guests and residents off the spacious, kitchen and oversized living area perfect for entertaining, relaxation, or WFH. Descend to the bedroom level where split-bedrooms each offer their own full bathroom with laundry off the central hall. Ten year property tax abatement. Under construction and still time to customize. A short walk to rapidly redeveloping Girard Avenue and convenient to Fairmount Park driving range and disc golf course.","num_images":5.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', '1550ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'condo', 'laundry in bldg', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-07T19:53:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/plymouth-meeting-experience-ultimate\/7480889823.html","post_id":7480889823,"result_date":"2022-05-07 21:25","title":"Experience ultimate luxury in Blue Bell's most sought after condo","description":"Experience ultimate luxury in Blue Bell's most sought after condominium community! \"Resort Style Living!\" This boutique style condo is complete with hardwood flooring, recessed lighting and professionally painted. The condo features a well appointed master suite , complete with a walk-in closet and entrance to the neutral mint condition bathroom, this condo also features a separate den area, which is the perfect place for a home office or guest bedroom. The Kitchen is complete with beautiful wood cabinetry, slate back splash, breakfast bar with pendant lighting, the dining area is located off the kitchen allowing the perfect flow for entertaining. The spacious living room features, plenty of living space,plush carpets, and sliders that exit to the quaint patio. All you have to do is more in, this home is for those for expect nothing but the BEST! Amenities include salt water pool, tennis courts, fitness center, just to name a few.. Enjoy this unit in time for Spring!","num_images":15.0,"lat":40.128927,"lng":-75.263731,"attrs":"['1BR \/ 1Ba', '935ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T19:40:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/plymouth-meeting-welcome-home-to-this\/7480887371.html","post_id":7480887371,"result_date":"2022-05-07 21:18","title":"Welcome home to this great condo located in the lovely community","description":"Welcome home to this great condo located in the lovely community of Oxford of Blue Bell. The community offer lots of green open space, pool, playground, tennis and basket ball courts, dog park, fitness center, club house and walking path. This 2nd floor condo offers ceramic tile entrance, large living area with sliders to cozy balcony. Den off of living room that could be used for an office, play room or additional bedroom space. Kitchen features ceramic tile floor and maple cabinets and is open to dining area. The main bedroom is super spacious and has large walk in closet. Main bath has been attractively updated with ceramic tile floor, new vanity and walk in shower with beautifully accented tile work. This condo has large and convenient closet for storage as well as storage area on balcony. Also includes washer and dryer. This home is clean and bright. Move in ready for you to simply start enjoying summer.","num_images":16.0,"lat":40.12899,"lng":-75.263825,"attrs":"['1BR \/ 1Ba', '935ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T19:32:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-furnished-room-for\/7480910823.html","post_id":7480910823,"result_date":"2022-05-07 21:00","title":"Fully furnished room for the summer","description":"Fully furnished room is available from now to the end of July. If you’re a girl and looking for a room for the summer, this is the perfect place for you! $585\/month, 4 bed 2 bath with a big backyard! 8-10 minute's walk to Temple University main campus. Text to  show contact info\nfor more details!","num_images":12.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'flooring: wood', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-05-07T20:56:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wyncote-apartment-for-rent-in-glenside\/7480877103.html","post_id":7480877103,"result_date":"2022-05-07 19:31","title":"Apartment for rent in Glenside","description":"Beautiful en suite studio apartment for rent just half a mile from Septa Regional Rail! Apartment rent includes such amenities as: driveway parking, private entrance, personal kitchen\/bathroom area, and laundry usage. Internet\/Utilities included!\nBe downtown in minutes!\n","num_images":0.0,"lat":40.1039,"lng":-75.1502,"attrs":"['1BR \/ 1Ba', '600ft2', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: carpet', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-07T18:59:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-graduate-hospital-studio\/7480882349.html","post_id":7480882349,"result_date":"2022-05-07 19:19","title":"Graduate Hospital Studio For Rent","description":"Welcome to Graduate Hospital! This move-in-ready first-floor studio unit has an open layout with beautiful hardwood floors throughout and is drenched with light from the large oversized windows. The kitchen gives the unit an updated look with the classic cabinets, granite countertops, and stainless steel appliances. There is a common laundry in the basement. The building is pet friendly. This unit is perfect for a starter apartment, graduate student, or to be used as a pied-a-terre.","num_images":10.0,"lat":39.94127,"lng":-75.176236,"attrs":"['0BR \/ 1Ba', '300ft2', 'available jun 2', 'air conditioning', 'application fee details: $30', 'flooring: wood', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-05-07T19:15:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-lovely-bedroom-bath-2nd-floor\/7480856301.html","post_id":7480856301,"result_date":"2022-05-07 18:00","title":"Lovely 1 Bedroom , 1 Bath 2nd Floor Apartment","description":"This is a extremely cozy, freshly painted, renovated one-bedroom Main Line apartment on the Second floor, on a very quiet street (N. Essex Ave.) in the village of Narberth. Rent includes domestic water, hot water and heat. Tenants pay for electricity, CATV and high-speed internet. A public laundry room (for tenant use only) with a coin-operated high efficiency washer and coin-operated high-efficiency dryer. unit has hardwood flooring throughout and comfortable hot water radiant heat. This apartment has a new kitchen and granite top. Narberth is in the Lower Merion School District, which was voted one of America's 100 Best Communities for Young People. Visit Narberth Borough's website for exciting events that take place year-round! The walk to the train station in the center of town takes approximately 10-15 minutes, making it perfect for individuals who work or go to school in the city and surrounding suburbs. You can also drive to the train and park your car for a very reasonable monthly fee. There is also a great downtown area to shop and eat. Lovely 2nd floor 1 bedroom unit, Enter into a Hardwood Dining room (11'x9') which adjoins a Hardwood Living room (12'x13') with built in hall closet., kitchen recently upgraded, with new Hardwood\/Ceramic tile floor , new cabinets and Granite Counter Top (11'x4'). full bath (8x11) with claw tub\/shower, bedroom 11' x 11') with closet. Walking distance to shopping, transportation and entertainment. Common area front porch as well as large back yard area for entertaining.","num_images":13.0,"lat":40.010836,"lng":-75.264738,"attrs":"['1BR \/ 1Ba', '500ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-07T17:56:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-2nd-fl-front-bed\/7480855368.html","post_id":7480855368,"result_date":"2022-05-07 17:58","title":"Modern 2nd Fl Front 2 Bed University City Apt w\/H\/W fls, C\/A, and more","description":"Modern 2nd Fl. Front 2 Bedroom, 1 Bath University City Apartment with H\/W Fls, Central Air, and so much more. Walk into a nice-sized living room\/dining room\/kitchen combo with hardwood floors; stainless steel refrigerator, electric range, microwave are included in the kitchen; good amount of cabinet and countertop space with beautiful ceramic tile backsplash! Gorgeous 3-piece ceramic tile bathroom and two nice-sized bedrooms with hardwood floors and closets! Central Air and Hot Air Heat! This is a BEAUTIFUL apartment. Lots of windows and nice natural light! Several large windows. Tenant pays electric, flat amount towards cold water\/sewer per month and cable\/internet. Cats and small quiet dogs (less than 25 lbs.) are OK with a one-time non-refundable pet fee. First, last, and security deposit required at lease signing. 1 year lease. Applicant must first fill out an application with two recent pay stubs\/some income verification, copy of photo ID, and non-refundable $75 application fee. Tenant is subject to credit check, criminal and eviction check. Available July 1, 2022! Sorry no laundry. No smoking. If approved, you will be charged a document preparation fee of $100.00. THIS FEE IS NON-REFUNDABLE. Each resident over the age of 18 must submit a separate rental application. For showings, please call\/text Mike Giordano at  show contact info\n!","num_images":14.0,"lat":39.967033,"lng":-75.20859,"attrs":"['2BR \/ 1Ba', '700ft2', 'available jul 1', 'air conditioning', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $100', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'no laundry on site', 'listed by: Mike Giordano, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-05-07T17:54:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-lease-today-close-to-shops\/7480855141.html","post_id":7480855141,"result_date":"2022-05-07 17:57","title":"Lease Today, Close to Shops and Dining, Laundry in Unit","description":"VIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nThe Point at Plymouth Meeting offers open floor plans, clean white cabinetry, and sleek kitchens that immerse you in style, while sunny dining areas, wall-to-wall carpeting, and private patios will lull you into the easy life. Visit us today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, entry closet, washer\/dryer, walk-in closet, and a private patio\/balcony!\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nCommunity Features\n* Bark Park\n* Renters Insurance is Required\n* Outdoor Grill Area\n* Community Kitchen\n* Sun Deck\n* Bike Racks\n* Professionally Managed\n* Swimming Pool\n* Short or Long Term Lease Available\n* Minutes from Restaurants, Shopping, and Much More\n* Community Lounge\n* Non Smoking Community\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* After-Hours Emergency Maintenance\n* Extra Storage\n* Car Wash Area\n* WiFi Access\n* E-Lounge\n* Easy Freeway Access\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Liability Insurance is Required\n* Credit Cards Accepted\n* Smoke Free Community\n* Package Acceptance","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['1BR \/ 1Ba', '769ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking']","posted_date":"2022-05-07T17:53:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-perfect-location-fenced-dog\/7480854403.html","post_id":7480854403,"result_date":"2022-05-07 17:55","title":"Perfect Location, Fenced Dog Park, Fitness Center","description":"VIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nLease today at The Point at Plymouth Meeting in Norristown, PA. Our community has a resort-style swimming pool, an outdoor lounge, and a newly renovated clubhouse. Contact us for more information!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, entry closet, washer\/dryer, walk-in closet, and a private patio\/balcony!","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['1BR \/ 1Ba', '769ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking']","posted_date":"2022-05-07T17:51:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-2nd-fl-bed-passyunk\/7480848903.html","post_id":7480848903,"result_date":"2022-05-07 17:40","title":"Modern 2nd Fl. 1 Bed. Passyunk Square Apt. w\/W\/D, C\/A, H\/W Fls & more!","description":"Located right in the heart of Passyunk Square, directly located on the beautiful E. Passyunk Ave. Dining and Shopping Corridor is this beautiful 2nd Fl. 1 Bedroom, 1 Bath Apt.! All Modern! W\/D! H\/W floors! Full Kitchen with bar - WOW! Stainless Steel electric range, refrigerator, and dishwasher! Walk into a modern living room\/kitchen combo with hardwood floors and beautiful bar with hanging overhead lights. Full kitchen with amble amount of cabinets and counter top space. You won't find another kitchen and living room like this! A nice-sized bedroom with two closets - one is a walk-in with skylight. There is a modern 3-piece ceramic tile bathroom with tiled shower! Mix of hardwood floor and tile throughout. Tenant pays gas, electric, and cable\/internet. Cold water\/sewer is included. Pets are ok...please advise on type of pet before showing. Cats and Small dogs under 25 lbs. only. One time non-refundable pet fee required. Tons of natural light and windows. Large corner property! Central Air and Heat! Available June 1, 2022! 1st, last and security due at lease signing. One year lease minimum. $75 non refundable application fee with two paystubs\/some form of income verification and photo ID - we run a credit, criminal and eviction check. Contact Mike Giordano at  show contact info\n!","num_images":15.0,"lat":39.927945,"lng":-75.165736,"attrs":"['1BR \/ 1Ba', '1000ft2', 'available jun 1', 'air conditioning', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-05-07T17:36:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-apartment\/7480840770.html","post_id":7480840770,"result_date":"2022-05-07 17:19","title":"Apartment","description":"Newly renovated 2 bedroom apartment yard included brand new flooring and paint and updated appliances. Great area close to transportation and highway","num_images":7.0,"lat":39.817245,"lng":-75.385952,"attrs":"['2BR \/ 1Ba', 'application fee details: 20', 'flooring: tile', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-07T17:15:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/conshohocken\/7480569419.html","post_id":7480569419,"result_date":"2022-05-07 03:35","title":"76, 476","description":"This is a 3 bedroom, 2 bathroom house. The owners recently did a complete renovation to make this their forever home; however, their family expanded quickly and forced them to move. These renovations include creating a chiefs kitchen, 2 zone central air, solid hardwood floors, a gorgeous fireplace, and all new windows. This house also has parking for 2 cars! There is a great covered porch and patio with a decent size backyard.\nAdditionally, you would be a brief walk from downtown Conshohocken, Sutcliffe Park, and minutes from 76, 476, and 202.\nSewer, Trash, and Grass Cutting are included. All other utilities and snow removal are the tenant's responsibility. This property does not permit pets or smoking.\nThe owner pays for Sewage, Trash, and Grass Cutting. The renter is responsible for all other utilities and snow removal.\nLast month's rent is due at signing.","num_images":12.0,"lat":40.080138,"lng":-75.301453,"attrs":"['3BR \/ 2Ba', '1704ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T03:18:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-for-rent\/7480545149.html","post_id":7480545149,"result_date":"2022-05-07 00:42","title":"FOR RENT","description":"*  Brewerytown Court is a quiet condominium community located in the Brewerytown neighborhood. Gated Community with well maintained lawns and garden. *  Kelly Drive to run\/walk or watch the regattas is a 7 minute walk away. Supermarket is 2 minute walk away! Gym is 1 minute walk away. Great location\n*  Available to rent NOW (May 7th 2022 onwards)\n*  Condo is available to be seen now - Courtyard Unit!\n*  Please call Simbai at  show contact info\nto set up an appointment\nSOME DETAILS INCLUDE:\n*  Safe gated community\n*  3 bedrooms and 3 full bathrooms\n*  Master bedroom with ensuite bathroom and with double closets\n*  Open concept with dining and living area\n*  Deck overlooking the courtyard\n*  1-car garage (attached) and open parking space in driveway –\n*  Central air conditioning and heating (gas)\n*  Laundry with washer and dryer\n*  Wall-to-wall carpeting in bedrooms\n*  Upgraded kitchen with stainless steel appliances [gas range, microwave, dishwasher and refrigerator (with icemaker and water dispenser)]\n*  Pre-wired connections available for  cable and\/or TV\/internet\n*  Security  from ADT can be activated by renter\n*  Exterior construction: Vinyl siding\nREQUIREMENTS:\n*  $2250 monthly rent due on the 1st of every month\n*  Water, gas, electricity, cable\/internet and phone service are not included\n*  At least a 1-year commitment\n*  Security deposit of one month's rent\n*  No pets\n*  No smoking in the condo\n*  Renter's insurance\n*  Credit check\nLOCATION (all distances are approximate):\n*  Walking distance (less than 2 minutes) to grocery store, liquor store, gym, restaurants\n*  1.5 miles to Art Museum\n*  0.75 miles to Kelly Drive\/Boathouse Row\n*  0.75 miles to Schuykill Expressway\n*  0.7 miles to Philadelphia Zoo\n*  0.5 – 1.5 miles to fairmount park, lemon hill, golf range, tennis courts, public swimming pool\n*  SEPTA Public transportation (bus and trailor) is located 200 yards from the Condo\n*  Easy access to I-76, I-676, 30th street station","num_images":11.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'available now', 'air conditioning', 'flooring: wood', 'condo', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: yearly']","posted_date":"2022-05-06T23:35:54-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-poplar-dr-stunning-clean-and\/7480938478.html","post_id":7480938478,"result_date":"2022-05-07 23:16","title":"Poplar Dr, stunning clean And comfortable 3 BR house *\/rent to own","description":"See life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in your gated community, from the inviting swimming pool to the inspiring fitness center. Take a peek at our photo gallery to see more of what’s waiting for you.\nR-E_NT___2___0W+N BAD CREDIT IS NO PROBLEAM\nCALL NOW； show contact info\nPR0PERTY ID‒693845170\n","num_images":1.0,"lat":40.3351,"lng":-75.875,"attrs":"['3BR \/ 2.5Ba', '1520ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'attached garage']","posted_date":"2022-05-07T23:12:16-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/hoboken-prime-location-in-unit-amenities\/7480934436.html","post_id":7480934436,"result_date":"2022-05-07 23:15","title":"Prime location, in-unit amenities","description":"Prime location, in-unit amenities, and more with this spacious 747-square foot 1-bedroom unit in the highly desired uptown section of Hoboken! This natural-light filled beauty features a box layout with historic character and all desired (and recently updated) amenities in unit. With large windows, high ceilings, exposed brick, hardwood floors, central air and heat (new 2018), ceiling fans, in-unit washer\/dryer (new 2015), extra storage space in basement and updated kitchen equipped with stainless steel appliances and dishwasher (new 2019) and plenty of cabinet space, this unit is completely move-in ready.","num_images":10.0,"lat":40.753557,"lng":-74.027872,"attrs":"['1BR \/ 1Ba', '747ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T22:48:32-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-check-out-this-charming\/7480937601.html","post_id":7480937601,"result_date":"2022-05-07 23:10","title":"Check out this charming affordable Semi on a quiet street","description":"See life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in.\nCALL NOW； show contact info\n‬\n","num_images":1.0,"lat":40.0091,"lng":-76.3671,"attrs":"['2BR \/ 1Ba', '896ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'detached garage']","posted_date":"2022-05-07T23:06:43-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-fountain-ave-fantastic-4br\/7480936401.html","post_id":7480936401,"result_date":"2022-05-07 23:03","title":"Fountain Ave,, Fantastic 4BR 1BA 1,544 sqft home available rent to own","description":"See life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in your gated community, from the inviting swimming pool to the inspiring fitness center. Take a peek at our photo gallery to see more of what’s waiting for you.\nR-E_NT___2___0W+N BAD CREDIT IS NO PROBLEAM\nCALL NOW； show contact info\nPR0PERTY ID‒042561738\n","num_images":1.0,"lat":40.0766,"lng":-76.3107,"attrs":"['4BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'detached garage']","posted_date":"2022-05-07T22:59:46-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/rahway-bed-2bath-across-trains-station\/7480929052.html","post_id":7480929052,"result_date":"2022-05-07 22:24","title":"2 Bed 2Bath across trains station, with New York City views","description":"Fully renovated 2 bedroom 2 Bath apartment with New York City views from all the rooms. New kitchen appliances, new flooring, new cabinets. Commuters' delight! Across the street from Rahway train station Under 40 minutes to NYC or an hour to the Jersey Shore. Sunny, spacious unit with 9 feet ceiling. Washer & dryer in the unit. Doorman. Fitness center. Covered parking available for a nominal monthly fee.\nCredit report and employment verification required.","num_images":6.0,"lat":40.60576,"lng":-74.275728,"attrs":"['2BR \/ 2Ba', '1216ft2', 'available jun 1', 'flooring: wood', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T22:20:42-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/plainsboro-bedroom-bath\/7480927867.html","post_id":7480927867,"result_date":"2022-05-07 22:24","title":"2 Bedroom 2 Bath","description":"This gorgeous, sunny 2nd floor Ventura model features 2 bedrooms, a loft, 2 full bathrooms, high ceilings, 2 balconies, and a cozy fireplace. Newer washer and dryer in unit. Newer stove and dishwasher. Interior was freshly painted and freshly cleaned carpets plus newer window treatments. Ceiling fans throughout unit. The exterior was renovated by the association last year with new siding\/railings, adding new sliding door and windows plus newly paved parking lot. All mentioned above make this condo in the West Windsor Plainsboro school district a must have. Large Pool Tennis Courts Playground for Children Volleyball Easy access to Princeton, Trenton, Philly, New York etc4 miles from Princeton Junction train stationDaily NYC bus service from complex 5 minute drive to new Princeton\/Plainsboro Hospital. Excellent West Windsor- Plainsboro Blue Ribbon Schools!","num_images":13.0,"lat":40.3324,"lng":-74.5688,"attrs":"['2BR \/ 2Ba', '1100ft2', 'available now', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T22:14:26-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/fords-great-private-yard-that-is-fully\/7480909636.html","post_id":7480909636,"result_date":"2022-05-07 22:08","title":"GREAT PRIVATE YARD THAT IS FULLY FENCED","description":"No maintenance fee! Full renovation in 2015. CENTRAL AIR\/Forced hot air\/Water Heater all replaced. New Xtended kitchen w\/new- wood cabinets, stainless appliances, granite counter-tops & porcelain floor. New 1 bath on the FIRST Floor! Great finished hardwood floors- both levels! Replaced vinyl and Anderson wood windows, Renovated main bath with bathroom fan. Basement is dry, painted and waiting for you to finish.","num_images":11.0,"lat":40.527595,"lng":-74.305968,"attrs":"['1BR \/ 1Ba', '847ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T20:52:18-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-br-bath-furnished-detached\/7480917478.html","post_id":7480917478,"result_date":"2022-05-07 21:31","title":"1 br 1 bath furnished detached house apartment suburbs","description":"The 1 Br 1 ba has a walk in closet. The basement apartment has a private entrance. It is furnished with a kitchen table, chairs, 2 beds and a couch. It includes modern appliances such as a washer, dryer, Sony flat screen, microwave and refrigerator. The house has a garage, driveway, deck & tiki bar. All utilities are included. Xfinity WiFi. Serious inquires only. Jay  show contact info","num_images":3.0,"lat":40.372985,"lng":-75.920024,"attrs":"['1BR \/ 1Ba', 'available jun 1', 'cats are OK - purrr', 'flooring: carpet', 'furnished', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T21:24:58-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/helmetta-luxury-2bed-2bath-with\/7480903163.html","post_id":7480903163,"result_date":"2022-05-07 21:28","title":"Luxury 2Bed 2Bath with Luxurious Amenities","description":"Contact info:\nThe Lofts at Monroe Parke |  show contact info\nTHE LOFTS AT MONROE PARKE\n623 Spotswood Englishtown Rd, Monroe Township, NJ 08831\nshow contact info\nwww.theloftsatmonroeparke.com\nIDEALLY SITUATED IN MONROE TOWNSHOP\nConvenient to Route 9\nClose to shopping centers\nLocated near many parks and recreation (Thompson Park, Manalapan Lake, hiking trails, beaches and more!)\nDESCRIPTION\nLive the lifestyle you deserve at The Lofts at Monroe Parke, a brand new luxurious community offering spacious one and two bedroom apartment homes. The Lofts will offer incredible convenience to its residents with shops and eateries below the apartments. The community has easy access to Routes 9, 18, 33 and The New Jersey Turnpike. Be among the first to live in one of the beautiful homes at The Lofts at Monroe Parke!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theloftsatmonroeparke.com\nContact info:\nThe Lofts at Monroe Parke\nshow contact info\n","num_images":9.0,"lat":40.370722,"lng":-74.401398,"attrs":"['2BR \/ 2Ba', '1031ft2', 'available jul 31', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T20:27:16-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/middlesex-this-is-great-neighborhood-to\/7480909324.html","post_id":7480909324,"result_date":"2022-05-07 21:17","title":"THIS IS A GREAT NEIGHBORHOOD TO CALL HOME","description":"This Townhouse has Plenty of storage with a full finished basement and laundry. Brand new Hot Water Heater and Furnaces has been recently serviced. Kitchen was renovated in 2007 with sliding doors leading to a deck that meets your private oasis! The backyard is spacious and fenced with a storage shed. This is a great neighborhood to call home with easy access to NY Train, major highways, restaurants, shopping & schools.","num_images":9.0,"lat":40.580395,"lng":-74.491159,"attrs":"['1BR \/ 1Ba', '617ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T20:50:59-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/helmetta-beautifully-luxurious-2bed\/7480900688.html","post_id":7480900688,"result_date":"2022-05-07 20:54","title":"Beautifully Luxurious 2Bed 2Bath with Amazing Amenities","description":"Contact info:\nThe Lofts at Monroe Parke |  show contact info\nTHE LOFTS AT MONROE PARKE\n623 Spotswood Englishtown Rd, Monroe Township, NJ 08831\nshow contact info\nwww.theloftsatmonroeparke.com>\nResidential Community with Luxurious Services and Amenities\nResident Lounge\nBusiness Center\nFitness Center\nConference Room\nElevators\nGame Room with Billiards\nDESCRIPTION\nLive the lifestyle you deserve at The Lofts at Monroe Parke, a brand new luxurious apartment community offering spacious one and two bedroom apartment homes. The community features an amazing array of amenities, including a spectacular residents’ lounge, premium fitness center, co-working space and conference rooms.\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theloftsatmonroeparke.com\nContact info:\nThe Lofts at Monroe Parke\nshow contact info\n","num_images":9.0,"lat":40.370722,"lng":-74.401398,"attrs":"['2BR \/ 2Ba', '1031ft2', 'available jul 31', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T20:17:56-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/fleetwood-possibilities-are-endless\/7480888558.html","post_id":7480888558,"result_date":"2022-05-07 19:47","title":"Possibilities are endless!","description":"One of a kind craftsman built ranch home nestled in the Brandywine SD on a 1.85 acre lot! Greeting you inside is a sun filled, spacious living room leading into an eat-in kitchen with custom craftsman built cabinets. Entertaining is effortless with a beautiful, stone covered patio and a built-in grill that can be accessed from the kitchen area. The lower level of the home offers a family room featuring more beautiful woodwork, a cozy woodstove incorporated into the heating system, a wet bar, as well as a half bath. From the lower level, you also have access to the attached one car garage, and on the other side of the basement is another oversized two car garage with a large workshop! Fantastic space for any work or hobby! Preserve or work on cars\/ boats or have a home business in the workshop area, possibilities are endless! Outside, there are multiple sheds, a second entrance for work truck\/boats\/RV & plenty of space . Write  me at Wdarvie @ aol . com","num_images":4.0,"lat":40.441481,"lng":-75.768119,"attrs":"['3BR \/ 2Ba', '2068ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: yearly']","posted_date":"2022-05-07T19:36:12-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mays-landing-in-need-of-apartment-for\/7480888964.html","post_id":7480888964,"result_date":"2022-05-07 19:41","title":"In Need of Apartment for Rent in Atlantic County","description":"I'm in need of a one bedroom in the Atlantic County area. I'm steadily employed and hope to stay grounded for some time. I have a small dog (bichon\/poodle) that's around 9lbs and is crate trained. Rarely ever barks. I have decent credit, stable income. I don't smoke or party. I'm looking to move close to June 1, 2022 or close to it. Any help would be appreciated.\nThanks\n","num_images":0.0,"lat":39.464845,"lng":-74.700763,"attrs":"['1BR \/ 1Ba', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T19:37:30-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-bed-single-home\/7480885088.html","post_id":7480885088,"result_date":"2022-05-07 19:28","title":"2 bed single home","description":"2 bed 1 bath single story home on south side of reading 1200  plus utilities.\nneed to have job, no evictions, good creadit  and no felonies\n","num_images":0.0,"lat":40.329222,"lng":-75.920279,"attrs":"['2BR \/ 1Ba', 'flooring: tile', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-07T19:24:44-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-coming-soon-available\/7480881651.html","post_id":7480881651,"result_date":"2022-05-07 19:18","title":"COMING SOON!!! AVAILABLE 6\/15\/2022","description":"***$1550.00\/mth****Immaculate 3 bedroom, 1 Bath un-finished basement rowhome for rent. Located on a quiet street in Wilmington Delaware.\nFeatures beautiful updated kitchen, with stainless steel appliances, updated cabinets, updated countertops, new flooring, updated bath and more. Updated heater and central air are a plus too. Requirements are $55 application fee per adult, Copy of photo ID per adult, 30-day pay-stubs per adult, and one month rent plus one and half month security deposit due upon signing lease. Ready for June15, 2022 move-in date. SERIOUS INQUIRIES ONLY!!!  You can text or email me.\nDon't delay, this home will not last!!!","num_images":11.0,"lat":39.758569,"lng":-75.538887,"attrs":"['3BR \/ 1Ba', 'available jun 15', 'air conditioning', 'flooring: carpet', 'townhouse', 'w\/d hookups', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-05-07T19:13:35-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-take-peek-at-our-photo\/7480860291.html","post_id":7480860291,"result_date":"2022-05-07 18:11","title":"Take a peek at our photo gallery to see more of what’s waiting for you","description":"CALL TODAY:- show contact info\n‬\nSee life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in your gated community, from the inviting swimming pool to the inspiring fitness center. Take a peek at our photo gallery to see more of what’s waiting for you. R-E_NT___2___0W+N\n","num_images":1.0,"lat":39.9308,"lng":-75.0175,"attrs":"['3BR \/ 1.5Ba', '1765ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'attached garage']","posted_date":"2022-05-07T18:07:57-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/absecon-well-maintained-duplex1st-floor\/7480818476.html","post_id":7480818476,"result_date":"2022-05-07 17:24","title":"@Well Maintained Duplex~1st Floor Rental w\/ 2Beds 2Bath\/Open living SP","description":"Beautiful Well Maintained Duplex . 1st floor Rental with 2 Bedrooms 2 Bath. Open living Space and beautiful Front porch- Freshly Painted with New floors and fixtures. Tenant pays for all utilities , Security Deposit and 1st Months rent due at lease signing!!","num_images":5.0,"lat":39.4218,"lng":-74.4949,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'duplex', 'w\/d hookups', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T16:20:43-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-3br-2ba-with-brand-new-ikea\/7480820616.html","post_id":7480820616,"result_date":"2022-05-07 17:19","title":"3br. 2ba. with a brand new IKEA kitchen and black quartz countertops","description":"Newly remodeled throughout 3br. 2ba. with a brand new IKEA kitchen and black quartz countertops. Gleaming polished hardwood floors throughout Efficient gas heat, updated bathrooms. Lower level can be used as 4th bedroom or family room which leads outside to covered backyard porch. Great neighborhood. Schedule today You won't be disappointed.\n","num_images":8.0,"lat":40.5891,"lng":-75.4645,"attrs":"['3BR \/ 2Ba', '1402ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T16:25:49-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-concierge-service-movie\/7480823374.html","post_id":7480823374,"result_date":"2022-05-07 17:08","title":"Concierge Service, Movie Theater, Resident Clubroom","description":"101 dupont place draws from the elegance of yesterday paired with the conveniences of today to create the first luxury living experience within the iconic Dupont Building in downtown Wilmington, DE. Each studio, one, two, and three bedroom apartment at 101 dupont place is appointed with state-of-the-art features that will exceed your expectations around every corner. With a variety of floor plans and an abundance of amenities, you are sure to find a home that meets your needs and elevates your lifestyle at 101 dupont place.\n-Smart Thermostats\n-Brass Bathroom Fixtures & Backlit Vanity Mirrors\n-Latch Keyless Access System\n-Pet-washing Station\n-24-Hour Fitness Center\n-Movie Theater\n-Walk-in Closets with built-in shelving, Linen Closets, or Coat Closets\n-Coworking Space\n-Resident Clubroom\n-Glass Shower or Soaking Tub\n-Nest Wifi-Enabled Smart Thermostat\n-Concierge Service\nCall:  show contact info\nFor more information, visit us at: https:\/\/livebpgroup.net\/sir7ojvw\/101-dupont-place\n","num_images":9.0,"lat":39.7378,"lng":-75.5497,"attrs":"['0BR \/ 1Ba', '488ft2', 'available aug 1', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'valet parking', 'wheelchair accessible']","posted_date":"2022-05-07T16:32:23-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-beautiful-one-bedroom\/7480832346.html","post_id":7480832346,"result_date":"2022-05-07 17:03","title":"Beautiful One Bedroom Apartment with Private Outdoor Deck!","description":"WElcome To Home E King St, Lancaster, PA 17602Call Now -  show contact info\nx 79OR Text 79 to  show contact info\nto text us. WELCOME HOME This is a 1 Bedroom, 1 Bath, approximately 620 Sq. Ft.  Beautiful One Bedroom Apartment with Private Outdoor Deck! - Beautifully remodeled one bedroom apartment with new flooring and fresh paint throughout. The private deck gives you the rare opportunity to enjoy outdoor living in a downtown setting!Pet Policy Pet Policy Type: Cat, DogMax Number of Pets: 2Max Weight of Pets: 50Pet Fee: $300Pet Monthly Rent Min\/Max: $20 - $40Other Pets Allowed: We welcome 2 pets per apartment home. There is a $300 pet fee (non-refundable) per pet. Pet rent is $20 per month, per pet. There is a weight limit of 50 pounds per pet, and aggressive breeds are prohibited. Please call our leasing office for our pet policy.Office Hours:Monday-Friday:9:00AM-6:00PMSaturday:10:00AM-5:00PMEqual Housing Opportunity WnGwfZJY8R\n","num_images":3.0,"lat":40.039961,"lng":-76.289482,"attrs":"['1BR \/ 1Ba', '620ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T16:54:33-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-beautiful-one-bedroom\/7480832391.html","post_id":7480832391,"result_date":"2022-05-07 16:58","title":"Beautiful One Bedroom Apartment with Private Outdoor Deck!","description":"WElcome To Home E King St, Lancaster, PA 17602Call Now -  show contact info\nx 79OR Text 79 to  show contact info\nto text us. WELCOME HOME This is a 1 Bedroom, 1 Bath, approximately 620 Sq. Ft.  Beautiful One Bedroom Apartment with Private Outdoor Deck! - Beautifully remodeled one bedroom apartment with new flooring and fresh paint throughout. The private deck gives you the rare opportunity to enjoy outdoor living in a downtown setting!Pet Policy Pet Policy Type: Cat, DogMax Number of Pets: 2Max Weight of Pets: 50Pet Fee: $300Pet Monthly Rent Min\/Max: $20 - $40Other Pets Allowed: We welcome 2 pets per apartment home. There is a $300 pet fee (non-refundable) per pet. Pet rent is $20 per month, per pet. There is a weight limit of 50 pounds per pet, and aggressive breeds are prohibited. Please call our leasing office for our pet policy.Office Hours:Monday-Friday:9:00AM-6:00PMSaturday:10:00AM-5:00PMEqual Housing Opportunity WnGwfZJY8R\n","num_images":3.0,"lat":40.039961,"lng":-76.289482,"attrs":"['1BR \/ 1Ba', '620ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T16:54:39-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/clementon-four-bedrooms-bathrooms\/7480829764.html","post_id":7480829764,"result_date":"2022-05-07 16:52","title":"Four Bedrooms 2 Bathrooms","description":"Single Home 2500ft2\n4 Bedrooms 2 Bathrooms Living Rm Dining Rm Kitchen\nFamily Room with Vaulted Ceiling and Fireplace\nLarge Kitchen with Center Island\nGas Heat with Central Air\nFull Basement\nCall  show contact info","num_images":0.0,"lat":39.8036,"lng":-75.0058,"attrs":"['4BR \/ 2.5Ba', '2500ft2', 'available jun 15', 'air conditioning', 'flooring: wood', 'house', 'w\/d in unit', 'detached garage', 'rent period: yearly']","posted_date":"2022-05-07T16:48:17-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/absecon-gt-rental-all-utilities\/7480817116.html","post_id":7480817116,"result_date":"2022-05-07 16:47","title":"@~GT~ RENTAL + ALL UTILITIES INCLUDED~2B-1B(Long-term & Short-term)","description":"FULLY FURNISHED RENTAL + ALL UTILITIES INCLUDED (long-term & short-term leasing). Spacious living room with comfy velvet couch and bar to entertain family and friends. Rental comes with 2 well designed bedrooms and a large modern walk-in shower room with dual shower heads for your comfort.  Fully furnished kitchen with good equipped high-grade stainless steel appliances. Extra large size refrigerator, modern stove, and microwave. We went the extra mile to provide you with a stylish toaster, tea, and coffee maker for your tasty morning brew. We also added dining and cooking utensils for your fine dinning at home. That's not all, in addition, the kitchen comes with a large pantry and enormous cabinet space.","num_images":4.0,"lat":39.4218,"lng":-74.4949,"attrs":"['2BR \/ 1Ba', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-07T16:17:30-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-fantastic-bedroom-full-bath\/7480808556.html","post_id":7480808556,"result_date":"2022-05-07 16:14","title":"Fantastic 4 bedroom 2 full bath ranch home- 137 Louisiana Ave","description":"Fantastic 4 bedroom 2 full bath ranch home in a great location convenient to schools and shopping. Hard wood floors, great yard, eat in kitchen and large full basement with washer and dryer. You don't want to miss this home.  Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals.","num_images":1.0,"lat":40.251,"lng":-74.7627,"attrs":"['4BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-07T15:57:53-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-see-life-bit-differently-from\/7480806435.html","post_id":7480806435,"result_date":"2022-05-07 15:56","title":"See life a bit differently from The Landings at Brooks City-Base","description":"See life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in your gated community, from the inviting swimming pool to the inspiring fitness center. Take a peek at our photo gallery to see more of what’s waiting for you.","num_images":4.0,"lat":40.251,"lng":-74.7627,"attrs":"['3BR \/ 2Ba', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T15:52:48-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/freehold-1550-stonehurst-apartments\/7480794430.html","post_id":7480794430,"result_date":"2022-05-07 15:29","title":"$1,550 Stonehurst Apartments","description":"WALKTHROUGHS STARTING 5\/1\/2022\n1 Bedroom 1 Bath updated with new kitchen and bath.\nHardwood in Master Bedroom.\nFreshly painted clean and ready to move in.\nHeat and hot water included.\nPROPERTY HIGHLIGHTS:\nQuiet and calm neighborhood\nOn site parking\nHeat, Water, Sewer & Cooking gas Included\nClose proximity to local schools\nOnsite Laundry\nCOMMUTE:\nEasy commute to NYC\nQuick access to State Route 9\nConveniently located to nearby public transportation\nAPPLICATION REQUIREMENTS:\nCredit Score above 600\nMust be working for minimum of one year\nIncome must be $4500 gross\nNo eviction history\nNo criminal Record\nNo Pets\n3 person occupancy limit\n1 Year minimum Lease required\nBRING ALONG TO THE TOUR\n4 Pay Stubs or Current Bank Statement\nPhoto ID\nContact us by filling out this form\nhttps:\/\/forms.office.com\/r\/hka2jTR7B2\n","num_images":7.0,"lat":40.233249,"lng":-74.279757,"attrs":"['1BR \/ 1Ba', '716ft2', 'available now', 'application fee details: $45', 'flooring: carpet', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-07T15:25:24-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/maple-shade-condo-for-rent\/7480793984.html","post_id":7480793984,"result_date":"2022-05-07 15:28","title":"Condo for Rent","description":"Spacious second floor condo, one bedroom, one (new) bath. Two large walk in closets in bedroom.  Private enclosed balcony. Good location, safe and close to many roads, shopping etc, yet still in a quiet comunity.  One or two persons over 21 . No pets or smoking.(anything) .  Please provide place of employment, current place of residence and reason for leaving, and credit check.","num_images":0.0,"lat":39.961575,"lng":-74.996733,"attrs":"['1BR \/ 1Ba', '800ft2', 'available jul 1', 'air conditioning', 'flooring: other', 'condo', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-07T15:24:27-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-spacious-bd-ba-sqft-1328-10th\/7480783019.html","post_id":7480783019,"result_date":"2022-05-07 15:22","title":"@@spacious 2 BD 1 BA-- SQFT 1328 S 10TH ST APT @@","description":"This spacious, soon to be renovated apartment is equip with brand new appliances, and beautiful hardwood flooring. There are two bedrooms in the unit with ample amount of closet space. This apartment also comes fully loaded with washer and dryer hook ups as well as two parking spaces!\nThe tenants are responsible to pay all utility bills. The tenants are responsible for grass cutting and snow cleaning.\nCall: show contact info","num_images":1.0,"lat":40.5891,"lng":-75.4645,"attrs":"['2BR \/ 1Ba', '1328ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T15:00:51-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-perfect-location-laundry\/7480782485.html","post_id":7480782485,"result_date":"2022-05-07 15:03","title":"Perfect Location, Laundry Room, Tree Lined Streets","description":"Top of the Hill has a park like setting. Surrounded by tow parks and lush wooded landscaping.\nThis two bedroom two bathroom apartment has plenty of space and a walk in closet. Balcony and more.\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nTop of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nCommunity Features\n* Fitness Studio\n* Swimming Pool\n* Car Wash Area\n* Playground\n* Laundry Care Center\n* Tennis Court\n* Some Utilities Included\n* Sun Deck\n* Professionally Managed\n* Renters Insurance is Required\n* After-Hours Emergency Maintenance\n* Our prices can change daily, price listed is based on today's availability. Call for details.","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['2BR \/ 2Ba', '1221ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no parking']","posted_date":"2022-05-07T14:59:51-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/delanco-pet-friendly-2br-25ba-townhome\/7480774330.html","post_id":7480774330,"result_date":"2022-05-07 14:46","title":"Pet-Friendly 2BR\/2.5BA Townhome w\/ a Basement, a Fireplace, & a Patio","description":"2  bedroom 2.5 bath 1944Sq.Ft. $2,580 - $2,730\/mo SDK Tenby Chase Apartments  CALL US TODAY:  show contact info\nx371  DESCRIPTION:  Check out the three-story townhomes in this two-bedroom, two-and-one-half-bathroom floor plan at Tenby Chase Apartments. The layout includes a spacious basement, which has a hobby area and a laundry room. A staircase leads to the first level where you will find the living area built with a fireplace. The living space extends to a patio, offering more areas for leisure. Next to the dining area, you have the fully equipped kitchen and the half bathroom. Take the next flight of stairs near the foyer up to the second floor. Here, each bedroom has access to a full-size bathroom for maximum convenience. Step out of the apartment and you can directly access the community’s scenic courtyards. The park-like setting makes Tenby Chase ideal for you and your pets. The community has a pool, a playground, and a tennis court. Shopping and dining are just minutes away. Call for inquiries. OFFICE HOURS:Monday:   9:00am to 5:00pm    Tuesday:   9:00am to 5:00pm    Wednesday:   9:00am to 5:00pm    Thursday:   9:00am to 5:00pm    Friday:   9:00am to 5:00pm    Saturday:   11:00am to 3:00pm     FLOORPLAN\/UNIT AMENITIES:  * Carpeted Floors  * Window Treatments  * Individual Apartment Entrances  * Full-size washer\/dryer  * Large Closets  * Spacious Floor Plans  * Fully Equipped Kitchen  * Dishwasher  * Central Heating & Air Conditio  * Dining Area  PROPERTY AMENITIES:  * Regular-sized pool  * Beautiful Park Like Setting  * Pet Friendly  * Tennis Court  * Laundry  * Well maintained grounds  * Good guest parking  * Online Resident Services  * Close to Major Highways  * On-site Maintenance  * On-site Management  * Professionally Landscaped Cour  * Off-street Parking  * Close to Dining, Shopping & En  * Park Like Setting  * Fitness Center  * Clubhouse  CALL US TODAY!  show contact info\nx371 Address:  193 Tenby Chase Dr Delran, NJ 08075  Managed By: SDK Apartments Equal Housing Opportunity\n","num_images":0.0,"lat":40.008697,"lng":-74.962943,"attrs":"['2BR \/ 2.5Ba', '1944ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T14:42:29-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/south-river-famly-home-down-stairs\/7480769330.html","post_id":7480769330,"result_date":"2022-05-07 14:35","title":"2 FAMLY  HOME DOWN STAIRS  APARTMENT","description":"DOWN STAIRS  APARTMENT TWO BEDROOM,  LIVINGROOM, KITCHEN,  AND ONE BATHROOM                         2 MONTH SEC NO PETS $1600 PER MONTH RENT PLUS ELEC\/GAS  CALL  show contact info","num_images":6.0,"lat":40.4444,"lng":-74.3801,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'off-street parking']","posted_date":"2022-05-07T14:31:59-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mount-royal-perfect-location-playground\/7480767088.html","post_id":7480767088,"result_date":"2022-05-07 14:31","title":"Perfect Location, Playground Area, Dog Park","description":"Located in desirable Gloucester County, our residents enjoy nearby attractions including shopping, recreation, and fine dining. Your day-to-day needs can be easily met within the surrounding area, but if you wish to explore a bit further, our location offers that as well! In less than fifteen minutes you can enjoy the city of Philadelphia or head thirty minutes south to Wilmington.\nThis two bedroom one bathroom apartment has a large living and dining room and the benefit of a great closet off for extra storage. Each bedroom has it's own large closet. Washer dryer and more!\nHeather Ridge Apartments, managed by Panco Management\n454 Heather Drive\nMantua, NJ 08051\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/heatherridgeapts.net","num_images":18.0,"lat":39.806488,"lng":-75.177315,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-07T14:27:46-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/glassboro-prime-location-house-for-rent\/7480761551.html","post_id":7480761551,"result_date":"2022-05-07 14:20","title":"Prime Location - House for Rent near Rowan University - 4 bed \/ 2 bath","description":"Welcome to 303 New Street W, located in the heart of Rowan University and one-block away from both the campus and Glassboro’s downtown retail and nightlife district, Rowan Boulevard. You cannot get any more convenient than this!\nJust steps away from landmarks like the Rowan University Bookstore (Barnes & Noble) and the Rowan Fitness Center, plus popular restaurants such as Chickie’s & Pete’s, LaScala’s Fire, Mexican Mariachi Grill, Playa Bowls, and more, 303 New Street West is the perfect place to call home!\nThis 2-story home is well maintained and has plenty of living space, including an eat-in kitchen boasting granite countertops, a large living room, four (4) bedrooms, and two (2) full bathrooms. The home also has an unfinished basement equipped with washing\/drying machines, providing ample space for laundry and storage!\nThe fully paved driveway can fit up to four (4) cars and leads to a garage (not included) plus a spacious yard for cookouts and yard games. The house is currently rented by a group who will be moving out on May 15, 2022. This property will be available for move-in on July 1, 2022.\nThe lease term will be a year-long (i.e., 7\/1\/2022 to 6\/30\/2023), with rent to be paid in the amount of $2,600 USD\/month. The utilities will be paid by tenants (i.e., gas, electric, water, internet), and no smoking is allowed in the house.\nIf you are interested in renting 303 New Street W for the upcoming year, or have any questions at all, please reach out (text and\/or call) Giovanni\n8five6-88five-three99two\nNOTE: Any individual and\/or party who inquiries about this listing agrees and acknowledges that they will be subject to a credit check and\/or income check, which shall be paid at their expense.","num_images":6.0,"lat":39.7068,"lng":-75.1172,"attrs":"['4BR \/ 2Ba', 'available jul 1', 'flooring: carpet', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-07T14:16:48-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-this-home-has-been-very-well\/7480743262.html","post_id":7480743262,"result_date":"2022-05-07 14:17","title":"This home has been very well maintained by the owner","description":"Well laid out living space conveniently located within minutes of Downtown Allentown, PPL Center, The Lehigh Valley Mall and public transportation.\nThis home is a great property for someone interested in a low monthly payment, low taxes and possible extended living quarters.\nThis home has been very well maintained by the owner. The first floor has a full kitchen, bathroom, living and dining room that has been used as a bedroom. . Schedule your appointment today!\n====================================================\n====================================================\n","num_images":6.0,"lat":40.6068,"lng":-75.4781,"attrs":"['1BR \/ 1Ba', '1672ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-07T13:41:48-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-15-off-local-restaurants\/7480728941.html","post_id":7480728941,"result_date":"2022-05-07 14:12","title":"15% off local restaurants like Bardea, Pet Friendly, Bike Storage","description":"These brand-new studio, one-, and two-bedroom apartments offer open floor plans and sleek finishes that will make you feel right at home the moment you step inside. Our pet-friendly community features amenities meant to make the most out of your lifestyle, such as a rooftop deck, fitness center, and a private courtyard.\nLocated on Lower Market Street, The Cooper offers unbeatable access to the Wilmington Train Station and Transit Center, local employment hubs, and neighborhood attractions in Downtown Wilmington and on the Riverfront. For those who want it all — contemporary apartments, impressive amenities, and walkable convenience — The Cooper is a place you can truly call home.\n-Rooftop Deck\n-Onsite Management & Maintenance\n-Private Courtyard\n-20% off rooms at the Hotel du Pont\n-Complimentary ticket giveaways to shows at The Queen, The Playhouse on Rodney Square, and The Grand Opera House\n-Access-Controlled Package Receiving\n-Fitness Center\n-10% off your morning coffee at Starbucks\n-15% off local restaurants like Bardea\n-Pet Friendly\n-Discounted membership to CoreTen Fitness and the YMCA\n-Bike Storage\nCall:  show contact info\nFor more information, visit us at: https:\/\/livebpgroup.net\/sfaddfif\/cooper\n","num_images":9.0,"lat":39.7378,"lng":-75.5497,"attrs":"['1BR \/ 1Ba', '523ft2', 'available jun 7', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-07T13:14:40-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/albany-stylish-kitchens-natural-light\/7480735115.html","post_id":7480735115,"result_date":"2022-05-07 14:10","title":"STYLISH KITCHENS || NATURAL LIGHT || 24-HOUR FITNESS || RESORT POOLS","description":"\"Incredibly spacious two bedroom floor plans featuring designer island kitchens, wood floors, stainless Energy Star appliances, garden tubs, oversized windows offering an abundance of natural light and magnificent views. Sheltered by a buffer of mature trees and native landscaping this gated community includes two resort-style pools, two state-of-the-art fitness centers, internet café with media lounge and outdoor grilling areas. Very pet friendly with large dog park and agility course for your four legged friend. Located in Central NJ neighborhood environment offering immediate access to major employers: Apple, Hewlett Packard, Dell, Samsung, and more\nCall Me For Availability Today!\n___________________________________\n100% FREE Service! No BROKERS FEES\nCall Now:- show contact info\n)\nCall Now:- show contact info\n)'''''''''''''''\nCall Now:- show contact info\n) '''''''''''''''''''\"\n","num_images":9.0,"lat":42.6568,"lng":-73.7605,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T13:26:01-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-spacious-modern-living\/7480739971.html","post_id":7480739971,"result_date":"2022-05-07 13:39","title":"Spacious Modern Living","description":"Dorchester floor plan — 881 sq. ft. — Starting Price $2,314 — Call to get on our waiting list!\nThis 1 bedroom apartment has a great view from a large private balcony! This apartment boats LVT flooring, central heat and air, a washer and dryer, stainless steel appliances, and plenty of cabinet space in the kitchen. This apartment also comes equipped with a spacious living area and walk-in closet. This gorgeous apartment is within close proximity to our clubhouse—featuring a 24-hour fitness center, theatre, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!\n","num_images":9.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '881ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T13:35:31-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-public-transportation-24\/7480727631.html","post_id":7480727631,"result_date":"2022-05-07 13:16","title":"Public Transportation, 24 Emergency Service, Ceiling Fans","description":"We are located in Blackwood New Jersey and close to the Philadelphia area. We offer spacious one and two bedroom apartment floor plans to choose from so you can find your perfect home for your family. Another great reason to live at Washington Way apartments is that each apartment has its own  balcony or patio overlooking our beautiful park like views.At Washington Way Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails. Our community enjoys hosting seasonal resident events for our residents with extended pool hours and DJ, food and raffles for a great way to meet your neighbors.At Washington Way Apartments consider our great location in Blackwood, NJ. Located in the top ten Washington Township School District, Your children enjoy a top rated education being one of the best school districts in the state. Our residents enjoy the convenient access to Routes I-295, and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Sicklerville, Deptford, and Turnersville, and the new Outlet Mall that just opened locally. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Washington Way Apartments today.\n-Ceiling Fans\n-24 Emergency Service\n-Courtyard\n-Playground\n-Cable Hookup\n-Patio’s or Balconies\n-Clubhouse\n-Small Pets Welcome\n-Disposal\n-Fitness Center\n-Gas Heat\n-Public Transportation\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/ciepp4oh\/washington-way\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!","num_images":8.0,"lat":39.7901,"lng":-75.0367,"attrs":"['1BR \/ 1Ba', '765ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking']","posted_date":"2022-05-07T13:12:15-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-spacious-modern-living\/7480725125.html","post_id":7480725125,"result_date":"2022-05-07 13:11","title":"Spacious Modern Living","description":"Dorchester floor plan — 881 sq. ft. — Starting Price $2,314 — Call to get on our waiting list!\nThis 1 bedroom apartment has a great view from a large private balcony! This apartment boats LVT flooring, central heat and air, a washer and dryer, stainless steel appliances, and plenty of cabinet space in the kitchen. This apartment also comes equipped with a spacious living area and walk-in closet. This gorgeous apartment is within close proximity to our clubhouse—featuring a 24-hour fitness center, theatre, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '881ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T13:07:34-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/perth-amboy-beautiful-2bd-2ba-condo-for\/7480686547.html","post_id":7480686547,"result_date":"2022-05-07 12:59","title":"Beautiful 2bd\/2ba condo for rent","description":"Ideal location. Genteel living awaits you in this 2 bedroom, 1 bath home with basement, a large patio for your famous barbecues, and shady fenced backyard. New roof, electric panel, Tesla tankless water heater installed in 2019. Be the lucky occupant","num_images":9.0,"lat":40.52674,"lng":-74.273734,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T11:55:29-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-laundry-facilities-w\/7480716986.html","post_id":7480716986,"result_date":"2022-05-07 12:56","title":"Laundry Facilities, W\/W Carpeting, Parking","description":"601 North Black Horse Pike, Monroe Township, NJ 08094Work, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes.Apartment Features:PoolDishwasherPublic TransportationDW\/Garbage DisposalW\/W CarpetingCable HookupPlaygroundGas & Heat IncludedCeiling FanParkingPets WelcomeLaundry FacilitiesAir ConditioningPrivate EntrancesLarge Floor PlansCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/tkvul7je\/laurelton-village*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!","num_images":7.0,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available may 28', 'apartment', 'laundry on site', 'off-street parking']","posted_date":"2022-05-07T12:52:46-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-10-off-your-morning-coffee\/7480664101.html","post_id":7480664101,"result_date":"2022-05-07 12:56","title":"10% off your morning coffee at Starbucks, Pet Friendly, Keyless Entry","description":"These brand-new studio, one-, and two-bedroom apartments offer open floor plans and sleek finishes that will make you feel right at home the moment you step inside. Our pet-friendly community features amenities meant to make the most out of your lifestyle, such as a rooftop deck, fitness center, and a private courtyard.\nLocated on Lower Market Street, The Cooper offers unbeatable access to the Wilmington Train Station and Transit Center, local employment hubs, and neighborhood attractions in Downtown Wilmington and on the Riverfront. For those who want it all — contemporary apartments, impressive amenities, and walkable convenience — The Cooper is a place you can truly call home.\n-Complimentary ticket giveaways to shows at The Queen, The Playhouse on Rodney Square, and The Grand Opera House\n-Pet Friendly\n-Keyless Entry\n-Discounted membership to CoreTen Fitness and the YMCA\n-Private Courtyard\n-15% off local restaurants like Bardea\n-Fitness Center\n-Smoke-Free Community\n-20% off rooms at the Hotel du Pont\n-10% off your morning coffee at Starbucks\n-Access-Controlled Package Receiving\n-Onsite Management & Maintenance\nCall:  show contact info\nFor more information, visit us at: https:\/\/livebpgroup.net\/pkok744o\/cooper\n","num_images":9.0,"lat":39.7378,"lng":-75.5497,"attrs":"['1BR \/ 1Ba', '685ft2', 'available now', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-07T11:11:01-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-this-cute-cape-cod-has-been\/7480707808.html","post_id":7480707808,"result_date":"2022-05-07 12:55","title":"@@%%This cute cape cod has been well maintained and is move-in ready..","description":"See life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in your gated community, from the inviting swimming pool to the inspiring fitness center. Take a peek at our photo gallery to see more of what’s waiting for you. R-E_NT___2___0W+N BAD CREDIT IS NO PROBLEAM\nCALL TEXT NOW ☎️📞📞📞  show contact info","num_images":1.0,"lat":40.328,"lng":-75.9908,"attrs":"['3BR \/ 1Ba', '1370ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-07T12:34:58-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/quarryville-bed-bath-in-solanco-school\/7480709433.html","post_id":7480709433,"result_date":"2022-05-07 12:42","title":"4 Bed 3 Bath in Solanco School Distict","description":"Beautiful Rancher in Quarryville. Over 3,000 square feet of living space near the town. House has too many amenities to list. This is a must see house that features a perfect combination of a quiet neighborhood that is close to town.","num_images":4.0,"lat":39.8949,"lng":-76.1465,"attrs":"['4BR \/ 3Ba', '3000ft2', 'available may 23', 'flooring: carpet', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T12:38:08-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-lease-today-great-views\/7480704154.html","post_id":7480704154,"result_date":"2022-05-07 12:32","title":"Lease Today, Great Views, Minutes to I 95","description":"VIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nLease today at Top of the Hill! Call for leasing details.\nThis two bedroom two bathroom apartment has plenty of space and a walk in closet. Balcony and more.\nTop of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nApartment Features\n* Gas Stove\n* Private Patio or Private Balcony (on select apartments)\n* Microwave\n* Pre-wired for internet and cable\n* Vertical Blinds\n* Refrigerator\n* Dishwasher\n* Central Heat and Air\n* Walk-in Closet","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['2BR \/ 2Ba', '1221ft2', 'available may 11', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no parking']","posted_date":"2022-05-07T12:28:09-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/new-brunswick-bedroom-bath-luxury\/7480696805.html","post_id":7480696805,"result_date":"2022-05-07 12:29","title":"1 BEDROOM 1 BATH LUXURY APARTMENT LOCATED NEAR RUTGERS UNIVERSITY","description":"Contact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIGHTS\n11 US-1, New Brunswick, NJ 08901>\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n… AND MORE!\nDESCRIPTION\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\nContact info:\nThe Edge at Raritan Heights\nEdgewood Properties\nshow contact info\nContact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIHTS\n11 US-1, New Brunswick, NJ 08901\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n…AND MORE!\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\n","num_images":14.0,"lat":40.4891,"lng":-74.4482,"attrs":"['1BR \/ 1Ba', '864ft2', 'available now', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T12:14:21-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-patio-onsite-cvs-and-wawa\/7480701842.html","post_id":7480701842,"result_date":"2022-05-07 12:27","title":"Patio, Onsite CVS and WAWA, Picnic areas","description":"100 Fox Meadow Drive, Maple Shade Township, NJ 08052Welcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today.Apartment Features:CorporateOnsite CVS and WAWAPoolPatioPetsBalconyDisposalFurnishedAir ConditioningPlaygroundStorageFitness centerTennis courtGarageOn-site managementPets welcomeOnsite Daycare CenterSignal 88 Courtesy PatrolGas heatLaundry facilitiesWasher\/dryer in rentalFull-size washer\/dryer availablePrivate entrancesDishwasherGarbage disposalPlaygroundsPicnic areasFitness and jogging trailsHandball\/Basketball courtShopping plaza24-hour maintenanceSwim clubCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/zfvxgkwf\/fox-meadow*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['2BR \/ 1.5Ba', '1000ft2', 'available now', 'apartment', 'laundry on site', 'street parking']","posted_date":"2022-05-07T12:23:41-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-private-entrances-laundry\/7480699402.html","post_id":7480699402,"result_date":"2022-05-07 12:23","title":"Private entrances, Laundry facilities, Playground","description":"Bedrooms: 1Bathrooms: 1Square Feet: 650Date Available: 2022-06-13Address: 100 Fox Meadow DriveWelcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today. Amenities Include:StorageBalconySignal 88 Courtesy PatrolPlaygroundHandball\/Basketball courtOnsite Daycare CenterOnsite CVS and WAWAFitness and jogging trailsCorporatePatioPicnic areasPets welcomeCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/72jrfkcf\/fox-meadow*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['1BR \/ 1Ba', '650ft2', 'available jun 13', 'apartment', 'laundry on site', 'street parking']","posted_date":"2022-05-07T12:19:06-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/new-brunswick-br-1bath-with-amazing\/7480694453.html","post_id":7480694453,"result_date":"2022-05-07 12:22","title":"1 BR\/1BATH with amazing amenities","description":"Contact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIGHTS\n11 US-1, New Brunswick, NJ 08901>\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n… AND MORE!\nDESCRIPTION\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\nContact info:\nThe Edge at Raritan Heights\nEdgewood Properties\nshow contact info\nContact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIHTS\n11 US-1, New Brunswick, NJ 08901\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n…AND MORE!\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\n","num_images":14.0,"lat":40.4891,"lng":-74.4482,"attrs":"['1BR \/ 1Ba', '864ft2', 'available now', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T12:09:54-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-see-life-bit-differently-from\/7480695180.html","post_id":7480695180,"result_date":"2022-05-07 12:15","title":"See life a bit differently from The Landings at Brooks City-Base","description":"See life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in your gated community, from the inviting swimming pool to the inspiring fitness center. Take a peek at our photo gallery to see more of what’s waiting for you. R-E_NT___2___0W+N BAD CREDIT IS NO PROBLEAM\nTEXT CALL  NOW ☎️📞📞📞  show contact info","num_images":1.0,"lat":40.167,"lng":-74.6488,"attrs":"['3BR \/ 2Ba', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T12:11:12-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/see-life-bit-differently-from-the\/7480695190.html","post_id":7480695190,"result_date":"2022-05-07 12:15","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/metuchen-see-life-bit-differently-from\/7480695172.html","post_id":7480695172,"result_date":"2022-05-07 12:15","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/metuchen-see-life-bit-differently-from\/7480695166.html","post_id":7480695166,"result_date":"2022-05-07 12:15","title":"See life a bit differently from The Landings at Brooks City-Base","description":"See life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in your gated community, from the inviting swimming pool to the inspiring fitness center. Take a peek at our photo gallery to see more of what’s waiting for you. R-E_NT___2___0W+N BAD CREDIT IS NO PROBLEAM\nTEXT CALL  NOW ☎️📞📞📞  show contact info\n...\n","num_images":1.0,"lat":40.5325,"lng":-74.3375,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T12:11:10-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-patios-or-balconies-24\/7480690575.html","post_id":7480690575,"result_date":"2022-05-07 12:06","title":"Patio’s or Balconies, 24 Emergency Service, Air Conditioner","description":"We are located in Blackwood New Jersey and close to the Philadelphia area. We offer spacious one and two bedroom apartment floor plans to choose from so you can find your perfect home for your family. Another great reason to live at Washington Way apartments is that each apartment has its own  balcony or patio overlooking our beautiful park like views.At Washington Way Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails. Our community enjoys hosting seasonal resident events for our residents with extended pool hours and DJ, food and raffles for a great way to meet your neighbors.At Washington Way Apartments consider our great location in Blackwood, NJ. Located in the top ten Washington Township School District, Your children enjoy a top rated education being one of the best school districts in the state. Our residents enjoy the convenient access to Routes I-295, and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Sicklerville, Deptford, and Turnersville, and the new Outlet Mall that just opened locally. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Washington Way Apartments today.\n-Dishwasher\n-Cable Hookup\n-Swimming Pool\n-Playground\n-Air Conditioner\n-Disposal\n-Small Pets Welcome\n-Ceiling Fans\n-Clubhouse\n-Gas Heat\n-24 Emergency Service\n-Courtyard\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/36rynqa5\/washington-way\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.7901,"lng":-75.0367,"attrs":"['2BR \/ 2Ba', '1005ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T12:02:53-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/dover-charming-2br-for-rent\/7480672062.html","post_id":7480672062,"result_date":"2022-05-07 12:02","title":"Charming 2BR for Rent","description":"Welcome to 216 N Kirkwood St., perfect for the First Time Home Buyer or Investor! Recent updates include new granite counter tops in 2018 and bathroom upgrades.  Enjoy the upcoming Spring and Summer seasons on the front porch. Enter the home through the front living room, into a dining area, then into the kitchen which provides bright cabinetry and granite counter tops. Also on the main floor is your full bathroom with an updated tile shower. Upstairs you'll find 2 bedrooms and a large attic space, great for storage. Conveniently located in the heart of Dover, DE., enjoy nearby amenities, restaurants and businesses such as The Dover Mall, Dover Downs Hotel & Casino, Delaware State University, Bayhealth Medical and less than an hours drive to Delaware's beautiful beaches! Schedule your tour today!","num_images":14.0,"lat":39.1605,"lng":-75.5974,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-05-07T11:26:55-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-fox-meadow\/7480686113.html","post_id":7480686113,"result_date":"2022-05-07 11:58","title":"FOX MEADOW!","description":"Welcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today.\n-Signal 88 Courtesy Patrol\n-Patio\n-Swim club\n-Corporate\n-Garage\n-Playground\n-Gas heat\n-Shopping plaza\n-Fitness center\n-Furnished\n-Onsite Daycare Center\n-Tennis court\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/4re6dtez\/fox-meadow\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['2BR \/ 1.5Ba', '1000ft2', 'available may 9', 'apartment', 'laundry on site', 'street parking']","posted_date":"2022-05-07T11:54:36-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/maple-shade-laundry-facilities-balcony\/7480681489.html","post_id":7480681489,"result_date":"2022-05-07 11:49","title":"Laundry facilities, Balcony, Corporate","description":"100 Fox Meadow Drive, Maple Shade Township, NJ 08052Welcome to Fox Meadow 1 & 2 bedroom Apartments for rent. We offer the best apartment rental price in the Maple Shade\/Cherry Hill area. Our one and two bedroom rental homes offer private luxury with community living with a variety of amenities that are included in your rent. At Fox Meadow Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a jog on our private jogging trails.You can enjoy Fox Meadow apartments for rent indoor health and fitness center, or join friends for a game at our tennis or basketball courts. For our dog lovers, there is a on site dog park!  We have thought of everything for your convenience with our on-site daycare, playground, and picnic area.At Fox Meadow Apartments for rent, consider our great location in Maple Shade, NJ. Our rental homes are near Philadelphia and minutes away from three bridges to Center City, Your new rental home will be located close to major shopping centers in Cherry Hill and Moorestown. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!Fox Meadow Apartments offers to receive your packages, along with an onsite Wawa convenience store and CVS Pharmacy.We take pride in our beautifully landscaped grounds and well maintained community. You will appreciate your private entrance to your spacious apartment rental  which includes your own balcony or patio. Your modern kitchen features stainless steel appliances with a dishwasher, disposal and refrigerator. Enjoy plenty of storage with walk in closets, other features include window coverings, a washer and dryer, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Fox Meadow Apartments & Townhomes today.Apartment Features:CorporateOnsite CVS and WAWAPoolPatioPetsBalconyDisposalFurnishedAir ConditioningPlaygroundStorageFitness centerTennis courtGarageOn-site managementPets welcomeOnsite Daycare CenterSignal 88 Courtesy PatrolGas heatLaundry facilitiesWasher\/dryer in rentalFull-size washer\/dryer availablePrivate entrancesDishwasherGarbage disposalPlaygroundsPicnic areasFitness and jogging trailsHandball\/Basketball courtShopping plaza24-hour maintenanceSwim clubCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/n2ukb2xi\/fox-meadow*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!","num_images":8.0,"lat":39.9511,"lng":-74.9946,"attrs":"['3BR \/ 1Ba', '960ft2', 'available jul 11', 'apartment', 'laundry on site', 'street parking']","posted_date":"2022-05-07T11:45:37-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/somerset-one-bed-washer-dryer-in-unit\/7480677533.html","post_id":7480677533,"result_date":"2022-05-07 11:41","title":"One bed washer & dryer in unit Available!","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nAbout The Park at FranklinCome in and tour our newly upgraded apartment homes which include; gorgeous granite countertops, modern stainless mist appliances, beautiful maple cabinetry, full sized washers and dryers and more! Live in the lap of \"Affordable Luxury\" and secure your home today. Availability is very limited, so call us today! The Park at Franklin is the perfect balance of suburban living with the convenience of an urban lifestyle. Close to fine dining, shopping and entertainment, you won't need to go far to enjoy all of what highly sought after Franklin Township has to offer. Easy access to major highways including: Route 287, Garden State Parkway and New Jersey Turnpike will make your commute a breeze. Our community will surround you with lush, mature landscaping creating a tranquil park-like setting. Our professional, on-site management and maintenance team will welcome you home to your new 1 or 2 bedroom apartment home featuring sleek hardwood floors, generous closet space and more! Come home to The Park at Franklin where there is something for everyone!***CLUBHOUSE\/LEASING OFFICE NOW OPEN*** brand new clubhouse, 24\/7 package concierge, 24\/7 state-of-the-art fitness center w\/ interactive yoga room, outdoor patio and pool. Full amenity package INCLUDED in your monthly rent!!!1X1  Premier\nDetails\nAvailability date: May 15, 2022\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Dogs Allowed: Breed restrictions apply. Call our Leasing Office for details\n•$50 Monthly Pet Rent\n•$250 Fee\n•2 Pet Limit\nCats Allowed\n•$35 Monthly Pet Rent\n•$250 Fee\n•2 Pet Limit\nDeposit: 250\nLeasing options: 6 months,9 months,12 months\nLeasing notes: WE ARE STILL OPEN!\nVirtual and Self-Guided Tours are available by appointment\nWe are taking all the necessary precautions to ensure the safety of our guests and staff including practicing social distancing.\nPlease limit all tours parties to a max of two people.\nApplication fee: 50\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage, Gas\nUtilities Cost:\nLaundry: In Unit\nParking type: Garage, Off-Street\nParking notes: Surface Lot Garage: $125 Assigned Parking. Detached garages available for rental for an additional monthly fee.\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard, Porch\nHeating\/cooling: Heat: forced air, Central AC\nWiring: Cable-ready, High-speed internet, Wired\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Barbecue, Business center, Tennis court, Dog Park\nSecurity and Access:\nViews: Water, Park\nAdditional features: Hardwood floor, Tile floor, Granite countertop\nOffered by:\nThe Park at Franklin\nEqual Housing Opportunity","num_images":18.0,"lat":40.510316,"lng":-74.491769,"attrs":"['1BR \/ 1Ba', '785ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-07T11:37:27-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/somerset-we-have-one-beds-for-may-move\/7480675962.html","post_id":7480675962,"result_date":"2022-05-07 11:38","title":"We have one beds for May Move Ins!","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nAbout The Park at FranklinCome in and tour our newly upgraded apartment homes which include; gorgeous granite countertops, modern stainless mist appliances, beautiful maple cabinetry, full sized washers and dryers and more! Live in the lap of \"Affordable Luxury\" and secure your home today. Availability is very limited, so call us today! The Park at Franklin is the perfect balance of suburban living with the convenience of an urban lifestyle. Close to fine dining, shopping and entertainment, you won't need to go far to enjoy all of what highly sought after Franklin Township has to offer. Easy access to major highways including: Route 287, Garden State Parkway and New Jersey Turnpike will make your commute a breeze. Our community will surround you with lush, mature landscaping creating a tranquil park-like setting. Our professional, on-site management and maintenance team will welcome you home to your new 1 or 2 bedroom apartment home featuring sleek hardwood floors, generous closet space and more! Come home to The Park at Franklin where there is something for everyone!***CLUBHOUSE\/LEASING OFFICE NOW OPEN*** brand new clubhouse, 24\/7 package concierge, 24\/7 state-of-the-art fitness center w\/ interactive yoga room, outdoor patio and pool. Full amenity package INCLUDED in your monthly rent!!!1X1  Premier\nDetails\nAvailability date: May 15, 2022\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Dogs Allowed: Breed restrictions apply. Call our Leasing Office for details\n•$50 Monthly Pet Rent\n•$250 Fee\n•2 Pet Limit\nCats Allowed\n•$35 Monthly Pet Rent\n•$250 Fee\n•2 Pet Limit\nDeposit: 250\nLeasing options: 6 months,9 months,12 months\nLeasing notes: WE ARE STILL OPEN!\nVirtual and Self-Guided Tours are available by appointment\nWe are taking all the necessary precautions to ensure the safety of our guests and staff including practicing social distancing.\nPlease limit all tours parties to a max of two people.\nApplication fee: 50\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage, Gas\nUtilities Cost:\nLaundry: In Unit\nParking type: Garage, Off-Street\nParking notes: Surface Lot Garage: $125 Assigned Parking. Detached garages available for rental for an additional monthly fee.\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard, Porch\nHeating\/cooling: Heat: forced air, Central AC\nWiring: Cable-ready, High-speed internet, Wired\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Barbecue, Business center, Tennis court, Dog Park\nSecurity and Access:\nViews: Water, Park\nAdditional features: Hardwood floor, Tile floor, Granite countertop\nOffered by:\nThe Park at Franklin\nEqual Housing Opportunity","num_images":18.0,"lat":40.510316,"lng":-74.491769,"attrs":"['1BR \/ 1Ba', '785ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T11:34:38-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/delanco-sunk-in-living-room-included-in\/7480672888.html","post_id":7480672888,"result_date":"2022-05-07 11:32","title":"Sunk-In Living Room Included in This Two-Story One-Bedroom Apartment","description":"SDK Tenby Chase Apartments CALL US:  show contact info\nx370  Adams House I  1  bed \/ 1.5 bath \/ 1271 Sq.Ft \/ $1,795  Welcome Home to SDK Tenby Chase in Delran NJ  From the sunk-in living rooms with wood-burning fireplaces to the laundry rooms with full-size washers and dryers, apartments in this one-bedroom, one-and-one-half-bathroom floor plan at Tenby Chase offer unique two-story designs. Homes in this model have updated kitchens with walk-in pantries and adjacent dining areas. This layout has a basement with a finished living room and a powder room. Apartments in this floor plan come with wall-to-wall carpeting and central heating and air conditioning. Residents can explore the well-maintained landscaped grounds, which has a park-like setting with garden courtyards. Members of the community enjoy having access to resort-style amenities such as a saltwater pool and free Wi-Fi. Active residents can take advantage of the on-site fitness center and the tennis court. Contact the leasing office today for more information.  Floor Plan\/Unit Amenities:  * Carpeted Floors  * Window Treatments  * Individual Apartment Entrances  * Full-size washer\/dryer  * Large Closets  * Spacious Floor Plans  * Fully Equipped Kitchen  * Dishwasher  * Central Heating & Air Conditio  * Dining Area  Property Amenities:  * Regular-sized pool  * Beautiful Park Like Setting  * Pet Friendly  * Tennis Court  * Laundry  * Well maintained grounds  * Good guest parking  * Online Resident Services  * Close to Major Highways  * On-site Maintenance  * On-site Management  * Professionally Landscaped Cour  * Off-street Parking  * Close to Dining, Shopping & En  * Park Like Setting  * Fitness Center  * Clubhouse CALL US TODAY! show contact info\nx370  SDK Tenby Chase Apartments  Address:  193 Tenby Chase Dr Delran, NJ 08075 Equal Housing Opportunity\n","num_images":0.0,"lat":40.008697,"lng":-74.962943,"attrs":"['1BR \/ 1.5Ba', '1271ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T11:28:40-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-luxurious-community-living\/7480665116.html","post_id":7480665116,"result_date":"2022-05-07 11:17","title":"Luxurious Community Living","description":"Resort like living with all the conveniences that you could ever ask for! Mere minutes from the train and The NJ turnpike, you'll find yourself right at home in this luxurious rental community. Minutes from Woodbridge mall, retail stores, Merrill park, downtown woodbridge,charming suburbs, and much much more!\nAmeneties include: Expansive Clubhouse with Fireplace and Lounge Seating,\nIdyllic Courtyard & Shared Garden, Resort Style Pool & Sundeck with Outdoor Grills & Bar, Fire pits, Juice bar, Co-working stations, in unit w\/d, Pet friendly, and more!\nText, call, or email Annie today for more details.  show contact info\n!","num_images":15.0,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T11:13:10-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-luxurious-community-living\/7480665016.html","post_id":7480665016,"result_date":"2022-05-07 11:16","title":"Luxurious Community Living","description":"Resort like living with all the conveniences that you could ever ask for! Mere minutes from the train and The NJ turnpike, you'll find yourself right at home in this luxurious rental community. Minutes from Woodbridge mall, retail stores, Merrill park, downtown woodbridge,charming suburbs, and much much more!\nAmeneties include: Expansive Clubhouse with Fireplace and Lounge Seating,\nIdyllic Courtyard & Shared Garden, Resort Style Pool & Sundeck with Outdoor Grills & Bar, Fire pits, Juice bar, Co-working stations, in unit w\/d, Pet friendly, and more!\nText, call, or email Annie today for more details.  show contact info\n!","num_images":14.0,"lat":40.556,"lng":-74.2845,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T11:12:58-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-public-transportation\/7480664386.html","post_id":7480664386,"result_date":"2022-05-07 11:15","title":"Public Transportation, Ceiling Fan, Cable Hookup","description":"Bedrooms: 2Bathrooms: 1Square Feet: 760Date Available: 2022-05-28Address: 601 North Black Horse PikeWork, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes. Amenities Include:Large Floor PlansCable HookupPlaygroundPoolW\/W CarpetingDishwasherAir ConditioningGas & Heat IncludedPrivate EntrancesPublic TransportationCeiling FanLaundry FacilitiesCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/r2dx5bjj\/laurelton-village*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":7.0,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available may 28', 'apartment', 'laundry on site', 'off-street parking']","posted_date":"2022-05-07T11:11:35-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-gas-heat-24-emergency-service\/7480663895.html","post_id":7480663895,"result_date":"2022-05-07 11:14","title":"Gas Heat, 24 Emergency Service, Clubhouse","description":"We are located in Blackwood New Jersey and close to the Philadelphia area. We offer spacious one and two bedroom apartment floor plans to choose from so you can find your perfect home for your family. Another great reason to live at Washington Way apartments is that each apartment has its own  balcony or patio overlooking our beautiful park like views.At Washington Way Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails. Our community enjoys hosting seasonal resident events for our residents with extended pool hours and DJ, food and raffles for a great way to meet your neighbors.At Washington Way Apartments consider our great location in Blackwood, NJ. Located in the top ten Washington Township School District, Your children enjoy a top rated education being one of the best school districts in the state. Our residents enjoy the convenient access to Routes I-295, and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Sicklerville, Deptford, and Turnersville, and the new Outlet Mall that just opened locally. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Washington Way Apartments today.\n-Dishwasher\n-Swimming Pool\n-Public Transportation\n-Gas Heat\n-Cable Hookup\n-Small Pets Welcome\n-Fitness Center\n-Air Conditioner\n-Playground\n-24 Emergency Service\n-Clubhouse\n-Patio’s or Balconies\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/mtxuprkn\/washington-way\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.7901,"lng":-75.0367,"attrs":"['2BR \/ 1Ba', '1005ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking']","posted_date":"2022-05-07T11:10:35-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-luxury-living-in-the-heart\/7480663268.html","post_id":7480663268,"result_date":"2022-05-07 11:13","title":"Luxury living in the heart of Woodbridge","description":"Up to 2months free! make it your sanctuary now!! Downtown living in Woodbridge with tons of attractions just minutes away. Transit is nearby, NY is located less than 30 miles northeast of Woodbridge, making it an ideal location for commuters. Charming subarban town with tons of retail stores, Woodbridge mall, Merrill park and many more attractions.Rt1 , GSP, NJ Turnpike are just minutes away from this stunning building.  Amenties include: Resort-style Pool & Landscaped Courtyard, Private BBQs & Outdoor Dining Area, Outdoor Fire Pit, Outdoor Screening Area, Resident Lounge with Fireplace, Bar & Lounge Seating, Billiards & Shuffleboard, State-of-the-art Fitness Center, Demonstration Kitchen, Full-size Laundry Rooms, Package Room with Smart Lock Entry, Bike Storage, Covered On-site Parking, 10,000 SF of On-site Retail, in unit W\/D, and much much more!  Texcall\/email  Annie to schedule a showing today!!  show contact info","num_images":18.0,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T11:09:16-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-luxury-living-in-the-heart\/7480663056.html","post_id":7480663056,"result_date":"2022-05-07 11:12","title":"Luxury living in the heart of Woodbridge","description":"Up to 2months free! make it your sanctuary now!! Downtown living in Woodbridge with tons of attractions just minutes away. Transit is nearby, NY is located less than 30 miles northeast of Woodbridge, making it an ideal location for commuters. Charming subarban town with tons of retail stores, Woodbridge mall, Merrill park and many more attractions.Rt1 , GSP, NJ Turnpike are just minutes away from this stunning building.  Amenties include: Resort-style Pool & Landscaped Courtyard, Private BBQs & Outdoor Dining Area, Outdoor Fire Pit, Outdoor Screening Area, Resident Lounge with Fireplace, Bar & Lounge Seating, Billiards & Shuffleboard, State-of-the-art Fitness Center, Demonstration Kitchen, Full-size Laundry Rooms, Package Room with Smart Lock Entry, Bike Storage, Covered On-site Parking, 10,000 SF of On-site Retail, in unit W\/D, and much much more!  Texcall\/email  Annie to schedule a showing today!!  show contact info","num_images":18.0,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T11:08:51-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-luxury-living-in-the-heart\/7480662829.html","post_id":7480662829,"result_date":"2022-05-07 11:12","title":"Luxury living in the heart of Woodbridge","description":"Up to 2months free! make it your sanctuary now!! Downtown living in Woodbridge with tons of attractions just minutes away. Transit is nearby, NY is located less than 30 miles northeast of Woodbridge, making it an ideal location for commuters. Charming subarban town with tons of retail stores, Woodbridge mall, Merrill park and many more attractions.Rt1 , GSP, NJ Turnpike are just minutes away from this stunning building.  Amenties include: Resort-style Pool & Landscaped Courtyard, Private BBQs & Outdoor Dining Area, Outdoor Fire Pit, Outdoor Screening Area, Resident Lounge with Fireplace, Bar & Lounge Seating, Billiards & Shuffleboard, State-of-the-art Fitness Center, Demonstration Kitchen, Full-size Laundry Rooms, Package Room with Smart Lock Entry, Bike Storage, Covered On-site Parking, 10,000 SF of On-site Retail, in unit W\/D, and much much more!  Texcall\/email  Annie to schedule a showing today!!  show contact info","num_images":18.0,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T11:08:22-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-luxury-living-in-the-heart\/7480662626.html","post_id":7480662626,"result_date":"2022-05-07 11:11","title":"Luxury living in the heart of Woodbridge","description":"Up to 2months free! make it your sanctuary now!! Downtown living in Woodbridge with tons of attractions just minutes away. Transit is nearby, NY is located less than 30 miles northeast of Woodbridge, making it an ideal location for commuters. Charming subarban town with tons of retail stores, Woodbridge mall, Merrill park and many more attractions.Rt1 , GSP, NJ Turnpike are just minutes away from this stunning building.  Amenties include: Resort-style Pool & Landscaped Courtyard, Private BBQs & Outdoor Dining Area, Outdoor Fire Pit, Outdoor Screening Area, Resident Lounge with Fireplace, Bar & Lounge Seating, Billiards & Shuffleboard, State-of-the-art Fitness Center, Demonstration Kitchen, Full-size Laundry Rooms, Package Room with Smart Lock Entry, Bike Storage, Covered On-site Parking, 10,000 SF of On-site Retail, in unit W\/D, and much much more!  Texcall\/email  Annie to schedule a showing today!!  show contact info","num_images":18.0,"lat":40.556,"lng":-74.2845,"attrs":"['0BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T11:07:59-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/old-bridge-convenient-location-and\/7480659727.html","post_id":7480659727,"result_date":"2022-05-07 11:06","title":"Convenient location and luxury living in Old Bridge","description":"No broker fee..LEASING SPECIALS · 1 Month free on 13 month leases · 2 Months free on 26 month leases · $1000 Credit on 1st floor apartments · $1000 Credit on 1 bedrooms.\nLocated in a convenient location. Tons of retail stores, restaurants, shopping malls are just a 10 minutes drive away.\nAmenities include, in unit w\/d, 9’ ceilings, huge closet space, private outdoor space, stainless steel appliances, on-site parking, bbq places and fire pits, outside pool and so much more!\nPlease call\/text\/email Annie to schedule a showing.  show contact info\n.\n","num_images":4.0,"lat":40.398,"lng":-74.3236,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T11:02:13-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-pet-washing-station-valet\/7480635885.html","post_id":7480635885,"result_date":"2022-05-07 11:02","title":"Pet-washing Station, Valet Parking, Latch Keyless Access","description":"101 dupont place draws from the elegance of yesterday paired with the conveniences of today to create the first luxury living experience within the iconic Dupont Building in downtown Wilmington, DE. Each studio, one, two, and three bedroom apartment at 101 dupont place is appointed with state-of-the-art features that will exceed your expectations around every corner. With a variety of floor plans and an abundance of amenities, you are sure to find a home that meets your needs and elevates your lifestyle at 101 dupont place.\n-Brass Bathroom Fixtures & Backlit Vanity Mirrors\n-Coworking Space\n-Valet Parking\n-Latch Keyless Access\n-Quartz Kitchen Countertops, Islands, or Breakfast Bars\n-Nest Wifi-Enabled Smart Thermostat\n-Custom Kitchens\n-Smart Thermostats\n-Glass Shower or Soaking Tub\n-Rooftop Deck\n-In-Unit Washer & Dryer\n-Movie Theater\nCall:  show contact info\nFor more information, visit us at: https:\/\/livebpgroup.net\/btptkxf6\/101-dupont-place\n","num_images":9.0,"lat":39.7378,"lng":-75.5497,"attrs":"['1BR \/ 1Ba', '772ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'valet parking', 'wheelchair accessible']","posted_date":"2022-05-07T10:10:39-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-gorgeous-ranch-style-home-in\/7480618904.html","post_id":7480618904,"result_date":"2022-05-07 10:50","title":"@@GORGEOUS RANCH STYLE home in hempfield SCHOOL district@@","description":"GORGEOUS ranch style home in Hempfield school DISTRICT!  Located a short drive down MARIETTA Ave to LANCASTER city, and easy access to nearby SHOPPING.  The home sits on a nice corner lot with plenty of BACKYARD space to enjoy the warm summer EVENINGS.  Enjoy the large eat-in kitchen with CORIAN COUNTERTOPS and flat top range.  Take ADVANTAGE of the SPACIOUS living room with newer LAMINATE floors and a brand new bay WINDOW providing ample NATURAL LIGHT.  There are three good sized bedrooms (second bedroom has been turned into a laundry but could easily be CONVERTED back).  Head down to the basement to an additional family room, PLAYROOM and plenty of STORAGE SPACE.\nOk Pets. No Smoking. $900\/month. $900 SECURITY DEPOSIT\nOwner pay TRASH, sewer, and water. TENNANTS are responsible FOR ALL ELECTRIC and gas.\nCall: show contact info\nwith listing address, contact information and best time to call for speedy process\n","num_images":6.0,"lat":40.0766,"lng":-76.3107,"attrs":"['3BR \/ 2Ba', '1658ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: other', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T09:30:27-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-newly-built-3bed-1bath\/7480643678.html","post_id":7480643678,"result_date":"2022-05-07 10:46","title":"Newly Built 3bed 1bath","description":"Forget your worries in this spacious and serene space. Follow the directions to access, and tour instantly.Kitchen features beautiful quartz counter tops, stainless steel appliance, and more. Great room is perfect for entertaining guests as the living room flows into the kitchen... Contact Mr Johnson on  show contact info\nfor more info concerning the home...","num_images":13.0,"lat":40.251,"lng":-74.7627,"attrs":"['3BR \/ 1Ba', '1296ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-07T10:28:45-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-gorgeous-ranch-style-home-in\/7480618186.html","post_id":7480618186,"result_date":"2022-05-07 10:41","title":"@@GORGEOUS RANCH STYLE home in hempfield SCHOOL district@@","description":"GORGEOUS ranch style home in Hempfield school DISTRICT!  Located a short drive down MARIETTA Ave to LANCASTER city, and easy access to nearby SHOPPING.  The home sits on a nice corner lot with plenty of BACKYARD space to enjoy the warm summer EVENINGS.  Enjoy the large eat-in kitchen with CORIAN COUNTERTOPS and flat top range.  Take ADVANTAGE of the SPACIOUS living room with newer LAMINATE floors and a brand new bay WINDOW providing ample NATURAL LIGHT.  There are three good sized bedrooms (second bedroom has been turned into a laundry but could easily be CONVERTED back).  Head down to the basement to an additional family room, PLAYROOM and plenty of STORAGE SPACE.\nOk Pets. No Smoking. $900\/month. $900 SECURITY DEPOSIT\nOwner pay TRASH, sewer, and water. TENNANTS are responsible FOR ALL ELECTRIC and gas.\nCall: show contact info\nwith listing address, contact information and best time to call for speedy process\n","num_images":5.0,"lat":40.0766,"lng":-76.3107,"attrs":"['3BR \/ 2Ba', '1658ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: other', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T09:28:41-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/east-brunswick-luxury-apartment-with\/7480614096.html","post_id":7480614096,"result_date":"2022-05-07 10:32","title":"Luxury apartment with gym, pool and more!!","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21.0,"lat":40.4284,"lng":-74.4064,"attrs":"['1BR \/ 1Ba', '851ft2', 'available now', '\\nsaturday 2022-05-07\\n', '\\nsunday 2022-05-08\\n', '\\nmonday 2022-05-09\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T09:16:48-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-playground-patios-or\/7480639184.html","post_id":7480639184,"result_date":"2022-05-07 10:22","title":"Playground, Patio’s or Balconies, Public Transportation","description":"We are located in Blackwood New Jersey and close to the Philadelphia area. We offer spacious one and two bedroom apartment floor plans to choose from so you can find your perfect home for your family. Another great reason to live at Washington Way apartments is that each apartment has its own  balcony or patio overlooking our beautiful park like views.At Washington Way Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails. Our community enjoys hosting seasonal resident events for our residents with extended pool hours and DJ, food and raffles for a great way to meet your neighbors.At Washington Way Apartments consider our great location in Blackwood, NJ. Located in the top ten Washington Township School District, Your children enjoy a top rated education being one of the best school districts in the state. Our residents enjoy the convenient access to Routes I-295, and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Sicklerville, Deptford, and Turnersville, and the new Outlet Mall that just opened locally. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Washington Way Apartments today.\n-Cable Hookup\n-Disposal\n-Swimming Pool\n-Fitness Center\n-Ceiling Fans\n-Small Pets Welcome\n-Air Conditioner\n-Patio’s or Balconies\n-Clubhouse\n-24 Emergency Service\n-Dishwasher\n-Courtyard\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/j5knzmz3\/washington-way\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8.0,"lat":39.7901,"lng":-75.0367,"attrs":"['2BR \/ 1Ba', '950ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking']","posted_date":"2022-05-07T10:18:10-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/east-brunswick-luxury-apartment-with\/7480613242.html","post_id":7480613242,"result_date":"2022-05-07 10:20","title":"Luxury apartment with gym, pool and more!!","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21.0,"lat":40.4284,"lng":-74.4064,"attrs":"['1BR \/ 1Ba', '703ft2', 'available now', '\\nsaturday 2022-05-07\\n', '\\nsunday 2022-05-08\\n', '\\nmonday 2022-05-09\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T09:14:13-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mount-royal-convenient-location-dog\/7480637795.html","post_id":7480637795,"result_date":"2022-05-07 10:19","title":"Convenient Location, Dog Park, Minutes from 295","description":"Heather Ridge Apartments, managed by Panco Management\n454 Heather Drive\nMantua, NJ 08051\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/heatherridgeapts.net\nYou will love living at Heather Ridge! Call today!\nGreat one bedroom one bathroom apartment with washer dryer, large walk in closet in bedroom and off the living room and more!","num_images":18.0,"lat":39.806488,"lng":-75.177315,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-07T10:15:04-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/ocean-city-enjoy-your-stay-only-steps\/7480627323.html","post_id":7480627323,"result_date":"2022-05-07 10:02","title":"Enjoy your stay only steps away from the Ocean City.","description":"Enjoy your stay only steps away from the Ocean City boardwalk and beach! With plenty of space to enjoy, this lovely third floor unit is the perfect getaway for those looking for a peaceful and family friendly vacation. This place comes with everything you need to relax and unwind; the only thing missing is you and the ones you love. Pets welcome! Includes: Utilities, Cable, WiFi, Washer, Dryer, Kitchenware, and Linens!\nCALL----  show contact info\n.\n.\n.\n.\n..\n.\n.\n..\n.\n.\n..\n.\n.\n.\n.\n..\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n..\n.\n.\n.\n.\n..\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.This gorgeous, large studio apartment is nestled at the Hollywood foothills, just steps from all the great restaurants, bars, shops, and many of L.A.'s world-famous attractions, including the Hollywood Bowl, the Hollywood and Highland Center, the Hollywood farmers market, and the Walk of Fame. Your new home will also be close to outdoor recreation like hiking trails such as Runyon Canyon and Griffith. Getting around LA is easy. Its proximity to the 101 freeway lets you hop over to Silverlake, Echo Park, DTLA or even the valley in minutes. You are also a quick drive away from all that West Hollywood has to offer! The Metro Red Line station is a walk away as well.\nThe apartment was recently treated to a full remodel, and EVERYTHING was redone! Enjoy updated hardwood throughout, the updated kitchen with granite countertops, and stainless-steel appliances including a dishwasher! The bathroom is remodeled too. The apartment features recessed lighting and updated fixtures throughout. The windows have been replaced with large double-pane windows that let in plenty of light, but not sound! The unit also features plenty of storage space with multiple closets.\nThis apartment comes with in-unit laundry and an assigned parking spot just steps from your front door!\n===================Looking for a great apartments to rent in Santa Clarita, California? River Ranch Townhomes, located off Antelope Valley Freeway and Sierra Highway, provides easy access to noteworthy shopping and dining opportunities. Just to the west, Six Flags Magic Mountain supplies endless enjoyment for kids of all ages. Head to Vasquez Rocks Interpretive Center to visit their museum and do some hiking or rock climbing.\nAMENITIES AND FEATURES\n-Two Relaxing Whirlpool Spas\n-Convenient Guest Parking\n-Tranquil Landscaping\n-Spectacular Hillside Vistas\n-Extra Large Balcony or Patio\n-Two Resort Style Swimming Pools\n-Central Air Conditioning\n-Private Two Car Garage\n-Close to Shopping\n-Fully Equipped Fitness & Cardiovascular Center\n-Two Children's Playgrounds\n-Ceramic Tile Entry Floors\n************Welcome To***************\nApartments for Rent in Westwood, CA| Axiom Westwood\nWelcome to Axiom Westwood, offering apartments for rent in an ideal location. Our community of studio, one, and two-bedroom homes provides modern comforts and classic style so that you’ll feel right at home immediately upon move-in.\nOur assortment of spacious floor plans allows you to choose the style and fit that works for you. Experience spacious, open-concept layouts fully equipped with attractive amenities and luxe interior features that give your home a uniquely personal feel. Indulge in gourmet-style kitchens, light-filled living rooms, and expansive master bedrooms, plus your own private patio or balcony where you can enjoy the sunshine and fresh breeze.\nThroughout our community, you’ll find convenient resident features and amenities designed to complement your active lifestyle. Cool off at the sparkling swimming pool on sunny days, and utilize the common areas to get some work done or mingle with new friends and neighbors. On-site management is here to take of your every need, and convenient transportation options make your daily commute seamless.\nLocated adjacent to UCLA, you’ll have endless options when it comes to dining, shopping, and entertainment. Explore Westwood with ease, and return each day to your oasis in the center of it all. Contact us to learn more about our apartments at Westwood Axiom.\nProfessionally Managed by Cirrus Asset Management, Inc., CA - License # 01834798\nContact Us\n-Covered Parking\n-Laundry Facilities\n-Pool\n-Quartz Countertops in Kitchens & Baths\n-Fireplace\n-Off Street Parking\n-Large Patios\/Balconies\n-WiFi Available in Common Areas\n-On-Site Maintenance\n-Cable Ready\n-Full-size Kitchens\n-Elevator\n","num_images":3.0,"lat":39.2709,"lng":-74.5875,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T09:51:15-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/ocean-city-enjoy-your-stay-only-steps\/7480627493.html","post_id":7480627493,"result_date":"2022-05-07 10:00","title":"Enjoy your stay only steps away from the Ocean City.","description":"Enjoy your stay only steps away from the Ocean City boardwalk and beach! With plenty of space to enjoy, this lovely third floor unit is the perfect getaway for those looking for a peaceful and family friendly vacation. This place comes with everything you need to relax and unwind; the only thing missing is you and the ones you love. Pets welcome! Includes: Utilities, Cable, WiFi, Washer, Dryer, Kitchenware, and Linens!\nCALL----  show contact info\n.\n.\n.\n.\n..\n.\n.\n..\n.\n.\n..\n.\n.\n.\n.\n..\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n..\n.\n.\n.\n.\n..\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.This gorgeous, large studio apartment is nestled at the Hollywood foothills, just steps from all the great restaurants, bars, shops, and many of L.A.'s world-famous attractions, including the Hollywood Bowl, the Hollywood and Highland Center, the Hollywood farmers market, and the Walk of Fame. Your new home will also be close to outdoor recreation like hiking trails such as Runyon Canyon and Griffith. Getting around LA is easy. Its proximity to the 101 freeway lets you hop over to Silverlake, Echo Park, DTLA or even the valley in minutes. You are also a quick drive away from all that West Hollywood has to offer! The Metro Red Line station is a walk away as well.\nThe apartment was recently treated to a full remodel, and EVERYTHING was redone! Enjoy updated hardwood throughout, the updated kitchen with granite countertops, and stainless-steel appliances including a dishwasher! The bathroom is remodeled too. The apartment features recessed lighting and updated fixtures throughout. The windows have been replaced with large double-pane windows that let in plenty of light, but not sound! The unit also features plenty of storage space with multiple closets.\nThis apartment comes with in-unit laundry and an assigned parking spot just steps from your front door!\n===================Looking for a great apartments to rent in Santa Clarita, California? River Ranch Townhomes, located off Antelope Valley Freeway and Sierra Highway, provides easy access to noteworthy shopping and dining opportunities. Just to the west, Six Flags Magic Mountain supplies endless enjoyment for kids of all ages. Head to Vasquez Rocks Interpretive Center to visit their museum and do some hiking or rock climbing.\nAMENITIES AND FEATURES\n-Two Relaxing Whirlpool Spas\n-Convenient Guest Parking\n-Tranquil Landscaping\n-Spectacular Hillside Vistas\n-Extra Large Balcony or Patio\n-Two Resort Style Swimming Pools\n-Central Air Conditioning\n-Private Two Car Garage\n-Close to Shopping\n-Fully Equipped Fitness & Cardiovascular Center\n-Two Children's Playgrounds\n-Ceramic Tile Entry Floors\n************Welcome To***************\nApartments for Rent in Westwood, CA| Axiom Westwood\nWelcome to Axiom Westwood, offering apartments for rent in an ideal location. Our community of studio, one, and two-bedroom homes provides modern comforts and classic style so that you’ll feel right at home immediately upon move-in.\nOur assortment of spacious floor plans allows you to choose the style and fit that works for you. Experience spacious, open-concept layouts fully equipped with attractive amenities and luxe interior features that give your home a uniquely personal feel. Indulge in gourmet-style kitchens, light-filled living rooms, and expansive master bedrooms, plus your own private patio or balcony where you can enjoy the sunshine and fresh breeze.\nThroughout our community, you’ll find convenient resident features and amenities designed to complement your active lifestyle. Cool off at the sparkling swimming pool on sunny days, and utilize the common areas to get some work done or mingle with new friends and neighbors. On-site management is here to take of your every need, and convenient transportation options make your daily commute seamless.\nLocated adjacent to UCLA, you’ll have endless options when it comes to dining, shopping, and entertainment. Explore Westwood with ease, and return each day to your oasis in the center of it all. Contact us to learn more about our apartments at Westwood Axiom.\nProfessionally Managed by Cirrus Asset Management, Inc., CA - License # 01834798\nContact Us\n-Covered Parking\n-Laundry Facilities\n-Pool\n-Quartz Countertops in Kitchens & Baths\n-Fireplace\n-Off Street Parking\n-Large Patios\/Balconies\n-WiFi Available in Common Areas\n-On-Site Maintenance\n-Cable Ready\n-Full-size Kitchens\n-Elevator\n","num_images":3.0,"lat":39.2709,"lng":-74.5875,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T09:51:40-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-paid-gas-water-laundry\/7480626884.html","post_id":7480626884,"result_date":"2022-05-07 09:54","title":"Paid Gas & Water, Laundry facilities, Free Fitness Center","description":"At Lakeview Apartment homes, you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails which are pet friendly. You can enjoy Lakeview’s health and fitness center, or join friends for a game at our tennis or basketball courts. We have thought of everything for your convenience with our on-site deli and convenience store, playground, and picnic area. Our community takes pride in hosting events for our residents for a great way to meet your neighbors.  We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.  For a great deal on our apartment home rentals contact Lakeview Apartments today.\n-Gas range\n-Pets\n-Refrigerator\n-Blinds\n-Garage\n-Picnic area\n-Public transportation\n-Air conditioning\n-Laundry facilities\n-Playground\n-Patio\n-Washer\/dryer\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/jc7o6fa5\/lakeview-apartments\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":16.0,"lat":39.7901,"lng":-75.0367,"attrs":"['1BR \/ 1Ba', '825ft2', 'available may 20', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T09:50:11-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-air-conditioning-private\/7480624017.html","post_id":7480624017,"result_date":"2022-05-07 09:47","title":"Air Conditioning, Private Entrances, Cable Hookup","description":"Work, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes.\n-Air Conditioning\n-Large Floor Plans\n-Pets Welcome\n-Dishwasher\n-Public Transportation\n-W\/W Carpeting\n-Gas & Heat Included\n-Pool\n-Playground\n-Cable Hookup\n-Laundry Facilities\n-Private Entrances\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/l7arko7x\/laurelton-village\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":7.0,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available may 28', 'apartment', 'laundry on site', 'off-street parking']","posted_date":"2022-05-07T09:43:19-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-bedroom-bathroom\/7480614363.html","post_id":7480614363,"result_date":"2022-05-07 09:35","title":"1 Bedroom & 1 Bathroom","description":"Large Historic Building with 1st Floor 1 Bedroom Apartment. NO SMOKING so skip me if you are a smoker! Living room and Bedroom have 12 foot ceilings with ceiling fans with lights. 5 Foot Walk in Closet with double hanging for bedroom. Kitchen has large NEW refrigerator and a gas stove. Back porch with entry to rear courtyard. It's all yours. I pay UGI gas heat, water, sewer, trash and recycling. You pay Electric and gas for the stove. Neighborhood has laundrymat across street. ( Mennonite owner) Close to CC Reading but close to highways. We have lots of closet and cabinet space in kitchen and porch. Our Neighbors are very helpful. On street permit parking . Security Deposit and first month required. Electric and gas for stove in your name before move in.","num_images":4.0,"lat":40.3306,"lng":-75.9192,"attrs":"['1BR \/ 1Ba', '564ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-07T09:17:39-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-convenient-location-tree\/7480619127.html","post_id":7480619127,"result_date":"2022-05-07 09:34","title":"Convenient Location, Tree Lined Streets, Great Views","description":"Top of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nThis community features tennis courts, a pool and fitness center. Call Top of the Hill today!\nGreat studio with patio area and large kitchen.","num_images":8.0,"lat":39.795988,"lng":-75.485192,"attrs":"['0BR \/ 1Ba', '500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no parking']","posted_date":"2022-05-07T09:30:57-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cherry-hill-love-this-building-love\/7480618414.html","post_id":7480618414,"result_date":"2022-05-07 09:33","title":"Love this building! Love this location!","description":"Manchester floor plan — 1,149 sq. ft. — Starting Price $3,095 — Call to get on our waiting list!\nThis 2 bedroom\/2 bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full size front loading washer and dryer, and stainless steel appliances. The large master bedroom is equipped with a private balcony, a walk-in closet and a spacious bathroom with double sink vanity and walk in shower. The second bedroom and bathroom are spacious as well!  This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theater room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T09:29:09-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/somerdale-great-location-in-great\/7480614643.html","post_id":7480614643,"result_date":"2022-05-07 09:22","title":"Great Location in a Great Community","description":"Fox Pointe Apartment Homes\nProperty Address\n220A Dobbs Drive, ,\nHi-Nella, NJ, 08083\nhttp:\/\/livefoxpointe.com\/su\/2b8s4w\nTake advantage of relaxed living in a great location with our deals on 2 bed 1 bath apartments. With rents as low as $1,605.00, these spacious 847 Sq. Ft. square foot floor plans won't be available for long. Call or stop by today!\nFloor Plan Details\nName: B1K\n2 Bedrooms \/ 1 Bathrooms\n847 Sq. Ft.\n$1,605.00 - $2,170.00\nCommunity Amenities\nOnline Rent Payment and Resident Portal\n24 Hour Emergency Maintenance\nPet Friendly\nNew Fitness Center-AION Fit\nOnsite Management Office\nOnline Maintenance Requests\nLovely Landscaped Grounds\nSundeck - AION Cabana\nLaundry Centers Onsite\nPool - AION Splash\nOff Street Parking\nPet Policy\nAION allows residents to have dogs, cats and service animals.  All animals must be housebroken.  No breeding of any permitted animal is allowed. Additionally, the following breeds of dogs are not permitted or any mix of these breeds of dogs where the following breeds are 50% or more in your dog and verified by veterinary report:  German Shepherds  Akitas,  Chow Terriers or Chow breed mixes,  American Bulldogs, Bull Staff or Staffordshire Terriers,  Doberman\/Doberman Pinchers, (mini pinchers are permitted)  Rottweiler's,  Wolf dog hybrid,  Pit-bull terriers,  Presa Canario or any variety of Canary dogs. All residents with a pet(s) are required to sign the Pet Addendum and provide vet records and a photo of the pet which should be kept in the resident lease file.\nPet Fees (one-time non-refundable): $400 flat onetime fee (due at move-in) and monthly pet rent is $50 for the 1st pet and an additional $25 for the 2nd pet.  2 Pet maximum.  Breed restriction applies.\nOffice Hours\nMonday - Friday 9:00 A.M. - 6:00 P.M.\n\nSaturday 10:00 A.M. - 5:00 P.M.\n\nProperty Contact\nshow contact info\nADA ACCESSIBLE\nEQUAL HOUSING OPPORTUNITY\n","num_images":11.0,"lat":39.84,"lng":-75.0309,"attrs":"['2BR \/ 1Ba', '847ft2', 'available jun 30', 'application fee details: $50 app fee $200 holding fee', 'flooring: carpet', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-07T09:18:31-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/egg-harbor-township-newly-built-4bed\/7480610483.html","post_id":7480610483,"result_date":"2022-05-07 09:15","title":"Newly Built 4bed 2bath","description":"Forget your worries in this spacious and serene space. Follow the directions to access, and tour instantly.Kitchen features beautiful quartz counter tops, stainless steel appliance, and more. Great room is perfect for entertaining guests as the living room flows into the kitchen... Contact Mr Johnson on  show contact info\nfor more info concerning the home...","num_images":13.0,"lat":39.3741,"lng":-74.6118,"attrs":"['4BR \/ 2Ba', '1560ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-07T09:05:40-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/pleasantville-immediate-occupancy\/7480603396.html","post_id":7480603396,"result_date":"2022-05-07 08:45","title":"Immediate Occupancy","description":"New kitchen,  Just painted through out, Brand New carpeting in both bedrooms.  Deck overlooks a private wooded area.  The building is the closest to the swim club and jacuzzi.  2 Beds 1 bath","num_images":0.0,"lat":39.387598,"lng":-74.564334,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available may 15', 'air conditioning', 'application fee details: Background Check $35', 'flooring: wood', 'condo', 'w\/d in unit', 'street parking', 'rent period: yearly']","posted_date":"2022-05-07T08:41:30-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-3bedroom-bath\/7480597753.html","post_id":7480597753,"result_date":"2022-05-07 08:23","title":"3Bedroom 1 Bath","description":"AVAILABLE 5\/16\/2022. Apply\nhttps:\/\/chancedel.managebuilding.com\/Resident\/rental-application\/new\nSection 8, SRAP, Military Vouchers welcome.\nPLEASE READ BEFORE YOU APPLY\nDrive by the house and the area first and then apply.\nApplication fee $45 Non refundable\nNO EVICTION RECORD\nExcellent past Rent history.\nNo smoking No criminal record.\nIncome $3000 or more\nVoucher must cover rent 90% or more\nRenter Pays for all Utilities","num_images":12.0,"lat":39.75277,"lng":-75.534766,"attrs":"['3BR \/ 1Ba', '1125ft2', 'available may 16', 'air conditioning', 'application fee details: $45', 'flooring: wood', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking']","posted_date":"2022-05-07T08:19:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/chester-apartment\/7480837181.html","post_id":7480837181,"result_date":"2022-05-07 17:10","title":"Apartment","description":"Newly renovated property two apartments building fresh paint and admenities. Very clean and close to highway and transportation.","num_images":6.0,"lat":39.831824,"lng":-75.389449,"attrs":"['1BR \/ 1Ba', 'application fee details: 20 dollars', 'flooring: carpet', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-07T17:06:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-newly-renovated\/7480825135.html","post_id":7480825135,"result_date":"2022-05-07 16:49","title":"3 bed\/2 Bath newly renovated townhome for rent","description":"Newly renovated 3 bed\/2 bath; just a couple blocks from downtown Main Street in Manayunk. Enjoy your own private, fenced in backyard. New flooring throughout and ***CENTRAL A\/C***.","num_images":24.0,"lat":40.0226,"lng":-75.2148,"attrs":"['3BR \/ 2Ba', '1300ft2', 'available now', 'air conditioning', 'application fee details: $42 to complete application. Amount deducted from 1st month’s rent', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: other', 'townhouse', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: yearly']","posted_date":"2022-05-07T16:36:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-efficient-appliances-on\/7480821881.html","post_id":7480821881,"result_date":"2022-05-07 16:32","title":"Efficient Appliances, On-Site Management, NEST Learning Thermostats","description":"Bedrooms: 1Bathrooms: 1Square Feet: 647Date Available: 2022-05-07Address: 631 N Broad StThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past. Amenities Include:Peloton RoomLatchOS technology lock systemControlled Access\/GatedGas RangeElevatorPet friendlyHardwood FloorsEnergy-efficient, gas-powered HVACRoof DeckHistoric BuildingRecyclingBike RoomCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/zh54cten\/stable-lofts\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['1BR \/ 1Ba', '647ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T16:28:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-electronic-thermostat\/7480814118.html","post_id":7480814118,"result_date":"2022-05-07 16:14","title":"Electronic Thermostat, State-of-the-Art Fitness Center, Washer\/Dryer","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1046Date Available: 2022-05-07Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:DishwasherElevatorCentral Air ConditioningRecyclingWasher\/DryerOn-Site MaintenanceElectronic ThermostatLatch Security SystemMicrowaveHardwood FloorsBike StorageExtra StorageCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/tdb6axan\/fairmount-north\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['2BR \/ 2Ba', '1046ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T16:10:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-perfect-location-direct-access\/7480813753.html","post_id":7480813753,"result_date":"2022-05-07 16:13","title":"Perfect Location, Direct Access Garages, Fitness Center","description":"VIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nThe Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nYou will love living at The Point at Pennbrook Station. From our prime location in Lansdale, PA, you can easily travel to North Wales, Hatfield, Blue Bell, City Center Philadelphia, and the Philadelphia International Airport. Visit us today!\nThis second floor two bedroom two bathroom apartment features a fully equipped kitchen with island, coat closet, walk-in closets, washer\/dryer, two porches, and direct access to the garage downstairs!\nCommunity Features\n* WiFi Access\n* Community Kitchen\n* Package Acceptance\n* Garage Parking\n* Sun Deck\n* Fitness Studio\n* Bark Park\n* Short Term Lease Available\n* After-Hours Emergency Maintenance\n* Minutes from Restaurants, Shopping, and Much More\n* Community Lounge\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Easy Freeway Access\n* Easy Access to Public Transportation\n* Swimming Pool\n* Outdoor Grill Area","num_images":11.0,"lat":40.226234,"lng":-75.283466,"attrs":"['1BR \/ 1Ba', '755ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-07T16:09:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-latchos-technology-lock\/7480806071.html","post_id":7480806071,"result_date":"2022-05-07 15:56","title":"LatchOS technology lock system, Controlled Access\/Gated, Bike Room","description":"Bedrooms: 0Bathrooms: 1Square Feet: 507Date Available: 2022-05-07Address: 631 N Broad StThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past. Amenities Include:Efficient AppliancesGas RangeClementine's Stable CafeLatchOS technology lock systemRecyclingHardwood FloorsLuxer Package RoomPet friendlyHistoric BuildingControlled Access\/GatedElevatorBike RoomCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/zvyrxsjt\/stable-lofts\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['0BR \/ 1Ba', '507ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T15:52:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/maple-shade-professionals-work-in\/7480805520.html","post_id":7480805520,"result_date":"2022-05-07 15:54","title":"Professionals! Work in Philly but dont want to live there?","description":"Beautiful second floor condo for rent, one bdrm,, one bath (new). Two walk in closets in bdrm. Private enclosed balcony. Small community in a quiet safe area, but not far from the bridges. Close to philly hospitals and also south jersey hospitals. Contact me for a showing. Please provide current place of residence and reason for leaving, employment history , credit score .","num_images":0.0,"lat":39.9511,"lng":-74.9946,"attrs":"['1BR \/ 1Ba', '780ft2', 'available jul 1', 'flooring: carpet', 'condo', 'w\/d in unit', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-07T15:50:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-on-site-maintenance\/7480798026.html","post_id":7480798026,"result_date":"2022-05-07 15:37","title":"On-Site Maintenance, Electronic Thermostat, Roof Deck","description":"Bedrooms: 1Bathrooms: 1Square Feet: 619Date Available: 2022-05-07Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:Extra StorageQuartz CountertopsRoof DeckLatch Security SystemOn-Site MaintenanceCentral Air ConditioningWasher\/DryerOn-Site ManagementRecyclingState-of-the-Art Fitness CenterElectronic ThermostatDishwasherCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/bfsg7oif\/fairmount-north\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['1BR \/ 1Ba', '619ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T15:33:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studios-available-in-mid\/7480797796.html","post_id":7480797796,"result_date":"2022-05-07 15:37","title":"Studios Available in Mid-July!! Heat\/Water Included!!!","description":"Sunny, studio apartments becoming available in mid-July!!! Monthly rents starting at $1,035. Apartments feature  upgraded kitchens and baths, large windows and 9 ft. ceilings. Ask about our NO SECURITY DEPOSIT program!! Cats are welcome (add'l fee)! All apartments are rented unfurnished.\nChancellor Apartments is a convenient high rise apartment community in an amazing location in Center City. We are close to most major schools and universities, public transportation, historical attractions, shopping, restaurants and theaters. Center City at its best!!\nRent includes: heat, hot\/cold water, 24-hour front desk attendant, free bike storage room, package acceptance service, 24-hour emergency maintenance service, on-site smart card laundry plus card access system and BuildingLink resident services portal access for all residents.\nThe Chancellor boasts several different studio and one bedroom floor plans. Apartments feature high ceilings, large bright windows, ceiling fans in most units, hardwood floors and breathtaking views of the Philadelphia skyline and Delaware River. Many apartments have large walk-in closets, too!\nWe have partnered with Optimal Sport Health Club to offer a generous discounted gym membership (we pay your initiation fee!). There are several off street parking lots and garages in the area, too!\nCHANCELLOR APARTMENTS\n206 S. 13th Street\nPhiladelphia, PA 19107\nshow contact info\nFranceina Thorne, REALTOR\nHours:\nMon. - Fri. 8:30 to 5:00\nSaturday - 10:00 to 3:00\nAppointments are highly recommended","num_images":8.0,"lat":39.948681,"lng":-75.162197,"attrs":"['0BR \/ 1Ba', 'available jul 15', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-07T15:33:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-efficient-appliances\/7480789771.html","post_id":7480789771,"result_date":"2022-05-07 15:19","title":"Efficient Appliances, Hardwood Floors, Bike Room","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1038Date Available: 2022-05-07Address: 631 N Broad StThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past. Amenities Include:Hardwood FloorsRoof DeckPeloton RoomClementine's Stable CafeRecyclingNEST Learning ThermostatsControlled Access\/GatedHistoric BuildingGas RangeElevatorLatchOS technology lock systemEnergy-efficient, gas-powered HVACCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/neugynfp\/stable-lofts\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['2BR \/ 2Ba', '1038ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T15:15:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-modern-bed-bath\/7480789185.html","post_id":7480789185,"result_date":"2022-05-07 15:17","title":"Gorgeous & modern 3 bed 3 bath apt w\/ parking space!","description":"3106 Clifford St #1 – Luxury 3 bed 3 bath home with parking space!\nGorgeous luxury 3 bed 3 bath bi-level apt in Brewerytown area, just a block from Fairmount Park is the perfect place to create new memories! This brand new first and sub level unit atop wonderful hardwood flooring is a one half of a 2 unit modern architectural space, curated with an eclectic mixture of contemporary fixtures amidst a ton of amenities for a higher quality of living. Now imagine you live here! The perfect spot to explore the city on foot, bicycle, or however, you choose.\nThe first bedroom (10’7″ x 9’6″) sits at the front part of the main level and while big windows are obvious at first sight, ample closet space are one of its best assets! A full bathroom with a stand up shower also sits on the main level. Discover an extravagant kitchen with quartz countertops, sleek white cabinetry, a breakfast bar and stainless-steel appliances including: a refrigerator, microwave, gas stove, dishwasher–which create an ideal setting for meal preparation. The kitchen and living room area make up a bright and open concept floorplan and just off the living room a back entrance\/exit which leads out to the driveway wherein your own parking space exists to relieve the parking woes we the citizens of Philadelphia have had bestowed upon us.\nThe sublevel includes 2 bedrooms (1 bedroom with an ensuite bathroom) located on opposite ends, closet space, a slate tiled bathroom with a large stand up shower, a stacked washer\/dryer atop hardwood flooring. 2nd bedroom (12’4”x11’8”) located on the front part of the sublevel, includes closet space. 3rd bedroom (12’3”x12’4”) located in the rear of the sublevel as an ensuite bathroom with a tiled stand up shower, as well as, tons of sunlight.\nFeatures:\nCentral Air\/Heat\nWasher Dryer\nParking space\n2 entrances\nDishwasher\nGas stove\n3 full bathrooms\nTons of natural light\n","num_images":13.0,"lat":39.982953,"lng":-75.184969,"attrs":"['3BR \/ 3Ba', 'available now', 'cats are OK - purrr', 'flooring: wood', 'apartment', 'w\/d in unit', 'no smoking', 'street parking']","posted_date":"2022-05-07T15:13:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-perfect-for-temple\/7480785597.html","post_id":7480785597,"result_date":"2022-05-07 15:10","title":"Perfect for Temple Students! Adorable 1 bed 1 bath apt!","description":"1819 W Oxford Street #2 (1R) – 1 bed 1 bath renovated apartment – Available May 5th, 2022\nBeautiful renovated building at 18th and Oxford!!  Super close to main Campus for Temple University, Broad Street for riding the train, Fairmount Park for working out or enjoying nature, and highways for easy access into and out of the City.\nCome see this renovated 1 bedroom 1 bathroom apartment with walk in closet, good natural light, granite counter tops, hardwood floors, new windows, all new electric heat, an intercom system, laundry in the basement and more.\nApartment boasts:\n1 bedroom\n1 bathroom\nWalk in closet\nGranite counter tops\nHardwood floors\nTall ceilings\nGreat natural light\nLaundry on site\nContact Bryan today to schedule your showing.\n","num_images":9.0,"lat":39.978095,"lng":-75.16458,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'flooring: wood', 'apartment', 'laundry on site', 'no smoking', 'street parking']","posted_date":"2022-05-07T15:06:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-convenient-location-in\/7480784639.html","post_id":7480784639,"result_date":"2022-05-07 15:08","title":"Convenient location in Lafayette Hill - Come see our 2 Bed \/ 2 bath!","description":"The Glen at Lafayette Hill Bedroom: 2 | Bathroom: 2Square Footage: 1157 sq ftMonthly Rent: $2366 - $2454 show contact info\nCommunity Description  Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.    Community Amenities✓ 24 Hour Availability✓ Barbecue\/Grill✓ Business Center✓ Cardio Machines✓ Online Services✓ Package Service✓ Pet Friendly✓ Pet Play Area✓ Recycling✓ Renters Insurance Program✓ BBQ Picnic Garden✓ Billiards, Club Lounge, Cafe Area, Library and Community Room✓ Fitness Center w\/ Free Weights, Weight Machines✓ Message Therapist Practice On-site✓ Outdoor Cafe & Coffee Bar✓ Outdoor Patio Lounge✓ Sprinkler System✓ Storage Space✓ Wi-Fi at ClubhouseUnit Features✓ Air Conditioning & Heating✓ Cable Ready✓ Carpet✓ Ceiling Fans (Select Floor Plans)✓ Heating✓ Range, Oven, Disposal, Oven✓ Refrigerator, Freezer and Ice Maker✓ Tub\/Shower✓ Wi-Fi✓ Window Coverings✓ Crown Molding (Select Floor Plans)✓ Dishwasher✓ High Speed Internet Access✓ Linen Closet✓ Tile Floors✓ Trash Compactor✓ Vaulted Ceiling (Select Floor Plans)✓ Walk-In Closets (Select Floor Plans)✓ Washer\/Dryer✓ Wheelchair Accessible (Rooms)  Contact InformationVisit Us: 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.com   Additional DetailsPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthManagement Company: Paradise Management, LLC Price is subject to change without prior noticeAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":18.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: carpet', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-07T15:04:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-desirable-spacious-bedroom\/7480779587.html","post_id":7480779587,"result_date":"2022-05-07 15:07","title":"desirable spacious 3 bedroom home for rent","description":"single on very quiet block-big outdoor deck\/hot tub\/full basement-just perfect for entertaining all your family and friends. Enter the first floor to big formal dining room with bar & marble floors (throughout first floor) , fabulous newer island  kitchen with high end stainless appliances and plenty of cabinet\/counter space. The first level also features large living room with  gas fireplace and bonus room that overlooks yard and opens up to gazebo on deck!!! The upstairs features giant master suite","num_images":6.0,"lat":40.0596,"lng":-75.0818,"attrs":"['3BR \/ 2Ba', '1766ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: tile', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: yearly']","posted_date":"2022-05-07T14:53:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this-great\/7480727428.html","post_id":7480727428,"result_date":"2022-05-07 15:00","title":"@@%%Welcome to this great Rancher Home located.%%@@!!","description":"See life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in your gated community, from the inviting swimming pool to the inspiring fitness center. Take a peek at our photo gallery to see more of what’s waiting for you. R-E_NT___2___0W+N BAD CREDIT IS NO PROBLEAM\nCALL TEXT NOW ☎️📞📞📞  show contact info","num_images":1.0,"lat":40.1166,"lng":-75.0198,"attrs":"['2BR \/ 2Ba', '1501ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-07T13:11:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-microwave-bike-storage\/7480780929.html","post_id":7480780929,"result_date":"2022-05-07 15:00","title":"Microwave, Bike Storage, Hardwood Floors","description":"Bedrooms: 1Bathrooms: 1Square Feet: 506Date Available: 2022-05-07Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:Extra StorageHardwood FloorsBike StorageOn-Site MaintenanceQuartz CountertopsLatch Security SystemDishwasherElevatorRecyclingMicrowaveWasher\/DryerCentral Air ConditioningCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/nedvmdp3\/fairmount-north\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['1BR \/ 1Ba', '506ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T14:56:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-awesome-looking-one-owner\/7480775511.html","post_id":7480775511,"result_date":"2022-05-07 14:48","title":"AWESOME LOOKING ONE OWNER MOVE IN READY 3BDR\/2BA","description":"See life a bit differently from The Landings at Brooks City-Base. Here, thoughtful designs and striking style invite you to settle in and get cozy. Hardwood-style flooring leads you into a cool modern kitchen with stunning granite countertops perfect for prepping meals. Feel like some active fun? Discover a full suite of resort-style amenities in your gated community, from the inviting swimming pool to the inspiring fitness center. Take a peek at our photo gallery to see more of what’s waiting for you.","num_images":1.0,"lat":35.6781,"lng":-84.4312,"attrs":"['3BR \/ 2Ba', 'apartment', 'w\/d hookups', 'off-street parking']","posted_date":"2022-05-07T14:44:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-temple-area-bed-bath-house\/7480769070.html","post_id":7480769070,"result_date":"2022-05-07 14:43","title":"Temple area 3 bed 1 bath house! Make this house your home today!","description":"2217 N Bouvier St – 3 bed 1 bath house – Available April\nLocated just a few blocks north of Temple University and a short walk to the Dauphin subway stop, this section of Philadelphia gives you easy access to all points of the city. Enjoy all that Broad St has to offer and MORE!\nThis beautiful 3 beds 1-bathroom house has all of the touches you need! Enter into a large living\/dining room that catches all the sunlight you need! Your kitchen has full size appliances including a full-sized refrigerator, microwave, dishwasher and gas stove! Hop onto your private back patio and enjoy a nice BBQ with friends and family!\nThe second-floor features three bedrooms with great closet space, and a full bathroom with toilet, vanity and shower stall.\nDon’t forget you have your very own washer and dryer in the basement!\n-3 beds\n-1 bath\n-hardwood floor\n-tile floor\n-dishwasher\n-full sized refrigerator\n-gas stove\n-microwave\n-ceiling fan\n-back patio\n-washer & dryer IN UNIT!\n-and MORE!\n","num_images":11.0,"lat":39.987042,"lng":-75.162055,"attrs":"['3BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'house', 'w\/d in unit', 'no smoking', 'street parking']","posted_date":"2022-05-07T14:31:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-and-bright-bed-bath\/7480771787.html","post_id":7480771787,"result_date":"2022-05-07 14:41","title":"Modern and Bright 2 bed 1 bath apt w\/ parking, W\/D, C\/A & more!","description":"1621 N. 4th Street #6 – Available NOW\nThe Courts at North Fourth.  Fantastic location in Northern Liberties\/Olde Kensington\/ Fishtown for this spacious and brand new luxury 2 Bed 1 Bath apartment with H\/W floors and more.  Located just blocks from the Schmidts Commons, one block from Luna Café and the walkable Germantown Ave, convenience stores, restaurants, bars, grocery stores, and more.  Easy access to highways, public transit, and parking.  This building offers garage parking and HUGE roof deck for all tenants to use.\nCome see why so many people are flocking to this area to call it home.\nThis unit offers a wide open living room\/ kitchen area with hardwood floors, great natural light, and tall ceilings.  The kitchen boasts granite counter tops, breakfast bar, and high end appliance package in stainless steel. The bedrooms are very spacious and offer great closet space.  This truly is a must see apartment boasting the following:\n2 bed 1 bath\nHardwood floors\nS\/S appliances\nWasher and dryer\nCentral air and heat\nGreat Location\nRoof deck for All tenants to use!!.\nGarage Parking Available for $125 per month\nVideo Tour of building: This is not a video of unit 6 but a generic video previously made : https:\/\/www.youtube.com\/watch?v=AfQPyY4k5Xc\nContact us today to schedule your showing.\n","num_images":12.0,"lat":39.97519,"lng":-75.141976,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'no smoking', 'street parking']","posted_date":"2022-05-07T14:37:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-incredible-amenities\/7480768787.html","post_id":7480768787,"result_date":"2022-05-07 14:34","title":"Incredible Amenities, Stylish Features, Lease Today","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nLease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nApartment Features\n* Granite Countertops\n* Wood-Like Floors\n* Private Patio or Private Balcony (on select apartments)\n* Extra Storage\n* Full sized Washer and Dryer in unit","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-07T14:30:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recycling-large-closets-24\/7480768203.html","post_id":7480768203,"result_date":"2022-05-07 14:33","title":"Recycling, Large Closets, 24\/7 Front Desk Attendant","description":"Bedrooms: 1Bathrooms: 1Square Feet: 518Date Available: 2022-05-07Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:RecyclingBike StorageHigh Speed InternetSmart Home FeaturesOn-Site ManagementElevatorRefrigeratorRooftop DeckWindow CoveringsElectronic ThermostatDishwasherFOB Controlled AccessCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/347imlta\/lvl-north\n","num_images":11.0,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '518ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'wheelchair accessible']","posted_date":"2022-05-07T14:29:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7480765358.html","post_id":7480765358,"result_date":"2022-05-07 14:28","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"When you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nCommunity Features\n* Sun Deck\n* Community Lounge\n* Easy Freeway Access\n* Pet Salon\n* TV Lounge\n* Fitness Studio\n* Outdoor Grill Area\n* Yoga Lounge\n* Swimming Pool\n* Professionally Managed\n* Bark Park\n* Minutes from Restaurants, Shopping, and Much More\n* Spa\n* Billiards\n[#9206101]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-07T14:24:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7480763693.html","post_id":7480763693,"result_date":"2022-05-07 14:25","title":"Schedule a Tour, Granite Countertops, Playground","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, master suite, washer\/dryer, walk-in closets, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1210ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-07T14:21:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recycling-large-closets\/7480755575.html","post_id":7480755575,"result_date":"2022-05-07 14:09","title":"Recycling, Large Closets, Parking Garage (Additional Fees)","description":"Bedrooms: 1Bathrooms: 1Square Feet: 551Date Available: 2022-05-07Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:RefrigeratorSmart Home FeaturesPackage ReceivingOn-Site ManagementBike StorageHigh Speed InternetFitness Center w\/ Peloton BikesWindow CoveringsRooftop DeckHardwood FloorsElevatorParking Garage (Additional Fees)Call:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/gx5euloj\/lvl-north\n","num_images":11.0,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '551ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'wheelchair accessible']","posted_date":"2022-05-07T14:05:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-on-site-management\/7480755049.html","post_id":7480755049,"result_date":"2022-05-07 14:08","title":"On-Site Management, Controlled Access\/Gated, Luxer Package Room","description":"Bedrooms: 1Bathrooms: 1Square Feet: 647Date Available: 2022-05-07Address: 631 N Broad StThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past. Amenities Include:Peloton RoomRecyclingLuxer Package RoomClementine's Stable CafeHardwood FloorsOn-Site ManagementNEST Learning ThermostatsBike RoomElevatorPet friendlyGas RangeLatchOS technology lock systemCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/byp3d32x\/stable-lofts\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['1BR \/ 1Ba', '647ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T14:04:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-brand-new-modern-bed\/7480749713.html","post_id":7480749713,"result_date":"2022-05-07 14:08","title":"This brand new, modern 2 bed 2 bath apt is calling your name!","description":"1259 N 23rd St\nThis captivating, brand new Brewerytown area 2 bed 2 bath bi-level luxury apartment is absolutely perfect for you! Come check out this wonders that await in a convenient location just off Girard Ave within walking distance to shopping, bars, restaurants, convenience stores, grocery stores, and more. Located conveniently close to the highway, public transit, Fairmount Park, and the Philadelphia Zoo. An open concept layout with quality appliances & finishes surely leaves a lasting impression. This sun drenched unit boasts tall ceilings, hardwood floors, granite counter tops, stainless steel appliances, new windows, washer and dryer, central air and heat, modern tiled bathrooms and private outdoor space. This is a must see apartment! • Unit boasts: • Hardwood floors • Central air and heat • Tall ceilings • Full size Stainless steel appliances • Dishwasher, microwave, stove, refrigerator • Washer \/ Dryer • Beautiful bathrooms • Spacious rooms • Outdoor space Contact Bryan today to schedule your showing! www.rentals215.com\n","num_images":14.0,"lat":39.974677,"lng":-75.173785,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'flooring: wood', 'apartment', 'w\/d in unit', 'no smoking', 'street parking']","posted_date":"2022-05-07T13:54:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-point-breeze-stupendous\/7480749701.html","post_id":7480749701,"result_date":"2022-05-07 14:07","title":"Point Breeze - Stupendous 2 bed 1 bath apt avail today!","description":"2317 Wharton St unit B available April 2022\nUpdated 2 bedroom 1 bathroom apartment across from Wharton Square Park at 23rd and Wharton Street, situated in the middle of the Point Breeze area. Enjoy the many conveniences this neighborhood has to offer including easy access to the highways, public transit, grocery stores, convenience stores, and more.\nThis beautiful 2 bedroom 1 bathroom unit offers with hardwood floors, central heat, tall ceilings, recessed lighting, fantastic kitchen with full size appliances, and your very own private deck. This is a must see building offering locked storage units for each apartment located in the basement.\nUnit Boasts:\nTall ceilings\nTons of natural light\nRecessed lighting\nGreat closet space\nSpacious kitchen with full size appliances\nPrivate out door space\nLaundry on site\nHardwood floors throughout\nCustom tiled back splash in kitchen\nGreat location with easy parking\nSorry no Dogs allowed. Contact Bryan to schedule your showing today\n","num_images":12.0,"lat":39.936115,"lng":-75.182856,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'flooring: wood', 'apartment', 'w\/d in unit', 'no smoking', 'street parking']","posted_date":"2022-05-07T13:54:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-house-for-you-and\/7480750626.html","post_id":7480750626,"result_date":"2022-05-07 13:59","title":"4 bed 2 bath house for you and yours! Tour today!","description":"1530 N 18th St – Expansive three story 4 bed 2 bath home with HUGE backyard\nRefreshing & sophisticated three story 4 bed 2 bath home situated blocks from the heart beat of Temple U…and it’s just the quality product you’ve been waiting for! Located on N 18th St between Jefferson & W Oxford St this home is only minutes away from all the necessities on Broad St including Fresh Grocer, AMC Theaters, restaurants, banks, cafes, BSL train & Septa public transpo lines and tons more!\nStep into a gracious supersized living room where virturally every classic feature is area meticulously bordered by a classic wrap around staircase; wherein an open & airy environment is accessorized by the ceiling fan from soaring high ceilings, and tall windows exemplify each classic feature with natural light whilst hardwood flooring flows into a massive eat in kitchen. The kitchen space finely features granite countertops, a double door refrigerator, microwave and electric stove among oak cabinetry, as well as enough room for a table and chairs and then some. A massive fenced in backyard sits behind this rowhome expanding your living space further for recreational use. A full sized washer & dryer can be found in the unfinished basement as well as tons of open space awaiting for your personal touch…or just great storage space.\nThe second and third level each possess the same functional layout with 2 bright & generously sized bedrooms opposite one another with a full bathroom that sits in between. Each bedroom measures roughly 14.5 x 10.5 and feature double closets, a ceiling fan, and hardwood flooring finely illuminated by an abundance of natural light through tall windows.\nThis home needs to be viewed to appreciate all of the great features it has to offer\n","num_images":24.0,"lat":39.978095,"lng":-75.16458,"attrs":"['4BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'house', 'w\/d in unit', 'no smoking', 'street parking']","posted_date":"2022-05-07T13:55:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-so-cool-so-clean-modern\/7480749685.html","post_id":7480749685,"result_date":"2022-05-07 13:58","title":"So cool! So clean! Modern 3 bed 2 bath apt w\/ outdoor space!","description":"1802 N 5th St #1 – 3 bed 2 bath bi-level apt with patio -AVAILABLE April\nCome see why everyone is moving to Old Kensington! This area is gleaming with new restaurants, boutiques, coffee shops and more! With very convenient access to I-95 north & south, getting in and out of town is super easy. With Fishtown only a few blocks away, enjoy becoming a regular face at the International Bar for cocktails, or La Colombe for that morning pick me up. This location has a ton to offer now and will only have more soon!\nThis 3 bed 2 bath bi-level apartment has everything you need and more to be comfortable. The first bedroom is on the left as you enter with plenty of room and a nice double door closet, catching all that morning sunlight!  With a massive 1st floor living and dining space, having friends and family over will be easy and fun! Enjoy dining a la carte with your back patio! With a custom bathroom with shower stall and dual vanity on the first floor, you have the modern chic look.\nHead downstairs to find two more bedrooms and  a full bathroom with similar finishing touches upstairs. The bedrooms downstairs have plenty of room and closet space for all your belongings. With the bedrooms divided by a second large living area, privacy is no issue.\nDON’T FORGET YOU HAVE YOUR OWN WASHER AND DRYER!!\nFeaturing\n3 bedrooms\n2 bathrooms\nBi-level layout\nPatio space\nFull sized refrigerator\nGas Stove\nMicrowave\nDishwasher\nWasher and dryer\nCentral air\n& MORE!\n","num_images":17.0,"lat":39.978359,"lng":-75.143188,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'flooring: wood', 'apartment', 'w\/d in unit', 'no smoking', 'street parking']","posted_date":"2022-05-07T13:54:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bed-15-bath-house\/7480749678.html","post_id":7480749678,"result_date":"2022-05-07 13:58","title":"This 3 bed 1.5 bath house will blow you away!","description":"2162 N 32nd St.- 3 bed 1.5 bath house w\/laundry in unit & back yard!\nThis vintage style 3 bed 1.5 bath home has a ton of character with accents of the modern upgrades necessary for you to live comfortably. Enjoy restored hardwood flooring throughout your open living\/dining space for sleek classic look. Prepare your favorite meals within your gorgeous kitchen atop tons of counter space, or in the microwave or gas stove. Don’t like dishes in the sink…great news, there is a dishwasher! Just beyond the kitchen A stackable washer and dryer can be found in the sunroom, along with a a half bath.\nThe second-floor features three spacious bedrooms and a full bathroom. Each bedroom catches plenty of sunlight and room for you to live comfortably.\nLocated slightly north of the up and coming Brewerytown, this area has more and more to offer almost everyday. Enjoy catching drinks and snacks at the Crime and Punishment, or some lunch at Rybread! Planning a dinner party is easy with ALDI and Liquor Store right next to each other on 31st St! Whether you have plans to head into town or need to get to work in the morning, this location has easy access to Ridge Ave, Kelly Dr. or east and west bound route 76.\n-hardwood floor\n-3 bedrooms\n-1 bath\n-small back yard\n-full sized refrigerator\n-gas stove\n-washer & dryer!!\n-and MORE!!\n","num_images":24.0,"lat":39.990002,"lng":-75.185052,"attrs":"['3BR \/ 1.5Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'house', 'w\/d in unit', 'no smoking', 'street parking']","posted_date":"2022-05-07T13:54:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-rarely-found-one\/7480743071.html","post_id":7480743071,"result_date":"2022-05-07 13:57","title":"This rarely found one bedroom plus den condo with a full-size PRIVATE","description":"This rarely found one bedroom plus den condo with a full-size PRIVATE ROOF DECK in a convenient Graduate Hospital location checks all the boxes. This beautifully maintained condo features an open concept living and kitchen area with a chic industrial vibe courtesy of exposed ductwork, painted brick accent wall and modern-style kitchen. The kitchen features sleek white cabinetry accented by a muted aquamarine penny tile backsplash and stainless-steel appliances. A sizeable island provides prep space for cooking meals at home and has an elevated breakfast bar for casual dining. Bamboo flooring flows throughout the kitchen, living and bedroom areas, unifying the spaces. Right off the living area is a smaller rear deck (perfect for a container garden) with stairs to access the private roof deck. Not only does this roof deck have panoramic, unobstructed Philly skyline views, it is also spacious enough to accommodate large-scale deck furniture. It truly functions as a second living space and with recent mild temperatures you can keep the outdoor living going into the colder months! Back inside the bedroom has two large windows for lots of light and a cool exposed brick accent wall.","num_images":19.0,"lat":39.943638,"lng":-75.178924,"attrs":"['1BR \/ 1Ba', '762ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T13:41:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bike-storage-dishwasher\/7480745237.html","post_id":7480745237,"result_date":"2022-05-07 13:49","title":"Bike Storage, Dishwasher, Hardwood Floors","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1122Date Available: 2022-05-07Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Electronic ThermostatLarge ClosetsHigh Speed InternetElevatorWasher\/DryerRooftop DeckMicrowaveDishwasherPackage ReceivingFOB Controlled AccessHardwood FloorsRecyclingCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/334ekbml\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['2BR \/ 2Ba', '1122ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'wheelchair accessible']","posted_date":"2022-05-07T13:45:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-high-speed-internet\/7480743368.html","post_id":7480743368,"result_date":"2022-05-07 13:46","title":"High Speed Internet, Microwave, Hardwood Floors","description":"Bedrooms: 0Bathrooms: 1Square Feet: 397Date Available: 2022-05-07Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Large ClosetsWasher\/Dryer24\/7 Front Desk AttendantWindow CoveringsOn-Site ManagementRooftop DeckParking Garage (Additional Fees)Fitness Center w\/ Peloton BikesMicrowaveBike StorageRecyclingDishwasherCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/2oljbgcn\/lvl-north\n","num_images":11.0,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '397ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'wheelchair accessible']","posted_date":"2022-05-07T13:42:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-for-rent\/7480743229.html","post_id":7480743229,"result_date":"2022-05-07 13:45","title":"House for Rent","description":"Three Bedroom  House,  (2)  Two   Bathroom,  Kitchen  Fridge, Stove.     Living room,  Dinning Room,   Hardwood  Floors,     Fully  Renovating:    Ceiling  Fans.\nBasement   Washer& Dryer.  Space for Play Area for Kids.\n1St  2Nd  Security\nAccepting:  VA,   SSI,\nMust be Employed for (2)  Two  Years.\nNo Pets, No Smoking.\n","num_images":0.0,"lat":40.0118,"lng":-75.1861,"attrs":"['3BR \/ 1.5Ba', 'available may 12', '\\nfriday 2022-05-13\\n', '\\nsaturday 2022-05-14\\n', '\\nmonday 2022-05-16\\n', 'application fee details: 40.00', 'flooring: wood', 'house', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-07T13:41:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-higher-quality-of-living\/7480740816.html","post_id":7480740816,"result_date":"2022-05-07 13:41","title":"A Higher Quality of Living","description":"Dorchester floor plan — 881 sq. ft. — Starting Price $2,314 — Call to get on our waiting list!\nThis 1 bedroom apartment has a great view from a large private balcony! This apartment boats LVT flooring, central heat and air, a washer and dryer, stainless steel appliances, and plenty of cabinet space in the kitchen. This apartment also comes equipped with a spacious living area and walk-in closet. This gorgeous apartment is within close proximity to our clubhouse—featuring a 24-hour fitness center, theatre, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!\n","num_images":18.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '881ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T13:37:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-spacious-modern-living\/7480728773.html","post_id":7480728773,"result_date":"2022-05-07 13:18","title":"Spacious Modern Living","description":"Dorchester floor plan — 881 sq. ft. — Starting Price $2,314 — Call to get on our waiting list!\nThis 1 bedroom apartment has a great view from a large private balcony! This apartment boats LVT flooring, central heat and air, a washer and dryer, stainless steel appliances, and plenty of cabinet space in the kitchen. This apartment also comes equipped with a spacious living area and walk-in closet. This gorgeous apartment is within close proximity to our clubhouse—featuring a 24-hour fitness center, theatre, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":16.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '881ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T13:14:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-home-to-2518-gratz\/7480716801.html","post_id":7480716801,"result_date":"2022-05-07 13:14","title":"Welcome home  to 2518  N Gratz street","description":"This home resides on a friendly, residential block, perfect for First-time homeowners. Walking distance to Temple University. This beautiful  3bedroom, 1.5 bath house has been rehabbed to perfection and  move-in ready.  You will be greeted home by exotic bleached oak steel front door , located as well in the rear entry ; surely a must see. Once you enter into this home there is  brand new flooring throughout, Electric Fireplace inside a  granite casing, 9 ft ceilings with a texture","num_images":10.0,"lat":39.992092,"lng":-75.162573,"attrs":"['3BR \/ 2Ba', '1026ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: tile', 'furnished', 'house', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: yearly']","posted_date":"2022-05-07T12:52:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-desirable-spacious-three\/7480712302.html","post_id":7480712302,"result_date":"2022-05-07 12:52","title":"desirable spacious three bed home for rent","description":"Wonderful family home in the desirable Somerton section of Far Northeast Philadelphia. This house is only blocks from the City limits. Quiet well maintained neighborhood and a wonderful place to raise a family. Three bedrooms, two baths, large fenced yard with pool and deck. Full unfinished basement.","num_images":6.0,"lat":40.1166,"lng":-75.0198,"attrs":"['3BR \/ 2Ba', '1744ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: tile', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: yearly']","posted_date":"2022-05-07T12:43:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-lease-today-close-to-shops-and\/7480704770.html","post_id":7480704770,"result_date":"2022-05-07 12:39","title":"Lease Today, Close to Shops and Dining, Pets Welcome","description":"VIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nLease today at The Point at Pennbrook Station in Lansdale, PA. Come home to convenience. With a modern, open-plan kitchen and meticulous stainless steel appliances, making dinner is easier (and more exciting) than ever. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, walk-in closets, washer\/dryer, attached garage, and a private porch!\nThe Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm","num_images":11.0,"lat":40.226234,"lng":-75.283466,"attrs":"['2BR \/ 2Ba', '12ft2', 'available may 28', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-07T12:29:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-for-rent\/7480706522.html","post_id":7480706522,"result_date":"2022-05-07 12:36","title":"HOUSE FOR RENT","description":"Welcome to 1508 N. Hancock Street located in the desirable Fishtown neighborhood. This home is just 1 block from the newly renovated Hancock Park and steps away from all the shops and cafe's that make Fishtown so special. This gorgeous 2600 sq. foot luxury townhome was built in 2017 and boasts floor to ceiling windows, 3 bedrooms, 5 bathrooms, & a finished lower level. As soon as you enter the home your eyes are drawn to the spectacular floating staircase, leading up to the gourmet kitchen & overlooking the spacious living room. The Master suite is the perfect place to relax & unwind, complete with a luxurious soaking tub. To top off this modern home, a private fully furnished roof deck w\/breathtaking views of the city, make this a must see! Other home features include a home security system with 24\/7 emergency service protection, state of the art remote controlled black out shades throughout, 2 separate HVAC units with Nest thermostats, a private back patio perfect for grilling, and an extra large garage with custom storage and your own 240-V electric vehicle charger. This home can be rented furnished or unfurnished. Book your showing today!","num_images":23.0,"lat":39.9736,"lng":-75.1376,"attrs":"['3BR \/ 4Ba', '2600ft2', 'available now', '\\nmonday 2022-05-09\\n', 'air conditioning', 'application fee details: Fee before See out', 'flooring: wood', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-07T12:32:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-freshly-painted\/7480696579.html","post_id":7480696579,"result_date":"2022-05-07 12:33","title":"\/\/*3 bed 1 bath freshly painted apartment at Temple University area\/*\/","description":"3 bed 1 bath freshly painted apartment at Temple University area. 2 bedrooms are smaller and 1 bedroom is a decent size. The apartment is featured with hardwood floors, open living space, tiled floors in living room, and central air. Laundry is one block away.\nOwners pay for water. Renter responsible for electric. No smoking, no pets.\n","num_images":4.0,"lat":39.972058,"lng":-75.16041,"attrs":"['3BR \/ 1Ba', '1028ft2', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T12:13:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-closets-package\/7480704708.html","post_id":7480704708,"result_date":"2022-05-07 12:33","title":"Large Closets, Package Receiving, 24\/7 Front Desk Attendant","description":"Bedrooms: 2Bathrooms: 2Square Feet: 843Date Available: 2022-05-07Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Rooftop DeckFOB Controlled AccessElevatorRefrigeratorHardwood FloorsSmart Home FeaturesMicrowaveBike StorageRecyclingParking Garage (Additional Fees)Package ReceivingWindow CoveringsCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/d5z4famb\/lvl-north\n","num_images":11.0,"lat":39.944135,"lng":-75.165818,"attrs":"['2BR \/ 2Ba', '843ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'wheelchair accessible']","posted_date":"2022-05-07T12:29:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-latch-security-system\/7480702083.html","post_id":7480702083,"result_date":"2022-05-07 12:28","title":"Latch Security System, Central Air Conditioning, Dishwasher","description":"Bedrooms: 0Bathrooms: 1Square Feet: 549Date Available: 2022-05-07Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:Amazon Package Locker SystemWasher\/DryerRoof DeckOn-Site ManagementQuartz CountertopsCentral Air ConditioningExtra StorageState-of-the-Art Fitness CenterRecyclingElectronic ThermostatHardwood FloorsElevatorCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/gv4lkvmw\/fairmount-north\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['0BR \/ 1Ba', '549ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T12:24:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7480702047.html","post_id":7480702047,"result_date":"2022-05-07 12:28","title":"Private Balcony, Quiet Community, Move In Now","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nCommunity Features\n* Fitness Studio\n* Easy Freeway Access\n* Billiards\n* Pet Salon\n* Outdoor Grill Area\n* Minutes from Restaurants, Shopping, and Much More\n* Community Lounge\n* Bark Park\n* TV Lounge\n* Swimming Pool\n* Yoga Lounge\n* Sun Deck\n* Professionally Managed\n* Spa","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1363ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-07T12:24:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-salt-water-pool-with\/7480700351.html","post_id":7480700351,"result_date":"2022-05-07 12:24","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nYou will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Extra Storage\n* Granite Countertops\n* Wood-Like Floors\n* Full sized Washer and Dryer in unit\n* Private Patio or Private Balcony (on select apartments)","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-07T12:20:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7480698030.html","post_id":7480698030,"result_date":"2022-05-07 12:20","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nFind yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nCommunity Features\n* Playground\n* Bark Park\n* Fitness Studio\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access\n* Swimming Pool\n* Pet Salon\n* EV Charging\n* Gaming Area\n* Billiards\n* Sun Deck","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1210ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-07T12:16:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-latchos-technology-lock\/7480692171.html","post_id":7480692171,"result_date":"2022-05-07 12:09","title":"LatchOS technology lock system, Gas Range, On-Site Management","description":"Bedrooms: 0Bathrooms: 1Square Feet: 507Date Available: 2022-05-07Address: 631 N Broad StThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past. Amenities Include:Energy-efficient, gas-powered HVACElevatorPet friendlyRecyclingNEST Learning ThermostatsHistoric BuildingEfficient AppliancesExposed Brick & Spiral DuctworkOn-Site ManagementControlled Access\/GatedGas RangeLuxer Package RoomCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/du6hzmom\/stable-lofts\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['0BR \/ 1Ba', '507ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-07T12:05:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-location-nicely-one\/7480682431.html","post_id":7480682431,"result_date":"2022-05-07 11:51","title":"Great location! Nicely one bedroom","description":"This is a very nicely one bedroom apartment in a quiet and safety area.\nAvailable July First (or Aug. 1)\nNear University of Pennsylvania, U Penn shuttle stops in front of the door during evening and night.\nJust minutes away from the USP campus.\nThere is a trolley stop around the corner, which can take you 15 min right to Center City.\nInside Penn Alexander School area. Close to Super Market, Clark Park, farmers market, great coffee shops, restaurants and bars.\nNo pet allowed.\nWasher and dryer in the house.\nAsking $ 845 \/M plus electric and gas. Owner pays water and sewer.\nOne year lease\nMove in need first, last and security deposit.\nEmail or text me if you would like to look at this apartment.","num_images":9.0,"lat":39.949779,"lng":-75.21485,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'flooring: wood', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-07T11:47:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-high-speed-internet-fob\/7480678632.html","post_id":7480678632,"result_date":"2022-05-07 11:43","title":"High Speed Internet, FOB Controlled Access, Washer\/Dryer","description":"Bedrooms: 0Bathrooms: 1Square Feet: 372Date Available: 2022-05-07Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Parking Garage (Additional Fees)DishwasherHardwood FloorsRecyclingHigh Speed InternetBike StorageFitness Center w\/ Peloton BikesPackage ReceivingOn-Site Management24\/7 Front Desk AttendantSmart Home FeaturesMicrowaveCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/tr2tzq62\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '372ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'wheelchair accessible']","posted_date":"2022-05-07T11:39:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-parking-garage-additional\/7480676976.html","post_id":7480676976,"result_date":"2022-05-07 11:40","title":"Parking Garage (Additional Fees), Smart Home Features, Recycling","description":"Bedrooms: 1Bathrooms: 1Square Feet: 701Date Available: 2022-05-06Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Window CoveringsElectronic ThermostatLarge ClosetsOn-Site ManagementWasher\/DryerParking Garage (Additional Fees)FOB Controlled AccessSmart Home FeaturesRefrigeratorHardwood FloorsRooftop DeckPackage ReceivingCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/f2oavgff\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '701ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'wheelchair accessible']","posted_date":"2022-05-07T11:36:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-dog-and-cat-friendly\/7480662627.html","post_id":7480662627,"result_date":"2022-05-07 11:11","title":"Dog and Cat-Friendly 1157 SqFt 2 Bed \/ 2 Bath! Pets Welcome Here!","description":"The Glen at Lafayette Hill Visit our community today! 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nUnit Rates:  $2366 - $2454\/month Unit Type: 2-BR 2-BA Unit Size: 1157 sq ftLease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.What you’ll find in our community: ● 24 Hour Availability● Business Center● Cardio Machines● Conference Room● Furnished Units Available● Gated, Controlled Access● Pet Play Area● Planned Social Activities● Recycling● Renters Insurance Program● BBQ Picnic Garden● Billiards, Club Lounge, Cafe Area, Library and Community Room● Fitness Center w\/ Free Weights, Weight Machines● Message Therapist Practice On-site● Outdoor Cafe & Coffee Bar● Outdoor Patio Lounge● Sprinkler System● Storage Space● Wi-Fi at ClubhouseDescription: Our residents enjoy luxurious amenities including an amazing outdoor cafe area, a clubhouse with flat screen TVs, and a full kitchen and fitness center. Open-concept floor plans accompanied by a variety of upscale features define the one-of-a-kind luxury lifestyle only found at our Lafayette Hill apartments.This unit comes with: ● Air Conditioning & Heating● Cable Ready● Carpet● Ceiling Fans (Select Floor Plans)● Dining Room● Heating● Refrigerator, Freezer and Ice Maker● Tub\/Shower● Wi-Fi● Window Coverings● Crown Molding (Select Floor Plans)● High Speed Internet Access● Linen Closet● Microwave● Storage Units● Tile Floors● Vaulted Ceiling (Select Floor Plans)● Walk-In Closets (Select Floor Plans)● Washer\/Dryer● Wheelchair Accessible (Rooms)Call or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.comProperty Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":18.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: carpet', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-07T11:07:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-huge-1bedroom-1bath-walkin\/7480657385.html","post_id":7480657385,"result_date":"2022-05-07 11:02","title":"Huge 1Bedroom 1Bath W Walkin closet & Vanity !!!","description":"Welcome Home to Chestnut Hill Village *Private Entry.*Septa Train Station in Backyard.*Patio\/Balcony Area.  Call Now:  show contact info\nx 26OR Text 26 to  show contact info\nto text us.Use this link for more information:https:\/\/cl.greystar.com\/m15159 This is a 1 Bedroom + 1 Den, 1 Bath, approximately 830 Sq. Ft. Features - Air Conditioning Units  - Wood Plank Flooring  - All New Stainless Steel Appliances!!  - Garbage Disposal *Dishwasher *Refrigerator *Microwave Community Amenities - Movie Screening Room  - Playground  - Swimming Pool  - Visual and Voice Intercom  - Near Public Transportation  - Smart Package 365  - Guarantors Welcome  - Smoke-Free  - Elevator  - Barbecue Area  - Controlled Access Building  - Business Center  - Fitness Center  - On-site Recycling  - Wi-Fi in Common Areas  - Clubhouse Pet Policy Pets are residents, too!Two pets per apartmentBreed restrictions apply*No weight restrictionsNon-refundable pet fee of $350 per petMonthly pet rent of $30 or $40, depending on size Office Hours Monday-Friday:9:00AM-6:00PMSaturday:10:00AM-5:00PMChestnut Hill Village  7715 Crittenden St, Philadelphia, PA, 19118Equal Housing Opportunity xbs39Av0e\n","num_images":8.0,"lat":40.0723,"lng":-75.2034,"attrs":"['1BR \/ 1Ba', '830ft2', 'available may 9', 'apartment', 'laundry in bldg', 'off-street parking']","posted_date":"2022-05-07T10:58:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-laundry-in-unit-lease\/7480649602.html","post_id":7480649602,"result_date":"2022-05-07 10:45","title":"Laundry in Unit, Lease Today, Convenient Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nLooking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Granite Countertops\n* Private Patio or Private Balcony (on select apartments)\n* Extra Storage\n* Wood-Like Floors\n* Full sized Washer and Dryer in unit\nCommunity Features\n* Bark Park\n* Professionally Managed\n* Swimming Pool\n* Easy Freeway Access\n* Pet Salon\n* Fitness Studio\n* Minutes from Restaurants, Shopping, and Much More\n* Yoga Lounge\n* Putting Green\n* TV Lounge\n* Outdoor Grill Area\n* Bocce Ball\n* Sun Deck\n* Community Lounge","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-07T10:41:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7480647135.html","post_id":7480647135,"result_date":"2022-05-07 10:40","title":"Pets Welcome, Lease Today, Quiet Community","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nCommunity Features\n* TV Lounge\n* Billiards\n* Professionally Managed\n* Easy Freeway Access\n* Fitness Studio\n* Spa\n* Minutes from Restaurants, Shopping, and Much More\n* Swimming Pool\n* Bark Park\n* Outdoor Grill Area\n* Pet Salon\n* Community Lounge\n* Yoga Lounge\n* Sun Deck","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '789ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-07T10:36:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-washington-square-west\/7480640046.html","post_id":7480640046,"result_date":"2022-05-07 10:24","title":"Washington Square West Unit-B5","description":"1122 Spruce Street - Unit B5 is a 350 square foot studio apartment available 6\/1\/22 for $ 1,150.00. It offers a newer kitchen with stainless steel appliances and granite counters, wood floors, central air and south facing windows overlooking a shared courtyard.  The Washer and Dryers are in the building.","num_images":6.0,"lat":39.947562,"lng":-75.159156,"attrs":"['0BR \/ 1Ba', '350ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'laundry in bldg', 'street parking', 'rent period: yearly']","posted_date":"2022-05-07T10:20:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-convenient-location-fitness\/7480634915.html","post_id":7480634915,"result_date":"2022-05-07 10:12","title":"Convenient Location, Fitness Center, Close to Shops and Dining","description":"Discover an easier, more fulfilling way of life at The Point at Plymouth Meeting. We have all the modern amenities in a great location close to some if the areas best dining, retail, and entertainment options. Call for a tour!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, walk-in closet, and a private patio\/balcony!\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nCommunity Features\n* Minutes from Restaurants, Shopping, and Much More\n* Car Wash Area\n* Outdoor Grill Area\n* Short or Long Term Lease Available\n* Smoke Free Community\n* After-Hours Emergency Maintenance\n* E-Lounge\n* Bike Racks\n* Community Lounge\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Easy Freeway Access\n* Professionally Managed\n* Renters Insurance is Required\n* Extra Storage\n* Sun Deck\n* Bark Park\n* Liability Insurance is Required\n* Non Smoking Community\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Swimming Pool\n* Community Kitchen\n* Package Acceptance\n* Credit Cards Accepted\n* WiFi Access","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['2BR \/ 2Ba', '1078ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking']","posted_date":"2022-05-07T10:08:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-unfurnished\/7480612019.html","post_id":7480612019,"result_date":"2022-05-07 10:01","title":"BRAND NEW, UNFURNISHED APARTMENT AVAILABLE in Northern Liberty","description":"BRAND NEW, UNFURNISHED APARTMENT AVAILABLE in Northern Liberty Triangle\n2 Bedroom \/ 1.5 Bathroom duplex with fireplace\n·        Sun drenched open concept duplex apartment\n·        Hardwood floors\n·        GE Stainless steel appliances in kitchen\n·        Walk-in closet in master bedroom\n·        Washer and dryer in unit\n·        Building amenities include state of the art private gym and access to private courtyard\n·        Nearby public transportation include Girard Ave and 2nd Street Transit Station and #5 Bus stop\n·        Across the street from Acme Supermarket and down the block fromGiant heirloom market.\n·        Nearby \/ walking distance to dining hotspots include: One Shot Coffee, Figo, Urban Village Brewing, Laser Wolf, Bottle Bar East, Pizza Beddia, The Piazza, Johnny Brenda's, El Camino real and Front Street Cafe and so many more!\n·       Dog friendly apartment!! 5 minute walk to one of the best dog parks in Philly, Orianna dog run. (https:\/\/www.oriannahill.org\/)\n·       a short walk or a quick jog to Philly's waterfront\nRent is $2,200\/month. Unit is available for starting May 15.  Looking for a 12-month lease (discount for 24-month lease)\nEmail me for more details and showing if interested!","num_images":5.0,"lat":39.9685,"lng":-75.1401,"attrs":"['2BR \/ 1.5Ba', '1000ft2', 'available may 15', '\\nsunday 2022-05-08\\n', '\\nmonday 2022-05-09\\n', '\\ntuesday 2022-05-10\\n', 'air conditioning', 'dogs are OK - wooof', 'flooring: wood', 'condo', 'w\/d in unit', 'street parking', 'rent period: yearly']","posted_date":"2022-05-07T09:10:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-studio-apartment\/7480622711.html","post_id":7480622711,"result_date":"2022-05-07 09:43","title":"UPDATED STUDIO APARTMENT LOCATED IN WEST OAK LANE","description":"⭐⭐⭐ UPDATED STUDIO APARTMENT LOCATED IN WEST OAK LANE ⭐⭐⭐\nProperty Address\n6935 N 15th Street - I1 (Studio) | Philadelphia, PA 19126\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ SPACIOUS UPDATED STUDIO (EFFICIENCY) APARTMENT!\n✔️ MINUTES AWAY FROM LA SALLE AND THE EYE INSTITUTE AT SALUS UNIVERSITY\n✔️ LOCATED IN THE HEART OF WEST OAK LANE!\n✔️ PRIVATE PATIO\n✔️ WALK-IN CLOSET\n✔️ LAMINATE FLOORING\n✔️ UPDATED KITCHEN AND BACKSPLASH\n✔️ COIN-OPERATED LAUNDRY (IN THE BUILDING)\n✔️ OFF-STREET PARKING AVAILABLE\n✔️ TONS OF STREET PARKING\n✔️ EASY ACCESS TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ EASY COMMUTE TO AND FROM THE CITY\n✔️ THIS WILL NOT LAST LONG, APPLY TODAY!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDETAILS:\nProfessionally Managed\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- The tenant is responsible for paying their own electricity and 50 water fee.\n*** Build your credit! We report rent payments to Experian! ***\nTo Schedule a Showing:\nhttp:\/\/www.redblock.com\nTags: Mt Airy, Germantown, Logan, Olney, Cheltenham, northwest, septa, parking, laundry, Elkins park, willow grove, hook up, commuter, Cheltenham, Stenton, ogontz, Logan, west oak lane, oak lane reservoir, Pennsylvania College of Optometry, Einstein Medical Center, La Salle, sale, now, special, find out more, redblock, red block, Redblock Realty Inc, studio, efficiency, bd, bedroom, flat, 0 bedroom, 19126, 19138, 19117, 19012, 19141, 19120, #nata\n\nDetails\nBeds\/Baths: 1.0BA\nSquare Feet: 450\nRental Terms\nRent: $800.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,600.00\n","num_images":11.0,"lat":40.058953,"lng":-75.142064,"attrs":"['0BR \/ 1Ba', '450ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T09:39:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-large-3rd-fl-bed\/7480622157.html","post_id":7480622157,"result_date":"2022-05-07 09:42","title":"Beautiful & Large 3rd Fl. 2 Bed. S. Broad St. Apt. w\/ H\/W, C\/A, & more","description":"Wow! Look no further! Modern and Large 3rd fl. 2 Bed. 1 Bath S Broad St apt. with W\/D, Hardwood Floors, Central Air, lots of windows\/natural light and so much more. Walk in and find a large front bedroom with three big windows overlooking S. Broad St., hardwood floors, and closet; down the hallway you will find a gorgeous tiled bathroom with tiled shower, dual vanity, and W\/D; next you will find the second bedroom with closet; modern kitchen and living room combo with H\/W and tile floors. The kitchen features gorgeous cabinets, granite countertops, island, and stainless steel appliances including a double door refrigerator with bottom freezer, electric range, microwave, and dishwasher. Gorgeous tile backsplash. The living room is spacious with a beautiful original closet with ornate moldings. The one wall is wood with a modern design. Tons of windows and natural light! Come see this! Central Air! GAS, ELECTRIC, AND WATER\/SEWER INCLUDED TO A LIMIT! Tenant pays their own cable and internet.  1 year lease minimum. $75 application fee with Two paystubs and ID with application.  We run a credit, criminal and eviction check. Sorry, no pets.  Available for August 2022. Contact Mike Giordano for showings at  show contact info\n!","num_images":16.0,"lat":39.928035,"lng":-75.168956,"attrs":"['2BR \/ 1Ba', '1300ft2', 'available aug 1', 'air conditioning', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'flooring: wood', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-05-07T09:38:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-updated-bd-ba-apt\/7480621709.html","post_id":7480621709,"result_date":"2022-05-07 09:41","title":"NEWLY UPDATED 2 BD & 1 BA APT LOCATED IN NORTHEAST PHILADELPHIA!","description":"⭐⭐⭐ NEWLY UPDATED 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN NORTHEAST PHILADELPHIA! ⭐⭐⭐\nProperty Address\n9843 Frankford Ave - 1F | Philadelphia, PA 19114\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ NEWLY UPDATED APARTMENT AVAILABLE IN NORTHEAST PHILADELPHIA!\n✔️ SPACIOUS 2 BEDROOMS AND 1 BATH APARTMENT!\n✔️ NEW CUSTOM LAMINATE!\n✔️ OPEN LAYOUT!\n✔️ SPACIOUS DINING AREA!\n✔️ NEW KITCHEN CABINETS!\n✔️ NEW CUSTOM BACKSPLASH!\n✔️ BREAKFAST BAR!\n✔️ CEILING FANS!\n✔️ CENTRAL HEATING!\n✔️ LARGE CLOSETS\n✔️ BASEMENT STORAGE SPACE!\n✔️ LARGE SHARED GARAGE!\n✔️ LARGE DRIVEWAY!\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant is responsible for their own utilities (electric, gas, & water fee)\nBuild your credit! We report rent payments to Experian!\n***Please apply online at https:\/\/redblock.com\/apartment\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nRental Terms\nRent: $1,400.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,800.00\n\n#nata\n","num_images":8.0,"lat":40.062549,"lng":-74.986884,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T09:37:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7480619670.html","post_id":7480619670,"result_date":"2022-05-07 09:36","title":"SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN WEST OAK LANE!","description":"SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN WEST OAK LANE!\nProperty Address\n6701 Ogontz Ave - 3R | Philadelphia, PA 19126\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT\n✔️Updated Apartment\n✔️Spacious 1 Bedroom \/ 1 Bathrooms\n✔️3rd-floor apartment in a small building, easy access\n✔️Hardwood flooring\n✔️Lots of closet space\n✔️High ceilings\n✔️Spacious rooms\n✔️Eat-in Kitchen\n✔️Ceiling fans\n✔️Easy access to and from the city\n✔️Easy access to public transportation\n✔️Conveniently located close to major routes\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities (electric and water)\n*** Build your credit! We report rent payments to Experian! ***\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: 19126, 19120, 19141, 19144, 19138, 19117, 19012, Mt Airy, Germantown, Logan, Olney, west oak lane, Elkins park, septa, Rowan William School, Broad Street, redblock, red block, Redblock Realty Inc, one bedroom, 1 bedroom, #nata\n\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 650\nRental Terms\nRent: $850.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,700.00\n\nPet Policy\nCats allowed\nDogs not allowed","num_images":9.0,"lat":40.056217,"lng":-75.149478,"attrs":"['1BR \/ 1Ba', '650ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T09:32:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-love-this-building-love\/7480618406.html","post_id":7480618406,"result_date":"2022-05-07 09:33","title":"Love this building! Love this location!","description":"Manchester floor plan — 1,149 sq. ft. — Starting Price $3,095 — Call to get on our waiting list!\nThis 2 bedroom\/2 bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full size front loading washer and dryer, and stainless steel appliances. The large master bedroom is equipped with a private balcony, a walk-in closet and a spacious bathroom with double sink vanity and walk in shower. The second bedroom and bathroom are spacious as well!  This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theater room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-07T09:29:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated-bd-ba\/7480617847.html","post_id":7480617847,"result_date":"2022-05-07 09:31","title":"Completely Renovated 3 BD \/ 2 BA Home, Central Air, Private Rear Deck","description":"Completely Renovated 3 Bedroom 2 Bath Home, Central Air, Private Rear Deck, brand new rehab in Elmwood Park\/Kingsessing\nProperty Address\n6345 Kingsessing Ave | Philadelphia, PA 19142\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Stunning renovation in Elmwood Park\/Kingsessing! ⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 2 Bath\n✔️Updated Kitchen w\/ custom designer backsplash\n✔️Master Bedroom has a Private brand new full bath\n✔️Located just minutes to schools, parks, and University City\n✔️All New Appliances\n✔️Hardwood flooring throughout\n✔️Recessed Lighting\n✔️Spacious bedrooms\n✔️Open layout, plenty of closet space.\n✔️Large basement perfect for storage\n✔️Central Air\n✔️Private Rear Deck\n✔️Washer\/Dryer Hookup\n✔️Located just minutes to schools, parks, and University City\n✔️Easy commute to and from the city\n✔️This property won't last long, inquire now!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1330\nRental Terms\nRent: $2000\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nVirtual Tour: https:\/\/my.matterport.com\/show\/?m=xG8QmjAkkCh\nStunning renovation in Elmwood Park\/Kingsessing! This immaculate home has been completely renovated from top to bottom! Located just minutes to schools, parks, and University City. Brand new renovation! Steps to UPENN, Drexel, USciences, Center City CHOP, and Hospital of the University of Pennsylvania. Home features 3 bedrooms, 2 baths! Central air! Private Rear Deck! Washer\/dryer hookup! Absolutely everything here is brand new! #nata\nFor security purposes, all of our properties are under live video and audio surveillance. All access and showings are recorded and monitored remotely\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,332\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n\nPet Policy\nCats allowed\nDogs not allowed","num_images":24.0,"lat":39.928403,"lng":-75.236155,"attrs":"['3BR \/ 2Ba', '1332ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T09:27:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated-bd-ba\/7480615745.html","post_id":7480615745,"result_date":"2022-05-07 09:25","title":"Completely Renovated 3 Bd 2 Ba Home, Central Air, Private Rear Deck","description":"Completely Renovated 3 Bedroom 2 Bath Home, Central Air, Private Rear Deck, brand new rehab in Kingsessing\nProperty Address\n5951 Belmar Street | Philadelphia, PA 19143\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Stunning renovation in Kingsessing! ⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 2 Bath\n✔️Updated Kitchen w\/ custom designer backsplash\n✔️Master Bedroom has a Private brand new full bath\n✔️Located just minutes to schools, parks, and University City\n✔️All New Appliances\n✔️Hardwood flooring throughout\n✔️Recessed Lighting\n✔️Spacious bedrooms\n✔️Open layout, plenty of closet space.\n✔️Large basement perfect for storage\n✔️Central Air\n✔️Private Rear Deck\n✔️Washer\/Dryer Hookup\n✔️Located just minutes to schools, parks, and University City\n✔️Easy commute to and from the city\n✔️This property won't last long, inquire now!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1330\nRental Terms\nRent: $2000\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nVirtual Tour: https:\/\/my.matterport.com\/show\/?m=ZUonK11wfaB\nStunning renovation in Kingsessing! This immaculate home has been completely renovated from top to bottom! Located just minutes to schools, parks, and University City. Brand new renovation! Steps to UPENN, Drexel, USciences, Center City CHOP, and Hospital of the University of Pennsylvania. Home features 3 bedrooms, 2 baths! Central air! Private Rear Deck! Washer\/dryer hookup! Absolutely everything here is brand new! #nata\nFor security purposes, all of our properties are under live video and audio surveillance. All access and showings are recorded and monitored remotely\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,300\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n","num_images":24.0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 2Ba', '1300ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T09:21:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7480615678.html","post_id":7480615678,"result_date":"2022-05-07 09:25","title":"Lease Today, Playground, Luxurious Bathrooms","description":"Schedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '833ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-07T09:21:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedrooms-bath-apt\/7480613918.html","post_id":7480613918,"result_date":"2022-05-07 09:20","title":"SPACIOUS 2 BEDROOMS & 1 BATH APT LOCATED CLOSE TO EINSTEIN HOSPITAL!","description":"SPACIOUS 2 BEDROOMS & 1 BATH APARTMENT LOCATED CLOSE TO EINSTEIN HOSPITAL!\nProperty Address\n5117 N Broad St | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ SPACIOUS, 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN OGONTZ\/LOGAN AREA\n✔️ BRAND NEW EAT-IN KITCHEN W\/ DESIGNER BACKSPLASH\n✔️ WATER-RESISTANT DESIGNER LAMINATE IN THE KITCHEN\n✔️ SPACIOUS BEDROOMS\n✔️ PARQUET FLOORING\n✔️ LARGE CLOSETS\n✔️ LOTS OF NATURAL LIGHT\n✔️ ALL-ELECTRIC HEATING\n✔️ GAS STOVE AND WATER HEATER\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ CLOSE TO EINSTEIN HOSPITAL\n✔️ SHORT DISTANCE FROM LA SALLE UNIVERSITY AND PHILADELPHIA EYE INSTITUTE\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- The tenant is responsible for electric, gas, andwater fee\nBuild your credit! We report rent payments to Experian!\n**** DO NOT VISIT THE PROPERTY WITHOUT A SCHEDULED SHOWING **** You must make an appointment by completing this form https:\/\/redblockrentals.com\/showing *****\nTags: REDBLOCK Realty inc, redblock, Albert Einstein Healthcare Network, Widener Memorial School, Delaware Valley Charter High School, Logan Station, Logan School, La Salle University, Howe Academic Plus School, Pennsylvania College of Optometry, Joseph Pennell Elementary School, Stenton Park, Jay Cooke Elementary School, Wister Woods Park, Wakefield, Prince Hall Elementary School, Logan, Olney, Germantown, Oak Lane, 19144, 19126, 19141, 19138, 19120, 19140, 2BR, 2 bedrooms, #nata\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 750\nRental Terms\nRent: $1,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,000.00\n\nPet Policy\nCats allowed","num_images":8.0,"lat":40.031351,"lng":-75.146411,"attrs":"['2BR \/ 1Ba', '750ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T09:16:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-1br-1bath-penthouse\/7480611906.html","post_id":7480611906,"result_date":"2022-05-07 09:13","title":"Modern 1BR\/1BATH Penthouse near PENN, PENN Medicine, Drexel University","description":"Modern 1BR\/1BATH Penthouse near PENN, PENN Medicine, Drexel University\nProperty Address\n437 N 40th Street | 5C | Philadelphia, PA 19104\nAvailable: 06\/01\/2022\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\nVirtual tours, photos, and all information at\nhttps:\/\/universitycityapartments.com\/virtual-tours\/\n- June 1, 2022 move-in\n- 1BR \/ 1BATH unit in brand new 19-unit building.\n- Private unit, price for entire unit!\n- Walk to Penn, Penn Medicine, Drexel University\n- 5-star tenant reviews!\n- Study Lounge\n- Gym\n- Elevator\n- Lobby \/ package area\n- Controlled access\n- WiFi for tenants\n- Roofdeck  <<<<<<\n- Bike Parking\n- Central air\n- Washer\/dryer in all unit\n- Modern loft designs!\n- Brand new kitchen and bathrooms!  Granite counters!\n- Stainless steel appliances\n- Pet friendly\n- Professionally managed\n- 15-minute walk to Penn, Penn Medicine, Drexel\nVirtual tours, photos, and all information at universitycityapartments.com\n#University City #Philadelphia #Penn Presbyterian Medical #University of Pennsylvania #PENN Hospitals #HUP #CHOP #Children’s Hospital of Philadelphia #Drexel University #Science Center #West Powelton #Dental #Nursing #Law #Engineering #Graduate Program #PHD #Residents #Fellows #REDBLOCK #40SPRING #40\/SPRING #nata\n\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 600\nRental Terms\nRent: $1,500.00\nAvailable: 06\/01\/2022\nApplication Fee: $50.00\nSecurity Deposit: $2,800.00\n\nPet Policy\nCats allowed\nDogs allowed","num_images":19.0,"lat":39.959708,"lng":-75.199077,"attrs":"['1BR \/ 1Ba', '600ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T09:09:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-large-bedroom-bath\/7480608318.html","post_id":7480608318,"result_date":"2022-05-07 09:03","title":"UPDATED, LARGE, 1 BEDROOM & 1 BATH APT LOCATED IN UNIVERSITY CITY!","description":"⭐⭐⭐ UPDATED, LARGE, 1 BEDROOM & 1 BATH APARTMENT LOCATED IN UNIVERSITY CITY!!! ⭐⭐⭐\nProperty Address\n36 N Preston St | Philadelphia, PA 19104\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ COZY APARTMENT LOCATED ON A QUIET BLOCK IN WEST PHILADELPHIA'S UNIVERSITY CITY AREA!\n✔️ 1 BEDROOM & 1 BATH APARTMENT W\/ A SHARED FRONT PORCH\n✔️ UPDATED KITCHEN W\/ AN ELECTRIC REFRIGERATOR AND AN ELECTRIC STOVE\n✔️ LAMINATE FLOORING\n✔️ SPACIOUS LIVING ROOM\n✔️ SPACIOUS BEDROOM\n✔️ INTERNET\/CABLE READY\n✔️ PLENTY OF CLOSET SPACE\n✔️ ACCESS TO THE BACKYARD\n✔️ EASY ACCESS TO PUBLIC TRANSPORTATION\n✔️ WALKING DISTANCE TO PENN & DREXEL\n✔️ CLOSE DISTANCE TO UNIVERSITY OF SCIENCES\n✔️ EASY COMMUTE TO CENTER CITY\n✔️ CLOSE TO ALL THE SHOPPING IN THE AREA\n✔️ WON'T LAST LONG, APPLY NOW!!!\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in.\n- Tenants pay their own utilities.\n*** Build your credit! We report rent payments to Experian! ***\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\ntags: REDBLOCK REALTY INC, red block, 1 bd, 1 bedroom, West Philadelphia, one, University City, apartment, market st, 19104, 19139, 19130, 19121, 19146, 19103, 19145, Penn, Drexel, Wharton, Lea Elementary School, University of Pennsylvania School of Dental Medicine, Sadie Tanner Mossell Alexander University of Pennsylvania Partnership School, The Restaurant School, UNI UCHS Garden, Lincoln University, Goodwin College of Professional Studies, Philadelphia 30th Street Station, SEPTA, #nata\nDetails\nBeds\/Baths: 1BD\/1.0BA\nRental Terms\nRent: $1,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,000.00\n\nPet Policy\nCats allowed","num_images":8.0,"lat":39.958159,"lng":-75.203493,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T08:59:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bd-and-ba-house\/7480606164.html","post_id":7480606164,"result_date":"2022-05-07 08:55","title":"Spacious 3 BD and 1 BA house located in Oxford Circle\/Castor area!","description":"Spacious 3 bedroom and 1 bath house located in Oxford Circle\/Castor area!\nProperty Address\n1430 Lardner Street | Philadelphia, PA 19149\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Updated property! Located in Oxford Circle! ⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 1.5 Bath\n✔️Updated Kitchen w\/ custom designer backsplash\n✔️Water-resistant laminate for easy kitchen cleaning\n✔️Restored hardwood flooring in the living room, dining area, and upstairs\n✔️Spacious bedrooms\n✔️Open layout, plenty of closet space.\n✔️Basement for storage\n✔️Driveway for parking\n✔️Spacious front patio\n✔️Located in NorthEast Philly, close to all major routes\n✔️Easy commute to and from the city\n✔️This property won't last long, inquire now!\nDetails\nFull background checks, $35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nBeds\/Baths: 3 BD\/ 1 BA\nSquare Feet: 1030\nRental Terms\nRent: $1500\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $3000\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nTags:  tags: 3 bedrooms, 3BD, three, REDBLOCK, REDBLOCK REALTY INC, RED BLOCK REALTY, garage, extra storage, renovated, updated, Lawncrest, Oxford Circle, Fox Chase, Bustleton, Northeast, Far Northeast, Boulevard, Grant, 19149, 19111, 19152, Naval Support Activity Philadelphia, Naval Center, Castor, Castor Gardens, Cottman, Roosevelt Mall, #nata\nDetails\nBeds\/Baths: 3BD\/1.5BA\nSquare Feet: 1,000\nRental Terms\nRent: $1,500.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,000.00\n","num_images":8.0,"lat":40.035774,"lng":-75.079953,"attrs":"['3BR \/ 1.5Ba', '1000ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T08:51:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedrooms-bath\/7480604932.html","post_id":7480604932,"result_date":"2022-05-07 08:51","title":"LARGE 2 BEDROOMS & 1 BATH LOCATED IN OAKLANE\/LOGAN AREA!","description":"⭐⭐⭐ LARGE 2 BEDROOMS & 1 BATH LOCATED IN OAKLANE\/LOGAN AREA!!!! ⭐⭐⭐\nProperty Address\n1342 Wagner Avenue - 1F | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT!!!!⭐⭐⭐⭐⭐\n✔️HUGE!!! UPDATED 2 BEDROOM AND 1 BATH\n✔️LOCATED ON THE 1ST FL, PROVIDING EASY ACCESS\n✔️LARGE KITCHEN\/LIVING ROOM AREA!\n✔️LAMINATE FLOORING\n✔️TILED KITCHEN\n✔️EVERYTHING IS ELECTRIC\n✔️STOVE\/FRIDGE\/MICROWAVE\n✔️CABLE READY\n✔️MOVE-IN READY\n✔️LARGE BEDROOMS\n✔️LARGE BATHROOM\n✔️SHARED FRONT PORCH\n✔️DESIGNER PAINT\n✔️CONVENIENTLY LOCATED\n✔️EASY ACCESS TO SEPTA\n✔️EASY ACCESS TO AND FROM THE CITY\n✔️WILL NOT LAST LONG!!!! INQUIRE TODAY!!!!\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move-in.\n- Tenant pays own utilities\n*** Build your credit! We report rent payments to Experian! ***\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 850\nRental Terms\nRent: $1200\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2400\nPet Policy\nCats allowed\nDogs not allowed\nNotic\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nTAGS: 2 bedroom, 2 bd, 1 bath, large apartment, spacious, cozy, Logan, Oak Lane, West Oak Lane, Philly, Philadelphia, Pa, Pennsylvania, house, apartment, septa, Philadelphia County Assistance Office District F Glendale, Logan Library, LOGAN Hope School, Logan Station, Einstein Medical Center Philadelphia Emergency Medicine, Central High School, La Salle University, Widener Memorial School, Fern Rock Transportation Center Station, Community College of Philadelphia - Northwest Regional Center, Eye Institute of Penna College, City Of Philadelphia Office Of Supportive Housing, 19144, 19138, 19126, 19141, 19140, 19120, #nata\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 850\nRental Terms\nRent: $1,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,000.00\n","num_images":7.0,"lat":40.031348,"lng":-75.14555,"attrs":"['2BR \/ 1Ba', '850ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T08:47:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7480603671.html","post_id":7480603671,"result_date":"2022-05-07 08:46","title":"SPACIOUS 2 BEDROOM 1 BATH APARTMENT IN NE PHILLY!","description":"SPACIOUS 2 BEDROOM 1 BATH APARTMENT IN NE PHILLY!!!\nProperty Address\n12526 Biscayne Dr - 2F | Philadelphia, PA 19154\nAvailable: 06\/01\/2022\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n12526 BISCAYNE DR - 2F |  PHILADELPHIA PA 19154\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\n✔️NORTHEAST PHILLY APARTMENT!⭐⭐⭐⭐\n✔️SPACIOUS 2 BEDROOMS AND 1 BATH\n✔️RESTORED HARDWOOD FLOORING\n✔️CENTRAL HEATING\n✔️SHARED GARAGE\n✔️SHARED YARD\n✔️OPEN LAYOUT, PLENTY OF CLOSET SPACE\n✔️CLOSE TO SHOPPING\n✔️EASY ACCESS TO I95, AND OTHER MAJOR ROUTES\n✔️THIS PROPERTY WON'T LAST LONG, INQUIRE NOW!\nFull background checks, $35 per person\nYearly leases only\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\ncentral heating\nBeds\/Baths: 2 BD\/1 BA\nRental Terms\nRent: $1400\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY:  WWW.REDBLOCK.COM\/APARTMENTS\n\nDetails\nBeds\/Baths: 2BD\/1.0BA\nRental Terms\nRent: $1,400.00\nAvailable: 06\/01\/2022\nApplication Fee: $35.00\nSecurity Deposit: $2,800.00\n\nPet Policy\nCats allowed\nDogs not allowed\n#nata\n","num_images":8.0,"lat":40.090872,"lng":-74.968212,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-07T08:42:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1ba-1bdquiet-clean-and\/7480580983.html","post_id":7480580983,"result_date":"2022-05-07 07:12","title":"1BA\/1BDQuiet, Clean and Peaceful***Very Nice REVOVATED efficiency!","description":"This lovely one bedroom and one bath comes furnished with utilities included in the rent. We offer monthly, short and long term lease. It is located in a gated and secured neighborhood.\nKindly reply text for enquiries. INCLUDE ADDRESS .PACE FOR RENT IN PRIVATE HOUSE. 1 BEDROOM, SMALL LIVING ROOM AREA, OPEN KITCHENETTE, BATHROOM WASHER\/DRYER AVAILABLE. Use of backyard Patio AVAILABLE to move in Place is available NOW. House is walking 2 blocks from R, M train Grand Avenue station near Queens Center mall, Target and other shopping areas on Queens Blvd. Easy access to all train lines to include E, F, M lines. MAJOR SHOPPING AREA 2 BLOCKS FROM QUEENS CENTER MALL, WITH LOTS OF GREAT MARKETS. ASKING PRICE IS $1100 WITH ALL UTILITIES INCLUDED AND BENEFITS OF WASHER DRYER ON SITE AND USE OF BACKYARD SPACE\nKeyword:\n*FOR RENT APARTMENTS* *HOUSING TO RENT NEAR ME* *RENTING APARTMENT NEAR ME* *RENTING NEAR ME* *FIND APARTMENT* *PLACES RENTING NEAR ME* *APARTMENTS FOR RENT STUDIOS* *APARTMENTS LISTINGS* *PROPERTIES RENT* *APARTMENTS FOR CHEAP* *APARTMENTS TO RENT CHEAP* *PROPERTIES NEAR ME FOR RENT* *APARTMENT 1 BEDROOM FOR RENT* *CONDOS NEAR ME FOR RENT* *RENT PLACE* *APARTMENTS TO RENT NEAR ME CHEAP* *HOUSING FOR RENT BY OWNER NEAR ME* *APARTMENTS FOR RENT 3 BEDROOMS* *APT RENTAL* *APARTMENTS FOR RENT NEAR ME 1 BEDROOM* *RENTALS PROPERTY MANAGEMENT* *1 BEDROOM HOUSING FOR RENT* *2 BEDROOM APARTMENTS NEAR ME FOR RENT* *RENT 3 BEDROOM* *SEARCH APARTMENTS* *APARTMENT FOR RENT 3 BEDROOM NEAR ME* *APARTMENT RENTAL AGENCIES* *PLACES TO RENT CHEAP NEAR ME* *RENTAL AGENCIES NEAR ME* *APARTMENTS LEASE* *FOR RENT BY OWNER APARTMENTS* *APARTMENT FOR RENT ONE BEDROOM NEAR ME* *TWO BEDROOMS APARTMENTS FOR RENT* *4 BEDROOMS APARTMENTS NEAR ME* *PRIVATE OWNER APARTMENTS FOR RENT* *RENT HOUSING WEBSITES* *APARTMENTS NEAR ME FOR LEASE* *APARTMENTS WEBSITE* *RENTING USA* *CHEAP PLACES FOR RENT* *RENT LISTINGS* *APARTMENTS AVAILABLE* *FIND APARTMENT TO RENT* *FOR RENT APP* *APARTMENT COMPLEX RENT* *APARTMENT FOR RENT WEBSITES* *APARTMENT LOOKING* *APARTMENT REALTORS* *APARTMENTS FINDER APP* *APARTMENTS FOR RENT BY OWNER NEAR ME* *APARTMENTS NEAR FOR RENT* *PRIVATE APARTMENT RENTAL* *RENT THREE BEDROOM APARTMENT* *STUDIO APT NEAR ME* *APARTMENTS FOR RENT IN* *APARTMENTS SEARCH WEBSITES* *MANAGEMENT APARTMENTS* *PROPERTY MANAGEMENT APARTMENTS* *APARTMENTS FOR ME* *APARTMENTS FOR RENT APP* *APARTMENTS PRICE* *AVAILABILITY APARTMENTS FOR RENT* *FIND RENT* *FOR RENT SEARCH* *REAL ESTATE NEAR ME FOR RENT* *RENTAL FINDER* *RENTAL UNITS NEAR ME* *TWO BEDROOM APARTMENTS NEAR ME FOR RENT* *APARTMENT COMPLEX NEAR ME FOR RENT* *APARTMENT FINDING WEBSITE* *APARTMENT RENTAL SITE* *APARTMENTS AGENCY* *APARTMENTS FOR NEAR ME* *APARTMENTS FOR RENT AROUND ME* *APPT FOR RENT* *FIND APARTMENT NEAR ME* *LOCAL APARTMENT* *LOCAL APARTMENTS FOR RENT* *LOCAL RENTALS* *NEW APARTMENT FOR RENT* *RENTAL APARTMENT LISTINGS* *RENTAL AVAILABLE NEAR ME* *RENTING IN MY AREA* *1 BR APT FOR RENT* *3 BEDROOMS APT FOR RENT* *APARTMENTS FOR RENT IN MY AREA* *AVAILABLE APARTMENTS FOR RENT NOW* *AVAILABLE APTS FOR RENT NEAR ME* *BEDROOM RENTALS NEAR ME* *FINDING PLACES TO RENT* *HOME","num_images":8.0,"lat":39.9207,"lng":-75.1595,"attrs":"['1BR \/ 1Ba', '\\nsaturday 2022-05-07\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-07T06:29:47-0400"}]