[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571792526.html","post_id":7571792526,"result_date":"Mon Dec 26 2022 02:30:02 GMT+0000 ","title":"Amazing 3 bed 2 bath in South Philly !!","description":"You are looking at a 3 bedrooms house which is located in a friendly neighborhood, the middle of South Philly. It is a convenience place that is easy to access highway I-76 and I-95 or Center city. Just 5 minutes walking to Quartermaster Plaza which have BJs, Home Depot, Shop rite, Aldi, fastfood restaurants ..There is a large living room when you walk in. Next is a kitchen with appliances and cabinets so you can store all your kitchen aid. There is also a half bath on first floor. Walk to the second floor, there are 3 lightly bedrooms with closets. We also installed new windows for the whole house. The house has washer\/dryer in the basement. Owner pays for water. Renter responsible for gas and electric. Parking is on street but there are always plenty of spaces around the house. Feel free to ask me questions if you are interested. I DO NOT pick up unknown numbers (because of telemarketing), so please leave a voicemail or text me. Thank you.","num_images":10.0,"lat":39.924341,"lng":-75.184217,"attrs":"['3BR \/ 1.5Ba', '1134ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-12-25T21:26:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571772739.html","post_id":7571772739,"result_date":"Mon Dec 26 2022 00:36:44 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571777687.html","post_id":7571777687,"result_date":"Mon Dec 26 2022 00:19:28 GMT+0000 ","title":"Covered Parking, Disposal, Garage, Courtyard","description":"Call Now -  show contact info\nx 93OR Text 93 to  show contact info\nto contact us.This is a 1 Bedroom, 1 Bath, Approximately 776 Sq. Ft. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Features: Dishwasher, Electronic Thermostat, Hardwood Style Flooring, Tons of Natural Lighting Throughout, Patio\/Balcony*, Cable Ready, Flush Mount Sinks with Goose Neck Faucets, Stone Counters, Premium Stainless Steel Appliance Package, Washer\/Dryer, Custom Subway Tile Backsplashes, Gas Range, Selected, Air Conditioner, Disposal, Large Closets with Organizing Systems  *In Select Apartment Homes Community Amenities: Multiple, Expansive Outdoor Spaces, BBQ\/Picnic Area, Playground, Parisian Style Café with Demonstration Kitchen, Elevator, Covered Parking, Rooftop Dog Park, Off Street Parking, Free Weights, Courtyard, Garage, Smoke-Free Community, On-Site Management, Tennis Court, Fitness Center, On-Site Maintenance, Multiple Co-Working Studios, Sundeck, Selected Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Visit This Website to See More:https:\/\/mack.touraptnow.com\/Lsm8299JNh7gcvqGes\n","num_images":15.0,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '776ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-12-25T19:15:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571754945.html","post_id":7571754945,"result_date":"Sun Dec 25 2022 21:41:57 GMT+0000 ","title":"Beautiful 3 bedrooms with full bathroom $779 month only.","description":"Beautiful 3 bedrooms with full bathroom $779 month only. Great starter home NEWLY Updated and immaculate 2 Bedroom Ranch style home Ditch the rent and let your equity build as you sunbath on your private balcony leading off of the Living Room; . Gleaming hardwood floors throughout. Living room with fireplace, formal Dining area and Eat in Kitchen. remodeled & unveiled 2br townhome in highly coveted, pet-friendly, park-like oasis of mission playmat. end-unit opens to green space for added tranquility. large patio with storage closet & full-size washer & dryer. 2 assigned parking spots. guest parking thru-out. walk to trolley station, 24-hr fitness, bars, dining, shopping & more.2 bedrooms, Full bathroom, Laundry Rm. Full & finished walkout basement w\/recreation room, Full bath, walkout basement, 2Car garage & driveway parking spaces. Very convenient location for trans & school, Shops, and Restaurants. Professional photos, video and 2D floor plan coming later this week! Enjoy the open layout on the first floor joining the living room and kitchen, and the large backyard with a patio. application fee $ details, Washer & Dryer coin-ops available in the basement.**If you are interested please TEXT:: ((301) 7--[9--[9-3[--5---[5---[2","num_images":3.0,"lat":40.0343,"lng":-75.1213,"attrs":"['3BR \/ 3Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-12-25T16:26:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571692401.html","post_id":7571692401,"result_date":"Sun Dec 25 2022 15:25:30 GMT+0000 ","title":"34 Katherine Ave, 55 + community in South Lebanon.","description":"Manufactured home located in 55 + community in South Lebanon Township! This spacious home  features 4 bedroom, 2 full bathrooms, a living room plus a family room with a fireplace. There have been several upgrades done to the home including flooring, furnace, hot water heater plus numerous other items (see sheet attached for all the details). It is located near South Hills park,  Lebanon VA Hospital,  WellSpan  \/ Good Samaritan Hospital and numerous shopping options! It is well maintained and a MUST SEE!","num_images":5.0,"lat":40.3316,"lng":-76.3976,"attrs":"['4BR \/ 2Ba', '1863ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-12-25T10:02:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571680517.html","post_id":7571680517,"result_date":"Sun Dec 25 2022 13:40:35 GMT+0000 ","title":"Enter into a living room made for entertaining or simply cozy up!","description":"Just in time for the holidays; Welcome Home to 3124 N Judson Street!  This 3bd\/1.5ba home boasts an open concept with modern appeal.   Enter into a living room made for entertaining or simply cozy up for an evening on those cold winter nights.  Next, you're greeted by a dining area that spans into a dreamy kitchen with newer appliances such as a double oven, sure to make cooking a breeze.  Off of the kitchen, you'll find the 1st-floor bedroom that's both spacious and secluded from the rest of the home.  From the kitchen your outdoor oasis awaits and before you ascend to the 2nd floor, you'll also notice a powder room directly off of the kitchen.  Just up the sleek staircase you'll find both the master bedroom and 2nd bedroom both designed to wow with ample closet space to boot.  And at the top of the staircase is the show-stopper bathroom that includes both a glass-encased stall shower and an original clawfoot bathtub made for soaking the day away.  Throughout this spacious home, you can appreciate luxurious flooring, warm and inviting neutral tones, and a huge basement providing laundry and additional storage.","num_images":4.0,"lat":39.9954,"lng":-75.1698,"attrs":"['3BR \/ 1.5Ba', 'available now', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-12-25T08:22:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571675364.html","post_id":7571675364,"result_date":"Sun Dec 25 2022 13:16:09 GMT+0000 ","title":"2 Bed w\/ 2 Bath*Extra Large Layout**","description":"This 2 bed 2 bath rental is available extra large layout lots of square footage and a brand new kitchen with GRANITE counter tops stainless steel appliances. Large living room has hardwood floors. Additionally a new washer and dryer was installed by the owner! Tenant pays all utilities except: Trash.\n(3834 Baring St, # 201, Philadelphia, PA 19104)\n-Spacious Units\n-Stainless Steel Appliances\n-New Paint\n-Fully Equipped Kitchen\n-Laundry Machines in Units\n-Dog Washing Station\n-Pets are Welcome - no additional fee\n","num_images":1.0,"lat":39.960673,"lng":-75.198338,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T07:07:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571674432.html","post_id":7571674432,"result_date":"Sun Dec 25 2022 13:04:19 GMT+0000 ","title":"This fantastic building*a peaceful living experience apartment","description":"-Perfect Rental Apartment\nWelcome to 102 W Berks St! This fantastic building is ready to welcome you home! Building amenities include an elevator for ultimate convenience, virtual doorman, shared roof deck, beautiful modern fixtures, and more! Each unit was designed to provide you with a peaceful living experience within the city. You’ll love how each unit features hardwood flooring, recessed lighting, modern finishes, exposed spiral ductwork, and in-unit laundry. The modern kitchen is equipped with ample cabinetry above & below for storage, granite countertops, tile backsplash, and a full lineup of stainless steel appliances including dishwasher, built-in microwave, refrigerator, electric stovetop & oven. There are large windows for a bright and airy feel throughout, and high efficiency central a\/c systems will ensure year-round comfort. Your stunning bathroom boasts modern finishes including sleek tiling, floating vanity, and great light from the sconces bordering your medicine cabinet. Unit #207 is a gorgeous 1 bedroom \/ 1 bathroom apartment, offering great natural sunlight and ample living space. This wonderful apartment !About The Neighborhood :Old Kensington is an incredible neighborhood just North of Fishtown. Conveniently accessible via I-96, I-676, and public transportation bus routes and the Market Frankford Line. Close to Towey Playground, Shissler Recreation Center, Palmer Park and Palmer Doggie Depot. You’ll be surrounded by tons of shopping, dining, and entertainment options including LMNO, Goldie, Gryphon Cafe, Riverwards Produce Market, Evil Genius Beer Company, Suraya, Steap & Grind, and many more!","num_images":4.0,"lat":39.978667,"lng":-75.13369,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T06:50:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571676089.html","post_id":7571676089,"result_date":"Sun Dec 25 2022 12:34:27 GMT+0000 ","title":"This 3 bedroom 1 bathroom home is located in a beautiful cul-de-sac in","description":"This 3 bedroom 1 bathroom home is located in a beautiful cul-de-sac in the Northeast section of Philadelphia. The layout offers a spacious living room, dining room, and basement that CALL \/ TEXT OK.","num_images":1.0,"lat":40.0897,"lng":-74.9781,"attrs":"['3BR \/ 1Ba', '2218ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: App fee $15.50 (per person) & Processing fee $90 (non refundable)', \"broker fee details: Discounted broker's fee\", 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'listed by: CALL \/ TEXT OK.', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-12-25T07:21:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571676087.html","post_id":7571676087,"result_date":"Sun Dec 25 2022 12:34:26 GMT+0000 ","title":"This 3 bedroom 1 bathroom home is located in a beautiful cul-de-sac in","description":"This 3 bedroom 1 bathroom home is located in a beautiful cul-de-sac in the Northeast section of Philadelphia. The layout offers a spacious living room, dining room, and basement that CALL \/ TEXT OK.","num_images":1.0,"lat":40.0897,"lng":-74.9781,"attrs":"['3BR \/ 1Ba', '2218ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: App fee $15.50 (per person) & Processing fee $90 (non refundable)', \"broker fee details: Discounted broker's fee\", 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'listed by: CALL \/ TEXT OK.', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-12-25T07:21:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571671972.html","post_id":7571671972,"result_date":"Sun Dec 25 2022 11:07:06 GMT+0000 ","title":"Spacious and beautiful 3 bedroom 2 bathroom House","description":"renovated 3bedrooms, 1.5baths townhouse with the finished basement located at the vicinity of 3rd & Shunk Street in the Whitman\/Pennsport area in Philadelphia. The first floor has an open floor concept living room, a gorgeous kitchen with granite countertops including a peninsula, SS appliances, dishwasher and washer\/dryer.","num_images":4.0,"lat":39.912,"lng":-75.151,"attrs":"['3BR \/ 1.5Ba', '1077ft2', 'air conditioning', 'application fee details: $50 per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'detached garage', 'rent period: monthly']","posted_date":"2022-12-25T05:51:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571669303.html","post_id":7571669303,"result_date":"Sun Dec 25 2022 09:37:41 GMT+0000 ","title":"NICE AND RARE 3BD PHILADELPHIA HOUSE FOR RENT!!! APPLY.","description":"This house was recently renovated, unfortunately, has some wear & tear. Much of the first floor has new drywall with recessed lighting. Flooring is just 2 years old throughout the first floor, but does need repairs. Very close, but repairs are needed, to be move-in ready condition. House was last used as a double, but best potential use is as a 3 bed\/2 bath single. If you are interested please send me a TEXT OR CALL:( 7 2 6 ) 3 3 3 1 7 7 7\nI will contact you soon. \\ \"\"\"\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\nI am looking for a furnished room (preferably a bed and a desk) in Brooklyn (preferably areas: Bensonhurst, Sunset park, but I will consider all offers). The rental price is 600-700 dollars per month for a period of six months or more. About me: A 55-year-old man, Russian-speaking (I don't speak English very well yet). There is a permanent job at a factory in Sunset Park. I can confirm the income. The credit score is about 725. I lead a healthy lifestyle. Quiet, serious, neat and disciplined. There are . I don't smoke or drink. I guarantee timely payment.Young creative writer visiting son 24th-1\/3 needs sublet room or 'a private rm' will be in 12\/24 2 pm- son has busy house with friends needs his privacy sleeping off site is logical.. non smoker, quiet respectful personality writing most of the time, business this week as well. please send your contact number to meet will be near 495 West End by 2 pm 12\/24 to meet thank you. rental room share, no soliciting if you please~Hello to those who will see this message my name is Dewayne Jack I am currently seeking a one-bedroom apartment that is roughly around $1,200. Location varies but I will love to have an apartment which is located in Staten Island, or Queens NY I and my girlfriend are desperately looking for a place to call home. We are currently living in a room in a 2-story house in Yonkers. The tenant who poses as a landlord got an eviction notice from the state of Yonkers and the marshal will be here to evict everyone on January 3rd which puts me and her at risk and everyone renting a room in this home. We are a lovely and quiet couple who stays to ourselves and are very respectful and clean. We are trying as soon as possible to move before January which will be ideal, but we know that this is the season when people usually won't have the time to give us any tours and will spend time with theirI am seeking to rent a room for month on the upper east side for 6 months. I am a clean respectful I am a graduate student and I work. I was born and raised in America. On my spare time I like to go out with my friends and visit my family who also live in New York City. Hello, I am looking to rent out a garage anywhere in Staten Island. I want to use the garage for restoring my car and not for any business use. If you have anything that could accompany that please let me know! Thank you I am seeking a weekly rental (hopefully no more than 200 weekly) anywhere in Manhattan. I need somewhere ASAP because I have not been sleeping in days (barely), so it’s taking a toll on me and I don’t feel well. I just spent 900 total for a place that is the least sleep-friendly place I’ve ever experienced. It has not allowed me to sleep since I’ve been here due to a never-ending series of loud noises that begin around 5 am and continue on through late night (past 12). The landlords have gone awol and are not getting back to me. So I’m willing to take a loss as long as I can find a better place. ** If you have somewhere quiet where I can begin paying weekly and without deposit at first (due to my unique situation) and where I then can pay monthly after a couple weeks, that would be amazing. ** About Me: I am a 34-year-old Italian\/Dutch\/Hispanic hybrid (lol) that works as an administrative assistant for a medical company and as a server at a restaurant. I am a non-smoker, non-drinker (for the most part), and I don’t have guests. I am straight (not that it matters, just had to mention due to certain emails I have gotten). I also write history blogs online as a hobby. I am extremely respectful, clean, accepting, dependable, and quiet. I can be a great friend when you need one as well. Just looking for a quiet place with good people as roommates (if any). This is real and not a scam. Just need a place where I can actually sleep. Call, email, or text me. I am very responsive. I'm looking for one larger-sized bedroom (unfurnished) in a 2 bedroom apartment. Must be able to fit full-size bed, desk, and dresser. Below 110th street Manhattan or select locations in Brooklyn. Max rent: $900\/month including most utilities Am looking to move in March of 2023. (Flexible) About me: . 32. I am currently working in marketing and mostly WFH. and few guests. Quiet and tidy, I also assist in cleaning shared spaces and am mainly looking for a comfortable place to continue working. I drink occasionally and am not a vegetarian. (I don't mind what you do, but I know this might me an issue for some.) Don't need to be near a university, hospital, or police station. here, just left college, looking for some men to share a place with in NYC. Gay friendly, easy going living in the city. Looking to relocate soon, wanting a private or shared room. Hello, my names Taj. I am searching for an apartment in Northern Virginia. Alexandria, Reston, Arlington, Falls Church, Fairfax and surrounding areas. Very polite and respectful young man. Pursuing a career in hair and beauty. Currently I am specifically looking for private landlords with 1 br\/ 1bath. I am a cosmetology student in Reston, and I am a 28 year old from Staunton, Virginia. I am currently a client with Northern Virginia Family Services which is a housing voucher. I am looking for any 1 bedroom 1 bathroom. Northern Virginia family services is a housing locator, and housing assistance programHi! I’m a current vet student at Cornell looking for a 1-2 bedroom apartment for myself and my partner (Cornell PhD student) next year, starting in summer 2023. We have 1 cat and 1 small (20 pound) dog. It must have off-street parking for two cars, a washer\/dryer on site, and be within a 13 minute drive from the vet school. Our budget is $1400. Please let me know if you have anything that fits this description! Seeking a 6 month term downtown. 30YO professional , work full time in hospitality management. Seeking a room with bath, or an efficiency setup or perhaps a mother in law suite in a home. Any leads would be greatly appreciated. No criminal history, stable income, decent credit no evictions etc, etc. etc. I've been having trouble finding work and I found a 1099 contractor gig called sudshare. they pay .75 a pound. there are lots of busy college kids in Boston that don't want to spend $100 to do laundry in their luxury apt complex. I just need a place to do laundry and I'll give you a percentage of my income for the utilities and space share. Naples 2 bedrooms and full bathroom. Great starter home. Updated and immaculate 2 Bedroom Ranch style home set on a quiet street in Glen Woods. Gleaming hardwood floors throughout. Living room with fireplace, formal Dining area and Eat in Kitchen. remodeled & unveiled 3br townhome in highly coveted, pet-friendly, park-like oasis of mission playmor. end-unit opens to green space for added tranquility. large patio with storage closet & full-size washer & dryer. 2 assigned parking spots. guest parking thru-out. walk to mts trolley station, 24-hr fitness, bars, dining, shopping & more. Professional photos, video and 2D floor plan coming later this week! Enjoy the open layout on the first floor joining the living room and kitchen, and the large backyard with a patio.\n","num_images":4.0,"lat":40.0018,"lng":-75.1179,"attrs":"['3BR \/ 2Ba', 'available now', 'EV charging', 'cats are OK - purrr', 'furnished', 'house', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-12-25T04:33:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571658938.html","post_id":7571658938,"result_date":"Sun Dec 25 2022 05:43:52 GMT+0000 ","title":"SUBLEASE 9 months left on the lease","description":"Subleasing my one bedroom\/one bath apartment in The Terrace building located between Logan Square and the Comcast building.\nLease ends in September, you’ll be signing to take over my lease with the building management (Pearl Properties) and you’ll need to go through their credit\/background check.\nThe apartment is partially furnished with a queen bed and a dining set, some kitchenware\/cookware as well, all of which you can keep for free if you’d like.\nThe apartment comes with light fixtures and a mounted 55” TV (provided by the building, not yours to keep)\nThe apartment is on the 15th floor with gorgeous views from a good size balcony (I have two lounge chairs there which you can keep for free as well).\nThe Terrace is a nice modern building with 24 hour front desk, gym, common spaces with a pool table and other amenities (no swimming pool).\nCheck out their website\nhttps:\/\/pearl-apartments.com\/properties\/the-terrace-on-18th\/\n","num_images":9.0,"lat":39.956314,"lng":-75.169036,"attrs":"['1BR \/ 1Ba', '688ft2', 'available jan 1, 2023', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-12-25T00:18:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571648731.html","post_id":7571648731,"result_date":"Sun Dec 25 2022 02:57:27 GMT+0000 ","title":"3 Bedroom","description":"Newly renovated 3 bedroom bilevel 2nd floor apt with rooftop deck is available for rent in Francisville area of Philadelphia. All new appliances with washing machine and dryer.","num_images":22.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 3Ba', '1500ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-24T21:53:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571647536.html","post_id":7571647536,"result_date":"Sun Dec 25 2022 02:45:13 GMT+0000 ","title":"3 bedroom Apt","description":"Newly renovated 3 bedroom bi-level apts is available for rent in the Francisville area of Philadelphia. All new appliances with washing machine and dryer in each Unit.","num_images":22.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2Ba', '1500ft2', 'available jan 1, 2023', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-24T21:38:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571735089.html","post_id":7571735089,"result_date":"Sun Dec 25 2022 20:01:16 GMT+0000 ","title":"2 bedroom house for rent (ready now)","description":"Ready for moving. 2 bedrooms, one bathroom. Washer and dryer in basement. Two level unit. Rent is 1100 per month. First and security required.\nLooking for somebody responsible.\nYou must fill out an application before we meet, as I come from two and a half hours away. Pets are okay if they are good.\nText me if you would like me to email you one.  show contact info","num_images":7.0,"lat":39.9772,"lng":-75.2545,"attrs":"['2BR \/ 1Ba', '1000ft2', 'air conditioning', 'application fee details: $34.99 rental history and background', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T14:27:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571738664.html","post_id":7571738664,"result_date":"Sun Dec 25 2022 19:51:49 GMT+0000 ","title":"Quality Apartment for rent","description":"Are you seeking an apartment for rent recently rehabbed close to SEPTA and Broad St line","num_images":0.0,"lat":40.0118,"lng":-75.1456,"attrs":"['1BR \/ 1Ba', '900ft2', 'available now', '\\nmonday 2022-12-26\\n', '\\ntuesday 2022-12-27\\n', '\\nwednesday 2022-12-28\\n', 'cats are OK - purrr', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-12-25T14:47:49-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571734981.html","post_id":7571734981,"result_date":"Sun Dec 25 2022 19:30:31 GMT+0000 ","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T14:26:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571734642.html","post_id":7571734642,"result_date":"Sun Dec 25 2022 19:28:23 GMT+0000 ","title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nApartment Features\n* Walk-in Closet\n* Washer and Dryer in unit\n* Linen Closet\n* Stainless Steel Appliances\n* Kitchen Island\n* Garden Tub\n* Private Patio or Private Balcony (on select apartments)","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T14:24:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571734561.html","post_id":7571734561,"result_date":"Sun Dec 25 2022 19:27:51 GMT+0000 ","title":"Laundry in Unit, Central Location, Ideal Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Easy Freeway Access\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* Bark Park\n* Spa\n* Professionally Managed\n* Outdoor Grill Area\n* Billiards\n* Swimming Pool\n* Yoga Lounge\n* TV Lounge\n* Fitness Studio\n* Sun Deck\n* Community Lounge","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1186ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T14:23:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571734492.html","post_id":7571734492,"result_date":"Sun Dec 25 2022 19:27:27 GMT+0000 ","title":"Fitness Center, Incredible Features, Central Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nBe the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nApartment Features\n* Linen Closet\n* Private Patio or Private Balcony (on select apartments)\n* Washer and Dryer in unit\n* Stainless Steel Appliances\n* Kitchen Island\n* Walk-in Closet\n* Garden Tub","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '815ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T14:23:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571730156.html","post_id":7571730156,"result_date":"Sun Dec 25 2022 19:00:01 GMT+0000 ","title":"Apartment for rent for $1200","description":"An absolutely stunning apartment with two bedrooms, brand new bathroom and kitchen on the second floor for $1200.","num_images":0.0,"lat":39.9448,"lng":-75.2288,"attrs":"['2BR \/ 1Ba', '1336ft2', 'available now', '\\nmonday 2022-12-26\\n', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-12-25T13:56:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571715476.html","post_id":7571715476,"result_date":"Sun Dec 25 2022 18:12:43 GMT+0000 ","title":"## ! HAPPY CHRISTMAS !\/! BROKER FEE NO~+ $00.00","description":"-=\nThis is a very large newly renovated one bedroom apartment located close to shopping and transportation! No security deposit, but a move in fee of 400 is required. Hot water, heat, and appliances included. Owner is looking for immediate occupancy, so please serious replies only. PETS OK . If you are interested in my room please send your phone number.\n","num_images":0.0,"lat":40.0897,"lng":-74.9781,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'application fee details: Application Fee Yes~+ $25.00', 'broker fee details: BROKER FEE Yes~+ $10.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T12:28:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571715433.html","post_id":7571715433,"result_date":"Sun Dec 25 2022 18:06:27 GMT+0000 ","title":"CUTE !!  newly Upgraded ## plnty of additional storage.","description":"1ST-JANU-AVAILABLE -|- 2 BDRM+ 1 BARM TOWNHUSE IN (Philadelphia Mills)!!!.\nThis newly Upgraded Aspen features a private entrance and plank flooring throughout. The Townhome opens to a cozy living room with tongue-and-groove panels for a cabin-like feel. The kitchen features custom white cabinets, quartz countertops, and gray appliances which lead to the dining room and private outdoor space. The upstairs features 2 bedrooms with vaulted ceilings, large closets, and plenty of natural light. The bathroom is centrally located between both bedrooms. There is a large closet in the hallway for plenty of additional storage.\n","num_images":4.0,"lat":40.0897,"lng":-74.9781,"attrs":"['2BR \/ 1Ba', '900ft2', 'air conditioning', 'application fee details: Application Fee Yes~+ $25.00', 'broker fee details: BROKER FEE Yes~+ $10.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T12:28:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571697746.html","post_id":7571697746,"result_date":"Sun Dec 25 2022 16:24:01 GMT+0000 ","title":"**HAPPY CHRISTMAS**-PETS OK + CozY 2BR 1Ba Apt For Rent!!","description":"This is a very large newly renovated one bedroom apartment located close to shopping and transportation! No security deposit, but a move in fee of 400 is required. Hot water, heat, and appliances included. Owner is looking for immediate occupancy, so please serious replies only. PETS OK . If you are interested in my room please send your phone number.","num_images":0.0,"lat":40.1813,"lng":-74.9104,"attrs":"['2BR \/ 1Ba', 'EV charging', 'application fee details: $15.00 app f`e`e` no AdmiN feE', 'broker fee details: +):Broker Fee NO+>', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'listed by: Realty GrEat ApartMentS North Inc', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T10:41:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571697478.html","post_id":7571697478,"result_date":"Sun Dec 25 2022 16:09:47 GMT+0000 ","title":"100 N Buckstown Rd, Nice 2 bedrooms. Great starter home *","description":"Nice 2 bedrooms and full bathroom. Great starter home. Updated and immaculate 2 Bedroom Ranch style home set on a quiet street in 100 N Buckstown Rd, Langhorne, PA. Gleaming hardwood floors throughout. Living room with fireplace, formal Dining area and Eat in Kitchen. remodeled & unveiled 2br townhome in highly coveted, pet-friendly, park-like oasis of mission playmat. end-unit opens to green space for added tranquility. large patio with storage closet & full-size washer & dryer. 2 assigned parking spots. guest parking thru-out. walk to trolley station, 24-hr fitness, bars, dining, shopping & more.2 bedrooms, Full bathroom, Laundry Rm. Full & finished walkout basement w\/recreation room, Full bath, walkout basement, 2Car garage & driveway parking spaces. Very convenient location for trans & school, Shops, and Restaurants. Professional photos, video and 2D floor plan coming later this week! Enjoy the open layout on the first floor joining the living room and kitchen, and the large backyard with a patio. If you interested Contact Me I will contact you soon.","num_images":0.0,"lat":40.1813,"lng":-74.9104,"attrs":"['2BR \/ 1.5Ba', 'air conditioning', 'application fee details: $15.00 app f`e`e` no AdmiN feE', 'broker fee details: +):Broker Fee NO+>', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'listed by: Realty GrEat ApartMentS North Inc', 'carport', 'rent period: monthly']","posted_date":"2022-12-25T10:38:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571700178.html","post_id":7571700178,"result_date":"Sun Dec 25 2022 16:02:45 GMT+0000 ","title":"House for Rent","description":"Home for rent (listed for sale but will consider retaining home as a rental ) in Huntingdon Valley, PA - Lower Moreland Township and School District Home 3-4 Bedrooms and 2.5 Bath (den on 1st floor can be used as 4th bedroom) 2090 square feet of living space plus unfinnished basement and 2 car garage on .51 acres-  Available for immediate occupancy- Applicants will need to meet income and credit requirements.","num_images":21.0,"lat":40.14773,"lng":-75.03372,"attrs":"['3BR \/ 2.5Ba', '2090ft2', 'available jan 1, 2023', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-12-25T10:58:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571691922.html","post_id":7571691922,"result_date":"Sun Dec 25 2022 16:01:12 GMT+0000 ","title":"2012 Mallard Ln, 3bed\/2bath.Welcome Home!","description":"Welcome Home!  This lovely home is well maintained and has welcoming landscaping and front porch.  Entering the  home you notice 9ft ceilings and have a view of the open living room and kitchen area.  At the entry is a hall closet and an office to the right with a solar tube and front windows for extra lighting.  The living room has a gas fireplace.  The eat-in kitchen has a sliding glass door that features a peaceful view of a pond to watch the wildlife or sit outside on the patio and deck under the pergola to enjoy the beautiful view.  The kitchen has ample counter space with additional seating at the counter peninsula.  Enjoy cooking in a well designed kitchen with great work space, tile backsplash, Corian counters and a gas stove.  The laundry is off the kitchen and two car garage.  The main bedroom is located off the front hallway and overlooks the back yard with the main bath, with heat light, and walk-in closet at the front of the home.  The two additional bedrooms and hall bath are off the kitchen area.  The bonus room is on the second floor and  will make a great playroom or office!  The backyard is great for entertaining with a patio and Trex deck with a pergola.  The gas grill that will stay with the home is fueled by natural gas so there is no need to deal with propane tanks ever again.  The mechanicals are located in the basement and inspected two times per year.  The natural gas line is currently used for the fireplace, stove and grill so the furnace could be switched from electric to gas if desired.  There is a security system installed but is not monitored.  This is a well-maintained truly loved home!","num_images":8.0,"lat":40.3812,"lng":-76.4368,"attrs":"['3BR \/ 2Ba', '1737ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-12-25T10:00:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571697029.html","post_id":7571697029,"result_date":"Sun Dec 25 2022 16:00:17 GMT+0000 ","title":"Realty GrEat ApartMentS North Inc-\/-1ST-JANU-AVAILABLE -|- 2 BDRM+","description":"1ST-JANU-AVAILABLE -|- 2 BDRM+ 1 BARM TOWNHUSE IN (126 Chestnut St, Philadelphia, PA)!!!.\nThis newly Upgraded Aspen features a private entrance and plank flooring throughout. The Townhome opens to a cozy living room with tongue-and-groove panels for a cabin-like feel. The kitchen features custom white cabinets, quartz countertops, and gray appliances which lead to the dining room and private outdoor space. The upstairs features 2 bedrooms with vaulted ceilings, large closets, and plenty of natural light. The bathroom is centrally located between both bedrooms. There is a large closet in the 126 Chestnut St, Philadelphia, PA for plenty of additional storage.\n","num_images":5.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'application fee details: Application Fee Yes~+ $25.00', 'broker fee details: BROKER FEE Yes~+ $10.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'listed by: Realty GrEat ApartMentS North Inc-\/-', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-12-25T10:35:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571696934.html","post_id":7571696934,"result_date":"Sun Dec 25 2022 15:45:38 GMT+0000 ","title":"very large newly renovated one bed!@#  339 N 11th St, Philadelphia, P","description":"=\nThis is a very large newly renovated one bedroom apartment located close to shopping and transportation! No security deposit, but a move in fee of 400 is required. Hot water, heat, and appliances included. Owner is looking for immediate occupancy, so please serious replies only. PETS OK . If you are interested in my room please send your phone number.\n","num_images":0.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', 'available jan 12, 2023', 'EV charging', 'air conditioning', 'application fee details: $50.00 app f`e`e` no AdmiN feE', 'broker fee details: NO', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'listed by: Realty GrEat ApartMentS North Inc-\/-', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-12-25T10:34:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7571697399.html","post_id":7571697399,"result_date":"Sun Dec 25 2022 15:42:14 GMT+0000 ","title":"Beautiful 3 Bedroom Duplex","description":"This house was recently renovated, unfortunately, has some wear & tear. Much of the first floor has new drywall with recessed lighting. Flooring is just 2 years old throughout the first floor, but does need repairs. Very close, but repairs are needed, to be move-in ready condition. House was last used as a double, but best potential use is as a 3 bed\/2 bath single. If you are interested please send me a TEXT OR CALL:::(7 2 0) 7 2 7-1 3 6 2\nI will contact you soon. \\ \"\"\"\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\nI am looking for a furnished room (preferably a bed and a desk) in Brooklyn (preferably areas: Bensonhurst, Sunset park, but I will consider all offers). The rental price is 600-700 dollars per month for a period of six months or more. About me: A 55-year-old man, Russian-speaking (I don't speak English very well yet). There is a permanent job at a factory in Sunset Park. I can confirm the income. The credit score is about 725. I lead a healthy lifestyle. Quiet, serious, neat and disciplined. There are . I don't smoke or drink. I guarantee timely payment.Young creative writer visiting son 24th-1\/3 needs sublet room or 'a private rm' will be in 12\/24 2 pm- son has busy house with friends needs his privacy sleeping off site is logical.. non smoker, quiet respectful personality writing most of the time, business this week as well. please send your contact number to meet will be near 495 West End by 2 pm 12\/24 to meet thank you. rental room share, no soliciting if you please~Hello to those who will see this message my name is Dewayne Jack I am currently seeking a one-bedroom apartment that is roughly around $1,200. Location varies but I will love to have an apartment which is located in Staten Island, or Queens NY I and my girlfriend are desperately looking for a place to call home. We are currently living in a room in a 2-story house in Yonkers. The tenant who poses as a landlord got an eviction notice from the state of Yonkers and the marshal will be here to evict everyone on January 3rd which puts me and her at risk and everyone renting a room in this home. We are a lovely and quiet couple who stays to ourselves and are very respectful and clean. We are trying as soon as possible to move before January which will be ideal, but we know that this is the season when people usually won't have the time to give us any tours and will spend time with theirI am seeking to rent a room for month on the upper east side for 6 months. I am a clean respectful I am a graduate student and I work. I was born and raised in America. On my spare time I like to go out with my friends and visit my family who also live in New York City. Hello, I am looking to rent out a garage anywhere in Staten Island. I want to use the garage for restoring my car and not for any business use. If you have anything that could accompany that please let me know! Thank you I am seeking a weekly rental (hopefully no more than 200 weekly) anywhere in Manhattan. I need somewhere ASAP because I have not been sleeping in days (barely), so it’s taking a toll on me and I don’t feel well. I just spent 900 total for a place that is the least sleep-friendly place I’ve ever experienced. It has not allowed me to sleep since I’ve been here due to a never-ending series of loud noises that begin around 5 am and continue on through late night (past 12). The landlords have gone awol and are not getting back to me. So I’m willing to take a loss as long as I can find a better place. ** If you have somewhere quiet where I can begin paying weekly and without deposit at first (due to my unique situation) and where I then can pay monthly after a couple weeks, that would be amazing. ** About Me: I am a 34-year-old Italian\/Dutch\/Hispanic hybrid (lol) that works as an administrative assistant for a medical company and as a server at a restaurant. I am a non-smoker, non-drinker (for the most part), and I don’t have guests. I am straight (not that it matters, just had to mention due to certain emails I have gotten). I also write history blogs online as a hobby. I am extremely respectful, clean, accepting, dependable, and quiet. I can be a great friend when you need one as well. Just looking for a quiet place with good people as roommates (if any). This is real and not a scam. Just need a place where I can actually sleep. Call, email, or text me. I am very responsive. I'm looking for one larger-sized bedroom (unfurnished) in a 2 bedroom apartment. Must be able to fit full-size bed, desk, and dresser. Below 110th street Manhattan or select locations in Brooklyn. Max rent: $900\/month including most utilities Am looking to move in March of 2023. (Flexible) About me: . 32. I am currently working in marketing and mostly WFH. and few guests. Quiet and tidy, I also assist in cleaning shared spaces and am mainly looking for a comfortable place to continue working. I drink occasionally and am not a vegetarian. (I don't mind what you do, but I know this might me an issue for some.) Don't need to be near a university, hospital, or police station. here, just left college, looking for some men to share a place with in NYC. Gay friendly, easy going living in the city. Looking to relocate soon, wanting a private or shared room. Hello, my names Taj. I am searching for an apartment in Northern Virginia. Alexandria, Reston, Arlington, Falls Church, Fairfax and surrounding areas. Very polite and respectful young man. Pursuing a career in hair and beauty. Currently I am specifically looking for private landlords with 1 br\/ 1bath. I am a cosmetology student in Reston, and I am a 28 year old from Staunton, Virginia. I am currently a client with Northern Virginia Family Services which is a housing voucher. I am looking for any 1 bedroom 1 bathroom. Northern Virginia family services is a housing locator, and housing assistance programHi! I’m a current vet student at Cornell looking for a 1-2 bedroom apartment for myself and my partner (Cornell PhD student) next year, starting in summer 2023. We have 1 cat and 1 small (20 pound) dog. It must have off-street parking for two cars, a washer\/dryer on site, and be within a 13 minute drive from the vet school. Our budget is $1400. Please let me know if you have anything that fits this description! Seeking a 6 month term downtown. 30YO professional , work full time in hospitality management. Seeking a room with bath, or an efficiency setup or perhaps a mother in law suite in a home. Any leads would be greatly appreciated. No criminal history, stable income, decent credit no evictions etc, etc. etc. I've been having trouble finding work and I found a 1099 contractor gig called sudshare. they pay .75 a pound. there are lots of busy college kids in Boston that don't want to spend $100 to do laundry in their luxury apt complex. I just need a place to do laundry and I'll give you a percentage of my income for the utilities and space share. Naples 2 bedrooms and full bathroom. Great starter home. Updated and immaculate 2 Bedroom Ranch style home set on a quiet street in Glen Woods. Gleaming hardwood floors throughout. Living room with fireplace, formal Dining area and Eat in Kitchen. remodeled & unveiled 3br townhome in highly coveted, pet-friendly, park-like oasis of mission playmor. end-unit opens to green space for added tranquility. large patio with storage closet & full-size washer & dryer. 2 assigned parking spots. guest parking thru-out. walk to mts trolley station, 24-hr fitness, bars, dining, shopping & more. Professional photos, video and 2D floor plan coming later this week! Enjoy the open layout on the first floor joining the living room and kitchen, and the large backyard with a patio.","num_images":6.0,"lat":39.9925,"lng":-75.1415,"attrs":"['3BR \/ 2Ba', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d hookups', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-12-25T10:38:14-0500"}]