[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561778440.html","post_id":7561778440,"result_date":"Sun Nov 27 2022 01:55:34 GMT+0000 ","title":"High-End Apts. Minutes to Philly airport & Boeing NORTHVIEW BUILDING","description":"www.northviewpa.com\nThe NORTHVIEW BUILDING Located in scenic, suburban Eddystone, Pa, Northview is a newly renovated apartment building that combines homestyle decor and modern design to create the perfect combination of comfort and style. With balconies overlooking picturesque Ridley Creek, Northview offers a taste of nature’s beauty with all the conveniences of city-life. Close to shopping and transportation and part of the sought - after Ridley School District.\nSome features include, Spacious living and bed rooms with plenty of closet and storage. Modern shaker style kitchen cabinets with Granite counter tops, brushed nickel fixtures built - in microwaves and stainless appliances. Vinyl, wood plank flooring and modern high- end finishes. Modernly- styled bathrooms and modern laundry facilities. Card access entry system and security cameras throughout interior and exterior of building.\nwww.northviewpa.com\n","num_images":15,"lat":39.860419,"lng":-75.345772,"attrs":"['1BR \/ 1Ba', '750ft2', 'available now', 'air conditioning', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T20:51:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561756150.html","post_id":7561756150,"result_date":"Sun Nov 27 2022 00:40:58 GMT+0000 ","title":"Affordable Unique 2Bd 1Ba Apartment","description":"Freshly painted 2br 1ba in Brewerytown. Easy access to I76, Fairmount park, Kelly Drive, and downtown bright well lit two bedroom apartment with hard wood floors. Remodeled kitchen with washer and dryer, First month, last month, and security deposit required.\nPet friendly.\nThe renter is responsible for gas and electricity. Small pets are allowed.\n","num_images":20,"lat":39.974876,"lng":-75.172239,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T19:17:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561742341.html","post_id":7561742341,"result_date":"Sun Nov 27 2022 00:30:55 GMT+0000 ","title":"Recently renovated 3BR**2nd Floor**apartment 1 year lease Now","description":"Recently renovated Second Floor Unit, 3 BD, 1.5 bathroom apartment available starting January 1st 2023, 1 year lease required. Rent is $940.00 per month and private parking is available for an additional fee. Applicants are required to complete a rental application and submit required documentation (proof of income 2.5x rent per month for combined applicants). 1 month and a half security deposit as well as first month rent due upon signing 1 year lease.","num_images":7,"lat":39.977133,"lng":-75.165601,"attrs":"['3BR \/ 1.5Ba', 'application fee details: $11..........Application Fee......@@', 'broker fee details: $20..........Broker Fee !!', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-26T18:28:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561719816.html","post_id":7561719816,"result_date":"Sun Nov 27 2022 00:14:23 GMT+0000 ","title":"Wonderful 2 bed, loft, 1.5 baths, 2 car garage with Opener RENT~!","description":"Wonderful 2 bedrooms, loft, 1 baths, 2 car garage with opener, over 1550 sq. ft. - HOA takes care of the lawn\/snow & Exterior of property. Main level consists of a wood burning fireplace, dining room, kitchen, living room, half bath and laundry room with washer\/dryer. Upstairs you will find a large loft area, primary bedroom with attached bathroom and walk in closet, 2nd bedroom and a full bath. Basement has storage area large family room. Wood floors on main and upper level, bedrooms and basement have carpet.. Enjoy the A\/C in the summer and large fenced patio area. If you are interested so text::::::::::::::::--","num_images":4,"lat":39.8253,"lng":-75.8374,"attrs":"['2BR \/ 1.5Ba', 'available nov 30', '\\nthursday 2022-12-01\\n', 'application fee details: Application Fee $25..............>?', 'broker fee details: Broker Fee $40...........................@@', 'cats are OK - purrr', 'dogs are OK - wooof', 'loft', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-26T17:17:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561744088.html","post_id":7561744088,"result_date":"Sun Nov 27 2022 00:10:58 GMT+0000 ","title":"Large 1 bed New flooring Apt Rent heart of Philadelphia, PA","description":"Large 1 bedroom unit in the heart of Philadelphia, PA. New kitchen, new bathroom, new flooring, new paint, and new appliances. Open layout with spacious lanai overlooking the beautiful Sun views.\nConvenient covered parking stall on the ground floor with secured entrance.\n","num_images":4,"lat":39.980381,"lng":-75.181104,"attrs":"['1BR \/ 1Ba', 'available dec 3', 'application fee details: Per Application Fee..........$10 !!', 'broker fee details: No Broker Fee ..........Needed !!', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-26T18:34:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561716950.html","post_id":7561716950,"result_date":"Sat Nov 26 2022 23:42:48 GMT+0000 ","title":"Freshly painted W\/D New LVP floor-Nice Townhome!","description":"Beautiful Townhome located in a quite cul-de-sac next to the Newtown Square, With abundant natural beauty and walking trails. Freshly painted with new LVP floor in the main level and new carpet upstairs. The main level kitchen features granite countertops and updated appliances. If you want to take our 3 bed house, please contact us thanks>>>>?","num_images":3,"lat":39.9863,"lng":-75.407,"attrs":"['3BR \/ 2.5Ba', 'available nov 30', '\\nsaturday 2022-12-03\\n', 'application fee details: $21..............>?', 'broker fee details: $35...........................@@', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T17:08:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561739039.html","post_id":7561739039,"result_date":"Sat Nov 26 2022 23:21:47 GMT+0000 ","title":"Beachfront cottage","description":"Quiet, quirky, quaint beachfront bungalow for rent. Located only 12min from downtown St Petersburg and only a short walk to historic, eccentric Gulfport Beach restaurants.\nWith private beach, firepit, and water access, just slide a kayak in the water and paddle 10min to the Clam Bayou mangroves reserve or 15min the other direction to the Gulfport Tuesday Market.\nEnjoy one of the last patches of affordable shoreline rental property in Florida. Be surrounded by multi-million dollar homes but only pay $1700 a month. Will go fast so call now.\nBay front 1 bedroom cottage with private porch on Boca Ciega Bay. AC and ceiling fans.\nBest bay view. Private beach. Water access.  Trash pick-up and water are included In the rent.\nGreat location, Close to restaurants and shopping.\n4990 31st Ave S, Gulfport Fl\n","num_images":13,"lat":27.7549,"lng":-82.7208,"attrs":"['1BR \/ 1Ba', '450ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T18:17:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561710283.html","post_id":7561710283,"result_date":"Sat Nov 26 2022 22:17:45 GMT+0000 ","title":"Italian-style mansion 1bedroom, 1 bathroom condo, in unit washer","description":"The historic J.J. Morton House, an Italian-style mansion located on a picture perfect block in the heart of Fairmount, is the setting for 1901 Green Street #7, a bi-level, one bedroom home with plenty of charm, convenience and original details throughout. The secure and gated picturesque courtyard leads to your private entrance into the condo where you’ll find an updated living room and full kitchen featuring granite countertops w\/ breakfast bar overhang, stainless steel appliances including a dishwasher and plenty of cabinet storage. A convenient laundry closet w\/ a stackable washer and dryer complete this space. The en-suite bathroom features a tiled shower, pedestal sink and a mirrored door with original hardware. Not to be missed are the extra large front steps of the building that highlight the architectural detail of the impressive facade of the historic brownstone mansion. SEND YOUR NUMBER FOR MORE DETAILS.","num_images":3,"lat":39.964781,"lng":-75.169102,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T16:49:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561707405.html","post_id":7561707405,"result_date":"Sat Nov 26 2022 21:45:49 GMT+0000 ","title":"2b\/1br rental near Zoo & art museum","description":"2 bed\/ 1 bathroom 2nd floor unit\nOnly 0.6 mi to Art Museum\nBrewery town\nCorner unit with lots of window and lots of Sunlight\nLandlord lives in unit and is very helpful with everything.\nPlease message me to inquire any questions!\n","num_images":17,"lat":39.9753,"lng":-75.1753,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available dec 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T16:41:49-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561699097.html","post_id":7561699097,"result_date":"Sat Nov 26 2022 21:34:55 GMT+0000 ","title":"Great views! Spacious units","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Pet-friendly livingHuge walk-in closets with ample storageOn-site bike storageBark parkGame Room with Billiards Table, Shuffle Board, and moreUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingBocce ball fieldFront Desk attendant during mornings and evenings to greet you and assist you with anything and everything48-hour Maintenance CommitmentUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densJogging trail right outside your doorAlexa or Google Home Capable in all ApartmentsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/y4nsncn6\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-26T16:18:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561581883.html","post_id":7561581883,"result_date":"Sat Nov 26 2022 16:51:51 GMT+0000 ","title":"3-bedroom House","description":"A nice 3-Bedroom house. Close to transportation and shopping.  Call Mrs Harley  show contact info\n.","num_images":0,"lat":39.992971,"lng":-75.159721,"attrs":"['3BR \/ 1Ba', 'available dec 1', 'house', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T11:47:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561561624.html","post_id":7561561624,"result_date":"Sat Nov 26 2022 16:43:19 GMT+0000 ","title":"Unique 1 bedroom w\/d large kitchen & office\/study room Available","description":"This unit is unique! Spacious living room, unusually big bedroom with nice closet, large kitchen, and an office\/study. Fantastic windows, lots of light! Off street parking. Excellent location, walking distance to down town","num_images":3,"lat":39.7378,"lng":-75.5497,"attrs":"['1BR \/ 1Ba', 'application fee details: $20 lease processing fee!!!', 'broker fee details: $50 ........... Brokers Fee@@!!!', 'apartment', 'no laundry on site', \"listed by: Pre-War Realty ONE MONTH'S RENT!!!\", 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T11:01:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561567943.html","post_id":7561567943,"result_date":"Sat Nov 26 2022 16:31:36 GMT+0000 ","title":"2 Bedroom Apartments Available","description":"Apt. 2305 — Royal floor plan — 1,293 sq. ft. — $3,384\nThis 3rd floor royal boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture, a dining set and bar stools, stainless steel appliances. The master suite comes with an enormous walk-in closet and double sinks with a luminous shower. The guest bedroom is room as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1293ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-26T11:15:36-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561572766.html","post_id":7561572766,"result_date":"Sat Nov 26 2022 16:31:01 GMT+0000 ","title":"Walk to Train & Shopping, D\/W, PETS, 24\/7 Gym, W\/D","description":"❄️Snow Place like HOME- Apply Now - Receive One-Month FREE❄️\nApt #A-20 Second floor apartment w\/ beautiful courtyard view. Newly renovated, close to the train & shopping!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 8:30 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":24,"lat":40.0,"lng":-75.276,"attrs":"['2BR \/ 1Ba', '897ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T11:27:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561566015.html","post_id":7561566015,"result_date":"Sat Nov 26 2022 16:19:06 GMT+0000 ","title":"$300\/Week.","description":"One bedroom on York Rd.\nConvenient location.  Second floor in a Victorian home.\nRemodeled and worth your time to inspect this offer.  Also, available on or about Jan first a smaller one B\/R @ $250\/week located on the first floor.","num_images":0,"lat":40.180914,"lng":-75.106594,"attrs":"['1BR \/ 1Ba', '400ft2', 'available nov 30', 'air conditioning', 'house', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: weekly']","posted_date":"2022-11-26T11:11:10-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561567266.html","post_id":7561567266,"result_date":"Sat Nov 26 2022 16:18:06 GMT+0000 ","title":"Beautiful 4B\/2B unit in Center City Available in January!!","description":"You'll Fall in love with all the charming details in this modern unit! This unit offers a private entrance to a beautiful 4BR\/2B unit. Modern kitchen with granite countertops and stainless steel appliances. Newly ceramic tiled floors and carpeted bedrooms. Four spacious bedrooms, all with great closet space. Some rooms offer a \"bonus room\" which can be used as an office or additional storage. Some bedrooms offer walk-in closets. Individually controlled central heating and air conditioning. Unit includes washer\/dryer. Cats are welcome (add'l fee)! Apartment is rented unfurnished.\nChancellor Apartments is a convenient high rise apartment community in an amazing location in Center City. We are close to most major schools and universities, public transportation, historical attractions, shopping, restaurants and theaters. Center City at its best!!\nRent includes: Water, 24-hour front desk attendant, free bike storage room, package acceptance service, 24-hour emergency maintenance service, BuildingLink resident services portal access for all residents.\nThe Chancellor boasts several different studio and one bedroom floor plans. Apartments feature high ceilings, large bright windows, ceiling fans in most units, hardwood floors and breathtaking views of the Philadelphia skyline and Delaware River. Many apartments have large walk-in closets, too!\nWe have partnered with Optimal Sport Health Club to offer a generous discounted gym membership (we pay your initiation fee!). There are several off street parking lots and garages in the area, too!\nCHANCELLOR APARTMENTS\n206 S. 13th Street\nPhiladelphia, PA 19107\nshow contact info\nFranceina Thorne, REALTOR\nHours:\nMon. - Fri. 8:30 to 5:00\nSaturday - 10:00 to 3:00\nAppointments are highly recommended\nProfessionally Managed by: Chancellor Properties, Inc.\nwww.cpihome.com\n\"CONSUMER NOTICE\"\nChancellor Properties, Inc. hereby states that with respect to this property, they are acting in the following capacity: an agent of the owner\/landlord pursuant to a property management or exclusive leasing agreement.\nEQUAL HOUSING OPPORTUNITY","num_images":14,"lat":39.948681,"lng":-75.162197,"attrs":"['4BR \/ 2Ba', 'available jan 14, 2023', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T11:14:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561556271.html","post_id":7561556271,"result_date":"Sat Nov 26 2022 16:03:08 GMT+0000 ","title":"1 Bedroom apt with Backyard and Basement","description":"A very nice 1 bedroom apartment (approximately 700 sqft). Available for rent on 12\/1\/22. The apartment includes a private backyard and basement for extra work and storage space. Laminate hardwood floors throughout. Modern kitchen with stainless steel appliances. Full size washer and dryer in the unit.\nConvenient location. 3 blocks to Tasker-Morris Subway stop. Short walk to Passyunk Walk, South Philadelphia Tap Room, American Sardine, South Street, and Rittenhouse Square. Walking distance to Center City. Free off street parking.\nCats\/Dogs are ok with a $250 non-refundable fee per pet.\nAvailable for rent on 12\/1\/22. 1st month, Last month and Security deposit required. We will be running a credit and background check.\nText or Email to schedule a showing.\nshow contact info","num_images":18,"lat":39.93118,"lng":-75.173778,"attrs":"['1BR \/ 1Ba', '700ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T10:48:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561544598.html","post_id":7561544598,"result_date":"Sat Nov 26 2022 15:22:35 GMT+0000 ","title":"Upgraded Kitchen, PETS, 24\/7 Gym, W\/D, Garage Parking Avail.","description":"❄️Snow Place like HOME- Apply Now - Receive One-Month FREE❄️\nApt #C-18 Second floor apartment with beautiful courtyard view. Newly renovated and close to the train!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 8:30 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":24,"lat":40.0,"lng":-75.276,"attrs":"['1BR \/ 1Ba', '663ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T10:18:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561539774.html","post_id":7561539774,"result_date":"Sat Nov 26 2022 15:09:45 GMT+0000 ","title":"Laundry in Unit, Lease Today, Convenient Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nLooking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\n[#9496309]","num_images":18,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-26T10:05:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561507326.html","post_id":7561507326,"result_date":"Sat Nov 26 2022 14:59:33 GMT+0000 ","title":"Move in with $0 DEPOSIT! Renovated one bedroom a apartment@ 532 N 15th","description":"Available Now\nOne year lease\n$750 a month\nRenovated one bedroom a apartment@\n532 N 15th St Apt 3F\nPhiladelphia PA 19130\n(Corner of 15th St and Brandywine St, one block north of Spring Garden Street)\nEnter into a small hall with closet and recessed lighting\nKitchen, living room combo\nSolid wood white 42” cabinets, self closing drawers and doors\nQuartz counter, dishwasher, fridge, all white appliances\nNew looking wood floors throughout, new blinds and curtain rods on every window\nCrown molding throughout the apartment, recessed lighting in every room including bathroom and controlled with dimmers\nWindow AC unit included\nBathroom with new floating vanity, toilet and medicine cabinet.\nGreat neighborhood in Fairmount, Art museum, Center City\nBlock away from Community College, close to Temple University, and many other colleges and Universities. Two blocks from fairmount Ave. close to eateries banks and other amenities. One block from the Broad street line. Giant Supermarket right around the corner. Permit parking (6). Ten minute walk to City Hall, (Center City). Close to the Art Museum, Ben Franklin Parkway, highways and bridges, very convenient location. If you are interested or have any questions please call\/ text to: (510)----224----2__5__8__8\nWe pay for cold water, sewer and trash\nYou pay for gas and electric\n","num_images":5,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T08:12:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561530169.html","post_id":7561530169,"result_date":"Sat Nov 26 2022 14:43:42 GMT+0000 ","title":"Lease Today, Playground, Luxurious Bathrooms","description":"Schedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Walk-in Closet\n* Window Coverings\n* Central Heat and Air\n* Pre-wired for internet and cable\n* Disposal\n* Lofty Vaulted Ceilings\n* Breakfast Bar\n* Ceiling Fan\n* Private Patio or Private Balcony (on select apartments)\n* Granite Countertops\n* Pantry\n* Garden Tub\n* Roommate Friendly Floor Plan\n* Stainless Steel Appliances\n* Full sized Washer and Dryer in unit\n* Linen Closet\n* High Efficiency Lighting Fixtures\nCommunity Features\n* Billiards\n* Long Term Lease Available\n* Pet Salon\n* Bike Racks\n* Short or Long Term Lease Available\n* Community Lounge\n* Easy Freeway Access\n* Package Acceptance\n* Non Smoking Community\n* Extra Storage\n* Controlled Access\n* Swimming Pool\n* Sun Deck\n* Professionally Managed\n* Landscaped Courtyards\n* Movie Theatre\n* Community Kitchen\n* Minutes from Restaurants, Shopping, and Much More\n* Garage Parking\n* Playground\n* WiFi Access\n* Dry Cleaning and Laundry Service\n* After-Hours Emergency Maintenance\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* EV Charging\n* Gaming Area\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Elevator\n* Fitness Studio\n* Renters Insurance is Required\n* Credit Cards Accepted\n* TV Lounge\n* Bark Park\n* Outdoor Grill Area","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available dec 15', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T09:39:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561523195.html","post_id":7561523195,"result_date":"Sat Nov 26 2022 14:21:01 GMT+0000 ","title":"Pets Welcome, Lease Today, Quiet Community","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nCommunity Features\n* Sun Deck\n* Pet Salon\n* Community Lounge\n* Spa\n* Fitness Studio\n* Professionally Managed\n* Swimming Pool\n* Minutes from Restaurants, Shopping, and Much More\n* Yoga Lounge\n* Billiards\n* TV Lounge\n* Outdoor Grill Area\n* Easy Freeway Access\n* Bark Park","num_images":23,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '733ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T09:17:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561520149.html","post_id":7561520149,"result_date":"Sat Nov 26 2022 14:16:32 GMT+0000 ","title":"2 Bedroom Apartments Available","description":"Balmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":23,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-26T09:06:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561518875.html","post_id":7561518875,"result_date":"Sat Nov 26 2022 14:14:20 GMT+0000 ","title":"Modern 4 bedroom house","description":"Beautiful large 4 bedroom home with finished basement that can be used for entertainment or storage. Home will feature a large kitchen, large dining room, living room and 4 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint, a large fireplace and brand new countertops and cabinets. Recessed lights throughout. Washer and dryer hookup up can be added. Down the street from boys Latin high school. Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. 3rd party vouchers and payments will not be accepted. Serious inquiries only.","num_images":0,"lat":39.9448,"lng":-75.2288,"attrs":"['4BR \/ 1Ba', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T09:02:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561519316.html","post_id":7561519316,"result_date":"Sat Nov 26 2022 14:07:48 GMT+0000 ","title":"Modern renovated 3 bedroom house","description":"Beautiful 3 bedroom home with finished basement that can be used for entertainment or storage. Home will feature kitchen, nice sized dining room, living room and 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint and brand new countertops and cabinets. If that wasnt enough, home also has a deck that you can walk straight into from the dining room. The living room and dining room has beautiful recessed lights that makes the room appear larger and brighter. There is also a attached garage that can be used as storage. Washer and dryer hook up can be added. The home is down the street from cobbs creek parkway. Minutes away from shopping and yeadon. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only.","num_images":0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-26T09:03:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561518294.html","post_id":7561518294,"result_date":"Sat Nov 26 2022 14:04:41 GMT+0000 ","title":"Large spacious newly renovated house for rent","description":"Beautiful large 3 bedroom, 2 full bathroom home with finished basement that can be used for entertainment or storage. Home will feature a large kitchen, eat in kitchen, large dining room, living room and 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint and brand new countertops and cabinets. Property has recessed lights throughout living and dining room. Washer and dryer hookup can be added. Down the street from cobbscreek parkway and public transportation. Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Across the street from yeadon. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only.","num_images":0,"lat":39.935773,"lng":-75.231095,"attrs":"['3BR \/ 2Ba', 'available feb 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T09:00:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561516883.html","post_id":7561516883,"result_date":"Sat Nov 26 2022 13:59:23 GMT+0000 ","title":"Three bedroom house for rent","description":"3 bedroom home for rent. Home will feature a large nice size kitchen, dining and living room along with 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the first floor, fresh paint, brand new countertops and cabinets with new gray carpets on the stairs and second floor. Washer and dryer hookup can be added. Minutes away from shopping and public transportation. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only.","num_images":0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T08:55:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561515592.html","post_id":7561515592,"result_date":"Sat Nov 26 2022 13:59:00 GMT+0000 ","title":"Remodeled 3 bedroom house w\/garage","description":"Beautiful cozy 3 bedroom home with large partially finished basement that can be used for entertainment or storage. Home will feature a kitchen, dining room, living room and 3 cozy bedrooms with alot of closet space. New walnut colored wall to Laminate throughout the house, fresh paint and brand new countertops and cabinets. Washer and dryer hookup can be added. Down the street from the market El train (63rd st station). Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. 3rd party vouchers and payments are not accepted. First month, Last month and security deposit is required to move in. Serious inquiries only.","num_images":12,"lat":39.936534,"lng":-75.232002,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-26T08:50:00-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561516522.html","post_id":7561516522,"result_date":"Sat Nov 26 2022 13:58:06 GMT+0000 ","title":"Modern 3 bedroom house for rent","description":"Beautiful 3 bedroom home for rent. Home will feature a large nice size kitchen, dining and living room along with 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the first floor, fresh paint, brand new countertops and cabinets with new gray carpets on the stairs and second floor. Washer and dryer hookup can be added. Minutes away from shopping and public transportation. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only.","num_images":5,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T08:54:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561514666.html","post_id":7561514666,"result_date":"Sat Nov 26 2022 13:49:55 GMT+0000 ","title":"Remodeled 4 bedroom house for rent","description":"Beautiful large 4 bedroom home with finished basement that can be used for entertainment or storage. Home will feature a large kitchen, large dining room, living room and 4 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint, a large fireplace and brand new countertops and cabinets. Recessed lights throughout. Washer and dryer hookup up can be added. Down the street from boys Latin high school. Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. 3rd party vouchers and payments will not be accepted. Serious inquiries only.","num_images":23,"lat":39.951696,"lng":-75.236861,"attrs":"['4BR \/ 1Ba', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T08:45:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561508651.html","post_id":7561508651,"result_date":"Sat Nov 26 2022 13:43:55 GMT+0000 ","title":"Receive One Month's Rent Free! Sun Splashed 1 Bed, 1 Bath Apt","description":"FOR A LIMITED TIME: RECEIVE ONE MONTH'S RENT FREE! SUN SPLASHED 1 bedroom, 1 bath apartment. All open living and dining area with HARDWOOD FLOORS throughout, kitchen with GRANITE counter tops, stainless steel appliances and breakfast bar. Bedroom boasts wonderful sized closets, and your elegant bathroom is fantastic. Enjoy living in this elevator doorman building with awesome new FITNESS CENTER, PRIVATE resident DECK, and just minutes from RITTENHOUSE SQUARE, 30th Street train station, Penn and Drexel universities, Trader Joe's, and the new COMCAST tower.\n2026 Market St #206\n","num_images":5,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '765ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T08:18:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561508090.html","post_id":7561508090,"result_date":"Sat Nov 26 2022 13:31:19 GMT+0000 ","title":"Luxury Apartments In Center City Philadelphia!","description":"Luxury Apartments In Center City Philadelphia. Beautiful, new center city Philadelphia apartments; our building has innovative, efficiently designed spaces that take advantage of every square inch for your comfort and convenience. The modern approach allows us to make your wish list achievable not as a dream in the future but right now when you need it most. Center City apartments at its best! Offering studios, 1 bedroom, and 2 bedroom apartment homes. Conveniently located just a few blocks from Rittenhouse Square, and is near the University Of The Arts (UARTS), Peirce College, Moore College of Art and Design, and Drexel College of Nursing. Be in the center of everything! Walk outside your front door and be steps away from Dilworth Park, Rittenhouse Square, the Avenue of the Arts, and countless restaurants, cafes, bars, and shops. See why Avenir is your ideal Center City apartment. People who participate in group fitness make it to the gym 45% more often! Experience the community within your community. Take a virtual spin class when it s convenient. Plan a Friday night workout with old friends or welcome a new neighbor to the community. Work out on your schedule, not someone else's! ** Photos are of model units * Prices and availability subject to change on daily basis **\n42 S 15th St #0B-1412\n","num_images":6,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '314ft2', 'available mar 3, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T08:16:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561507479.html","post_id":7561507479,"result_date":"Sat Nov 26 2022 13:17:16 GMT+0000 ","title":"2500 Blk. S. Rosewood Street","description":"Subject property is a 3 bedroom townhouse one block from Broad Street and in close proximity to the Sports Complex. Property features wood floors throughout with a semi-modern kitchen and bath with a full size washer and dryer.","num_images":0,"lat":39.919052,"lng":-75.17158,"attrs":"['3BR \/ 1Ba', '1100ft2', 'available dec 1', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T08:13:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561507402.html","post_id":7561507402,"result_date":"Sat Nov 26 2022 13:16:53 GMT+0000 ","title":"Be the First to Live, Completely New & Tasteful Top to Bottom Renovati","description":"BE THE FIRST to live at 1415 Locust. A completely new and tasteful top to bottom renovation. BRAND NEW EVERYTHING. A 16 Unit boutique elevator building in the heart of Center City. Live above it all! A short walk down Locust Street to Rittenhouse Square. Easy access to all that Center City has to offer. 4 units per floor. Brand new elevator. 1 bedroom and 2 bedroom offerings. All units have the following: High ceilings, new windows, in-unit central air, in-unit washer and dryer, stainless steal appliances, white kitchens, black hardware, stone countertops, recessed lighting, stall showers and glass shower doors. Ready for occupancy December 2022. ****Limited time special: Half month rent free on a 21 month lease**** Many parking options within 100 feet. Pet friendly.\n1415 Locust St #504\n","num_images":6,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '450ft2', 'available dec 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-26T08:12:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561506715.html","post_id":7561506715,"result_date":"Sat Nov 26 2022 13:13:33 GMT+0000 ","title":"Welcome to Strickland Row Condo Located in the Heart of Washington","description":"Welcome to Strickland Row Condominiums located in the heart of Washington Square West!! This bi-level apartment in an elevator building is truly a peaceful hideaway amongst the busy city. The unit has hardwood flooring throughout, washer dryer in-unit, great size bedroom and storage space. Live in the center of everything and enjoy amenities like a landscaped relaxing pool area and a rooftop deck for all seasons including day and night views of Center City and holiday fireworks too. Walk, bike or drive to Center City. This location offers excellent food shopping, dining choices , green park spaces and ample parking lots. Easy access to 76\/676, NJ bridges, public transportation, local bike paths and the best Philadelphia has to offer. Schedule your showing today!!! Property address also known as 1014 Spruce Street, #72.\n1008-20 Spruce St #72\n","num_images":5,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', '857ft2', 'available dec 1', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T08:09:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561505787.html","post_id":7561505787,"result_date":"Sat Nov 26 2022 13:08:44 GMT+0000 ","title":"Industrial Style Lofts, Includes 1 Parking Space in Our Gated Lot!","description":"Industrial Style Lofts, includes 1 Parking Space in our gated Lot, access to our 8000 square foot Fitness Center, 24\/7 Front Desk Personnel and on-site Property Management. 444 Lofts is a True Warehouse Conversion featuring Concrete Flooring Throughout and Concrete Beamed Ceilings, Exposed Ductwork. Kitchen features sleek Granite Countertops and Stainless Steel Appliances (DW, GD, Microwave) Stacked Washers and Dryers and generous Closet space. This unit features 4 Large Windows, Incredible View, Exposed Brick, and a lofted Bedroom. Within Walking Distance to Public Transportation, Restaurants, Galleries, shops, and some of the Best Night Life Philadelphia has to offer! 444 is on a quiet block, convenient to Major Roadways and Public Transportation. Home to \"BE WELL FED\" CAFE and SMALL WORLD SEAFOOD! Get your pet Shampooed @ GROOMADELPHIA......PETS RULE!\n444 N 4th St #308\n","num_images":5,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '1100ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T08:04:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561503065.html","post_id":7561503065,"result_date":"Sat Nov 26 2022 13:05:23 GMT+0000 ","title":"Bright and spacious 1 bedroom 1 bath apartment","description":"Bright and spacious 1 bedroom 1 bath apartment with a large private backyard in Graduate Hospital Area. This first floor unit features open floor plan with a bay window in the living room, bamboo floors throughout, high ceilings with exposed ducts. This beautiful apartment has been freshly painted, has a newly remodeled full bathroom with a tub, great closet space, blinds on all windows and a sumptuous bedroom in the back with a backyard view. Tenant is responsible for all utilities. Common laundry is in the basement. Available for an immediate occupancy. Amazing location with an easy access to public transportation and I-76; close to Heirloom grocery store, near many restaurants, bars, coffee shops, Starbucks, CVS, Amazon store, Indego bike share.\n2319 Catharine St ##1\n","num_images":5,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '1881ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T07:50:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561504479.html","post_id":7561504479,"result_date":"Sat Nov 26 2022 13:02:43 GMT+0000 ","title":"This Gated Community is in a Great Location Near the Restaurant!","description":"Enter the gated community from Wildey Street and park in the rear of your new home. Enter that home into the modern equipped kitchen with SS Whirlpool Appliance Package, 4 seat kitchen island. Adjoining the kitchen is the spacious dining and living room area. The full finished basement is setup for a media \/ game room with extra space for plenty of additional storage. The second floor consists of two bedrooms with California Custom Closets and shared bathroom while the third floor has the master suite or owner suite. The owner suite will have a pvt entrance separate from the roof top deck access. The master suite boasts large walk in custom closets, dual vanity master bathroom with linen closet and dual shower stall. Full finished roof top deck with lighting system and built in gardening shed. Rooftop Furniture Included in rental! Use the roof top deck all year round! This gated community is in a great location near the restaurant district of Girard Ave and Frankford Ave (Lloyd, Kraftwork, Johnny Brenda's, Frankford Hall, E.G.G. and much more), Planet Fitness, CVS, Dunkin Donuts, Wawa are all close by and a short walking distance to The Piazza at Schmidt's. Convenient access to I95 and the Frankford Blue Line. Must See!\n1103 E Berks St\n","num_images":5,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2.5Ba', '1696ft2', 'available dec 1', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-26T07:58:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561502619.html","post_id":7561502619,"result_date":"Sat Nov 26 2022 13:02:34 GMT+0000 ","title":"$500 Security Deposit!!! HARDWOOD FLOORS throughout!","description":"$500 Security Deposit!!! HARDWOOD FLOORS throughout! Chancery Lane offers loft-style apartment homes with elevator, in a gated courtyard setting within historic Old City and boasts a community rooftop deck with panoramic views of the city. Beautiful large loft-style 1 bedroom apartment. Pictures are of the actual unit.\n130 Arch St #306\n","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '700ft2', 'available feb 7, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-26T07:47:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561504081.html","post_id":7561504081,"result_date":"Sat Nov 26 2022 13:00:43 GMT+0000 ","title":"New Construction at Northbank. It is a Bi-level Rowhome","description":"This is new construction at Northbank. It is a bi-level rowhome. The property faces towards the community park and on the rooftop, you have a beautiful view of the river and the bridge. Along with the rooftop, the home has two balconies in the living room and in the master room.\n2160 Northbank Pl #161\n","num_images":6,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2.5Ba', '2400ft2', 'available dec 1', 'furnished', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-26T07:56:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561500967.html","post_id":7561500967,"result_date":"Sat Nov 26 2022 13:00:06 GMT+0000 ","title":"FOR A LIMITED TIME: 2 MONTH'S FREE RENT ON AN 18 MONTH LEASE!!!!","description":"FOR A LIMITED TIME: 2 MONTH'S FREE RENT ON AN 18 MONTH LEASE!!!!You will just LOVE this 1 bedroom, 1 bath SUN SPLASHED, and light filled apartment, boasting amazing WATER FRONT views. Awesome & open living, dining area, kitchen with all CUSTOM cabinetry, GRANITE counter tops, stainless steel appliances, hotel\/spa type BATHS, and fantastic closet space. Roof top DECK, and LOUNGE is off the charts! State of the art GYM, with a SLIDE & coffee\/juice bar. This 24\/7 elevator, door man building located in OLD CITY, at the base of the Ben Franklin bridge is A MUST SEE, for the Philadelphia renter that is looking for LIFESTYLE , LUXURY, and having it ALL! PARKING available for additional cost. Photo's are of model unit.\n234 N Columbus Blvd #506\n","num_images":6,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '680ft2', 'available feb 12, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T07:37:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561501879.html","post_id":7561501879,"result_date":"Sat Nov 26 2022 12:57:38 GMT+0000 ","title":"Luxury 1 bedroom with loads of personality available at the Annex","description":"No. 1518-1B: No. (Unit): Luxury 1 bedroom with loads of personality available at the Annex at the Touraine. This beautiful 460 sq ft gem features 2 large closets, a complimentary storage locker, in unit washer\/dryer, individually controlled heating and cooling, full size gas stove, and a pop of color in a retro Big Chill fridge. The Annex at the Touraine: Adjacent to the famed Touraine apartment building, sits The Annex at The Touraine, two mid-nineteenth century brownstones which have been lovingly restored with reverence to the original architectural details that have set them apart throughout time. Iconic and unique, each unit has maintained its historic character while incorporating the most modern amenities and environmental sustainability. We invite you to come and see why The Annex at The Touraine is truly history in the remaking.  Enjoy the coziness of a brownstone and all of the comforts of a Luxury Hi-Rise! The Annex at the Touraine’s residents enjoy 24 Hour Emergency Maintenance, on-site Management, Package Reception, Online Rent Pay and Service Request Entry through our Resident Portal which can be accessed online or with an app, our Fitness Center & Yoga Studio, Curated Workshops, Hospitality Suites, complimentary and secure document shredding, composting, recycling, Business Center, and more. **Pictures and virtual tour are of a different unit with the same floor plan.\n1518 Spruce St #1B\n","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '460ft2', 'available jan 31, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-26T07:42:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561499835.html","post_id":7561499835,"result_date":"Sat Nov 26 2022 12:55:47 GMT+0000 ","title":"!!! Great SPACE and VALUE, in this fantastic studio apartment","description":"FOR A LIMITED TIME RECEIVE: ONE MONTH'S RENT FREE ON A 12 MONTH LEASE!!! Great SPACE and VALUE, in this fantastic studio apartment just off RITTENHOUSE SQUARE. Enjoy living in this elevator\/doorman building with AMAZING GYM, minutes from PENN, DREXEL , 30th St TRAIN STATION and in the heart of ALL!!!!!!!Philadelphia has to offer Walking score is 110!!!!! Photo's are of model unit.\n2100-2 Walnut St #7G\n","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '250ft2', 'available jan 21, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-26T07:28:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561495258.html","post_id":7561495258,"result_date":"Sat Nov 26 2022 12:46:38 GMT+0000 ","title":"High Quality Designed Perfect Price 2-bed\/1-bath apt*Fitness Center","description":"Best Choice Apartment\nWelcome to your new home located at 6702 Martins Mill Rd 1st Floor, which is in the Lawndale section of the city. It is conveniently within close proximity of the Regional Rail Line, Tacony Creek Parkway, shops, and restaurants. High Quality Designed Perfect Price 2-bed\/1-bath apartment.  Its bathrooms are meticulously designed, appointed with marble and limestone and featuring top-of-the-line fittings by Water Works. Customized windows treatment, two Juliet Balconies, wood paneling, walnut flooring, solid wood doors, a washer\/dryer as well as Crestron home automation controlling lighting and HVAC, floor to ceilings windows are just some of the finishing touches that make this exclusive Chelsea home an amazing residential opportunity.\nAddress-6702 Martins Mill Rd\n-9ft Ceilings\n-Resident Lounge\n-Cyber Cafe\n-Upgraded Finishes\n-Full Size Washer\/Dryer Connections\n-Business Center\n-Large Closets\n-Fitness Center","num_images":1,"lat":40.053286,"lng":-75.092155,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T06:48:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561501473.html","post_id":7561501473,"result_date":"Sat Nov 26 2022 12:44:12 GMT+0000 ","title":"Nicely renovated, 2 bedroom home for rent in Fairmount","description":"Nicely renovated, 2 bedroom home for rent in Fairmount\/Art Museum area. Finished basement with front load GE washer and dryer, hardwood floors, recessed lights and ceiling fans. New heater, windows, basement carpet, central air and fresh paint job. Small side yard, with back door and street access. This property will not last. Call to make an appointment.\n1823 W Olive St\n","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '940ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T07:40:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561500699.html","post_id":7561500699,"result_date":"Sat Nov 26 2022 12:39:06 GMT+0000 ","title":"Stunning newly renovated apartment in the up-and-coming Loft District","description":"Stunning newly renovated apartment in the up-and-coming Loft District. Unit includes hardwood floors, washer\/dryer, and 14' ceiling heights! Kitchens feature Italian-style charcoal textured wood grain cabinetry, solid quartz countertops, stainless steel appliances, a commercial-style goose-neck faucet, and a built-in dishwasher. The bathroom features a thermostatic shower system with rain head, hand spray, and 4 sets of body jets; extra large soaking tubs; floating vanities with quartz countertops, a dual flush system for water savings, and high-end LED light strips in the shower cove and underneath the vanity. The building features a 24-hour concierge, a fully-equipped fitness center with a panorama of the skyline, a rooftop pool, and a hot tub. You won't want to miss this! Book your appointment today! Photos are of the model unit, but very similar.\n315 N 12th St #0305\n","num_images":5,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '140363ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-26T07:35:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561488270.html","post_id":7561488270,"result_date":"Sat Nov 26 2022 10:29:33 GMT+0000 ","title":"@1br -Large, One to two-bd;'AVL: 12\/25\/22|| R&D Cocktail Bar\/\/PA","description":"Apartment 2. Taking applications for a large, completely remodeled, one or two-bedroom apartment (second bedroom is small, could be a study or office) . Water and trash paid for by landlord. Tenant pays electricity. No smoking. $525\/ month with $525 security deposit","num_images":6,"lat":39.968878,"lng":-75.134428,"attrs":"['1BR \/ 1Ba', '900ft2', 'available dec 25', 'EV charging', 'air conditioning', 'application fee details: $25', 'broker fee details: NO BROKER FEE@', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'listed by: Jennifer Fahey@', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T04:58:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561480654.html","post_id":7561480654,"result_date":"Sat Nov 26 2022 07:57:26 GMT+0000 ","title":"1200 sq ft Updated Rowhome","description":"........ AVAILABLE FOR RENT IN 19124 ON A ONE YEAR LEASE TERM.......\nRESIDENCE DETAILS\n3 Bedroom\/1 Bath recently remodeled rowhome in the Frankford section of the city. 2 story plus full basement. 1200 sq ft. Full renovation inside completed mid-2021. (New electrical & service, new plumbing, new HVAC, new windows, new doors, new floors, new cabinets, new countertops, new sheetrock, new paint, new trim, new utility appliances (Furnace & Water Heater)). One previous year long lease so only the second tenancy since remodel.\nFull & fully finished basement with newly added huge 200 sq. ft. 3rd bedroom; clothes closet; laundry closet; utility closets; & additional large open space suitable for 2nd living room, chill spot, movie room,  man cave, kids playroom, extra storage, or to make entire basement an expansive master bedroom suite (minus the bathroom). This space by itself rents the house IMO.\nHardwood floors throughout, 12\"x24\" tile in kitchen, bath, & basement. Granite countertops. High-end fixtures. Recessed lighting. Spacious closets. Stainless refrigerator & electric range provided. W\/D Hookups in basement. Central heat & A\/C.\nFenced in large backyard with grass, shade, & with a new cement path to the back alley that leads to cross street for easy rear entrance to home. Outdoor water & electrical acccess. New siding & stucco. Street parking. Good neighborhood. Friendly neighbors. Convenient location (74\/100 on Zillow).\nNEIGHBORHOOD\nConveniently located near popular MFL station as well as 3, 5, & 56 bus routes and a short drive to I-95 on ramp. Commuting to Center City for work on SEPTA will take you about 30 minutes. Laundromat within 5 minute walk. Family Dollar, Aldi, Rite Aid, Save-A-Lot, Dollar General, Shoprite, Wawa, McDonalds, Dunkin' Donuts, Popeyes, and Texas Chicken & Burgers all within 1.2 miles or less. Walmart & Target as well as a multitude of other big name stores & restaurants are accessible by car in 5 minutes or by bus in 15. Local parks & playgrounds walkable or by very short bus ride. Allen M. Stearne (K-8) & Frankford High (9-12) Schools.\nLEASE & DEPOSIT\nOne year lease term with subsequent auto-renewing month-to-month lease extension. $1050 per month (RentZestimate® is $1099).  A security deposit equivalent of TWO months rent, plus FIRST & LAST month rent, for a total of $4200 is due at the time of the signing of the lease (plus any applicable pet deposit)\nPAYMENT METHODS\n*NOTE: Deposit may be made in cash, or by EFT (Ca$happ, Zelle, Venmo, Paypal), ONLY. I feel as though EFT is best because it can go directly to into my escrow account as required by law, and that means you will immediately & exactly know where your deposit is being held. Nobody argues with cash, however, including me. Cash will always be king. No checks. No 3rd party payments. I have my reasons for doing this . The main one is to avoid being scammed (again & again) by bounced check into letting a squatter with no intention to pay gain entry to my house (its happened before), plus checks are so dated, slow, & easily forged or badly written to manipulate time frames to the max and can really jam up business. I despsie checks; another reason is to establish that you are independent & reliable and capable of making timely monthly rent payments on your own. Its very aggravating to have to repeat this whole process in 3 months because mom paid your deposit and you couldnt afford to keep making rent and I have to go through Eviction Diversion. So likewise, no co-signator to the lease. After deposit is paid, we can discuss paying by check if that is how you prefer to pay your monthly rent. If this is an issue for you, no hard feelings & i'm sure there are plenty of other places currently for rent in Philly, as I'm sure there are plenty of other prospective tenants besides you*\nUTILITIES\nTenant is responsible for paying all utilites including PWD (water), PECO (electric), & PGW (gas). Trash & recycling colllection is provided free of charge by the Dept. Of Streets. One blue recycing bin is provided for your use. Trash cans are the responsibility of the tenant.\nWater Heater, Range, & Furnace Ignition Switch\/Blower are all electric. Furnace Fuel Source is Natural Gas.\nADDITIONAL TERMS\nUp to 2 pets allowed, $50 pet deposit per.\nSmoking is permitted on the premesis but please be responsible & courteous about the butts.\nRent is due on the 3rd of each month, with a grace period until the 13th because, well,  shit happens. Late rent payments in excess of 10 days, and insufficient funds returns, subject to additional fee.\nNo Section 8 or vouchers are accepted.\nLost keys are subject to $50 replacement fee. Lockout services are $125 per occurrence.\nAPPLICANTS\nThe ideal applicant will have a credit score at 600 or above, favorable references, gainful employment, and satisfactory credit & rental history, free of any judgements or evictions. All applicants are considered equally,fairly, & without discrimination or immmediate disqualifcation for any one derogatory mark,  regardless of their past, race, religion, age, sexual orientationz and I encourage people from all backgrounds, heritages, & walks of life to apply.\nAPPLICATION PROCESS\nNevertheless, a routine personal background check is still required, as is the associated non-refundable $30 application fee, payable by EFT. No walk-throughs will be scheduled before application & fee have been collected as to not waste anybodys time. It is a very busy time of the year and as limited as my time is already with twins expected any time between now & Christmas, I also live in Trappe - 45 minute trip each way with no traffic - and work in Boyertown - 56 min trip each way with no traffic - so getting down here to show the places I have for rent is time consuming and very tricky.\nSo unfortunately if you arent qualified, there is no sense in you seeing it or me having to drive down to show it to you. I don't mean to be rude, its just being practical & honest. I do, however, try to work with everyone, but in order to get past sub-600 credit scores and past evictions, at a minimum, your monthly net income must be at least 3x the rent ($750\/week) and have at least one recent glowing reference in regards to making payments in full & on-time. I also do not perform criminal background checks on my applicants. Everyone  deserves a second chance, including felons, and your crime is not my business, not my place to judge you, and not relevant to whether or not you are a good tenant. Your rental - not your criminal - history tells me that.\nMOVE-IN DATE\nReply to this ad to start the process by submitting your application and fee. Won't last long!!! Move-in date is set for 01 January 2023 but I can probably push it to 15 December 2022 (if no water breaks, if no mandatory OT, if no this no that......) but move-in costs would then jump, as pro-rated December rent would need to be paid up front as well. NO HOLDS! Payment of Security Deposit ONLY is required, and the ONLY way, to secure the rental til 01 January. First & Last can be made in advance all at once or when you get the keys.\nINFORMALITIES\nI'm sorry I can't accomodate everyone. Telling people I chose another applicant is the worst part of my role as landlord. Any questions, I am happy to oblige!! A safe & happy holiday season to you all. Thank you!","num_images":6,"lat":40.0055,"lng":-75.0932,"attrs":"['3BR \/ 1Ba', '1200ft2', 'available jan 1, 2023', 'application fee details: $30 non-refundable application fee for standard background report inquiries', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T02:34:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561454889.html","post_id":7561454889,"result_date":"Sat Nov 26 2022 05:31:55 GMT+0000 ","title":"Beautiful and Gorgeous rental in ART MUSEUM AREA","description":"Lofts 640 offers you the \"most bang for your buck\" in Philadelphia! Included with your monthly rental price is extended cable TV service, fitness center, indoor\/heated pool and hot tub with attached outdoor roof deck, yoga\/fitness studio, cyber lounge, 24\/7 front desk attendant, and more!! Walk off the busy street into 640 North Broad and enter an urban space that combines the old with the new. Feel the past mix with a refreshing dose of hip, understated sophistication. The original character of the building is not lost but enhanced by modern accents and furnishings. A thriving community dwells within our walls -- a state-of-the-art fitness center, cyber cafe, and yoga studio serve to nurture body, mind, and spirit. Setting the night sky aglow, our glass-domed pool house is the perfect place to unwind. Go for a swim in the warm salt water, relax your muscles in the Jacuzzi, or meet and socialize on the roof deck lounge. Enter the lobby, your public space. Experience orange as it bursts in the artwork and pours from geometric ceiling lights that warm the mocha-colored floors. Accented with a healthy dose of pure white and stainless steel, contrast brings together the energizing elements of your entrance. A thriving community dwells within our walls -- a state-of-the-art fitness center, cyber cafe, and yoga studio serve to nurture body, mind, and spirit. Setting the night sky aglow, our glass-domed pool house is the perfect place to unwind.\nMinutes from Reading Terminal Market and the Pennsylvania Convention Center, Lofts 640 combines commuter convenience of center city living with spectacular urban spaciousness of true loft living.*Property amenities-Cable included in rent Reconnect at the Cyber Lounge. Reenergize at the gym.\nGo for a swim in the warm salt water, relax your muscles in the Jacuzzi, or meet and socialize on the roof deck lounge. Lofts 640 is just six (6) blocks north of City Hall on Broad Street. Lofts 640 is centrally located to Philadelphia shoppes, restaurants, hospitals, and the thriving community of Fairmount.\nRejuvenate at the pool. Relax at the yoga studio. Reward yourself with a new lifestyle. Unit amenities12 Foot CeilingsBalconies Available w\/select loftsBeautifully Landscaped CourtyardCentral Heat \/ AirCovered Garage ParkingDesigner Wall to Wall CarpetEuro-Luxe Stainless KitchenExposed BrickHigh Speed Internet available industrial Size Windows Lavish Closet Space Unspoiled Skyline ViewsWasher \/ Dryer in each loft *Availability subject to change on a daily basis.","num_images":15,"lat":39.965159,"lng":-75.160804,"attrs":"['0BR \/ 1Ba', '914ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-25T22:44:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561467530.html","post_id":7561467530,"result_date":"Sat Nov 26 2022 05:16:51 GMT+0000 ","title":"Art Museum","description":"3 bedroom house for rent well kept hardwood floors yard basement washer and dryer available January the 1st 2023.\nSmall pet OK, 1st last month's security, good credit\n","num_images":16,"lat":39.968393,"lng":-75.178663,"attrs":"['3BR \/ 1Ba', '1170ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T00:12:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561692040.html","post_id":7561692040,"result_date":"Sat Nov 26 2022 21:06:04 GMT+0000 ","title":"Stunning historic building - Restored gem! 1411 Sq Ft 2 Bed \/ 1.5 Bath","description":"RENTAL INFO Rental Rates: $2289\/monthLocation: 200 S Line St Lansdale, PA 19446Unit for Rent: 2-BR 1.5-BA | Square Feet: 1411 sq ft | Lease Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-Month show contact info\nPROPERTY AMENITIES➢ 18' Long Shuffle Board➢ 2 Weber Propane Grills➢ Business Center➢ Dog Wash Room➢ Elevator➢ Laundry Facilities➢ Monthly Community Events➢ Package Service➢ Pet-Friendly Community➢ Smoke-Free➢ Beautifully Landscaped Grounds with Access to Local Businesses➢ Close to Montgomeryville Mall and Routes 202 & 309➢ Community Lounge featuring free Verizon Fios TV\/Wi-Fi➢ Courtyard featuring tasteful Outdoor Seating and Fire Pits➢ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting➢ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi➢ Free Parking - 2 Spaces per Apartment Home + Guest Parking➢ Lobby Area with Complimentary Coffee➢ Professional On-Site Management Team➢ Storage units - $50\/$75 per monthAPARTMENT AMENITIES➢ Cable & Hi-Speed Internet Ready➢ Central Air Conditioning➢ Courtyard View in select apartments➢ Dishwasher➢ Full Size Washer & Dryer➢ Large Windows➢ Range \/ Oven➢ Refrigerator\/Freezer➢ Secured Building Access➢ Storage Spaces  ADDITIONAL INFODescription: SEE WHAT YOU'VE BEEN MISSING  Live the luxurious lifestyle you're looking for in a building rich with history enhanced with modern amenities at Silk Factory Lofts. Our Lansdale, PA apartments feature open-concept loft-style layouts with high ceilings, chic kitchens, and oversized windows that make each home bright and welcoming. Communal spaces are designed with residents' comfort and convenience in mind at our Lansdale apartments. Residents can hang out in our upscale lounge, maintain work out goals at the on-site fitness center, and so much more at our apartments in Lansdale, PA.Pet Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/ Silk Factory Lofts: show contact info\nIncome requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITYF76CF909050544A5\n","num_images":17,"lat":40.237106,"lng":-75.280919,"attrs":"['2BR \/ 1.5Ba', '1411ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T16:02:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561689954.html","post_id":7561689954,"result_date":"Sat Nov 26 2022 21:00:24 GMT+0000 ","title":"1 Bedroom","description":"1 Bedroom apartment 1st floor apartment with backyard & basement for rent.New refrigerator & stove. Quite block in southwest philadelphia. No evictions accepted, first last & security required. Teant pays gas and electric, landlord pays water. Call Darry  show contact info","num_images":3,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'available dec 1', 'application fee details: $50', 'cats are OK - purrr', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T15:56:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561689044.html","post_id":7561689044,"result_date":"Sat Nov 26 2022 20:57:51 GMT+0000 ","title":"3 Bed 2 full Bath BI Level Apartment","description":"BI level apartment with 3 bed, 2 bath plus laundry room\/office (laundry room big enough for the washer\/dryer and desk plus small closet for additional storage).\nSpace is perfect for small family or 3 people.\nPictures don't represent the how great this space is. Currently the apartment is being painted\/renovated.\nsecurity deposit needed to reserve apartment, 1st month rent to move in and last months rent needed by end of the 1st month.\n","num_images":13,"lat":39.972481,"lng":-75.180806,"attrs":"['3BR \/ 2Ba', '1000ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T15:53:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561679065.html","post_id":7561679065,"result_date":"Sat Nov 26 2022 20:30:57 GMT+0000 ","title":"Two Bedroom with Split Bedrooms and Washer and Dryer","description":"The Glen at Lafayette Hill Bedroom: 2 | Bathroom: 2Square Footage: 1078 sq ftMonthly Rent: $2276 show contact info\nCommunity Description  Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.-Split Bedrooms\n-Generous Laundry Room\n-Abundant Closet Space\n-High Ceilings    Community Amenities✓ 24 Hour Availability✓ Business Center✓ Elevator✓ Furnished Units Available✓ Gated, Controlled Access✓ Online Services✓ Pet Friendly✓ Pet Play Area✓ Recycling✓ Renters Insurance Program✓ BBQ Picnic Garden✓ Billiards, Club Lounge, Cafe Area, Library and Community Room✓ Fitness Center w\/ Free Weights, Weight Machines✓ Message Therapist Practice On-site✓ Outdoor Cafe & Coffee Bar✓ Outdoor Patio Lounge✓ Sprinkler System✓ Storage Space✓ Wi-Fi at ClubhouseUnit Features✓ Air Conditioning & Heating✓ Cable Ready✓ Ceiling Fans (Select Floor Plans)✓ Dining Room✓ Heating✓ Range, Oven, Disposal, Oven✓ Refrigerator, Freezer and Ice Maker✓ Tub\/Shower✓ Wi-Fi✓ Window Coverings✓ Crown Molding (Select Floor Plans)✓ High Speed Internet Access✓ Linen Closet✓ Microwave✓ Storage Units✓ Trash Compactor✓ Vaulted Ceiling (Select Floor Plans)✓ Walk-In Closets (Select Floor Plans)✓ Washer\/Dryer✓ Wheelchair Accessible (Rooms)  Contact InformationVisit Us: 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.com   Additional DetailsPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthManagement Company: Paradise Management, LLC Price is subject to change without prior noticeAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY220ADF76D80A400A\n","num_images":17,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1078ft2', 'available jan 22, 2023', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-26T15:26:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561673865.html","post_id":7561673865,"result_date":"Sat Nov 26 2022 20:29:10 GMT+0000 ","title":"Enjoy the private pool in the communal courtyard for Strickland court","description":"The rarely available Strickland Court condominiums are a bright one-bedroom unit with a courtyard and pool in the middle of Washington Square West. As soon as you step inside this converted brownstone, you'll notice how much of its original character and history come from old Philadelphia. When you first walk into the apartment, you'll be struck by how open the space is and how much natural light floods in through the large windows and high ceilings. This area leads to a sizable kitchen with a deep pantry and lots of counter space. Along the hallway, there is a full bathroom as well as a storage closet with a washer and dryer built in. The main bedroom has two large windows that look out onto the courtyard and two closets with additional space above for additional storage. Enjoy the private pool in the communal courtyard for Strickland court residents only. With easy access to Jefferson Hospital, public transportation, and a wide variety of eateries, including Middle Child, Kanella, GreenStreet Coffee Roasters, Varga, Tria, and Bleu Sushi, to name a few, this home's location is unbeatable. Make an appointment right away","num_images":9,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '800ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-26T15:13:10-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561676917.html","post_id":7561676917,"result_date":"Sat Nov 26 2022 20:24:52 GMT+0000 ","title":"2 Bedroom 2 Bath","description":"Charming 2 bedroom 2 bath rowhome available for rent in Brewerytown! Located on a quiet street and centrally located to all the Fairmount\/Brewerytown has to offer. Close to numerous shops, public transportation, Aldi, Target and Whole Foods. Blocks from the Art Museum, Boat House Row, Fairmount Park and Eastern State. Check out the full listed at https:\/\/www.phillyhomegirls.com\/rental-properties\/2906-w-flora-st","num_images":5,"lat":39.975098,"lng":-75.183542,"attrs":"['2BR \/ 2Ba', '1000ft2', 'available dec 1', 'air conditioning', 'application fee details: $50 application fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T15:20:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561671312.html","post_id":7561671312,"result_date":"Sat Nov 26 2022 20:11:11 GMT+0000 ","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"When you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nApartment Features\n* Kitchen Island\n* Stainless Steel Appliances\n* Private Patio or Private Balcony (on select apartments)\n* Washer and Dryer in unit\n* Linen Closet\n* Garden Tub\n* Walk-in Closet","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-26T15:07:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561656012.html","post_id":7561656012,"result_date":"Sat Nov 26 2022 19:35:04 GMT+0000 ","title":"You'll love the serene setting in this 2BR 2BA! Call Today!","description":"Millview ApartmentsLocated at: 100 Cobblestone Dr Coatesville, PA 19320Featured unit: 2 bed | 2 bath | 1088 sq ft Prices start at: $1588 - $2140\/month Call Today!  show contact info\nMillview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.Wonderful Amenities!● Business Center● On-Site Leasing Office● Pet-Friendly● Private Garages In Select Units● 24-Hour Emergency Maintenance● Coffee Bar Clubhouse Kitchen● Resident Referral BonusesApartment Features!● Built-In Microwave● Central Heat & Air Conditioning● Disability Access In Select Units● Dishwasher● Full-Size Washer & Dryer In Every Apartment● Mini Blinds On All Windows● Refrigerator\/Freezer With Ice Maker● Walk-In Closets  show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T14:31:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561655739.html","post_id":7561655739,"result_date":"Sat Nov 26 2022 19:34:31 GMT+0000 ","title":"Incredible Amenities, Stylish Features, Lease Today","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nLease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nApartment Features\n* Wood-Like Floors\n* Private Patio or Private Balcony (on select apartments)\n* Full sized Washer and Dryer in unit\n* Extra Storage\n* Granite Countertops","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-26T14:30:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561650372.html","post_id":7561650372,"result_date":"Sat Nov 26 2022 19:32:52 GMT+0000 ","title":"Two bedroom for December","description":"Looking for a modern apartment home with off street parking? Check out theglenphilly.com!","num_images":3,"lat":40.043228,"lng":-75.246477,"attrs":"['2BR \/ 2Ba', '927ft2', 'available dec 17', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T14:16:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561653124.html","post_id":7561653124,"result_date":"Sat Nov 26 2022 19:27:58 GMT+0000 ","title":"A home for everyone - even your pets! Pet friendly 1 bed \/ 1 bath!","description":"Millview ApartmentsRENT: $1389 - $1865\/ MONTH SIZE: 771 sq ft  BEDROOMS: 1 BATHROOMS: 1 LEASE TERMS: Variable show contact info\nUNIT FEATURES:   ◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In ClosetsMillview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.PROPERTY FEATURES: ◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral Bonuses PET POLICY: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.VISIT OR CALL US TODAY!  100 Cobblestone DrCoatesville, PA 19320 show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ EQUAL HOUSING OPPORTUNITY27A7057C58A14CE\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '771ft2', 'available dec 10', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T14:23:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561649345.html","post_id":7561649345,"result_date":"Sat Nov 26 2022 19:25:34 GMT+0000 ","title":"Spacious living with beautiful views of the Philly Skyline","description":"Available: 11\/30\/22\nBalmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":18,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-26T14:14:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561651211.html","post_id":7561651211,"result_date":"Sat Nov 26 2022 19:22:50 GMT+0000 ","title":"Stone Manor House","description":"Floor through  2 bed\/1 bath with grand scale rooms and charming views from 3 bright exposures. Large eat in kitchen overlooking the grounds of the Mercer Museum. Located in the heart of the boro and the Cultural District. Private off street parking space. W\/D hook up(no units). NO smoking, pets. 2nd floor walk up. $1895 month. Available January 1, 2023 for 1 year.","num_images":6,"lat":40.3054,"lng":-75.1489,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T14:18:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561650426.html","post_id":7561650426,"result_date":"Sat Nov 26 2022 19:21:01 GMT+0000 ","title":"Professional Management, Beautiful Community, Playground","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Central Heat and Air\n* Garden Tub\n* Ceiling Fan\n* Pantry\n* Linen Closet\n* Full sized Washer and Dryer in unit\n* Window Coverings\n* Lofty Vaulted Ceilings\n* Walk-in Closet\n* Private Patio or Private Balcony (on select apartments)\n* Breakfast Bar\n* Pre-wired for internet and cable\n* Stainless Steel Appliances\n* High Efficiency Lighting Fixtures\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Disposal\n* Granite Countertops\n* Roommate Friendly Floor Plan","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1190ft2', 'available dec 3', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T14:17:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561627150.html","post_id":7561627150,"result_date":"Sat Nov 26 2022 18:41:33 GMT+0000 ","title":"Bocce ball field, Pet-friendly living, Online Payments Available","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Upgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingAlexa or Google Home Capable in all ApartmentsOn-site bike storageBocce ball fieldBark park48-hour Maintenance CommitmentState-of-the-art fitness center overlooking the Manayunk canalOnline Payments Available9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardPet-friendly livingGame Room with Billiards Table, Shuffle Board, and moreMarble master baths, some with deep linen storageCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/mlmt7dz7\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-26T13:24:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561622237.html","post_id":7561622237,"result_date":"Sat Nov 26 2022 18:40:01 GMT+0000 ","title":"The house rent is perfect for us","description":"show contact info\n-Number 2 and 39 septa bus stop in the corner\n-Corner groceries nearby\n-Within 10 minutes drive on nearby hospitals\n-Within 10 minutes drive on nearby supermarkets\n-8 minutes drive to Fairmount Park\n-Close to Temple University\n-Dawson Chen:  show contact info\n-House address: 2305 N Colorado St, Philadelphia, PA 19132\nMust pay 2 months of rent in advance(First month and Last month) then a one month of security deposit (will return to you once the lease ended).\nTenant responsible for all utilities.\n","num_images":11,"lat":39.988626,"lng":-75.161234,"attrs":"['3BR \/ 1Ba', '1060ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T13:14:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561631737.html","post_id":7561631737,"result_date":"Sat Nov 26 2022 18:38:25 GMT+0000 ","title":"Something for everyone! Rent a unique loft now! 797 Sq Ft!","description":"-- Silk Factory Lofts -- show contact info\nMonthly Rent:  $1782Apartment: 1 Bedroom | 1 Bathroom  Square Footage:  797 sq ft SEE WHAT YOU'VE BEEN MISSING  Discover an upscale lifestyle at Silk Factory Apartments. Our landmark historic building features a brick exterior, soaring ceilings, large windows, and a beautiful courtyard with outdoor lounge seating and firepits, a picnic and grilling area with gas grills, and a community herb garden. Inside your spacious loft-style apartment you'll find modern style from your updated kitchen with dishwasher, stove, refrigerator, and microwave, to central air conditioning, and a private in-home washer and dryer. Call us today for a tour!Pet Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephCheck out our beautiful community featuring: ◾ 18' Long Shuffle Board◾ 2 Weber Propane Grills◾ Business Center◾ Dog Wash Room◾ Elevator◾ Game Room & Free Wi-Fi◾ Laundry Facilities◾ Pet-Friendly Community◾ Pool Table◾ Vintage Building◾ Beautifully Landscaped Grounds with Access to Local Businesses◾ Close to Montgomeryville Mall and Routes 202 & 309◾ Community Lounge featuring free Verizon Fios TV\/Wi-Fi◾ Courtyard featuring tasteful Outdoor Seating and Fire Pits◾ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting◾ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi◾ Free Parking - 2 Spaces per Apartment Home + Guest Parking◾ Professional On-Site Management Team◾ Storage units - $50\/$75 per month◾ Within Walking Distance to TrainsApartment features include:  ◾ Cable & Hi-Speed Internet Ready◾ Central Air Conditioning◾ Courtyard View in select apartments◾ Dishwasher◾ Full Size Washer & Dryer◾ Large Windows◾ Range \/ Oven◾ Refrigerator\/Freezer◾ Storage Spaces◾ Upgraded Kitchens in Select ApartmentsPhone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/200 S Line St Lansdale, PA 19446Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthManaged by Paradise Management, LLCIncome requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYCFB7D8D080894DAD\n","num_images":18,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '797ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T13:34:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561630754.html","post_id":7561630754,"result_date":"Sat Nov 26 2022 18:36:20 GMT+0000 ","title":"Oh my! What a gorgeous place! See this 1 bed, 1 bath for yourself!","description":"Silk Factory Lofts  Address:  200 S Line St Lansdale, PA 19446 Bedrooms: 1 | Baths: 1 | Sq. Footage:  809 sq ft | Pricing: $1782\/Month Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-Month show contact info\n+ + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + +Features in this apartment home: ◾ Cable & Hi-Speed Internet Ready◾ Central Air Conditioning◾ Courtyard View in select apartments◾ Dishwasher◾ Large Windows◾ Range \/ Oven◾ Refrigerator\/Freezer◾ Secured Building Access◾ Storage Spaces◾ Upgraded Kitchens in Select Apartments◾ Central Air Conditioning◾ Courtyard View (select apartments)◾ Dishwasher◾ Full-Size Washer & Dryer◾ Large Windows◾ Range \/ Oven◾ Refrigerator\/Freezer◾ Secured Building Access◾ Storage Spaces◾ Upgraded Kitchens (select apartments) + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + +Amenities at our property: ◾ 2 Weber Propane Grills◾ Business Center◾ Game Room & Free Wi-Fi◾ Laundry Facilities◾ Monthly Community Events◾ Package Service◾ Pet-Friendly Community◾ Pool Table◾ Smoke-Free◾ Vintage Building◾ Close to Montgomeryville Mall and Routes 202 & 309◾ Community Lounge featuring free Verizon Fios TV\/Wi-Fi◾ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting◾ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi◾ Free Parking - 2 Spaces per Apartment Home + Guest Parking◾ Lobby Area with Complimentary Coffee◾ Maintenance-Free Lifestyle◾ Professional On-Site Management Team◾ Storage units - $50\/$75 per month◾ Within Walking Distance to Trains+ + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + +About the community: SEE WHAT YOU'VE BEEN MISSING  Silk Factory Lofts Apartments offers unique one bedroom, two bedroom, and three bedroom apartment homes in a beautiful setting that combines the comfort of home with exceptional resident services and outstanding community amenities. Options like large windows and storage spaces help you choose one of the apartment homes and create a style that is perfect for you. You will enjoy the convenience of living just minutes from major highways (1-476) and having easy access to transportation, employers, fine dining, parks and recreational areas, cultural events, historic attractions and shopping! By living luxuriously with a maintenance free lifestyle, you will find the serenity and convenience of Silk Factory Lofts Apartments to be your refreshing paradise. Schedule a tour of our beautiful Lansdale apartments today and see why residents love coming home to Silk Factory Lofts.Pets: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephPhone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/Twitter: https:\/\/twitter.com\/SilkFactoryLPWebsite: https:\/\/www.silkfactoryapts.com\/ Management: Paradise Management, LLC*Prices are subject to change without noticeIncome requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY2A6F1CAF76CF407\n","num_images":17,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '809ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T13:32:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561605682.html","post_id":7561605682,"result_date":"Sat Nov 26 2022 18:21:16 GMT+0000 ","title":"Spacious 3x1 North-Philadelphia w\/Large Kitchen, w\/d hookups, Hardwood","description":"Spacious north Philadelphia 3 bedroom home\nFeatures:\n*hardwood flooring throughout\n*ceiling fans\n*Washer\/Dryer hook ups\n*large kitchen with lots of closet space\nNO EVICTIONS\nNO JUDGEMENTS\nMUST HAVE RENTAL HISTORY\nMIN INCOME 3K\n","num_images":14,"lat":40.010241,"lng":-75.142891,"attrs":"['3BR \/ 1Ba', '1174ft2', 'available now', '\\nmonday 2022-12-05\\n', '\\nwednesday 2022-12-07\\n', '\\nfriday 2022-12-09\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T12:38:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561622563.html","post_id":7561622563,"result_date":"Sat Nov 26 2022 18:18:44 GMT+0000 ","title":"Extra Storage, W\/D, PETS, D\/W, 24\/7 Gym, Breakfast Bar","description":"❄️Snow Place like HOME- Apply Now - Receive One-Month FREE❄️\nApt #C-11 First floor apartment with beautiful courtyard view. Newly renovated and close to the train!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 8:30 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":24,"lat":40.0,"lng":-75.276,"attrs":"['1BR \/ 1Ba', '663ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T13:14:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561617462.html","post_id":7561617462,"result_date":"Sat Nov 26 2022 18:08:10 GMT+0000 ","title":"Two Bedroom Apartment w\/ In Home Washer & Dryer","description":"Come home to a great community - The Glen at Lafayette Hill!Address: 555 Andorra Glen Ct Lafayette Hill, PA 19444Beds: 2  \/ Baths: 2 \/ Size: 1043 sq ft   Monthly Rent: $2237 - $2692We offer the premier location for apartment homes in Lafayette Hill. With a great location and easy access to I-476 (Veteran's Memorial Hwy), you will love calling The Glen Apartments your home. Residents of our Lafayette Hill apartment rentals enjoy our one, two, and three bedroom floor plans that add a touch of style and sophistication to any lifestyle. We boast a number of lavish amenities, including 42-inch kitchen cabinetry, gas cooking, over-sized closets and in-unit washers and dryers. With its convenient location near the most prominent dining, shopping and entertainment venues in Lafayette Hill, The Glen is perfect for commuters all across the Pennsylvania area. Schedule a tour of our luxury Lafayette Hill apartments today and see why residents love coming home to our apartments.Security Deposit: $500Length of Lease: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nProperty Features: ◾ 24 Hour Availability◾ Business Center◾ Cardio Machines◾ Conference Room◾ Elevator◾ Gated, Controlled Access◾ Multi-Use Room◾ Package Service◾ Pet Play Area◾ Planned Social Activities◾ BBQ Picnic Garden◾ Billiards, Club Lounge, Cafe Area, Library and Community Room◾ Fitness Center w\/ Free Weights, Weight Machines◾ Message Therapist Practice On-site◾ Outdoor Cafe & Coffee Bar◾ Outdoor Patio Lounge◾ Sprinkler System◾ Storage Space◾ Wi-Fi at ClubhouseApartment Amenities:◾ Air Conditioning & Heating◾ Cable Ready◾ Carpet◾ Ceiling Fans (Select Floor Plans)◾ Dining Room◾ Heating◾ Range, Oven, Disposal, Oven◾ Refrigerator, Freezer and Ice Maker◾ Tub\/Shower◾ Wi-Fi◾ Crown Molding (Select Floor Plans)◾ Dishwasher◾ High Speed Internet Access◾ Linen Closet◾ Microwave◾ Storage Units◾ Tile Floors◾ Vaulted Ceiling (Select Floor Plans)◾ Walk-In Closets (Select Floor Plans)◾ Washer\/DryerPets: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds. Business Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMReady to Lease? Call our office at  show contact info\nWebsite: https:\/\/www.the-glen-apartments.comProudly managed by Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7FEB687AB31D403\n","num_images":21,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1043ft2', 'available dec 2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-26T13:04:10-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561605855.html","post_id":7561605855,"result_date":"Sat Nov 26 2022 18:01:38 GMT+0000 ","title":"#[2x1]+br - 970ft2 - Two Bd Available;''24\/7~CVS Pharmacy","description":"We currently have a two bedroom, two bathroom available. This spacious 970 square feet apartment home is upstairs with a wood burning fireplace, perfect for this cooler weather we're having and a screened in porch as well! We offer some awesome amenities as well including a tennis court, 24\/7 fitness center with peloton bikes, wood burning fire pit, outdoor grilling station and more.","num_images":6,"lat":39.947196,"lng":-75.166458,"attrs":"['2BR \/ 1Ba', '970ft2', 'available dec 25', 'EV charging', 'air conditioning', 'application fee details: $45', 'broker fee details: NO BROKER FEE@', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'listed by: Yasuko Nagai!', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T12:38:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561604948.html","post_id":7561604948,"result_date":"Sat Nov 26 2022 17:58:41 GMT+0000 ","title":"1br - Philly Free School - One bd Available for 25-12-2022***PA","description":"Hurry this won't last long! We have a one bedroom one bathroom apartment home available for move in 25\/12\/2022!\nThis apartment is such a cute spot offering 630 square feet of living space and includes a screened in porch! We also include some awesome amenities including a wood burning fire pit, 24\/7 fitness center with peloton bikes, Tennis court, and Laundry Facility on the property! We are happy to assist with finding your perfect apartment and answer any questions you may have!\n","num_images":4,"lat":39.944528,"lng":-75.218654,"attrs":"['1BR \/ 1Ba', '900ft2', 'available dec 25', 'EV charging', 'air conditioning', 'application fee details: $45', 'broker fee details: NO BROKER FEE@', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'listed by: Yasuko Nagai!', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T12:36:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561605113.html","post_id":7561605113,"result_date":"Sat Nov 26 2022 17:47:01 GMT+0000 ","title":"Jogging trail right outside your door, BBQ and deck area, Bark park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Alexa or Google Home Capable in all ApartmentsState-of-the-art fitness center overlooking the Manayunk canalOn-site bike storageBBQ and deck areaUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densJogging trail right outside your doorHuge walk-in closets with ample storageMarble master baths, some with deep linen storageUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsBocce ball fieldPet-friendly livingUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/3iezxktk\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1364ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-26T12:37:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561605971.html","post_id":7561605971,"result_date":"Sat Nov 26 2022 17:42:51 GMT+0000 ","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"Find yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two story two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, two patio\/balconies, and a loft with a closet upstairs!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Non Smoking Community\n* Outdoor Grill Area\n* Package Acceptance\n* Community Lounge\n* Bark Park\n* Community Kitchen\n* Pet Salon\n* TV Lounge\n* Long Term Lease Available\n* WiFi Access\n* Elevator\n* Short or Long Term Lease Available\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Landscaped Courtyards\n* Minutes from Restaurants, Shopping, and Much More\n* Dry Cleaning and Laundry Service\n* Controlled Access\n* Playground\n* Renters Insurance is Required\n* Professionally Managed\n* Easy Freeway Access\n* Gaming Area\n* Fitness Studio\n* Billiards\n* Swimming Pool\n* Movie Theatre\n* Garage Parking\n* Sun Deck\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* After-Hours Emergency Maintenance\n* Bike Racks\n* Credit Cards Accepted\n* EV Charging\n* Extra Storage","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1210ft2', 'available dec 3', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T12:38:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561604765.html","post_id":7561604765,"result_date":"Sat Nov 26 2022 17:40:17 GMT+0000 ","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nYou will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Full sized Washer and Dryer in unit\n* Wood-Like Floors\n* Granite Countertops\n* Extra Storage\n[#9496615]","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-26T12:36:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561598205.html","post_id":7561598205,"result_date":"Sat Nov 26 2022 17:26:06 GMT+0000 ","title":"Private Balcony, Quiet Community, Move In Now","description":"Discover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nApartment Features\n* Walk-in Closet\n* Linen Closet\n* Garden Tub\n* Stainless Steel Appliances\n* Private Patio or Private Balcony (on select apartments)\n* Washer and Dryer in unit\n* Kitchen Island","num_images":23,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1239ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-26T12:22:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561596912.html","post_id":7561596912,"result_date":"Sat Nov 26 2022 17:23:14 GMT+0000 ","title":"Conveniently Located! 2br 2ba W\/A City View! Call For More Info!","description":"RENT: $1652 - $2217\/Month | SIZE: 1178 sq ft | BEDROOMS: 2 | BATHROOMS: 2LEASE TERMS: Variable show contact info\nABOUT COMMUNITY: Complete with a soothing sauna, dry-cleaning pick-up and delivery, a resort style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Pet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.UNIT FEATURES:   − Built-In Microwave− Central Heat & Air Conditioning− Disability Access In Select Units− Dishwasher− Full-Size Washer & Dryer In Every Apartment− Mini Blinds On All Windows− Refrigerator\/Freezer With Ice Maker− Walk-In ClosetsCOMMUNITY FEATURES: − Business Center− On-Site Leasing Office− Pet-Friendly− Private Garages In Select Units− 24-Hour Emergency Maintenance− Coffee Bar Clubhouse Kitchen− Resident Referral BonusesCONTACT US TODAY!Millview Apartments100 Cobblestone Dr  Coatesville, PA 19320Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ Professionally managed by Paradise Management, LLC EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T12:19:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561595597.html","post_id":7561595597,"result_date":"Sat Nov 26 2022 17:20:36 GMT+0000 ","title":"Comfortable living. Conveniently located, spacious 1 bed 1 bath! W\/D!","description":"Millview Apartments - A place to call home! Bed: 1 \/ Bath: 1  Sq. Footage: 845 sq ft Rent: $1444 - $1931\/MonthTerms: Variable show contact info\nTHE BEST APARTMENTS IN COATESVILLE, PA\nIf you're looking for the best apartments in Chester County, look no further than Millview Apartment Homes. Our world-class amenities, including a resort-worthy swimming pool, sauna, and clubhouse are better than any in the Coatesville area. Our professional leasing staff is eager to welcome you home to a carefree lifestyle. Please schedule a tour and come home to the best Coatesville, PA apartments.Our Apartment Homes Feature:   ◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In Closets Our Residents Enjoy:  ◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral BonusesContact Info: show contact info\n100 Cobblestone Dr Coatesville, PA 19320 Website: https:\/\/www.apartmentsincoatesvillepa.com\/Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. EQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T12:16:36-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561552063.html","post_id":7561552063,"result_date":"Sat Nov 26 2022 17:19:48 GMT+0000 ","title":"Move in with $0 DEPOSIT! Renovated one bedroom a apartment@ 532 N 15th","description":"Available Now\nOne year lease\n$750 a month\nRenovated one bedroom a apartment@\n532 N 15th St Apt 3F\nPhiladelphia PA 19130\n(Corner of 15th St and Brandywine St, one block north of Spring Garden Street)\nEnter into a small hall with closet and recessed lighting\nKitchen, living room combo\nSolid wood white 42” cabinets, self closing drawers and doors\nQuartz counter, dishwasher, fridge, all white appliances\nNew looking wood floors throughout, new blinds and curtain rods on every window\nCrown molding throughout the apartment, recessed lighting in every room including bathroom and controlled with dimmers\nWindow AC unit included\nBathroom with new floating vanity, toilet and medicine cabinet.\nGreat neighborhood in Fairmount, Art museum, Center City\nBlock away from Community College, close to Temple University, and many other colleges and Universities. Two blocks from fairmount Ave. close to eateries banks and other amenities. One block from the Broad street line. Giant Supermarket right around the corner. Permit parking (6). Ten minute walk to City Hall, (Center City). Close to the Art Museum, Ben Franklin Parkway, highways and bridges, very convenient location. For more details and showing please text your number.\nWe pay for cold water, sewer and trash\nYou pay for gas and electric\n","num_images":5,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T10:37:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561593049.html","post_id":7561593049,"result_date":"Sat Nov 26 2022 17:15:32 GMT+0000 ","title":"One Bedroom Apartment - Available Now","description":"Third Floor - one bedroom apartment available in quiet mature building in great Germantown location.\nClose to transportation & shopping and freshly painted. Ideal for single tenant or couple.\nCredit above 620\/income 3x the rent\/no prior evictions\nMove in - $2,850.00\nFor More information\/Appointment Call: 267-97-9031\n","num_images":13,"lat":40.028732,"lng":-75.182083,"attrs":"['1BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-26T12:11:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561575509.html","post_id":7561575509,"result_date":"Sat Nov 26 2022 17:09:18 GMT+0000 ","title":"2 Bed\/2 Bath Luxury Roxborough GreenTree Condo","description":"Drive up to your beautifully landscaped new home, nestled away in a great location in Manayunk\/Roxborough, surrounded by trees in GreenTree Summit. COMPLETELY Remodeled! Walk up your private stairway to your beautiful and Spacious 2 bedroom 2 Bathroom Condominium with Master Bedroom and Bathroom suite, including Two Large walk-in closets. Enjoy the modern kitchen with New Cabinets, Granite Counters and New Stainless Steel Appliances. Sit on your expansive Trex Porch, overlooking the Olympic sized pool and spectacular Tree lined horizon. In the Winter, cozy up next to the Fireplace in your living room. Private Washer\/Dryer, Central Air, tons of storage, Brand new floor and fresh custom paint. Washer and Dryer.","num_images":13,"lat":40.0402,"lng":-75.2231,"attrs":"['2BR \/ 2Ba', '1270ft2', 'available now', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T11:33:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561574493.html","post_id":7561574493,"result_date":"Sat Nov 26 2022 17:01:01 GMT+0000 ","title":"Renovated & Private 4x2 w\/Central AC\/Heat, Finished Basement, W-Dryer!","description":"Newly renovated; 4 bedrooms and Full Bathroom upstairs. Kitchen, Dining Room and Living Room Main Floor. Finished Basement with 1 Bedroom, Full Bathroom and private entrance.\nNew Central AC and Heating throughout the house.\nStove, microwave, Fridge, Washer and Dryer are Included.\nOwner pays for water. Renter\/tenant pays for electric, gas, reimbursement for water. When signing lease tenant must pay first month rent, Last month rent, 2 month rent Security (If payments are made on Time for 7 month, tenant gets back one month security).\n","num_images":15,"lat":40.031646,"lng":-75.030319,"attrs":"['4BR \/ 2Ba', '1290ft2', 'available now', '\\nmonday 2022-12-05\\n', '\\ntuesday 2022-12-06\\n', '\\nwednesday 2022-12-07\\n', 'application fee details: We will run background check + credit score check', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-26T11:31:01-0500"}]