[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-studio-available-now\/7603689796.html","post_id":7603689796,"title":"Great studio available now at 35th and Spring garden!","description":"Affordable studio","num_images":4.0,"lat":39.962769,"lng":-75.192846,"attrs":"['0BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T22:15:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-available\/7603685360.html","post_id":7603685360,"title":"Spacious 2 bedroom available now at 35th and Spring garden!","description":"Updated kitchen. Spacious living room. Hardwood floors. Laundry room is in the building. Tenant pay for electric and gas. Cold water is included. 1 year lease. $60 application fee. 3 months to move in. $250 pet fee plus $25 pet rent.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":14.0,"lat":39.962769,"lng":-75.192846,"attrs":"['2BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T21:53:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-available\/7603681566.html","post_id":7603681566,"title":"Spacious 1 bedroom available now at 4704 Chestnut st!","description":"Great, beautiful 1 bedroom available now. Dark hardwood floors. Spacious living room and a good size bedroom. Laundry room is in the building. Tenant pays for electricity and gas. Cold water is included. $60 application fee. 3 months to move in. 1 year lease.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":16.0,"lat":39.957259,"lng":-75.215396,"attrs":"['1BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T21:35:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/roommate-wanted-in-center-city\/7603681451.html","post_id":7603681451,"title":"Roommate wanted in center city","description":"Searching for a roommate to take over my lease in center city starting in May or June (flexible with date)\n1200 sq feet apartment with floor to ceiling windows over looking Jefferson hospital, with central air\/heat, close to a lot of restaurants and shops\n2bed 1 bath - will share apartment\/bathroom with one M 25 but will have your own bedroom\nnear 10th and chestnut\nRent: $1100\/month\nPet friendly\n24\/hr door man\nState of the art gym in building\nWasher\/dryer shared on each floor\n","num_images":4.0,"lat":23.034671,"lng":-63.632813,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-03-26T21:34:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-heres-your-opportunity-to\/7603658483.html","post_id":7603658483,"title":"Here's your opportunity to live in one of the Most Spacious Apartment","description":"Here's your opportunity to live in one of the most spacious and desired one bedroom floor plans at The Phoenix Condominiums in Center City, Philadelphia. This unit features large windows, beautiful floors, large kitchen with separate dining room, in-unit washer & dryer and ample closet space. Enjoy the entertaining, open floor plan and high ceilings. 5 X 4 Storage locker included in the price. This grand, historic and amenity filled building is centrally located and just steps away from everything Center City, Philadelphia has to offer. Amenities include a beautiful fitness center, media room, gorgeous roof top terrace with views of the city, direct access to Suburban Station, Starbucks and a full service restaurant. Valet Parking is available for an additional fee. Don't miss this wonderful opportunity.","num_images":19.0,"lat":39.954816,"lng":-75.166365,"attrs":"['1BR \/ 1Ba', '961ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T20:02:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-bath-home\/7603671452.html","post_id":7603671452,"title":"Large 4 bedroom 1 bath home","description":"Clean 4 bedroom and 1 bath home available in a  beautiful community filled with plenty of amenities. This home features hardwood flooring, high ceilings, open floor plan. Newly rehabbed kitchen with stainless steel appliances. Large backyard for entertaining, or creating a great outdoor space for your pet. In addition, this home is walking distant to ACME, several banks, cafes, restaurants, Crane Arts, distilleries, and recreational centers. Several bus routes, train to center city or Amtrak. Schedule your appointment today. This won’t last long! Please be advised we are not a HUD landlord at this time. If this changes we will update post.","num_images":9.0,"lat":39.978,"lng":-75.1459,"attrs":"['4BR \/ 1Ba', '1600ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T20:51:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifull-renovated2-bedr\/7603651868.html","post_id":7603651868,"title":"Beautifull renovated(2 bedr &1.5 bath)and cable\/wifi.Two parking spots","description":"Beautifully renovated 2 bedroom, 1.5 bath condo in Village Terrace. $1800 per month. Tenant pays electric and cable\/wifi. Two parking spots steps from condo entrance. Just minutes to areas beaches, the nicest along RI's southern coast. Walk to downtown Philadelphia where you will find live entertainment and too many dining options to mention. Take a short ride over to Mystic, CT to the seaport or aquarium or maybe you prefer a day trip to Block Island. So much to do, visit and enjoy here in Westerly and the surrounding areas.","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1.5Ba', '1325ft2', 'available now', 'apartment', 'w\/d in unit', \"listed by: To Know Do  THRU ''REPLY''\", 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T19:37:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-home-has-been-well\/7603653191.html","post_id":7603653191,"title":"This home has been well- maintained and upgraded from top to bottom!","description":"This home has been well- maintained and upgraded from top to bottom! When walking into this stunning home you are greeted by an open floor plan with nice, vaulted ceilings. The kitchen is completely upgraded and includes all stainless-steel appliances as well as granite counter tops! The main floor consists of one full bath and three generous sized bedrooms with new hardwood floors throughout! The fully re-finished basement is a must-see and perfect for entertainment! Washer\/Dryer located in the basement as well as a full bath with a stand-up shower! The backyard is one of the highlights of the home showcasing a beautiful lawn and plenty of fenced in space for entertaining! Also there is a detached two car garage along with a very generous front driveaway! Text here  show contact info","num_images":5.0,"lat":40.0634,"lng":-74.999,"attrs":"['3BR \/ 2Ba', 'available now', 'application fee details: App fee None (per person) & Processing fee $1 (Refundable)', \"broker fee details: Discounted broker's fee\", 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'listed by: Keller Williams Realty', 'detached garage', 'rent period: monthly']","posted_date":"2023-03-26T19:42:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-12th-st-available-15-rent\/7603637701.html","post_id":7603637701,"title":"(S) 12th St - Available 4\/15 Rent includes heat Please know!!","description":"One bedroom apartment, with large storage room, available 4\/15. Rent includes heat, hot water, water\/sewer, normal household trash, plowing of main section of driveway. Please know, this is a second floor apartment.\nLarge bedroom and separate living area. I heated storage room off the bedroom as added space for belongings. Off street parking for up to 2 vehicles.\nOne year lease preferred. Credit, criminal and eviction check conducted as final step before signing lease. First months rent and security deposit of a full month’s rent due at lease signing.\nThis is a non smoking building and strictly enforced.\n","num_images":3.0,"lat":39.943997,"lng":-75.161599,"attrs":"['1BR \/ 1Ba', \"application fee details: Discounted broker's fee\", 'broker fee details: Fee Per Adult **P\/A', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'listed by: Claudia D. Hauser', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T18:48:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/105-reed-st-newly-remodeled-3br-house\/7603630344.html","post_id":7603630344,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-to-123-butternut\/7603533979.html","post_id":7603533979,"title":"Beautiful to 123 Butternut Drive, a recently remodeled 3 bedroom","description":"Welcome to 123 Butternut Drive, a recently remodeled 3 bedroom 1 1\/2 bath Rancher with a one car garage. Featuring a New Kitchen with plenty of white cabinetry and counterspace. All new stainless steel appliances including range\/oven, dishwasher and built in microwave. New Pergo Ultra Laminate flooring is featured in the kitchen as well as the living and dining areas. Both bathrooms have been totally remodeled. All 3 bedrooms have new wall to wall carpeting. Other features of this lovely home include: fresh paint, recessed lighting, new windows, 100 AMP electric service, New Heater with Central Air, laundry tub, great landscaping with low voltage lighting and drip irrigation in place out front. Low Taxes! Located in Hatboro Horsham School District. Close to shopping and restaurants. Not too far from the PA turnpike entrance as well as Septa's regional rail. Have you been thinking about one level living?","num_images":3.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T13:55:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-single-family\/7603532144.html","post_id":7603532144,"title":"Beautiful single family home","description":"he kitchen\/dining room has laminate flooring for easy cleaning and is so large, you can host all the holiday dinners while still interacting with your guests. Best yet, it also features a convenient powder room! Enjoy quieter moments at the breakfast counter with your morning coffee, Need a home office or a place for the kids to play? This house has it with a finished space in the lower level.","num_images":4.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 1.5Ba', '1152ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T13:50:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-extremely-overall\/7603528764.html","post_id":7603528764,"title":"🏠🏠Extremely Overall Beautifully 1 Bedroom 1 Bath Apartment","description":"Beautifully 1 Bedroom 1 Bath Apartment !!! Centrally located in Worcester with total privacy and spacious 1.4 acreage. Former short term rental appointed with high end linens and details. Fully equipped kitchen. One bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed. Wood-burning fireplace, patio\/deck with propane Weber BBQ, massage chair, cable TV with ROKU and Bluetooth sound bar. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. $500 damage deposit required and returned at the end of rental if no damage incurred. Absolutely no smoking indoors. References will be requested. If you are interested Please text me at: jessicaneff08gmail.com","num_images":3.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T13:41:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-listed-bed-15-bath-c\/7603517282.html","post_id":7603517282,"title":"JUST LISTED 3 Bed 1.5 bath - A\/C, H\/W Floors, W\/D, OFF STREET PARKING!","description":"6766 Germantown Ave – 3 bed 1.5 bath house  - H\/W floors, Central Air, in unit W\/D & off-street parking! $2149\/month -  AVAILABLE AUGUST 1\nCome see why so many people are calling Mt. Airy home! Located on Germantown Ave. within walking distance from Lovett Park and all points Mt. Airy. Head down the street for dinner at McMenamin’s or Earth & Bready Brewery, or hop into town for a night.\nLovingly maintained 3-bedroom 1.5 bath house with off street parking and more! Open floor plan in your living and dining area with hardwood flooring. Excellent light pours into the updated kitchen with new tile flooring, stainless steel microwave, dishwasher and oven.\nConvenient half bath off the living space with newly installed vanity. Second floor features three spacious bedrooms with generous closet space, and a full three-piece bathroom.\nDon’t forget your very own WASHER & DRYER! Laundry is a breeze!! CENTRAL AIR! Keeping you cool during those hot HUMID summer days!\nFeaturing:\n3 bedrooms\n1.5 bath\nStove\nDishwasher\nFull sized refrigerator\nMicrowave\nWasher & dryer\nCentral Air\nOff-street parking\nFull basement storage\nAND MORE!","num_images":12.0,"lat":40.053966,"lng":-75.186516,"attrs":"['3BR \/ 1.5Ba', 'available aug 1', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T13:12:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-perfact-beautiful\/7603526239.html","post_id":7603526239,"title":"AMAZING #@perfact beautiful & BRIGHt 2 bed, 2 bath!! a must see!!!","description":"AMAZING #@perfact beautiful & BRIGHt 2 bed, 2 bath!! a must see!!! !. Kitchen, living room and dining area with sliding glass doors leading to patio area. Lower unit, lots of closets, non-smoker. Central air, W\/D, Pool & Club house, parking. Former short term rental appointed with high end linens and details. FULLY EQUIPPED KITCHEN. ONE BEDROOM HAS A QUEEN BED AND ANOTHER BEDROOM HAS TWIN BUNKBEDS AND A SECTIONAL\/QUEEN BED. Wood-burning fireplace, patio\/deck with propane Weber BBQ, massage chair, cable TV with ROKU and Bluetooth sound bar. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. $635 damage deposit required and returned at the end of rental if no damage incurred. Absolutely no smoking indoors.","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T13:35:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3700-hamilton-st-near-penn\/7603510925.html","post_id":7603510925,"title":"3700 Hamilton St ( Near Penn and Drexel)","description":"Located in Powelton Village, on the corner of 3700 Hamilton St, is a bright and airy 1 bedroom 2nd floor apartment. This apartment is located in a quiet neighborhood with street parking and is close to Penn, Drexel and public transportation. The landlord pays the heat and the water. The renter is responsible for electric and gas usage. Landlord pays water and heat. Free laundry in the basement. The rent is $900.00, first and last month's rent plus security deposit is required. The lease is a 1 year lease. The apartment is available immediately.","num_images":15.0,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T12:56:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-price-drop-bed-bath-apt-d\/7603497883.html","post_id":7603497883,"title":"PRICE DROP! 2 BED 1 BATH APT! W\/D IN UNIT, PRIVATE ENTRANCE & MORE!!!!","description":"4833 Germantown Ave #1  – 2 bed 1 bath apartment w\/private entrance & in-unit laundry! $1249\/month\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co. or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nExcellent spacious 2 bed 1 bathroom first floor apartment with private entrance.  Eat – in kitchen with gas stove and full-sized refrigerator. Boasting hardwood flooring throughout, bedrooms offer plenty of room. Living space is large featuring bay windows and classic fireplace mantle. Exclusive access to basement and storage purposes.\nLaundry is a breeze with your own in unit washer & dryer!\nFeaturing:\n2 bedrooms\n1 bathroom\nGas stove\nFull sized refrigerator\nFull basement storage\nHardwood floors\nPrivate entrance\nIn Unit Laundry\nAND MORE!\n4833 Germantown Ave #1  – 2 bed 1 bath apartment w\/private entrance & in-unit laundry! $1249\/month\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co. or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nExcellent spacious 2 bed 1 bathroom first floor apartment with private entrance.  Eat – in kitchen with gas stove and full-sized refrigerator. Boasting hardwood flooring throughout, bedrooms offer plenty of room. Living space is large featuring bay windows and classic fireplace mantle. Exclusive access to basement and storage purposes.\nLaundry is a breeze with your own in unit washer & dryer!\nFeaturing:\n2 bedrooms\n1 bathroom\nGas stove\nFull sized refrigerator\nFull basement storage\nHardwood floors\nPrivate entrance\nIn Unit Laundry\nAND MORE!","num_images":11.0,"lat":40.028245,"lng":-75.162125,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T12:22:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bed-full-bath\/7603479981.html","post_id":7603479981,"title":"@@Beautiful 4 Bed\/2 full bath home@@(Large\/Growing Family)","description":"Beautiful 4 Bedroom, 2 full bath home perfect for a large\/growing family. This home boasts an open floor plan with separate kitchen, dinning & living room; Perfect for family get-togethers and events. Full basement downstairs with an extra room included. Detached garage is great for storage and any personal projects. If you think the open floor plan is enough, wait until you check out the fenced in backyard that is just above over a half an acre of clear land and a large parking area in the front of the garage, so you can easily take the party outside!! Bonus front porch for relaxation and enjoyment. Also to mention that a new Roof, Heater, A\/C, Electric, water heater & Windows were all installed in 2017!!\nFor more information about this home please reply with your phone number.","num_images":4.0,"lat":40.0596,"lng":-75.0818,"attrs":"['3BR \/ 2Ba', '1678ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T11:34:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-furnished-units-available\/7603511364.html","post_id":7603511364,"title":"Furnished Units Available","description":"Apt. 1507 — Edgeware floor plan — 919 sq. ft. — $4,494\nLocated on the 5th floor, this fully-furnished 1-bedroom corporate has a great view from a private balcony! This apartment boats LVT flooring, central heat & air, a front-load washer & dryer, and upgraded stainless steel appliances. This apartment also comes equipped with a spacious living area and bathroom. This gorgeous apartment is within close proximity to our clubhouse—featuring a 24-hour fitness center, theatre, resort-style swimming pool, and so much more! Available for short-term lease at a 3-month minimum with utilities included!\nContact our leasing office to schedule a tour!  show contact info","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '919ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T12:58:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-furnished-units-available\/7603510420.html","post_id":7603510420,"title":"Furnished Units Available","description":"Apt. 1507 — Edgeware floor plan — 919 sq. ft. — $4,494\nLocated on the 5th floor, this fully-furnished 1-bedroom corporate has a great view from a private balcony! This apartment boats LVT flooring, central heat & air, a front-load washer & dryer, and upgraded stainless steel appliances. This apartment also comes equipped with a spacious living area and bathroom. This gorgeous apartment is within close proximity to our clubhouse—featuring a 24-hour fitness center, theatre, resort-style swimming pool, and so much more! Available for short-term lease at a 3-month minimum with utilities included!\nContact our leasing office to schedule a tour!  show contact info","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '919ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T12:55:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/chester-4br-2b-fully-renovated-sec8-ok\/7603508416.html","post_id":7603508416,"title":"4BR 2B Fully Renovated - Sec8 OK","description":"Completely renovated twin. All new kitchen, both baths, flooring, etc. 1st Fl: kitchen, dining, formal living, huge family room, mud room, laundry, Master\/walk in closet\/private bath. 2nd Fl: two bedrooms, full bath. 3rd Fl: Bedroom. Front porch and covered back deck. Fenced yard and off street private driveway. Section 8 listed\/ok. No pets\/smoke.  Email Jennifer for showing and rental application.","num_images":24.0,"lat":39.854479,"lng":-75.380869,"attrs":"['4BR \/ 2Ba', '2000ft2', 'available apr 1', '\\nsaturday 2023-04-01\\n', 'townhouse', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T12:50:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-renovated\/7603471606.html","post_id":7603471606,"title":"Beautifully renovated 3 bedroom, 2 bathroom house in Yeadon!","description":"Welcome to your new home! This recently renovated house in Yeadon features 3 spacious bedrooms and 2 full bathrooms. You'll love the modern touches like recessed lighting throughout, laminate flooring, and gray and white wall to wall paint. Plus, there's a finished basement with an attached garage, providing even more space and storage.\nEnjoy the convenience of living across the street from Yeadon and within walking distance of Cobbs Creek Parkway. Plus, you're only 10 minutes away from University City. And when you're not exploring the area, relax in your own large backyard.\nDon't miss out on this beautiful rental opportunity! Contact us today by email with your name and number to schedule a viewing. text me  show contact info","num_images":6.0,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 2Ba', 'available now', '\\nsunday 2023-03-26\\n', '\\nmonday 2023-03-27\\n', '\\ntuesday 2023-03-28\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T11:09:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-price-drop-bed-15-bath-apt\/7603498050.html","post_id":7603498050,"title":"PRICE DROP! 3 BED 1.5 BATH APT! W\/D IN UNIT, A\/C, PRIVATE YARD & MORE!","description":"5046  Germantown Ave #1  – 3 bed 1.5 bath apartment w\/private entrance & in-unit laundry! $1349\/month\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co., or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nTerrific 3 bed 1.5 bath 1st floor apartment. Large open concept living space with. Three spacious bedrooms with closet storage. Full sized 3-piece bathroom with tub\/shower, vanity and toilet. Eat-in kitchen with stainless steel appliances including dishwasher, microwave & gas stove.\nLaundry is a breeze with convenient laundry room! CENTRAL AIR! keeping you cool in the summertime!\nFeaturing:\n3 bedrooms\n1.5 bathroom\nCentral Air\nGas stove\nMicrowave\nDishwasher\nEat – in kitchen\nFull sized refrigerator\nPrivate entrance\nIn-unit laundry\nPrivate yard\/patio space\nAND MORE!","num_images":14.0,"lat":40.029945,"lng":-75.164949,"attrs":"['3BR \/ 1.5Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T12:23:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-central-location-upgraded\/7603497099.html","post_id":7603497099,"title":"Central Location, Upgraded Finishes Available, Pet Park","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nThe Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Credit Cards Accepted\n* Community Lounge\n* Elevator\n* Short or Long Term Lease Available\n* Extra Storage\n* Professionally Managed\n* Controlled Access\n* Community Kitchen\n* Long Term Lease Available\n* Playground\n* TV Lounge\n* Fitness Studio\n* Bike Racks\n* Bark Park\n* Movie Theatre\n* Landscaped Courtyards\n* Billiards\n* After-Hours Emergency Maintenance\n* Sun Deck\n* EV Charging\n* Outdoor Grill Area\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Pet Salon\n* Non Smoking Community\n* Swimming Pool\n* Package Acceptance\n* Dry Cleaning and Laundry Service\n* Gaming Area\n* Renters Insurance is Required\n* Garage Parking\n* WiFi Access\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1217ft2', 'available apr 2', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T12:20:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-incredible-features-resort\/7603496804.html","post_id":7603496804,"title":"Incredible Features, Resort Style Pool, Upgraded Finishes Available","description":"The Point at West Chester is the perfect location for your new home. Explore our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, Den, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Swimming Pool\n* Easy Freeway Access\n* Package Acceptance\n* Pet Salon\n* Long Term Lease Available\n* WiFi Access\n* Short or Long Term Lease Available\n* Bike Racks\n* Community Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Bark Park\n* Landscaped Courtyards\n* Credit Cards Accepted\n* Extra Storage\n* Controlled Access\n* Community Kitchen\n* Outdoor Grill Area\n* Dry Cleaning and Laundry Service\n* Billiards\n* EV Charging\n* TV Lounge\n* Professionally Managed\n* After-Hours Emergency Maintenance\n* Movie Theatre\n* Garage Parking\n* Non Smoking Community\n* Playground\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Fitness Studio\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Renters Insurance is Required\n* Sun Deck\n* Gaming Area\n* Elevator","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available apr 2', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T12:19:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-laundry-in-unit-central\/7603492237.html","post_id":7603492237,"title":"Laundry in Unit, Central Location, Ideal Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1218ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T12:08:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/media-nice-sunny-2br-bath-apt-great\/7603472014.html","post_id":7603472014,"title":"Nice & Sunny 2BR & 1 Bath Apt, great area & location","description":"MEDIA - 2 BED\/1 BATH - Walking distance to downtown Media, Great location. Move in Ready Now. Available 4\/1\nCall Chris @  show contact info\nfor showing\nNewly remodeled in Media with hardwood floors and updated kitchen. Walking distance to trains to downtown Philadelphia, shopping, etc.\nAvailable Immediately!\n*RENTAL REQUIREMENTS*\n- MONTHLY NET INCOME: $3,900\nRates:\n$1499 per month. Tenant responsible for all utilities.\nExperience Everyone's Hometown of Media, PA: A charming walk able town with shops, diverse restaurants and nearby parks. Whether business in the County seat brings you to Media or visiting the Philadelphia area for pleasure, experience small town living with convenient public transportation to Philadelphia.\nHighlights of the Property Include:\n1. Washer and dryer available\n2. Tenant is responsible for all utilities.\n3. Walking distance to Media SEPTA Train Station that will take you all the way to downtown Philadelphia, Penn University, Temple University, University City.\n4. Near Penn State University Brandy Wine\n5. Walking distances to Delaware County Courthouse\n6. Walking distance to the restaurant and local shop, etc\n7. Near Movie Theater\n8. Near Riddle Hospital\/Media\n9. Walking to distance to downtown Media and close to the post office, bank, Wawa store.\nOff street parking! Walk to train station or walk into town and enjoy the many fine restaurants.\nNorth on Route One, turn right at Hill's Seafood, go to stop sign. Property located across from stop sign.\nNo Smoking or Indoor Candles!\nCall Chris @  show contact info\nfor showing\n2 bed\/1 bath. $1350 rent, 2+ Year lease preferred, longer term tenant\nAmenities:\n- Unfurnished\n- Smoke Free\nAppliances:\n- Air Conditioning\n- Microwave\n- Range\n- Refrigerator\n- Oven\n- Washer & Dryer - Basement\nLeaseLengths:\n- 12 Months lease - Prefer long term tenant\n- 24 Months lease - Prefer long term tenant\nUtilities:\n- Resident Pays Electricity\n- Resident Pays Gas\n- Resident Pays Heat\n- Resident Pays Water\n- Resident Pays Trash Pick-up\n- High-Speed Internet Available\nContact at  show contact info\nfor more information.\n","num_images":12.0,"lat":39.915968,"lng":-75.394898,"attrs":"['2BR \/ 1Ba', '900ft2', 'available apr 7', 'air conditioning', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T11:10:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stunning-bedroom-loft-with\/7603482937.html","post_id":7603482937,"title":"Stunning 2 Bedroom Loft with Parking in Northern Liberties","description":"This is an updated and elegant New York loft style condo in an excellent building. 2 large bedrooms and 2 full baths with an open, airy feel and copious natural light throughout. Of special note, this unit includes: track lighting, a gorgeous marble epoxy flooring throughout, and top of the line stainless steel appliances.\nThis unit also includes 1 parking space in the gated lot, access to an 8000 sq ft fitness center, 24\/7 front desk personnel & on-site maintenance.\n444 Lofts is a true warehouse conversion featuring concrete beamed ceilings and magnificent views of the city. The custom kitchen features sleek granite counters, newer Samsung stainless steel appliances, in unit stacked washer\/dryer, ample closet space, and high speed internet\/cable access.\nYou are sure to enjoy the large sundrenched windows featuring Southern sun. The exposed brick is a great style detail. Rounding out this special unit is a primary bedroom with full bath and plenty of privacy. Both bathrooms are updated and in great condition.\nListing is provided by Compass Pennsylvania LLC\n","num_images":19.0,"lat":39.958945,"lng":-75.145423,"attrs":"['2BR \/ 2Ba', '1358ft2', 'available apr 15', 'air conditioning', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T11:43:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lasalle-student-rental\/7603480149.html","post_id":7603480149,"title":"LaSalle Student Rental","description":"Nicely updated, clean house for rent just 1 block from LaSalle University.  Updated kitchen and bath in this 3 bedroom student rental home.  Hardwood flooring throughout the 2nd floor and carpet on the 1st. Brand new heating system installed this year.  Available June 1. Call or text for showing. Kim  show contact info\n.","num_images":14.0,"lat":40.0365,"lng":-75.1451,"attrs":"['3BR \/ 1Ba', 'available jun 1', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T11:35:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fitness-center-incredible\/7603475967.html","post_id":7603475967,"title":"Fitness Center, Incredible Features, Central Location","description":"Be the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Yoga Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Sun Deck\n* Billiards\n* Outdoor Grill Area\n* Professionally Managed\n* Swimming Pool\n* TV Lounge\n* Spa\n* Fitness Studio\n* Easy Freeway Access\n* Pet Salon\n* Bark Park\n* Community Lounge","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '815ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T11:22:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-mount-airy-newly-renovated\/7603473558.html","post_id":7603473558,"title":"Mount Airy Newly Renovated Apartment","description":"Newly renovated 2nd floor, 1 bedroom, 1 bathroom apartment in the Mount Airy section in of Philadelphia with new carpet, new vinyl flooring in bathroom & kitchen, new stackable washer\/dryer and new range. Close to public transit and a great neighborhood.","num_images":16.0,"lat":40.0702,"lng":-75.1779,"attrs":"['1BR \/ 1Ba', 'available now', 'application fee details: $50.00', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T11:15:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-great-pet-friendly\/7603462190.html","post_id":7603462190,"title":"Great Pet-Friendly Community in Coatesville! Ask for details!","description":"Millview Apartments 100 Cobblestone Dr Coatesville, PA 19320  show contact info\nUnit Information: 2 Bedroom | 2 Bath  Unit Size: 1178 sq ft  Monthly Rent: $1725 - $2309 Lease Terms: Variable Unit Includes:● Built-In Microwave● Central Heat & Air Conditioning● Disability Access In Select Units● Dishwasher● Full-Size Washer & Dryer In Every Apartment● Mini Blinds On All Windows● Refrigerator\/Freezer With Ice Maker● Walk-In ClosetsProperty Description: Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.Property Amenities: ● Business Center● On-Site Leasing Office● Pet-Friendly● Private Garages In Select Units● 24-Hour Emergency Maintenance● Coffee Bar Clubhouse Kitchen● Resident Referral Bonuses Website: https:\/\/www.apartmentsincoatesvillepa.com\/Call us today!  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMPet Ownership Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Proudly managed by Paradise Management, LLCEQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":10.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T10:39:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-567ft2-spacious-bedroom\/7603456196.html","post_id":7603456196,"title":"567ft2 - Spacious 2 Bedroom 1 Bath Apartment for rent!!!!first month f","description":"Awesome2 Bedroom 1 Bath Apartment for rent. Centrally located in Philadelphia (PA) with total privacy and spacious 1.4 acreage. Former short term rental appointed with high end linens and details. Fully equipped kitchen. Hardwood floors, in-unit laundry, granite counters, kitchen pantry, contemporary tile flooring in bathrooms, separate heat\/air in bedroom and living areas, sprinkler system, extra tenant storage space in building, LED lighting, large windows and large closets are just some of the great amenities this property has to offer! Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. $600 damage deposit required and returned at the end of rental if no damage incurred. Two bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed. Wood-burning fireplace, patio\/deck with propane Weber BBQ, massage chair, cable TV with ROKU and Bluetooth sound bar. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing mach\nine), high speed internet and property mainteance. See photos. $600 damage deposit required and returned at the end of rental if no damage incurred. Absolutely no smoking indoors. References will be requested. Text number\/\/\n** Reply with contact number is highly recommended **\n","num_images":5.0,"lat":39.953625,"lng":-75.208122,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T10:18:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-this-is-the-place-youve\/7603461483.html","post_id":7603461483,"title":"This is the place you've been looking for! 2 BD \/ 2 BA!","description":"Millview Apartments - A place to call home! Bed: 2 \/ Bath: 2  Sq. Footage: 1088 sq ft Rent: $1705 - $2285\/MonthTerms: Variable show contact info\nComplete with a resort style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Our Apartment Homes Feature:   − Built-In Microwave− Central Heat & Air Conditioning− Disability Access In Select Units− Dishwasher− Full-Size Washer & Dryer In Every Apartment− Mini Blinds On All Windows− Refrigerator\/Freezer With Ice Maker− Walk-In Closets Our Residents Enjoy:  − Business Center− On-Site Leasing Office− Pet-Friendly− Private Garages In Select Units− 24-Hour Emergency Maintenance− Coffee Bar Clubhouse Kitchen− Resident Referral BonusesContact Info: show contact info\n100 Cobblestone Dr Coatesville, PA 19320 Website: https:\/\/www.apartmentsincoatesvillepa.com\/Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":10.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T10:37:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-two-bedroom-bath\/7603445386.html","post_id":7603445386,"title":"BeauTiful TWO bedroom 1 bath apT!!5929 Greene St,**BBQ**","description":"Beautiful 2 bedroom 1 bath apartment!!! Centrally located in Philadelphia, PA. Former short term rentals have been appointed with high end linens and details. Large living room and kitchen, washer and dryer in unit and lots of storage space! Reserved off-street parking. One bedroom has a queen bed and the other bedroom has twin bunkbeds and a sectional\/queen bed. Wood-burning fireplace, patio\/deck with propane Weber BBQ, massage chairs, cable TV with ROKU and Bluetooth sound bar. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. Do not smoke indoors at all.","num_images":4.0,"lat":40.0358,"lng":-75.179235,"attrs":"['2BR \/ 1Ba', '1200ft2', 'air conditioning', 'application fee details: $20 PER APPLICANT 18+', 'broker fee details: $15 Lease Admin Fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'listed by: Smart Choice Realty', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T09:38:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-philadelphia-pa-2bed-1bath\/7603446257.html","post_id":7603446257,"title":"|| Philadelphia, PA || 2bed\/1bath apartment for rent","description":"2bed\/1bath apartment for rent. Apartment has a full kitchen. Laundry room in building. Heat and hot water included. hardwood floors, free WiFi. $785 per month.\nCall 0r text F0r Apply Or view At : (631) 706-88 98\nPlease contact us for additional information and to schedule a viewing via text your Email address!\n","num_images":8.0,"lat":39.970678,"lng":-75.16343,"attrs":"['2BR \/ 1Ba', 'application fee details: $9', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T09:42:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bustleton-ave-newly\/7603444460.html","post_id":7603444460,"title":"11711 Bustleton Ave @!# Newly renovated two bedroom aPt @--@$866\/M*","description":"Newly renovated two bedroom apartment located on 11711 Bustleton Ave, Philadelphia, PA. One large bedroom and one small bedroom. Full size eat in kitchen and washer\/dryer room with washer and dryer included. Full bath.\nNatural gas for heating and hot water. Walking distance to Leo Mall. $866\/month with no utilities included.\n","num_images":3.0,"lat":40.119005,"lng":-75.017948,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'application fee details: $20 PER APPLICANT 18+', 'broker fee details: $15 Lease Admin Fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Smart Choice Realty', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T09:35:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-very-perfect-location-2bra\/7603425093.html","post_id":7603425093,"title":"Very Perfect Location-2BR*A Brand new Kitchen $900\/Month","description":"Very perfect location living 2bedroom with 1 bathroom (tiled) in West Philadelphia. This apartment has a brand new kitchen renovation and efficient heating unit. A well thought out, nice feeling space with New Hardwood Floors, Natural Light, Open Kitchen Design. Larger bedrooms with plenty of closet space. Nice yard & functional basement. Dishwasher, Central Air, Washer & Dryer.\nAppliances:\n- Dishwasher\n- Freezer\n- Microwave oven\n- Range\n- Refrigerator\n- SS appliance.\n*Property is overall well maintained\n","num_images":5.0,"lat":40.003672,"lng":-75.156329,"attrs":"['2BR \/ 1Ba', '600ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T07:37:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-bed-2bath-luxury-living\/7603439722.html","post_id":7603439722,"title":"2 bed\/2bath - Luxury Living","description":"Apt. 1401 — Trafalgar floor plan — 1,452 sq. ft. — $3,945\nThis large 4th floor corner apartment has so much to offer! This apartment home includes LVT flooring throughout the spacious living area, central heat and air, a spacious laundry room, stainless steel appliances, a large private balcony, and ample storage space. The master bedroom is equipped with a spacious walk-in closet and generously-sized bathroom with double vanity sinks. The guest bedroom and bathroom are spacious, as well! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T09:13:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/media-media-bed-bath-1st-flr-available\/7603434502.html","post_id":7603434502,"title":"Media - 2 bed\/1 bath - 1st Flr - Available Now","description":"MEDIA - 2 BED\/1 BATH - Walking distance to downtown Media, Great location. Move in Ready Now. Available 4\/1Call Chris @  show contact info\nfor showingNewly remodeled in Media with hardwood floors and updated kitchen. Walking distance to trains to downtown Philadelphia, shopping, etc.Available Immediately!*RENTAL REQUIREMENTS* - MONTHLY NET INCOME: $3,900 Rates:$1499 per month. Tenant responsible for all utilities. Experience Everyone's Hometown of Media, PA:  A charming walk able town with shops, diverse restaurants and nearby parks.  Whether business in the County seat brings you to Media or visiting the Philadelphia area for pleasure, experience small town living with convenient public transportation to Philadelphia.Highlights of the Property Include:1. Washer and dryer available2. Tenant is responsible for all utilities. 3. Walking distance to Media SEPTA Train Station that will take you all the way to downtown Philadelphia, Penn University, Temple University, University City. 4. Near Penn State University Brandy Wine5. Walking distances to Delaware County Courthouse6. Walking distance to the restaurant and local shop, etc7. Near Movie Theater8. Near Riddle Hospital\/Media 9. Walking to distance to downtown Media and close to the post office, bank, Wawa store.Off street parking! Walk to train station or walk into town and enjoy the many fine restaurants. North on Route One, turn right at Hill's Seafood, go to stop sign. Property located across from stop sign.No Smoking or Indoor Candles!Call Chris @  show contact info\nfor showing\n2 bed\/1 bath. $1350 rent, 2+ Year lease preferred, longer term tenant\nAmenities:\n- Unfurnished\n- Smoke Free\nAppliances:\n- Air Conditioning\n- Microwave\n- Range\n- Refrigerator\n- Oven\n- Washer & Dryer - Basement\nLeaseLengths:\n- 12 Months lease - Prefer long term tenant\n- 24 Months lease - Prefer long term tenant\nUtilities:\n- Resident Pays Electricity\n- Resident Pays Gas\n- Resident Pays Heat\n- Resident Pays Water\n- Resident Pays Trash Pick-up\n- High-Speed Internet Available\nContact M&C at  show contact info\nfor more information\n","num_images":16.0,"lat":39.915968,"lng":-75.394898,"attrs":"['2BR \/ 1Ba', '800ft2', 'available apr 1', '\\nmonday 2023-03-27\\n', '\\ntuesday 2023-03-28\\n', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T08:47:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-apartment\/7603438636.html","post_id":7603438636,"title":"Large 1 Bedroom Apartment","description":"Nice one bedroom apartment. 600 sqft. Hardwood floors throughout. Spacious bedroom. Modern kitchen with stainless steel appliances. Washer and dryer in the unit.\nConvenient location. 3 blocks to Tasker-Morris subway stop. Short walk to Passyunk Walk, South Philadelphia Tap Room, American Sardine, South Street, and Rittenhouse Square. Walking distance to Center City\nFirst month, Last month and Security Deposit required.\nCats\/Dogs are ok with a $250 non-refundable fee per pet.\nWe will be running a credit and background check.\nCall or Text to schedule showing.","num_images":24.0,"lat":39.93118,"lng":-75.173778,"attrs":"['1BR \/ 1Ba', '600ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T09:08:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-remodeled-first\/7603435424.html","post_id":7603435424,"title":"Recently remodeled, first floor 2 bed\/1bath apartment in Philadelphia","description":"Recently remodeled, first floor 2 bed\/1bath apartment in Philadelphia . Recently remodeled, first floor 2 bed\/1bath in private landlord-owned 3-unit building in the quite neighborhood. Brand new hardwood flooring and new ceramic tile. Large living room and dining room. Heat and cooking gas included in rent. Well-maintained building with quiet neighbors. Tenant pays electricity. Shown with working appliances but Landlord not responsible for maintenance on appliances. Tenant can bring their own appliances. Plenty of street parking. Kitchen, living room and dining area with sliding glass doors leading to patio area. Lower unit, lots of closets, non-smoker. Central air, W\/D, Pool & Club house, parking. Former short term rental appointed with high end linens and details. Fully equipped kitchen. One bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. no damage deposit required and returned at the end of rental if no damage incurred. if you are really interested our property please send me your phone number I will contact you as soon as possible. Please Text me:  show contact info","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T08:52:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-eclectic-apartment\/7603430462.html","post_id":7603430462,"title":"Modern Eclectic Apartment in Heart of The City","description":"Welcome to this modern eclectic luxury apt located in the heart of Philadelphia, minutes away from iconic & historical sites. Surrounded by the most incredible arts, entertainment, nightlife, shopping, and fine-dining the city has to offer, all within walking distance. A perfect stay for traveling nurses and business professionals or anyone coming to experience the city.\nRates are set automatically by market conditions. Please review the listings link for more. This is a short-term or mid-term rental, fully furnished, serviced, newly renovated, and fully stocked.\nYou are only:\n4 min to Rittenhouse Square\n6 min to Love Park\n6 min to the famous Rocky Steps\n6 min to Jefferson Hospital\n10 min to Penn hospital\n15 min to Airport\nThe space\n-55\" Roku TV w\/ free Youtube TV Subscription - Living Room\n-50\" Roku TV w\/ free Youtube TV Subscription\n-Lightening Fast Business WiFI 250mbps download speeds\n-Fully-Stocked Kitchen (Stainless Steel Pots & Pans, Knife Set, Drinking Glasses, Wine Glasses, Coffee Mugs, Silverware, Plateware, Kurig, Blender)\n-Smartlock\n-Honeywell smart heater\n-Stand up mirror in bedroom\n-Keyless Entry\nGuest access\nThe entire unit is yours.\n","num_images":19.0,"lat":39.951263,"lng":-75.167195,"attrs":"['1BR \/ 1Ba', 'available mar 28', 'air conditioning', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: daily', 'wheelchair accessible']","posted_date":"2023-03-26T08:20:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/abington-apartment\/7603434929.html","post_id":7603434929,"title":"Apartment","description":"Apartment  two bedrooms, two full bathrooms, laundry , central air , off street parking $1900.00 per month + utilities\nno smoking , no pets    show contact info","num_images":0.0,"lat":40.1238,"lng":-75.1148,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T08:50:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-amenities\/7603421018.html","post_id":7603421018,"title":"**GREAT AMENITIES**","description":"Welcome to this beautiful three-bedroom single rancher in the desirable East Torresdale section of Philadelphia! This home has been well- maintained and upgraded from top to bottom! When walking into this stunning home you are greeted by an open floor plan with nice, vaulted ceilings. The kitchen is completely upgraded and includes all stainless-steel appliances as well as granite counter tops! The main floor consists of one full bath and three generous sized bedrooms with new hardwood floors throughout! The fully re-finished basement is a must-see and perfect for entertainment! Washer\/Dryer located in the basement as well as a full bath with a stand-up shower! The backyard is one of the highlights of the home showcasing a beautiful lawn and plenty of fenced in space for entertaining! Also there is a detached two car garage along with a very generous front driveaway! Minutes away from I-95! This home is packed with upgrades and a rare find! Do not miss out on this beautiful and unique property !! Will not last long !","num_images":11.0,"lat":40.051299,"lng":-74.997715,"attrs":"['3BR \/ 2Ba', '1717ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T06:52:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-renovated-600-sf\/7603418758.html","post_id":7603418758,"title":"RECENTLY RENOVATED (600\/-SF 1)-BED 1)-BATH UNIT IN [P*A]","description":"Recently renovated 1 bed 1 bath unit in the heart of  Philadelphia, PA! This completely renovated unit boasts new flooring, freshly coated paint, new stainless steel appliances, new kitchen cabinetry and countertops. Off street parking is provided right next to this unit, complimented by your own private entrance! Don't miss out on this unit at an affordable price! ►Please send me a personal phone number. I will contact you!!","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'application fee details: $10 PER APPLICANT 18+', 'broker fee details: $05 Lease Admin Fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Peggy W. Kimbrough', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T06:22:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-ultra-clean-condition-1br\/7603421554.html","post_id":7603421554,"title":"Ultra Clean Condition! 1BR 655Sqft cheap cost ($1000\/month)","description":"Ultra Clean Condition! 1bedroom, 1 bathroom with round balcony attached living room apartment in very cheap cost ($1000\/month). Unit 7 offers solid birch hardwood floors, its own washer\/dryer, Bluetooth surround sound, and abundant natural light. Entertain friends in your spacious gourmet kitchen with its gleaming stainless steel appliances, granite counter tops, and rustic hickory cabinetry. A spiral staircase leads from the main level to a lofted mezzanine overlooking the living space.\n* Off-street parking!\n* A small pets allowed.\n* No smoking\nShort or long term lease available!\n","num_images":6.0,"lat":39.947721,"lng":-75.211495,"attrs":"['1BR \/ 1Ba', '655ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T06:59:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-in-philadelphia\/7603416437.html","post_id":7603416437,"title":"3 bedroom in philadelphia  $1325","description":"3 bedroom apartment in philadelphia. Washer\/dryer hookups and off street parking. Utilities are not included.","num_images":4.0,"lat":39.9925,"lng":-75.1415,"attrs":"['3BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T05:40:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-fully\/7603413767.html","post_id":7603413767,"title":"Newly renovated, fully furnished townhome","description":"Newly renovated, fully furnished townhome just north of the bustling Francisville neighborhood.\nThe first floor has an open-concept living space with new oak flooring, new high-performance windows, and new recessed lighting throughout. The kitchen has 42 inch soft-close cabinets, quartz counter tops, and stainless steel appliances. You also will find a powder room located on the 1st floor. The door from the kitchen leads to a private fenced back yard patio and parking spot.\nUpstairs, each spacious bedroom is complete with its own master bathroom. The washer and dryer are conveniently placed in the upstairs hallway closet. The finished basement with high ceilings is ideal for entertaining and exercise.\nA few short blocks away from Broad Street SEPTA Line, Fairmount Avenue, Art Museum District, Brewerytown, and Center City. Contact owner for details on current home furnishings. Short term lease is possible.\nWhen answering my ad, please include your phone number.","num_images":7.0,"lat":39.980514,"lng":-75.174179,"attrs":"['2BR \/ 2.5Ba', '1530ft2', 'available mar 28', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T04:45:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7603407891.html","post_id":7603407891,"title":"Spacious 2 Bedroom 1 Bath Apartment for rent!!!!first month free!!!!","description":"Awesome2 Bedroom 1 Bath Apartment for rent. Centrally located in Philadelphia (PA) with total privacy and spacious 1.4 acreage. Former short term rental appointed with high end linens and details. Fully equipped kitchen. Hardwood floors, in-unit laundry, granite counters, kitchen pantry, contemporary tile flooring in bathrooms, separate heat\/air in bedroom and living areas, sprinkler system, extra tenant storage space in building, LED lighting, large windows and large closets are just some of the great amenities this property has to offer! Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. $600 damage deposit required and returned at the end of rental if no damage incurred. Two bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed. Wood-burning fireplace, patio\/deck with propane Weber BBQ, massage chair, cable TV with ROKU and Bluetooth sound bar. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. $600 damage deposit required and returned at the end of rental if no damage incurred. Absolutely no smoking indoors. References will be requested. Text number\/\/","num_images":7.0,"lat":40.054525,"lng":-75.070124,"attrs":"['1BR \/ 1Ba', '567ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T02:46:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-remodeled-bedroom\/7603400802.html","post_id":7603400802,"title":"LOVELY REMODELED 2 BEDROOM APARTMENT! GREAT SPACE!","description":"COMPLETELY REMODELED 2 BEDROOM APARTMENT!\nGREAT SPACE!\n*Available for an immediate move in!\n*Rent is $1100 per month. Electricity and water are not included.\n*Cherry floors.\n*Stainless steel appliances, marble counter-tops.\n*Central air system.\n*Beautifully tiled bathrooms.\n*Laundry in building.\n*Internet and cable-ready.\n*Near University City UPENN and Drexel\n*Easy access to public transportation (bus 21, Market-Frankford Subway Line).\n*Cats OK, Small dogs OK with approval\nCall us at +(185) 5 7 1 7 2 3 4 3\nUNIT AMENITIES\nHeat - electric, Laundry room \/ hookups, Refrigerator, Stove and oven\n","num_images":9.0,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T01:10:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-awesome2-bedroom-bath\/7603402061.html","post_id":7603402061,"title":"Awesome2 Bedroom 1 Bath Apartment for rent.","description":"Awesome2 Bedroom 1 Bath Apartment for rent. Centrally located in Philadelphia (PA) with total privacy and spacious 1.4 acreage. Former short term rental appointed with high end linens and details. Fully equipped kitchen. Hardwood floors, in-unit laundry, granite counters, kitchen pantry, contemporary tile flooring in bathrooms, separate heat\/air in bedroom and living areas, sprinkler system, extra tenant storage space in building, LED lighting, large windows and large closets are just some of the great amenities this property has to offer! Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. $600 damage deposit required and returned at the end of rental if no damage incurred. Two bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed. Wood-burning fireplace, patio\/deck with propane Weber BBQ, massage chair, cable TV with ROKU and Bluetooth sound bar. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. $600 damage deposit required and returned at the end of rental if no damage incurred. Absolutely no smoking indoors. References will be requested. Text number\/\/","num_images":4.0,"lat":39.9227,"lng":-75.1812,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T01:25:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-condo-in\/7603383934.html","post_id":7603383934,"title":"Beautiful  Condo in Francisville 3 bed 2.5 bath new construction","description":"Coming in April, 2nd Unit Condo in Francisville. Beautiful 3 bedroom, 2.5 bath new construction in 2018 condo located in growing Francisville. The light-filled corner unit features high-end finishes throughout. High-end finishes throughout, this upper unit opens into a welcoming living room with half bath. The main living level has a gourmet kitchen with stainless steel appliances, an island great for gathering and an area for dining and relaxing. The first bedroom features a closet with built-ins and full bathroom accessible in hallway. The upper floor features two large bedrooms, a bathroom with glass shower and a laundry room. Laundry room convenient to bedrooms features washer and dryer. This gorgeous home enjoys a large, private roof deck with skyline views. Scores in the 80's for walking, biking and easy access to various modes of transportation. Within 15 minutes to Philadelphia International Airport. Across the street from a café and withing walking distances from other restaurants, museums, other points of interest. Utilities: Gas and Electric, are tenant responsibility. Water will be kept in owners name and invoiced to tenant. Renter's insurance required. Central Air and Washer & Dryer in unit. On-Street Parking. No smoking. No Pets.","num_images":24.0,"lat":39.970051,"lng":-75.163101,"attrs":"['3BR \/ 3Ba', '2000ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T22:54:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-like-heaven-what-you\/7603376490.html","post_id":7603376490,"title":"Just Like Heaven what you have be looking for","description":"Comfortable one bedroom apartment in South Philadelphia. Our apartment is located near Board Street, with brand new renovations and includes cold water in the rent for only.\nNestled along the banks of the Delaware River near the Pennsylvania-New Jersey state line, the historic city of Philadelphia played a major role in the fight for independence, even serving as the nation’s capital for a brief period. Today, Philly’s rich history blends seamlessly with its modern, progressive spirit, forming a one-of-a-kind urban experience. As one of the nation’s largest cities, you’ll discover a variety of bustling businesses, such as the Philadelphia Stock Exchange, the country’s oldest stock exchange.","num_images":4.0,"lat":39.926711,"lng":-75.170917,"attrs":"['1BR \/ 1Ba', '500ft2', 'available now', '\\nsaturday 2023-03-25\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-03-25T22:10:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-fourth-floor-1br-1ba\/7603638920.html","post_id":7603638920,"title":"Large Fourth Floor 1BR\/1BA in Walkup for June\/July! 125 S 21st Street","description":"Available June\/July 1st!\nCall or text Annie at  show contact info\nwith any questions or to set up a showing!\nCredit must be in good standing. FICO score and credit history will be reviewed. Monthly income must exceed 3x the rent. No evictions or serious crimes. We only require the security deposit and first month's rent to move in (no last month's rent upfront!) In the event you don't meet the credit or income requirements, cosigners can be considered.\nAddress: 125 S 21st Street #4R\nThis property is professionally managed by AMC Delancey Group.\nAll of our buildings have the option to come furnished at an additional monthly rate.\nThis 1BR\/1BA is located on the 4th floor of a walkup. Features include hardwood floors, lofted nook, bright natural light, and a great layout. Mobile payment laundry is located on the second floor of the building.\nLocated above Alchemy Coffee, this apartment puts you in the center of it all. Enjoy easy access to some of Philadelphia's best establishments, including Trader Joe's, JJ's Thai Cuisine, Rosy's Taco Bar, Butcher Bar, and Solidcore. With its proximity to Penn, Drexel, and University City, this location is also perfect for students and professionals alike.\nWe are pet friendly! No breed or weight restrictions - just a one-time fee of $250\/pet. Water is included in the rent. Only security deposit and first month's rent needed to move in! Credit requirements apply.\nContact Annie to schedule a showing!\nAnnie Oliver\nAMC Delancey\nshow contact info\n- text me!\n","num_images":12.0,"lat":39.951155,"lng":-75.175649,"attrs":"['1BR \/ 1Ba', 'available jun 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-03-26T18:52:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-with-finished\/7603638899.html","post_id":7603638899,"title":"3 Bedroom with Finished Basement and Roof Deck in Fishtown","description":"Take a look at this beautifully renovated 3 bedroom, 2.5 bathroom with finished basement in Fishtown. A renovation done right from top to bottom! Property features include 3 large bedrooms with deep closets, new hardwood floors, kitchen tile backsplash, and beautiful granite countertops.\nThe kitchen also features energy efficient stainless steel appliances, and an abundance of cabinet space. The finished basement offers additional living space and lots of extra storage and washer\/dryer. This home has all new mechanicals and HVAC with all Low-e windows throughout.\nThe spacious deck off of the 3rd floor master bedroom is made of Trex and is perfect for entertaining. Located near all of Fishtown's hot spots on Frankford!\nListing is provided by Keller Williams Philly\n","num_images":16.0,"lat":39.979704,"lng":-75.12189,"attrs":"['3BR \/ 2.5Ba', '1680ft2', 'available may 1', 'air conditioning', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T18:52:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1100-sq-feet-bedrooms\/7603631084.html","post_id":7603631084,"title":"1100 sq feet 2 bedrooms  2 bathroom","description":"Newly Renovated 2 bedroom, 1 bathroom apartment located in Queens Village South Philadelphia is available April 15th.\nThis is a Bi level apartment with 10 feet hi ceilings, brand new Kitchen,  brand new bathroom, new flooring, New Central air and heat .\nThe apartment is close  walking distance to major hospitals in Philadelphia , walking distance to shopping , grocery supermarkets and tons of restaurants on every corner.\nThis apartment is available for month to month or yearly lease.\nThe proximity to 4 major hospitals makes this apartment in the middle of Queens Village,  a perfect location for traveling nurse or medical travel professionals.\nClose to Pennsylvania Hospital\nJefferson Hospital, University of Pennsylvania Hospital and Temple Hospital.\nThis 2 bedroom apartment can be delivered fully furnished or Empty or partially furnished.","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '1100ft2', 'available apr 15', 'air conditioning', 'application fee details: 25 application fee', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T18:26:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studio-apartment-864-22nd\/7603617229.html","post_id":7603617229,"title":"Studio apartment (864 n 22nd st)","description":"Lovely studio apartment located in one of the best neighborhoods in Philadelphia with a newly renovated bathroom with a stand up shower. This apartment is walking distance or has public transportation to Philadelphia's great attractions like Center city, University's, Museum's, Restaurant, Shopping, Whole foods, Fairmount park and Kelly drive that great for biking, running and walking.","num_images":6.0,"lat":39.971,"lng":-75.1737,"attrs":"['0BR \/ 1Ba', '350ft2', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T17:42:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-now-spacious\/7603590932.html","post_id":7603590932,"title":"@!@Available now Spacious, newly renovated 2 bedroom, 1 bath apartment","description":"*Available now* Spacious, newly renovated 2 bedroom, 1 bath apartment located on the 2nd floor of a duplex in West Philadelphia, just a short distance from Walnut Street with plenty of public transportation options, Cobbs Creek Park & Recreation Center, and numerous conveniences like Dunkin', The Fresh Grocer, the West Philadelphia YMCA and more. This home features an updated kitchen with granite countertops, stainless steel appliances, and stylish subway tile backsplash. There are also great amenities such as a separate laundry room, central AC, and wood flooring throughout. The full bath is centrally located and has a tiled shower\/tub and traditional vanity for storing toiletries. *Pets permitted on a case by case basis with owner approval. $250 refundable pet fee required.\nCall Us :  show contact info","num_images":10.0,"lat":39.9612,"lng":-75.2303,"attrs":"['2BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T16:24:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fabulous-two-bedrooms\/7603613029.html","post_id":7603613029,"title":"Fabulous Two Bedrooms! - Dwell 2nd Street","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N American St Suite 101\nPhiladelphia Pa 19122\nBedrooms:2\nBathrooms:2\nSquare Footage:1088-1261 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 2BR floor-plans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.971179,"lng":-75.140092,"attrs":"['2BR \/ 2Ba', '1135ft2', 'available now', '\\nsunday 2023-03-26\\n', '\\nmonday 2023-03-27\\n', '\\ntuesday 2023-03-28\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T17:29:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-now-in\/7603602551.html","post_id":7603602551,"title":"Available now in PHILADELPHIA, PA","description":"Spacious 2 Bed 1 Bath Available now in PHILADELPHIA, PA. Fully equipped kitchen. One bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed. Kitchen, living room and dining area with sliding glass doors leading to patio area. Lower unit, lots of closets, non-smoker. Big living room with lots of southern exposure great natural light. Ample storage in unit. Large eat in kitchen with a gas range. Off street park and onsite laundry. Gas heat and hot water included in rent. No smoking allowed. Second floor unit. Pet negotiable with reference and pet deposit. Please share some info about yourself when applying. There is a standard rental application form. Former short term rental appointed with high end linens and details. Wood-burning fireplace, patio\/deck with propane. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. no damage deposit required and returned at the end of rental if no damage incurred. Absolutely no smoking indoors. References will be requested.","num_images":5.0,"lat":39.9448,"lng":-75.2288,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T16:58:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1938-mutter-st\/7603604650.html","post_id":7603604650,"title":"1938 Mutter St.","description":"Amazing cozy two bedroom house for rent located in the up and coming West Kensington area. The property has central air and comes with washer and dryer. Easy access to transportation. First and last months rent plus security deposit required. NO PETS","num_images":12.0,"lat":39.97954,"lng":-75.135839,"attrs":"['2BR \/ 1Ba', '755ft2', 'available now', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T17:04:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-incredible-amenities\/7603602994.html","post_id":7603602994,"title":"Incredible Amenities, Stylish Features, Lease Today","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nLease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Bocce Ball\n* Sun Deck\n* Putting Green\n* Minutes from Restaurants, Shopping, and Much More\n* Outdoor Grill Area\n* Community Lounge\n* Professionally Managed\n* Yoga Lounge\n* Easy Freeway Access\n* TV Lounge\n* Bark Park\n* Swimming Pool\n* Pet Salon\n* Fitness Studio","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-26T16:59:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-yoga-and-ballet-studio\/7603603494.html","post_id":7603603494,"title":"Yoga and Ballet Studio, Visit Your New Home, Leasing Now","description":"The Point at Glen Mills offers all of the amenities your looking for and some you didn't even know you wanted. Check out our two-story clubhouse-complete with flat screen TVs, a 24-hour fitness center and a pool table. Enjoy our on-site yoga studio or our outdoor putting green. Visit us today!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nApartment Features\n* Wood-Like Floors\n* Extra Storage\n* Granite Countertops\n* Full sized Washer and Dryer in unit\n* Private Patio or Private Balcony (on select apartments)\n[#9631596]","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-26T17:01:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-call-for-details-clubhouse\/7603603271.html","post_id":7603603271,"title":"Call for Details, Clubhouse with Game Room, Visit Your New Home","description":"Prepare to fall in love with The Point at Glen Mills! Kick back in our community lounge. Watch your furry friend frolic with his furry friends in our dog park. Challenge your friends to a game of golf on our outdoor putting green. Life is good at The Point at Glen Mills. Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-26T17:00:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-salt-water-pool-with\/7603602717.html","post_id":7603602717,"title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"You will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nCommunity Features\n* Bark Park\n* Yoga Lounge\n* Community Lounge\n* Professionally Managed\n* Outdoor Grill Area\n* Putting Green\n* Sun Deck\n* TV Lounge\n* Easy Freeway Access\n* Swimming Pool\n* Bocce Ball\n* Minutes from Restaurants, Shopping, and Much More\n* Fitness Studio\n* Pet Salon","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-26T16:58:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-laundry-in-unit-lease\/7603602527.html","post_id":7603602527,"title":"Laundry in Unit, Lease Today, Convenient Location","description":"Looking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-26T16:58:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-aspect-that-is\/7603571426.html","post_id":7603571426,"title":"Spacious aspect that is accentuated by interior beams","description":"This cozy house has a spacious aspect that is accentuated by interior beams soaring over an open living\/dining room. A Simple but efficient kitchen and closet complete the first floor. Large sliding glass doors lead to the deck with awning overlooking the private back yard and offering a glimpse of Lake Saint Catherine. Upstairs, skylights illuminate the bedroom and a bath with shower stall.","num_images":5.0,"lat":39.9783,"lng":-75.24609,"attrs":"['1BR \/ 1Ba', '655ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T15:32:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-very-nice-split-bedroom\/7603591222.html","post_id":7603591222,"title":"Very Nice Split 2 Bedroom \/ 1 Bath Apartment","description":"Rent is $850\/mo.\n2nd floor apartment above a store.\nVery quiet, perfect if you have a child that wants more privacy.\n2 bedroom 1 bath.\nFreshly rehabbed.\n*Note -- this apartment is made up of 2 sections, divided by a stairwell. Kitchen, living room and bedroom on one side, bathroom and bedroom on the other. Both sections have keyed entry.*\nPlease email back through Craigslist for more information.","num_images":11.0,"lat":40.018635,"lng":-75.155454,"attrs":"['2BR \/ 1Ba', 'apartment', 'no laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2023-03-26T16:25:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bath-with-den-yard\/7603593186.html","post_id":7603593186,"title":"4 Bedroom \/ 2 Bath with Den & Yard","description":"Available starting June\nLocated on a quiet block yet conveniently close to public transit and all the amenities of University City.\nLarge 4 bedroom 2 bath w\/ den\nNewer building\nBi-level unit\nRear yard outdoor space\nPre-wired cable in each room\nLocated in West Powelton, University City. Close to Drexel University, University of Pennsylvania and University of the Sciences Campus.\nLicensed PA salesperson with ownership interest.\n","num_images":13.0,"lat":39.959721,"lng":-75.205429,"attrs":"['4BR \/ 2Ba', '1700ft2', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T16:30:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-spacious-bedroom-floorplans\/7603593074.html","post_id":7603593074,"title":"Spacious 2 Bedroom floorplans! Come see our great community!","description":"RENTAL INFO Rental Rates: $1749 - $2339\/monthLocation: 100 Cobblestone Dr Coatesville, PA 19320Unit for Rent: 2-BR 2-BA | Square Feet: 1178 sq ft | Lease Length: Variable show contact info\nPROPERTY AMENITIES◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral BonusesAPARTMENT AMENITIES◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In Closets  ADDITIONAL INFODescription: THE BEST APARTMENTS IN COATESVILLE, PA\nIf you're looking for the best apartments in Chester County, look no further than Millview Apartment Homes. Our world-class amenities, including a resort-worthy swimming pool, and clubhouse are better than any in the Coatesville area. Our professional leasing staff is eager to welcome you home to a carefree lifestyle. Please schedule a tour and come home to the best Coatesville, PA apartments.Pet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. Website: https:\/\/www.apartmentsincoatesvillepa.com\/ Millview Apartments: show contact info\nEQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":10.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T16:30:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-pa-first-floor-bed\/7603556650.html","post_id":7603556650,"title":"^_PA_^ First floor 2 bed\/1bath.=Lovely.! RT$705.00!!~FT950!!","description":"Lovely 1 Bedroom 1 Bath Apartment in 1123 PA-73, Philadelphia, PA . first floor 2 bed\/1bath in private landlord-owned 3-unit building in the quite neighborhood. Brand new hardwood flooring and new ceramic tile. Large living room and dining room. Heat and cooking gas included in rent. Well-maintained building with quiet neighbors. Tenant pays electricity. Shown with working appliances but Landlord not responsible for maintenance on appliances. Tenant can bring their own appliances. Plenty of street parking. Kitchen, living room and dining area with sliding glass doors leading to patio area. Lower unit, lots of closets, non-smoker. Central air, W\/D, Pool & Club house, parking. Former short term rental appointed with high end linens and details. Fully equipped kitchen. One bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed.","num_images":3.0,"lat":40.0596,"lng":-75.0818,"attrs":"['1BR \/ 1Ba', '950ft2', \"application fee details: App fee None (per person) & Don't Have Any Processing fee.\", \"broker fee details: 58%free broker's fee\", 'apartment', 'laundry in bldg', 'listed by: !!!Stacy R. Minder!!!', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T14:53:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nov-2022cats-small-dogs\/7603556615.html","post_id":7603556615,"title":"1 Nov 2022.**Cats, Small Dogs, Large Dogs Allowed**","description":"Large New 1 bedroom \/1 bathroom apartment in  Philadelphia, PA . Beautiful kitchen and plenty of storage. 2-car garage and driveway for parking. Fenced in back yard with mountain views and direct access to bike path. Unfurnished but washer\/dryer stays. No smoking or nonsense. Owner pays water\/garbage. Tenant pay gas\/electric. Looking for somebody to rent starting Tue, 1 Nov 2022.**Cats, Small Dogs, Large Dogs Allowed**","num_images":3.0,"lat":39.942534,"lng":-75.232444,"attrs":"['1BR \/ 1Ba', '980ft2', \"application fee details: App fee None (per person) & Don't Have Any Processing fee.\", \"broker fee details: 58%free broker's fee\", 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'listed by: !!!Stacy R. Minder!!!', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T14:53:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bed-bath\/7603585633.html","post_id":7603585633,"title":"Spacious 2 Bed 1 Bath Available now in Philadelphia","description":"Spacious 2 Bed 1 Bath Available now in Philadelphia. Fully equipped kitchen. One bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed. Kitchen, living room and dining area with sliding glass doors leading to patio area. Lower unit, lots of closets, non-smoker. Big living room with lots of southern exposure great natural light. Ample storage in unit. Large eat in kitchen with a gas range. Off street park and onsite laundry. Gas heat and hot water included in rent. No smoking allowed. Second floor unit. Pet negotiable with reference and pet deposit. Please share some info about yourself when applying. There is a standard rental application form. Former short term rental appointed with high end linens and details. Wood-burning fireplace, patio\/deck with propane. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. no damage deposit required and returned at the end of rental if no damage incurred. Absolutely no smoking indoors. References will be requested. If you are interested Please massage me at:  show contact info","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T16:10:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-two-bedroom-home\/7603589276.html","post_id":7603589276,"title":"Cozy Two bedroom home!!","description":"Cozy 2 bedroom home with front porch and fenced in rear yard. Full basement for additional storage. Convenient location. Schools, shopping, recreation and transportation all within walking distance. (4||1||4) 6||7||8-9||1||5||4}}","num_images":1.0,"lat":40.0118,"lng":-75.1456,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T16:19:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-home-to-this\/7603542989.html","post_id":7603542989,"title":"WELCOME HOME TO THIS GERMANTOWN GEM - 3 BED 2 BATH!!!","description":"Welcome home to this newly rehabbed Germantown Gem. This quiet and peaceful street with doubled sided parking will bring you comfort as you're greeted by your new home. Featuring hardwood flooring throughout with all new cabinetry, stainless steel appliances, breakfast bar, and quartz countertops. The floating staircase compliments this semi open concept for a modern touch. The second floor host two generous size bedrooms, optimal closet space and full bathroom. You'll find the basement to be fully finished with a powder room there as well. Rear deck and tons for yard space for entertaining. Quick access to route 76, Public transit, schools and shops within walking distance.","num_images":21.0,"lat":40.049107,"lng":-75.17364,"attrs":"['3BR \/ 2Ba', '960ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T14:18:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/north-wales-stunning-bedroom-bath\/7603582229.html","post_id":7603582229,"title":"Stunning 3 Bedroom, 1 1\/2 Bath Townhouse For Rent!","description":"Beautiful and Sunny end unit townhouse in Gwynedd Pointe community in North Wales, located in the award winning North Penn School District.  These 3 bedrooms 2 bathrooms house featuring hardwood flooring throughout, 3 attractive new updated bathrooms. New lighting fixture. Newer window. New water heater, Updated kitchen with breakfast area, gas cooking, wood cabinets and island, granite counter top, provide ample storage complete with dishwasher, stainless steel sink, exhaust fun, garbage disposal. Finished basement features a sliding door to back yard. Excellent location close to major malls and shopping, train station, restaurants and more. Newer HVAC system, Newer Washer & Dryer, Landlord pays HOA fee.","num_images":7.0,"lat":40.2166,"lng":-75.2565,"attrs":"['3BR \/ 2.5Ba', '1936ft2', 'available apr 15', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T16:02:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-blending-relaxation\/7603579964.html","post_id":7603579964,"title":"Blending Relaxation & Sophistication to Create the Ideal Place!","description":"Apt. 1507 — Edgeware floor plan — 919 sq. ft. — $4,494\nLocated on the 5th floor, this fully-furnished 1-bedroom corporate has a great view from a private balcony! This apartment boats LVT flooring, central heat & air, a front-load washer & dryer, and upgraded stainless steel appliances. This apartment also comes equipped with a spacious living area and bathroom. This gorgeous apartment is within close proximity to our clubhouse—featuring a 24-hour fitness center, theatre, resort-style swimming pool, and so much more! Available for short-term lease at a 3-month minimum with utilities included!\nContact our leasing office to schedule a tour!  show contact info","num_images":16.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '919ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T15:56:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fabulous-one-bedrooms\/7603575941.html","post_id":7603575941,"title":"Fabulous One Bedrooms! - Dwell 2nd Street","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:760-800 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '767ft2', 'available now', '\\nsunday 2023-03-26\\n', '\\nmonday 2023-03-27\\n', '\\ntuesday 2023-03-28\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T15:45:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this-lovely\/7603542954.html","post_id":7603542954,"title":"WELCOME TO THIS LOVELY HOME - 3 BED 2 BATH!!!","description":"Welcome Home! This lovely home is located on a peacefully quiet block in the highly desired Pine Valley section of Northeast Philadelphia. Upon your arrival the stunning curb appeal of this home is sure to catch your eye! Continue inside where you are greeted by gorgeous bamboo hardwood flooring on the first floor. Enjoy the oversized living room perfect for a relaxing evening at home. The living room flows into the dining room area. Conveniently located just off of the dining room you will find the half bath. In the rear of the home you will find the enormous eat-in kitchen that was recently renovated in 2016. The second floor offers three generous sized bedrooms and the full bath that was recently updated in 2016. Continue downstairs where you will find the finished basement perfect for movie night! The basement area also offers immense room for all of your storage needs, including a full cedar closet! In the backyard you will get to enjoy the covered patio complete with a fan to enjoy those summer nights. The spacious rear yard provides plenty of room for entertaining! Between the large driveway, garage and shed, parking and storage should never be a concern.","num_images":15.0,"lat":40.092304,"lng":-75.059387,"attrs":"['3BR \/ 2Ba', '1498ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T14:18:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-row-home-close-to-hup-chop\/7603568236.html","post_id":7603568236,"title":"Row home close to HUP \/ CHOP \/ UPenn","description":"Available for rent by owner starting early June, 2-story 3 bed\/2 bath renovated row home located in the desirable Grays Ferry neighborhood. We have absolutely loved living here for the past years especially given the short commute to work in University city. Single families\/young professionals would find this house ideal - within walking distance to University of Pennsylvania, HUP, Children's hospital (CHOP).\nPlease email us for more information and describe your interest in the house and something about yourself, otherwise emails will be filtered out.\nHighlights:\n-------------\n* Pet friendly (dogs, cats) + grass area across the street to take your dog\n* Grocery store right across the street (The Fresh Grocer)\n* Bus stop at the corner (line 49 takes you to Penn, line 12 goes into center city).\n* Ample street parking\n* Ramp to 76 located around the corner\n* In unit laundry (washer + dryer), dishwasher, central A\/C & heat\n* Outdoor patio space to grow veggies, BBQ, entertain, etc\n* Close to Grays Ferry Crescent Trail Park","num_images":9.0,"lat":39.939917,"lng":-75.194917,"attrs":"['3BR \/ 2Ba', '1200ft2', 'available jun 5', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T15:24:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-listingsunny-1st-flr\/7603541046.html","post_id":7603541046,"title":"NEW LISTING:Sunny 1st flr apt 2bd 1bth h\/w floor Art Museum Avail Nov1","description":"It's still available for rent! sent me your phone number will contact you as soon as possible.Living room-hardwood floors throughout , high ceilings and ceiling fan.\nKitchen- wood cabinets, oven, microwave oven, tiled porcelain floor, high ceiling, modern light fixture.\nTiled bathroom- sit down bath with shower head,\nLong wide hall(can be used for small work station)?\nLeads to two bedrooms each with closets and overhead storage,\nnew solid wood floors, ceiling fans\nLaundry facilities available in the building.\nLocated in the one of the most beautiful blocks in the area.\nArt Museum area, Fairmount, close to Center City\nExcellent location!!!!\nProfessional and friendly neighbors.\nSafe neighborhood.\nAmple on street parking.","num_images":5.0,"lat":39.9223,"lng":-75.2338,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T14:13:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-in-time-to-welcome-in\/7603542927.html","post_id":7603542927,"title":"JUST IN TIME TO WELCOME IN SPRING- 3 BED 2 BATH!!!","description":"Just in time to welcome in Spring. We proudly present this wonderfully renovated home with generous open floor plan. Come and enjoy the new flooring, recessed lighting, brand new kitchen with rear deck along with a finished basement with full bathroom. The upper level hosts three spacious bedrooms and beautiful new bathroom with spa tub. Let me not forget there's also split AC .There's nothing left to do but come and check it out for yourself.","num_images":21.0,"lat":40.044863,"lng":-75.147102,"attrs":"['3BR \/ 2Ba', '1424ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T14:18:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-the-porter-apartments\/7603563034.html","post_id":7603563034,"title":"The  Porter Apartments","description":"Beautiful 2 bedroom, 2 bathroom apartment located in the Brewerytown area of Philadelphia. Indoor fitness center just steps away from the front door, common lounge space area and rooftop deck great for social events and quiet evenings for peace. Fully furnished apartment available for short-term leasing agreements and month to month agreements.","num_images":6.0,"lat":39.97646,"lng":-75.184231,"attrs":"['2BR \/ 2Ba', 'available apr 17', 'EV charging', 'air conditioning', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: daily']","posted_date":"2023-03-26T15:10:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apartment-available-now\/7603561594.html","post_id":7603561594,"title":"Apartment Available now for rent. in 1719 Green St, APT!!","description":"Spacious new 2 Bedroom 1 Bath Apartment Available now for rent. in 1719 Green St, APT 1, Philadelphia, PA, Kitchen, living room and dining area with sliding glass doors leading to patio area. Lower unit, lots of closets, non-smoker. Central air, W\/D, Pool & Club house, parking. Former short term rental appointed with high end linens and details. Fully equipped kitchen. Two bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed. Wood-burning fireplace, patio\/deck with propane Weber BBQ, massage chair, cable TV with ROKU and Bluetooth sound bar. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. $100 damage deposit required and returned at the end of rental if no damage incurred. Absolutely no smoking indoors. References will be requested. Text me:(619) 35 33 622","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T15:06:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ardmore-off-street-parkingamazing-bed\/7603550004.html","post_id":7603550004,"title":"OFF-STREET PARKING!!AMAZING  1 BED\/1 BATH APART  FOR RENT!!","description":"1 BEDROOM APARTMENT AVAILABLE - 750 SF - WASHER AND DRYER IN UNIT - GRANITE COUNTER TOPS - STAINLESS STEEL APPLIANCES.\nQUIET BUILDING IN THE HEART OF THE MAIN LINE. WALKING DISTANCE TO THE PAOLI\/THORNDALE REGIONAL RAIL LINE. ONE MONTH SECURITY DEPOSIT IS REQUIRED. PETS ALLOWED (UNDER 60LBS)\nBASEMENT STORAGE UNIT INCLUDED. ROOM FOR BIKES ETC.\nGREAT LOCATION ON A RESIDENTIAL STREET.\nOFF-STREET PARKING. 1 PARKING SPOT.\n","num_images":5.0,"lat":40.016403,"lng":-75.302954,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T14:36:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fabulous-studios-dwell-2nd\/7603551226.html","post_id":7603551226,"title":"Fabulous Studios! - Dwell 2nd Street","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.978,"lng":-75.1459,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', '\\nsunday 2023-03-26\\n', '\\nmonday 2023-03-27\\n', '\\ntuesday 2023-03-28\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T14:39:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-unparalleled-views\/7603549914.html","post_id":7603549914,"title":"Unparalleled Views. Exceptional Style. Nonstop Luxury","description":"Current Craigslist Availability\nApt. 2410 — Oxford floor plan — 1,203 sq. ft. — $3,460\nThis 4th floor 2-bedroom\/2-bathroom apartment home has much to offer! It comes upgraded with hardwood LVT flooring, central heat and air, upgraded stainless steel appliances, and a lovely tile backsplash! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive living area is perfect for hosting! This gorgeous apartment has a beautiful view of the Philadelphia skyline. It is also within close proximity to our Clubhouse — featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T14:35:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-furnished-bed\/7603528645.html","post_id":7603528645,"title":"Charming FURNISHED 1 Bed\/1 Bath Townhouse, water included in rent!","description":"Fully furnished, move-in ready! Water & furniture included in rent.\nAre you looking for a move-in ready rental in Philly with a friendly and responsive landlord?\nYou're in luck! My one-of-a-kind, FURNISHED 1 bedroom\/1 bath home in South Philly is available for rent starting May 15. The property is a tri-level 950 sq ft townhouse in Pennsport. I love that it was originally built in the 1880s and has a ton of character.\nThe house is in a great location with:\n- a walk score of 92\n- 2 blocks from bus lines\n- 3 parks nearby\n- easy street parking\n- close to restaurants\/Head House Square\n- 10 min walk to Target!\nAmenities include:\n- central heat + AC\n- washer + dryer\n- deck\n- finished basement\n- new windows, blinds, and kitchen appliances (including dishwasher)\nMy two favorite things about the house are the deck on the second floor and the mosaic on the side of the house that was personally designed and installed in 2016 by well-known Magic Gardens artist, Isaiah Zagar. This place is super unique!\nThe house is fully furnished (plus artwork if desired) and all items were purchased for my personal use so it's nice stuff (read: not IKEA)!\nAdditional perks:\n- water is included (so no separate water bill)\n- no gas bill\n- WiFi is already set up so you can get online as soon as you move in!\nIf you think you might want to snag this awesome place starting in May, please send me a message. I'm happy to answer any questions and provide additional details. I look forward to hearing from you!\n(sorry, no pets)","num_images":7.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', 'available may 15', 'air conditioning', 'furnished', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T13:41:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-june-10th\/7603535065.html","post_id":7603535065,"title":"🪴One Bedroom 🪴 June 10th 🪴","description":"Life By Design. The Preston At Falls Center We Designed A Lifestyle That Is Unparalleled In Apartment Living. Our Exclusive Amenity Package Offers A Living Experience That Is Focused On Wellness And Convenience. Wake Up Each Morning To A Cup Of Gourmet Coffee In Our Onsite Café. Enjoy A True Live-Work Environment By Staying Connected With Free Wifi In Our Club Room. Relax And Rejuvenate By Taking A Complimentary Yoga Class In Our Yoga Studio. End Your Day With Specialty Pizza In Our On-Site Restaurant. Afterwards We Invite You To Relax By One Of Our Fire Pits In The Main Courtyard Or To Enjoy A Movie In Our On-Site Theatre Room.\nCentral Heat & Air Conditioning\nIn Unit Washer \/ Dryer In Select Units\nOpen Concept Kitchens With Designer Appliance Package & Custom Quartz Counter Tops\nOver Sized Windows Offer Breathtaking Views From The Highest Point In East Falls\nSpa Inspired Bathrooms With Soaking Tubs Or Invigorating Showers\nStylish Loft Aesthetic With Historic Accents\nWalk In Closets\nWide Plank Floors Throughout Each Apartment Home\n","num_images":6.0,"lat":40.014,"lng":-75.187,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T13:58:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-stainless-steel-appliances\/7603546765.html","post_id":7603546765,"title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Kitchen Island\n* Private Patio or Private Balcony (on select apartments)\n* Stainless Steel Appliances\n* Walk-in Closet\n* Linen Closet\n* Washer and Dryer in unit\n* Garden Tub\nCommunity Features\n* Fitness Studio\n* Pet Salon\n* Bark Park\n* Easy Freeway Access\n* Yoga Lounge\n* Sun Deck\n* Professionally Managed\n* Spa\n* Community Lounge\n* Billiards\n* Minutes from Restaurants, Shopping, and Much More\n* Swimming Pool\n* Outdoor Grill Area\n* TV Lounge","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-26T14:28:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-altoona-rent-to-own-home\/7603534017.html","post_id":7603534017,"title":"🔥Altoona Rent to Own Home Deal🔥","description":"🔥Altoona Rent to Own Home Deal🔥\n1102 17th Ave, Altoona, PA 16601\nPoor Credit\/No Credit Doesn't Matter\nDown-payment & proof of income is your qualification to homeownership\n$5,999 down\n$1099\/ mo for 15yrs\nCall\/text Mike at  show contact info\nfor more info, pics, or to schedule viewing\n3B\/1B\nSqft: 1,430\nLot Size 3,049\nBuilt: 1900\nHeating: Forced air, Coal\nCity Water\nElectric 60 Amp Fuse\nTaxes: $951\/yr\nGreat fixer upper for an investment property or rental unit.  Spacious but needs some TLC.\nWe cannot confirm the condition of the home, please do your own inspection\nClean title\nTaxes up to date\nLike my FB page to be notified when I get more https:\/\/www.facebook.com\/pasellerfinancehomes & see more here https:\/\/5minvestments.managebuilding.com\/Resident\/public\/home\n","num_images":4.0,"lat":39.9227,"lng":-75.1812,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-26T13:55:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-incredibly-well-kept-3br\/7603517242.html","post_id":7603517242,"title":"INCREDIBLY WELL KEPT 3BR\/2BA SINGLE FAMILY HOME READY TO RENT@@","description":"Incredibly well kept 3BR\/2BA single family home (split floor plan) on nice size lot in a great neighborhood. C\/A on upper main level. New interior and exterior paint, roof, siding and gutters installed 2 years ago. There are 2 large family rooms on the ground level. One could act as a 4th bedroom or home office\/gym. Full bathroom on each level. Oversized attached garage off of largest family room.","num_images":0.0,"lat":40.1267,"lng":-75.5272,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-26T13:12:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-professionally-managed\/7603539895.html","post_id":7603539895,"title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"When you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nApartment Features\n* Central Heat and Air\n* Pantry\n* Walk-in Closet\n* Breakfast Bar\n* Linen Closet\n* Ceiling Fan\n* Garden Tub\n* Roommate Friendly Floor Plan\n* Pre-wired for internet and cable\n* Full sized Washer and Dryer in unit\n* Stainless Steel Appliances\n* Granite Countertops\n* Disposal\n* Private Patio or Private Balcony (on select apartments)\n* High Efficiency Lighting Fixtures\n* Lofty Vaulted Ceilings\n* Window Coverings\n* Refrigerator, Microwave, Dishwasher & Electric Stove","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1075ft2', 'available apr 2', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-26T14:10:24-0400"}]