[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apartment-for-rent-near\/7576425298.html","post_id":7576425298,"result_date":"Mon Jan 09 2023 02:35:22 GMT+0000 ","title":"Apartment for rent near Drexel and Upenn University","description":"No emails please call only for all information about the apartment at  show contact info\n. 2 bedrooms Apartment for rent at 4010 Ludlow Street. (2 bedrooms, 2 bathrooms, and kitchen). Just half a block away from the 40th Street train station' within walking distance to Drexel University, UPenn University, CVS, Acme Supermarkets, and many restaurants!! Tenants pay for electricity and cooking gas. The landlord pays for hot water, cold water, and heat.","num_images":21,"lat":39.956404,"lng":-75.202338,"attrs":"['2BR \/ 2Ba', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T21:31:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedrooms-apartment\/7576419923.html","post_id":7576419923,"result_date":"Mon Jan 09 2023 02:09:48 GMT+0000 ","title":"3 bedrooms apartment","description":"bi-level apartment 2nd &3rd floor","num_images":0,"lat":40.0338,"lng":-75.1731,"attrs":"['3BR \/ 2Ba', 'available jan 15', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T21:05:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-bbq-picnic-area-fitness\/7576397839.html","post_id":7576397839,"result_date":"Mon Jan 09 2023 00:35:11 GMT+0000 ","title":"BBQ\/Picnic Area, Fitness Center, Gas Range","description":"Call Now -  show contact info\nx 96OR Text 96 to  show contact info\nto chat!This is a 1 Bedroom, 1 Bath, Approximately 776 Sq. Ft. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Features: Gas Range, Stone Counters, Tons of Natural Lighting Throughout, Large Closets with Organizing Systems, Custom Subway Tile Backsplashes, Selected, Disposal, Flush Mount Sinks with Goose Neck Faucets, Electronic Thermostat, Premium Stainless Steel Appliance Package, Dishwasher, Hardwood Style Flooring, Cable Ready, Air Conditioner, Patio\/Balcony*, Washer\/Dryer  *In Select Apartment Homes Community Amenities: Playground, Fitness Center, Sundeck, On-Site Maintenance, Off Street Parking, On-Site Management, Smoke-Free Community, BBQ\/Picnic Area, Free Weights, Tennis Court, Garage, Selected, Elevator, Parisian Style Café with Demonstration Kitchen, Multiple, Expansive Outdoor Spaces, Covered Parking, Courtyard, Multiple Co-Working Studios, Rooftop Dog Park Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Want more info on this unit? See the link (below):https:\/\/mack.touraptnow.com\/63h4c6Qa460neOQUkk\n","num_images":13,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '776ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T19:31:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stop-renting\/7576395457.html","post_id":7576395457,"result_date":"Mon Jan 09 2023 00:25:51 GMT+0000 ","title":"STOP RENTING","description":"THIS IS NOT FOR RENT. IT IS FOR RENTERS LOOKING TO PURCHASE THEIR OWN HOME!!\nWhy rent when you can buy. If you can afford to pay your landlords mortgage, then you can afford to buy your own house. It is not hard to become a homeowner and I can help you.\nSerious inquiries only. Reply back to this post with your name, email and phone number if interested.\nYou can also  message or call me Louise at  show contact info\nMust have at least a 630 credit score minimum\nVerifiable employment with consistent income\nLouise Ezoua, Realtor\nHomeSmart Realty Advisors\n2424 E. York Street, Suite 213\nPhiladelphia, PA  19125\nOffice #  show contact info\next. 375\nCell #  show contact info","num_images":3,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T19:21:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-townhome-driveway\/7576386840.html","post_id":7576386840,"result_date":"Mon Jan 09 2023 00:01:30 GMT+0000 ","title":"$2200\/ 3BR townhome w driveway","description":"Welcome to 1916 N. Franklin Street. This 3 BD 1.5 BA twin has so much charm and character with plenty of modern updates. Immediately upon arrival, you will notice the enchanting curb appeal as well as the driveway, which provides 2-car parking! Entering through the spacious, front porch, you are greeted by the large, open main living area, which boasts hardwood flooring throughout and freshly painted walls. Past the main living space, you will enter the kitchen, which features tile flooring and wood cabinets. There is also a sizable storage closet under the stairway. Off the kitchen, is the backroom perfect for a formal dining area or sitting area! This space has gorgeous double patio doors that provide access to a nicely sized patio area, which leads to a great sized privately fenced-in backyard. The first floor also provides the owner with a conveniently located half bath, laundry closet, and large coat closet on the first floor. Upstairs, you'll find the three, sizable, sun drenched bedrooms and the full bath. Each bedroom features carpet and incredibly spacious closets. The full bath features a tub \/ shower combo, vanity, and a nice size linen closet with plenty of storage space. This home is located on a quiet street with friendly neighbors! Close to Temple; perfect for Temple University or Temple Hospital employees! Only a few blocks away from other hot neighborhoods with fine and casual dining, as well as brunch and coffee spots! Located right near the Broad Street Line, very convenient for access to and from Center City! This home is the perfect blank slate and is move-in ready, so pack your bags and move right in! Schedule your showing today!","num_images":6,"lat":39.980616,"lng":-75.14705,"attrs":"['3BR \/ 1.5Ba', 'available feb 1', 'air conditioning', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T18:50:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-griffmovesquick\/7576386058.html","post_id":7576386058,"result_date":"Sun Jan 08 2023 23:56:20 GMT+0000 ","title":"GriffMovesQuick","description":"Moving? Looking for someone who cares about your things? Call today for a quote and move tomorrow!!\nGriff wishes you continued favor in your search for your new spot — and once you get it let’s get you there!!\nReasonable rates and over 25 years of experience in efficient and effortless moving\nIn 2023, choose Griff for your move\nTri-state area and long distance moves\nCall or text Griff  show contact info\nor text  show contact info\nLet’s help make 2023 your JORDAN year and get you moved in quick and purposefully\n","num_images":0,"lat":39.9925,"lng":-75.1133,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily']","posted_date":"2023-01-08T18:47:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bedroom-full-bath\/7576357889.html","post_id":7576357889,"result_date":"Sun Jan 08 2023 22:39:20 GMT+0000 ","title":"this  3 bedroom\/ 2 full bath single family home @@","description":"Located in the desirable Penn Knox section of Germantown, this  3 bedroom\/ 2 full bath single family home with off street parking for two-cars, a large fully fenced rear yard & garden and two working fireplaces is a real gem! The charming living room is kept delightfully warm by a gorgeous Colonial fireplace.  A glass paned door invites one’s view straight out through two rooms to the garden. The living room is augmented by beautiful oak floors and three windows that let in tons of natural light. The good sized eat-in kitchen (large double sink, insinkerator disposal, dishwasher, gas range, refrigerator) with vintage knotty pine cabinets looks out on the lovely backyard & garden with flowers always blooming in spring, summer and early fall. The first floor also has a full bath, walk-in pantry, coat closet and one room with pinewood flooring. The second floor features two bedrooms; the main has a wonderful fireplace. A full bath and a hall linen closet complete the floor. The third floor is finished as a large third bedroom with lots of closet space and front and rear Colonial dormers; it provides the option of having both a third bedroom and a studio area. Original Colonial wide plank pine flooring run throughout the second and third floors. The unfinished original stone basement provides ample area for storage and a workshop, along with clothes washer and dryer and a utility sink. The spacious, fully fenced (30 by 70 feet) backyard and garden is private and is great for entertaining. The garden is planted with many perennials including a small raspberry patch with plots for planting veggies, and is divided from the lawn area by a brick path that leads to the separate brick building (15 by 15 foot with electricity) at the rear of yard which is shaded by a large maple tree. A small brick patio is just outside of the kitchen. On the side of the grassy yard area are four large bushes and trees which bloom at different times and enhance the privacy and enjoyment of this backyard and garden. Three SEPTA rail lines are in walking distance. By bus (30 feet around the corner from your door) the H, XH, or one block to Wayne Ave., the 53) take you to the Erie subway stop. A short walk away are Germantown Friends School, Greene Street Friends School and several city parks including the Wissahickon – Forbidden Drive just a 10-minute bike ride away. The house is a short distance from Drexel University College of Medicine, Thomas Jefferson East Falls campus, Germantown Cricket Club, popular Germantown Avenue (Uncle Bobby’s Coffee Shop) and so much more.  This is a unique and lovely home for you to enjoy for many years to come! **Contact us directly and learn more, text bobbi8952gmailcom","num_images":11,"lat":40.023192,"lng":-75.177521,"attrs":"['3BR \/ 2Ba', 'available now', 'air conditioning', 'application fee details: application fee details: $25 app f`e`e` no AdmiN feE', 'broker fee details: broker fee details: Broker Fee NO+>', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'listed by: listed by: Realty GrEat ApartMentS North Inc-\/-', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T17:12:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/doylestown-263-foxchase-ln-3br-separate\/7576361472.html","post_id":7576361472,"result_date":"Sun Jan 08 2023 22:27:39 GMT+0000 ","title":"!#@263 Foxchase Ln, 3BR (separate) Unit - Avail. February 1, 2023@#@#@","description":"Four separate units available on February 1, 2023. Lease is month-to-month. All units are either fully furnished or semi-furnished with necessities. All units have private bathroom, kitchen and living space. LOCATED (263 Foxchase Ln, Doylestown, PA) within 10-minute walking distance to the legislative building. Coin-op washers and dryers on site. Heat is electric. RENT is $1,025.00 per month. Price range dependent on TOU. Tenant responsible for electricity (landlord willing to discuss electric being covered in rent), landlord covers water\/sewer, trash and WIFI. Great stay for legislative workers. Parking is on street, no assigned parking.\nPlease Text here\/\/\/- Ryanjaime934@gmail_com\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n(Text to contact phone #... texts)\n","num_images":1,"lat":40.3477,"lng":-75.0968,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'application fee details: Processing fee $25 (non refundable) & App fee $45 (per adult)', \"broker fee details: It's Totally Free Services!!\", 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T17:23:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this-well\/7576358085.html","post_id":7576358085,"result_date":"Sun Jan 08 2023 22:26:57 GMT+0000 ","title":"Welcome to this!! Well maintained*, Pet Friendly 3 beds 2 bath Home🙂","description":"Welcome home to 7354 Meadowlark! Located in the desirable Penrose neighborhood, this end of row home is the gift that keeps on giving with a private side yard perfect for any party or event, pets,  or for anybody looking to grow their own plants. Upon entering the home you will be greeted by an open concept living area leading into the kitchen, featuring a breakfast bar, newer stove and other modern appliances. Continue down the hallway and you will find extra storage space along with your master bedroom, full bathroom and an additional ample sized bedroom. If that isn't enough, head downstairs where you will be greeted by a fully finished living space equipped with a fireplace and half bath that would serve as a great office space, additional living room or even a 3rd bedroom conversion. The lower level will also lead you to both your own backyard patio as well as to your separate 1 car garage, but if you prefer to park your car in your private driveway, then it could also be an ideal place for further storage.   This home has been well maintained by the current owners, boasting a newer roof, ceiling fans and windows, meaning all that's left to do is move in and enjoy your new home. Schedule a showing before it's gone! **Contact us directly and learn more, text bobbi8952gmailcom","num_images":10,"lat":39.9055,"lng":-75.2444,"attrs":"['3BR \/ 2Ba', 'available now', 'air conditioning', 'application fee details: application fee details: $25 app f`e`e` no AdmiN feE', 'broker fee details: broker fee details: Broker Fee NO+>', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'listed by: listed by: Realty GrEat ApartMentS North Inc-\/-', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T17:12:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bathroom-in-great\/7576358949.html","post_id":7576358949,"result_date":"Sun Jan 08 2023 22:25:38 GMT+0000 ","title":"(((4 Bedroom 2 bathroom in a great location))))","description":"NEW light fixtures, new resealed driveway, replaced gas service line, new storm doors, new Google thermostat, new garage door with auto opener, new hot water heater, BEAUTIFUL accent wall added to the family room PLUS landscaping completed and finished with a vinyl picket fence with gate!  These features are a BONUS to the FABULOUS ultra modern kitchen and bathrooms!  This HOME is super CLEAN and organized with NEW flooring and fresh paint!  Did I mention the solar panels?  A transferrable 20 year lease with PosiGen has your monthly electric bill coming in at under $70!  This UNIQUE home in the heart of the GREAT NE won't last long!   **Contact us directly and learn more, text bobbi8952gmailcom","num_images":9,"lat":40.057424,"lng":-75.014444,"attrs":"['4BR \/ 2Ba', 'available now', 'air conditioning', 'application fee details: application fee details: $25 app f`e`e` no AdmiN feE', 'broker fee details: broker fee details: Broker Fee NO+>', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'listed by: listed by: Realty GrEat ApartMentS North Inc-\/-', 'detached garage', 'rent period: monthly']","posted_date":"2023-01-08T17:15:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-home-in-ditman-street\/7576241151.html","post_id":7576241151,"result_date":"Sun Jan 08 2023 17:47:21 GMT+0000 ","title":"This home in DITMAN STREET , Philadelphia, is move in ready !!!","description":"****NOW AVAILABLE***************\nFantastic East End Location. 3 bedroom 2 bath, great back yard.\nRent range $900-$900\nDeposit range $900-$900\nPet allowed restrictions may apply\nThis home is available to view and we are accepting application currently.\n**To view this home, we offer two options.\nYou are welcome to come to our office Monday through Friday to pick up a key between 9am and 6PM. You will need a $0 refundable key deposit (cash only) and we will copy your ID.\nWe are located at:\nWe Buy Real Estate\n6303 DITMAN STREET , Philadelphia, PA, 19135\nshow contact info\n*You can also go directly to the property to view this home Monday through Sunday 9am to 6pm using their lockbox. But First, Please call Tenant and follow the prompts, to be pre-qualified, then schedule an appointment. The lockbox number is located on the box at the property.\nwww.rentusnow.com\n12. month lease terms\nConcord Cooperative, Come and See this unit on a corner lot, In this gated and well maintained community. Located minutes from the Airport, Shopping, Downtown and Marta, Must See. Monthly Carrying Charge is $900covers HVAC, hot water heater, roof, exterior, landscape, property taxes, liability insurance for the building, water, trash and common area. CALL:\nshow contact info\nThis house at New port Richey area ....3 bedroom 2 bathroom for rent $900a month .....This house very good for a small family ......close to many restaurant and bank ...close to highway 40 and drive to just 20 minutes drive to just 25 minutes drive to just 40 minutes ....if your family need this home ,please call me or text me :\nshow contact info\nWonderful 3 bed ranch on a double lot. Features a fenced in back yard with plenty of trees and privacy, large window in living room for loads of natural light, a freshly painted interior, and more! Kitchen cabinets have been redone and there is plenty of space in the garage and basement for storage. Short term lease is available.For more details Text::  show contact info","num_images":5,"lat":40.021602,"lng":-75.054617,"attrs":"['3BR \/ 1Ba', '1084ft2', 'available now', '\\nsunday 2023-01-08\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T11:56:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-where-convenience-meets\/7576252820.html","post_id":7576252820,"result_date":"Sun Jan 08 2023 17:30:46 GMT+0000 ","title":"Where Convenience Meets Luxury.","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:2\nBathrooms:2\nSquare Footage:767-780 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nLeasing Specials\nReduced Security Deposit when you move-in by 2\/15\/2023 and apply within 48 hours of your tour! *Security Deposit reduced from 1 Month's Rent to $1,000.00!\nWaived Application Fee waived when you move-in by 1\/31\/2023 and apply within 48 hours of your tour! *Up to 2 application fees waived.\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 2BR floor-plans in the sought after Fishtown\/Northern Liberties area.\nConvenient to I-95, 676 and Girard Avenue, getting around the city is a breeze whether you're driving, taking public transportation or Uber\/Lyft!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home. Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":22,"lat":39.971179,"lng":-75.140092,"attrs":"['2BR \/ 2Ba', '1155ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T12:26:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bed-1250-mo-avial\/7576251034.html","post_id":7576251034,"result_date":"Sun Jan 08 2023 17:26:02 GMT+0000 ","title":"@@@#Gorgeous 4 bed $1250\/Mo - Avial. thru April 15 *\/* In Philadelphia","description":"Gorgeous 4 bedroom, 3 bathroom apartment for rent in Philadelphia. High vaulted ceiling make this unit feel open and spacious. Large kitchen\/living great room and lots of windows. 3 full bathrooms with tubs. Washer and dryer within the unit. Within walking distance of the grocery shopping, entertainment, public library, restaurants and the public transportation system. RENT is $1250\/Mo.. Tenant pays electric, and cable\/phone\/internet. Pets are allowed with additional pet deposite. No Smoking. Available NOW through April 15, 2023.\nPlease reply\/\/\/- Luznash847@gmail_com\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n(Text to contact phone #... texts)","num_images":3,"lat":40.0247,"lng":-75.0518,"attrs":"['4BR \/ 3Ba', 'air conditioning', 'application fee details: Processing fee $25 (non refundable) & App fee $45 (per adult)', 'broker fee details: -:)+Broker Fee \"Yes ($25.00) \"+(:-', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: To Know Do [txt] thru \"Luznash847@gmail_com\"', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T12:22:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-take-deep-breath-and-relax\/7576250961.html","post_id":7576250961,"result_date":"Sun Jan 08 2023 17:25:49 GMT+0000 ","title":"Take a Deep Breath and Relax Here at Park Lane!","description":"Apt. 2410 — Oxford floor plan — 1,203 sq. ft. — $3,460\nThis 4th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-08T12:21:49-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-laundry-in-unit-central\/7576250269.html","post_id":7576250269,"result_date":"Sun Jan 08 2023 17:23:50 GMT+0000 ","title":"Laundry in Unit, Central Location, Ideal Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nCommunity Features\n* Fitness Studio\n* Outdoor Grill Area\n* Bark Park\n* TV Lounge\n* Yoga Lounge\n* Pet Salon\n* Community Lounge\n* Professionally Managed\n* Swimming Pool\n* Billiards\n* Sun Deck\n* Easy Freeway Access\n* Minutes from Restaurants, Shopping, and Much More\n* Spa","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1110ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-08T12:19:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fitness-center-incredible\/7576249631.html","post_id":7576249631,"result_date":"Sun Jan 08 2023 17:22:04 GMT+0000 ","title":"Fitness Center, Incredible Features, Central Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nBe the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '758ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-08T12:18:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-2bedroom-2bath\/7576248054.html","post_id":7576248054,"result_date":"Sun Jan 08 2023 17:18:05 GMT+0000 ","title":"Beautiful 2bedroom, 2bath Apt located in Philadelphia","description":"Beautiful 2bedroom, 2bath Apt located in Philadelphia. Great location - close to everything. Eat-in Kitchen has bar, good storage space and a built-in hutch\/china cabinet. Spacious backyard - quiet neighborhood. Great Investment property! Text today to schedule your showing. If you interested please text me number . Text:  show contact info\nEstelle offers two-bedroom and penthouse apartments in the heart of Philadelphia.\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n-- If you interested please text me number . Text:  show contact info","num_images":3,"lat":39.9523,"lng":-75.1638,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T12:14:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-fishtown-br-ba\/7576247504.html","post_id":7576247504,"result_date":"Sun Jan 08 2023 17:16:43 GMT+0000 ","title":"Beautiful Fishtown 1 BR\/1 BA","description":"I'm going to be leaving the city in a few months, and will be looking for someone to take over a new lease. This is not a sublet, you'd be signing your own lease and mine would be terminating - just looking to get a jump on the process. Ideally looking for somebody to move in sometime in March, as I'm targeting leaving that first weekend.\nThis is a beautiful 1 bed 1 bath with high ceilings, huge windows with loads of natural light in a fantastic location for a great price. In-unit washer\/dryer, pet-friendly, super friendly neighbors and a great location. Lounge area and gym in the building.\nThere is a garage, but there's a fee and I believe a waitlist. Otherwise, standard Fishtown street parking.\n","num_images":5,"lat":39.9788,"lng":-75.1262,"attrs":"['1BR \/ 1Ba', 'available mar 13', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T12:12:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-central-location-upgraded\/7576247239.html","post_id":7576247239,"result_date":"Sun Jan 08 2023 17:16:09 GMT+0000 ","title":"Central Location, Upgraded Finishes Available, Pet Park","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1128ft2', 'available jan 16', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T12:12:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-2bed-2bath-home\/7576238106.html","post_id":7576238106,"result_date":"Sun Jan 08 2023 16:51:22 GMT+0000 ","title":"Beautiful 2bed \/ 2bath home located in Pennsylvania","description":"Beautiful 2bedroom, 2bath home located in Pennsylvania, PA.\nGreat location - close to everything. Eat-in Kitchen has bar, good storage space and a built-in hutch\/china cabinet. Spacious backyard - quiet neighborhood. Great Investment property! Text today to schedule your showing.\nEstelle offers two-bedroom and penthouse apartments in the heart of Pennsylvania, PA.\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n-- If you interested please text me number . Call:  show contact info\n( Please Avoid Scam Direct Call )\n","num_images":3,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T11:47:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-renovated-bedroom\/7576233275.html","post_id":7576233275,"result_date":"Sun Jan 08 2023 16:37:27 GMT+0000 ","title":"Luxury renovated 2 Bedroom 1 Bath apartment in philadelphia","description":"Luxury renovated 2 Bedroom 1 Bath apartment in philadelphia  !!. Designed with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping. If you are interested, please send a TEXT:   show contact info\nEstelle offers 2-bedroom and penthouse apartments in the heart of Hphiladelphia !!\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nIf you are interested, please send a TEXT  show contact info","num_images":4,"lat":35.6781,"lng":-84.4312,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T11:33:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-love-where-you-live\/7576230171.html","post_id":7576230171,"result_date":"Sun Jan 08 2023 16:27:58 GMT+0000 ","title":"Love Where you Live! Available 1 bed, 1 bath with Premiere Upgrade!","description":"The Gateway Apartments1515 Manley Rd West Chester, PA 19380Pricing: $1661 - $2402\/Month*Bedrooms: 1  Bathrooms: 1 Square Footage: 779 sq ft show contact info\nFeatures in this apartment home:● Alarm● Cable Ready● Carpet● Den● Dining Room● Dishwasher● Garbage Disposal● High Speed Internet Access● Walk-In Closets● Window Coverings● Built-In Microwave Oven● Disability Access (select homes)● Frost-Free Refrigerator\/Ice Maker● Garden\/Spa Tub (select homes)● Gas Fire Place (select homes)● Kitchen Pantry● Large Windows● Mini Blinds On All Windows● Wired For High-Speed Internet● Wooded View\/Pool View (select homes)About the community:  Exclusive features, including a resort-style pool with a sun deck and a 24-hour fitness center, are what make us the best apartment homes in the West Chester, PA area. Whether you want to spend a tranquil afternoon enjoying our beautiful landscapes or invite people over for a social function in our clubhouse, our community has something to offer everyone. Secure gated entrances and 24-hour maintenance provide the residents of our pet-friendly apartments with peace of mind. If you are searching for luxury West Chester apartment homes or are simply looking to relocate to the East Goshen Township area, come tour our wonderful apartments. Offering the best apartments in the area, we will help you feel right at home. Whatever you desire in life, find it at The Gateway Apartments.Please take our virtual tour\nhttps:\/\/my.matterport.com\/show\/?m=4RkQ1PobBkE&brand=0 Amenities at our property:● Business Center● Clubhouse● Fitness Center● Onsite Maintenance● Onsite Management● Package Service● Picnic and Grilling Area● Pool and Sundeck● Storage Space● Walking\/Biking Trails● Across From Wawa & Goshen Crossing Shopping Center● Beautifully Landscaped Grounds● Garages For Lease● Gated Entrances● Maintenance Free Lifestyle● Onsite Leasing Office● Pet-Friendly● Relaxing Fire Pit● Three BBQ\/Picnic Areas● Wi-Fi Access in Clubhouse and at PoolAdditional information:Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthPets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonWebsite: https:\/\/www.thegatewayapartments.com\/Phone:  show contact info\nProfessionally managed by Paradise Management, LLC *Prices are subject to change without notice All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY970F506CB0054A\n","num_images":21,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '779ft2', 'available jan 27', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T11:23:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-two-bedroom\/7576225048.html","post_id":7576225048,"result_date":"Sun Jan 08 2023 16:12:33 GMT+0000 ","title":"Spacious two bedroom apartment","description":"Spacious two bedroom apartment with new flooring throughout! Unit has 2 full sized bedrooms along with one additional smaller room that would be perfect for an office\/studio or child's room. A new oven\/refrigerator are being delivered and will be installed prior to move in (not shown in pictures). There is a washer and dryer hookup in unit, along with a mudroom prior to entering the large dining room\/kitchen area. We do not allow pets. No other utilities included.\nDesigned with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Philadelphia\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you interested please send your contact number, I will contact you as soon as possible asap.\n","num_images":3,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T11:08:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-love-this-building\/7576224990.html","post_id":7576224990,"result_date":"Sun Jan 08 2023 16:12:24 GMT+0000 ","title":"Love this building!","description":"Spacious two bedroom apartment with new flooring throughout! Unit has 2 full sized bedrooms along with one additional smaller room that would be perfect for an office\/studio or child's room. A new oven\/refrigerator are being delivered and will be installed prior to move in (not shown in pictures). There is a washer and dryer hookup in unit, along with a mudroom prior to entering the large dining room\/kitchen area. We do not allow pets. No other utilities included.\nDesigned with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Philadelphia\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you interested please send your contact number, I will contact you as soon as possible asap.\n","num_images":3,"lat":39.9906,"lng":-75.1296,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T11:08:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautiful-bedroom\/7576223251.html","post_id":7576223251,"result_date":"Sun Jan 08 2023 16:07:22 GMT+0000 ","title":"++++this beautiful 3 bedroom\/2 full bath home++++","description":"3 bedrooms\n2 bathroom\nNewly painted\nRestained original wood floors\nFridge & stove included\nBasement storage\nWasher connection & Dryer\nFenced backyard great for entertaining!\n‪‪Please call or text_  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nwelcome\nLuxury renovated 3 Bedroom 1\/2 Bath apartment. Designed with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Chattanooga\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n","num_images":4,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 2Ba', '1350ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T11:03:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautiful-bedroom\/7576223249.html","post_id":7576223249,"result_date":"Sun Jan 08 2023 16:07:22 GMT+0000 ","title":"++++this beautiful 3 bedroom\/2 full bath home++++","description":"3 bedrooms\n2 bathroom\nNewly painted\nRestained original wood floors\nFridge & stove included\nBasement storage\nWasher connection & Dryer\nFenced backyard great for entertaining!\n‪‪Please call or text_  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nwelcome\nLuxury renovated 3 Bedroom 1\/2 Bath apartment. Designed with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Chattanooga\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n","num_images":4,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 2Ba', '1350ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T11:03:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-pennsport-3br-2ba\/7576220362.html","post_id":7576220362,"result_date":"Sun Jan 08 2023 15:58:59 GMT+0000 ","title":"$1,800- Charming Pennsport 3BR, 2BA w\/yard and parking","description":"Charming 1130 sq. ft. Pennsport 3BR, 2BA. Full interior painting in Sept 2022. Off street parking with driveway and remote entry. Yard with cherry tree. Ample street parking, close to shopping, I-95, beautiful Dickinson Square Park, and vibrant 2nd St and Moyamensing Avenue. $1800\/mo. with first, last, security required. Tenant pays all utilities. Available now.","num_images":24,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', '1130ft2', 'available now', 'air conditioning', 'application fee details: $50 application fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T10:54:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-new-fresh-bedroom\/7576202742.html","post_id":7576202742,"result_date":"Sun Jan 08 2023 15:51:11 GMT+0000 ","title":"Luxury New Fresh- 1 Bedroom Apartment || Washer- Dryer || Available No","description":"Luxury remodaled Huge 1 Bedroom 1 Bathroom Apartment Downtown Philadelphia. Updated Kitchen, Stainless steel, Washer\/Dryer, Owner pays for water\/gas. residents enjoy luxury amenities including 24 hour doorman, brand new state of the art Fitness Center, and a seasonal rooftop swimming pool, all included in rent, and parking in the garage (fee when available) 8G has a full sized, fully equipped kitchen with frost free frig, self cleaning range, dishwasher, garbage disposal, and a ton of cabinets. There are 3 huge clothes closets, and a linen closet, 21 foot living room with bay window with City Skyline views, individually controlled HVAC. Washer\/dryer on each floor of building. Easy walk to Upenn, Chop, and HUP. Half block walk to all Rittenhouse Square has to offer. Floor plan available. Yearly lease, Pets are allowed, non smoking building. Off street parking. If you are interested please Call me:  show contact info","num_images":5,"lat":40.0343,"lng":-75.1213,"attrs":"['1BR \/ 1Ba', '635ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T09:52:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-home-for-rent\/7576205486.html","post_id":7576205486,"result_date":"Sun Jan 08 2023 15:47:00 GMT+0000 ","title":"4 Bed \/ 3 Bath Home for rent - Perfect for Working Professionals","description":"*Available March 2023* Possibly Sooner\nGorgeous 4 bed, 3 full bath townhome in Point Breeze.\nAn open concept first floor with an abundance of natural light, 9' ceilings, and access to a back patio.\nThe kitchen features comes with a gas range, dishwasher, bar counter seating, Cabinets, Pantry, a 3\/4 in quartz waterfall island, and high end stainless steel appliances.\nFinished basement with a full bathroom, giving you the flexibility to use this space as either a bedroom suite or a fantastic entertainment space.\nThe second floor features 2 large bedrooms and a full bathroom.\nThe 3rd floor Master suite is full of natural light, and offers a large walk-in-closet. The Master bath offers double sinks, a linen closet, and a rain shower with body spray and a standalone tub.\nThe roof deck with panoramic views of the city. You will also find a wet bar so get your guests together and enjoy this beautiful home!\nAlso in the house: a washer\/dryer and storage space in the basement.\nDon't miss this expansive, high-end home. You also can quickly access Washington Ave, Broad Street and neighboring areas like Rittenhouse Square, Center City and Fitler Square for more local entertainment. Close to Bus stop (#17) and Indigo Bikeshare.\nPETS: Dogs & Cats Under 35 lbs $500 Nonrefundable pet deposit per pet (Max 2 pets)\nUtilities: Landlord covers Trash and Sewage.\n","num_images":19,"lat":39.932463,"lng":-75.179188,"attrs":"['4BR \/ 3Ba', '2000ft2', 'available mar 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T10:02:00-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-call-for-details-clubhouse\/7576215613.html","post_id":7576215613,"result_date":"Sun Jan 08 2023 15:43:02 GMT+0000 ","title":"Call for Details, Clubhouse with Game Room, Visit Your New Home","description":"Prepare to fall in love with The Point at Glen Mills! Kick back in our community lounge. Watch your furry friend frolic with his furry friends in our dog park. Challenge your friends to a game of golf on our outdoor putting green. Life is good at The Point at Glen Mills. Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-01-08T10:39:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1600-charming-1130-sq-ft\/7576211979.html","post_id":7576211979,"result_date":"Sun Jan 08 2023 15:29:59 GMT+0000 ","title":"$1600\/Charming 1130 sq. ft. Pennsport 3BR, 1BA. Totally renovated in 2","description":"$1600\/Charming 1130 sq. ft. Pennsport 3BR, 1BA. Totally renovated in 2010: windows, fixtures, plumbing, carpet, facade, paint, basement waterproofing, and tiled kitchen and bath. Full interior painting and new roof in 2021. New gas furnace, washer\/dryer, dishwasher and basement scrub sink in 2011. Ample street parking, close to shopping, I-95, beautiful Dickinson Square Park, and vibrant Moyamensing Avenue. $1600\/mo. with first, last, security required. Tenant pays all utilities. Available 1\/9.","num_images":15,"lat":39.9207,"lng":-75.1595,"attrs":"['3BR \/ 1Ba', '1130ft2', 'available now', 'air conditioning', 'application fee details: $50 application fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T10:25:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apt-for-rent\/7576203988.html","post_id":7576203988,"result_date":"Sun Jan 08 2023 15:00:42 GMT+0000 ","title":"1 BEDROOM APT FOR RENT NORTHEAST AREA","description":"1 bedroom apartment for rent\nRent $925 includes water\nTenant pays electric and gas\n3 months to move in (first, last, security)\nPrior evictions will not be accepted\nPlease call Foose for further information to be exchnaged @  show contact info\n, Thanks\n","num_images":4,"lat":40.0256,"lng":-75.043,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T09:56:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-2bed-2bath-home\/7576202353.html","post_id":7576202353,"result_date":"Sun Jan 08 2023 14:54:32 GMT+0000 ","title":"Beautiful 2bed \/ 2bath home located in Pennsylvania","description":"Beautiful 2bedroom, 2bath home located in Pennsylvania, PA.\nGreat location - close to everything. Eat-in Kitchen has bar, good storage space and a built-in hutch\/china cabinet. Spacious backyard - quiet neighborhood. Great Investment property! Text today to schedule your showing.\nEstelle offers two-bedroom and penthouse apartments in the heart of Pennsylvania, PA.\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n-- If you interested please text me number .\n","num_images":4,"lat":39.9772,"lng":-75.2545,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T09:50:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-single-person-couple-for\/7576198986.html","post_id":7576198986,"result_date":"Sun Jan 08 2023 14:40:44 GMT+0000 ","title":"Single Person \/ Couple For Ready This Rehabbed 1 bed Apartment","description":"Available January Last Week 1st This recently rehabbed 1 bedroom 1 bath apartment with a den will be available. The apartment features a large eat-in kitchen with tall cherry cabinetry, granite countertop, limestone tiled backsplash, under cabinet lighting, and stainless steel appliances including a dishwasher and a built-in micro. The apartment has 9 ft. ceilings and beautiful maple flooring throughout, a new ceramic tiled bath, a large private patio, new windows, 2 ceiling fans, mini blinds, gas-forced heat, and air conditioning. $520 per mo. Plus utilities. Rent Includes free hot and cold water.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nMove in-Ready\nAmazing renovated 1 Bedroom 1 Bath apartment heart of Philadelphia, PA .\nDesigned with elegance in mind, Estelle offers an impressive collection of 1 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature, and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Philadelphia, PA.\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you interested please send your contact number, I will contact you as soon as possible asap.\n","num_images":3,"lat":40.0178,"lng":-75.0895,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'application fee details: App fee $11 (per person) & Processing fee $15 (refundable)', \"broker fee details: Discounted broker's fee\", 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Security deposit is equal to one months rent', 'carport', 'rent period: monthly']","posted_date":"2023-01-08T09:36:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-single-family\/7576196568.html","post_id":7576196568,"result_date":"Sun Jan 08 2023 14:30:36 GMT+0000 ","title":"BEAUTIFUL SINGLE FAMILY APTMENT FOR RENT","description":"If you're looking for a 2 bedroom, 1 bathroom rental apt, there are plenty of options available. Depending on your budget and location, you can find a variety of rental homes ranging from single-family homes to townhouses and apartments. You can search online for rental homes in your area, or contact a local real estate agent to help you find the perfect rental home for you.\nCALL OR TEXT:( 7 4 7 ) 4 7 7- 8 2 7 1\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.welcome\nDesigned with elegance in mind, Estelle offers an impressive collection of 2 bedroom apt and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers one-bedroom and penthouse House in the heart of San Jose, CA. If you are interested, please send a call or CALL OR TEXT:( 7 4 7 ) 4 7 7- 8 2 7 1 💬🕿︎\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you are interested, please CALL OR TEXT:( 7 4 7 ) 4 7 7- 8 2 7 1💬🕿︎","num_images":5,"lat":39.9925,"lng":-75.1415,"attrs":"['2BR \/ 1Ba', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-08T09:26:36-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bathroom\/7576196556.html","post_id":7576196556,"result_date":"Sun Jan 08 2023 14:30:33 GMT+0000 ","title":"Spacious 2 bedroom 2 bathroom for rent","description":"If you're looking for a 2 bedroom, 2 bathroom rental home, there are plenty of options available. Depending on your budget and location, you can find a variety of rental homes ranging from single-family homes to townhouses and apartments. You can search online for rental homes in your area, or contact a local real estate agent to help you find the perfect rental home for you.\nCALL OR TEXT:( 7 4 7 ) 4 7 7- 8 2 7 1\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.welcome\nDesigned with elegance in mind, Estelle offers an impressive collection of 2 bedroom apt and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers one-bedroom and penthouse House in the heart of San Jose, CA. If you are interested, please send a call or CALL OR TEXT:( 7 4 7 ) 4 7 7- 8 2 7 1 💬🕿︎\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you are interested, please CALL OR TEXT:( 7 4 7 ) 4 7 7- 8 2 7 1💬🕿︎","num_images":5,"lat":39.9925,"lng":-75.1415,"attrs":"['2BR \/ 2Ba', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-08T09:26:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studios-newly\/7576196541.html","post_id":7576196541,"result_date":"Sun Jan 08 2023 14:30:29 GMT+0000 ","title":"STUDIOS **Newly Renovated**3Bedroom Condo**","description":"If you're looking for a 3 bedroom, 2 bathroom rental home, there are plenty of options available. Depending on your budget and location, you can find a variety of rental homes ranging from single-family homes to townhouses and apartments. You can search online for rental homes in your area, or contact a local real estate agent to help you find the perfect rental home for you.\nCALL OR TEXT:( 7 4 7 ) 4 7 7- 8 2 7 1\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.welcome\nDesigned with elegance in mind, Estelle offers an impressive collection of 2 bedroom apt and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers one-bedroom and penthouse House in the heart of San Jose, CA. If you are interested, please send a call or CALL OR TEXT:( 7 4 7 ) 4 7 7- 8 2 7 1 💬🕿︎\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you are interested, please CALL OR TEXT:( 7 4 7 ) 4 7 7- 8 2 7 1💬🕿︎","num_images":3,"lat":39.9925,"lng":-75.1415,"attrs":"['3BR \/ 2Ba', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-08T09:26:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-bedroom-bathroom\/7576191111.html","post_id":7576191111,"result_date":"Sun Jan 08 2023 14:06:23 GMT+0000 ","title":"Nice 2 bedroom 1 bathroom apartment in Philadelphia.","description":"Nice 2 bedroom 1 bathroom apartment in Philadelphia.\nDesigned with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers one-bedroom and penthouse apartments in the heart of Philadelphia.\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock\nConnect our home please text me- show contact info","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T09:02:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-luxury-renovated\/7576181113.html","post_id":7576181113,"result_date":"Sun Jan 08 2023 13:21:14 GMT+0000 ","title":"BEAUTIFUL>> Luxury renovated 1 Bed \/ 1 Bath apartment","description":"Luxury renovated 1 Bedroom 1 Bath apartment in 339 N 11th St, Philadelphia, PA,  ri !. Designed with elegance in mind, Estelle offers an impressive collection of 1 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers 1-bedroom and penthouse apartments in the heart of 339 N 11th St, Philadelphia, PA!!\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\n","num_images":0,"lat":39.95851,"lng":-75.15662,"attrs":"['1BR \/ 1Ba', '1750ft2', 'air conditioning', 'application fee details: $15 every applicants (no credit & background) & $50 lease processing fee', \"broker fee details: +-] Discounted broker's fee\", 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'listed by: Realty GrEat ApartMentS North Inc-\/-', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T08:05:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-room-bath-apartment\/7576179835.html","post_id":7576179835,"result_date":"Sun Jan 08 2023 13:10:43 GMT+0000 ","title":"2 Bed room 1 Bath apartment.","description":"2 Bed room 1 Bath apartment. Designed with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nText me :  show contact info","num_images":3,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T07:56:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-lo210-rittenhouse\/7576181197.html","post_id":7576181197,"result_date":"Sun Jan 08 2023 13:09:53 GMT+0000 ","title":"great lo;';';()210 W Rittenhouse Square, Philadelphia, PA ,","description":"Luxury renovated 2 Bedroom 2 Bath apartment. Designed with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of 210 W Rittenhouse Square, Philadelphia, PA ,\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T08:05:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-unit-is-780-sqft-bed-bath\/7576180917.html","post_id":7576180917,"result_date":"Sun Jan 08 2023 13:07:53 GMT+0000 ","title":"Unit 1 is a 780 sqft 2 bed\/ 1 bath","description":"Welcome to 835 Corinthian Ave located in one of the best blocks in Fairmount. Unit 1 is a 780 sqft 2 bed\/ 1 bath that was recently updated with Calcutta quartz finishes, subway tile backsplash & stainless steel appliances. This unit features an in unit washer & dryer and a deck space. Please text me for more information:(786) 745-57^56\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nwelcome\nLuxury renovated 2 Bedroom 1 Bath apartment. Designed with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Chattanooga\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n","num_images":3,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T08:03:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-unit-is-780-sqft-bed-bath\/7576180914.html","post_id":7576180914,"result_date":"Sun Jan 08 2023 13:07:52 GMT+0000 ","title":"Unit 1 is a 780 sqft 2 bed\/ 1 bath","description":"Welcome to 835 Corinthian Ave located in one of the best blocks in Fairmount. Unit 1 is a 780 sqft 2 bed\/ 1 bath that was recently updated with Calcutta quartz finishes, subway tile backsplash & stainless steel appliances. This unit features an in unit washer & dryer and a deck space. Please text me for more information:(786) 745-57^56\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nwelcome\nLuxury renovated 2 Bedroom 1 Bath apartment. Designed with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Chattanooga\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n","num_images":3,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T08:03:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bi-level-apartment\/7576177449.html","post_id":7576177449,"result_date":"Sun Jan 08 2023 13:02:53 GMT+0000 ","title":"2 bedroom bi-level apartment","description":"2nd Floor Apt in the Harrowgate Section of Philadelphia\n2 level apartment\nLiving room, kitchen and bathroom in the 2nd floor\n2 really good size bedrooms in the 3rd floor\nBrand new apartment rehabbed\n2 Bedrooms 1 Bath\nNew lighting and plumbing\nNew Flooring throught out the whole apartment.\nBrand new kitchen with new appliances, cabinets\nNice closet space\nEverything on this unit is brand new\nTHIS apartment is ideal for a couple with kids\nAsking for $1,100 per month\nAPPLY NOW\nCONTACT US\nConveniently located near schools, shopping and public transportation.\nDETAILS:\n- NO app fee.\n- Yearly leases only.\n- Available asap\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant pays own Electric, Gas, and 1\/4 of water\n","num_images":15,"lat":40.076,"lng":-75.0876,"attrs":"['2BR \/ 1Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T07:35:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-where-luxury-meets\/7576179177.html","post_id":7576179177,"result_date":"Sun Jan 08 2023 12:55:16 GMT+0000 ","title":"Where Luxury Meets Convenience!!","description":"Available Now\nApt. 2510 — Oxford floor plan — 1,203 sq. ft. — $3,510\nThis 5th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-08T07:51:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stunning-bedroom-bathroom\/7576175526.html","post_id":7576175526,"result_date":"Sun Jan 08 2023 12:31:37 GMT+0000 ","title":"Stunning 1 bedroom 1 bathroom in the heart of Philly","description":"Fully furnished 1 bedroom 1 bedroom unit. Queen size bed set. Desk, chair. Lamp. Leather sofa sleeper. Coffee table. Bar chairs. Located in a quiet, serene and tidy environment; Next to Convention Center, City Hall, Chinatown, Hahnemann Hospital, Jefferson Hospital. Easy access to I-676 and I-95. Public parking lot right next to the building. Beautiful roof top deck. Big bedroom and living room. All hard wood floor through out. Beautiful 22-inch LED ceiling light in bedrooms. Washer\/dryer in unit. Fully equipped kitchen with top grade granite counter top. Powerful kitchen vent hood. Central heating and AC. Big screen TV with TV program included. Fully furnished! All utilities included (water, sewer, heating, cooling, WIFI, TV, electricity, trash collection)","num_images":0,"lat":39.9523,"lng":-75.1638,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T07:15:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-logan-bedroom-for-rent\/7576176599.html","post_id":7576176599,"result_date":"Sun Jan 08 2023 12:31:17 GMT+0000 ","title":"Logan 1 Bedroom for Rent","description":"3rd Floor studio Apt in the Logan Section of Philadelphia\nBrand new apartment rehabbed\n1 Bedrooms 1 Bath\nNew lighting and plumbing\nNew Flooring throught out the whole apartment.\nBrand new kitchen with new appliances, cabinets\nNice closet space\nEverything on this unit is brand new\nTHIS apartment is ideal for a couple or single person.\nAsking for $750 per month\nAPPLY NOW\nCONTACT US\nConveniently located near schools, shopping and public transportation.\nDETAILS:\n- $28.50 app fee per person applying\n- Yearly leases only.\n- Available asap\n- 3-months rent to move-in. (1 months rent and 2 months security)\n- Tenant pays own Electric, Gas, and 1\/4 of water of bill","num_images":6,"lat":40.076,"lng":-75.0876,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'application fee details: credit company charges $29.99', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T07:27:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-updated-bedroom-bath-condo\/7576126082.html","post_id":7576126082,"result_date":"Sun Jan 08 2023 04:24:09 GMT+0000 ","title":"updated 1 bedroom, 1 bath condo located on the second floor is ready","description":"As you enter the home, notice the updated flooring, all the natural sunlight and neutral paint color throughout. In the kitchen you will find lovely white cabinets, ample countertop space and some stainless-steel appliances. The bedroom is bright, spacious and not short of storage, just take a look at the closet! This is where you will find the stackable washer\/dryer unit, which is an awesome bonus! Across the hall is the full bath that offers more storage in the vanity and linen closet. Outside on the balcony, there is room to entertain while being able to look at the nice views of the tennis courts and field. A few bonus features of this home are that the washer\/dryer and kitchen refrigerator are staying for the new owner.","num_images":8,"lat":40.22825,"lng":-75.317108,"attrs":"['1BR \/ 1Ba', '588ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-07T21:48:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stunning-aparment-in\/7576132209.html","post_id":7576132209,"result_date":"Sun Jan 08 2023 03:30:21 GMT+0000 ","title":"🏡 STUNNING APARMENT IN LUDLOW! W\/D, ROOFTOP DECK, HARDWOOD FLOORING","description":"NOTE: Feel free to contact me if this is not what you are looking for, I may have other properties to pass by you.\nCONTACT NUMBER:  show contact info\n2 BEDS\n1 BATHS\n1,013 SQUARE FEET\nGorgeous modern apartment is available in NOW! PRIVATE ROOFTOP!\nThis fantastic 2 bedroom condo with a private roof deck in a very desirable location could be yours and is ready to move in. Natural sunlight invites you in and fills the entire home throughout the day. Hardwood flooring flows through the home from the living areas to the 2 large sun drenched bedrooms.\nThe spacious kitchen has upgraded stainless steel appliances with gas cooking, granite countertops, and a peninsula to work on or entertain while cooking. A matching set of stackable full size washer and dryer are located on the main floor for convenience as well as a tankless hot water heater.\nConsisting of the top two floors this bright and spacious condo with 12' ceilings throughout is the perfect starter home or fantastic and desirable investment property. The huge fiberglass roof deck encompasses the entirety of the building, over looking the Ben Franklin Bridge and Center City skyline is outfitted with electricity and water and is only accessed and available though and for this property.\nThe 1400 block of N 7th street is busting with activity, centrally located and very convenient to to all that Fishtown. Just minutes from all major arteries whether it is the Ben Franklin bridge or 95 they are all just a few minutes away getting you in and out of the City with ease.\nThere is plenty of on street parking anytime.\n","num_images":10,"lat":39.9877,"lng":-75.1554,"attrs":"['2BR \/ 1Ba', '1013ft2', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-07T22:21:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-corner-bedroom-condo\/7576125986.html","post_id":7576125986,"result_date":"Sun Jan 08 2023 03:19:37 GMT+0000 ","title":"This corner 1 bedroom condo in the stunning Lenox Building","description":"The layout has a great flow to it, that is spacious and bright. Large bedroom with en suite bathroom. Several wonderful upgrades include in unit washer\/dryer, Mini-Split Heating & Cooling systems throughout, and California closets. The kitchen features ample counter space and cabinets, rock stone back splash, stainless steel appliances and granite countertops. Take advantage of the Ave. of the Arts, and all the shops and restaurants in the neighborhood.","num_images":7,"lat":39.94724,"lng":-75.162513,"attrs":"['1BR \/ 1Ba', '808ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-07T21:47:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/doylestown-avail-february-semi\/7576360663.html","post_id":7576360663,"result_date":"Sun Jan 08 2023 22:24:58 GMT+0000 ","title":"Avail. February 1, 2023! S[emi-furnished 3ba x 2ba Units -M2M Rent AVL","description":"Four separate units available on February 1, 2023. Lease is month-to-month. All units are either fully furnished or semi-furnished with necessities. All units have private bathroom, kitchen and living space. LOCATED (263 Foxchase Ln, Doylestown, PA) within 10-minute walking distance to the legislative building. Coin-op washers and dryers on site. Heat is electric. RENT is $1,025.00 per month. Price range dependent on TOU. Tenant responsible for electricity (landlord willing to discuss electric being covered in rent), landlord covers water\/sewer, trash and WIFI. Great stay for legislative workers. Parking is on street, no assigned parking.\nPlease Text here\/\/\/- Ryanjaime934@gmail_com\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n(Text to contact phone #... texts)\n","num_images":4,"lat":40.3477,"lng":-75.0968,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'application fee details: Processing fee $25 (non refundable) & App fee $45 (per adult)', \"broker fee details: It's Totally Free Services!!\", 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T17:20:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-the-popular-germantown\/7576346065.html","post_id":7576346065,"result_date":"Sun Jan 08 2023 22:06:43 GMT+0000 ","title":"The Popular Germantown!!","description":"Located in the desirable Penn Knox section of Germantown, this  3 bedroom\/ 2 full bath single family home with off street parking for two-cars, a large fully fenced rear yard & garden and two working fireplaces is a real gem! The charming living room is kept delightfully warm by a gorgeous Colonial fireplace.  A glass paned door invites one’s view straight out through two rooms to the garden. The living room is augmented by beautiful oak floors and three windows that let in tons of natural light. The good sized eat-in kitchen (large double sink, incinerator disposal, dishwasher, gas range, refrigerator) with vintage knotty pine cabinets looks out on the lovely backyard & garden with flowers always blooming in spring, summer and early fall. The first floor also has a full bath, walk-in pantry, coat closet and one room with pinewood flooring. The second floor features two bedrooms; the main has a wonderful fireplace. A full bath and a hall linen closet complete the floor. The third floor is finished as a large third bedroom with lots of closet space and front and rear Colonial dormers; it provides the option of having both a third bedroom and a studio area. Original Colonial wide plank pine flooring run throughout the second and third floors. The unfinished original stone basement provides ample area for storage and a workshop, along with clothes washer and dryer and a utility sink. The spacious, fully fenced (30 by 70 feet) backyard and garden is private and is great for entertaining. The garden is planted with many perennials including a small raspberry patch with plots for planting veggies, and is divided from the lawn area by a brick path that leads to the separate brick building (15 by 15 foot with electricity) at the rear of yard which is shaded by a large maple tree. A small brick patio is just outside of the kitchen. On the side of the grassy yard area are four large bushes and trees which bloom at different times and enhance the privacy and enjoyment of this backyard and garden. Three SEPTA rail lines are in walking distance. By bus (30 feet around the corner from your door) the H, XH, or one block to Wayne Ave., the 53) take you to the Erie subway stop. A short walk away are Germantown Friends School, Greene Street Friends School and several city parks including the Wissahickon – Forbidden Drive just a 10-minute bike ride away. The house is a short distance from Drexel University College of Medicine, Thomas Jefferson East Falls campus, Germantown Cricket Club, popular Germantown Avenue (Uncle Bobby’s Coffee Shop) and so much more.  SEND NUMBER FOR MORE INFO","num_images":5,"lat":40.0338,"lng":-75.1731,"attrs":"['3BR \/ 2Ba', '2300ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T16:36:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/thorndale-ready-for-move-in\/7576338897.html","post_id":7576338897,"result_date":"Sun Jan 08 2023 21:42:44 GMT+0000 ","title":"Ready for move in","description":"About 1561 Montvale Cir\nThis property is a single family home that contains 2,002 sq ft and was built in 1976. It contains 2 bedrooms and 2 bathrooms. The house is two stories and has a basement. The house was renovated and equipped with new tiling two years ago as well as new wood flooring in one of the bedrooms. It has a large area in the front yard and back yard.","num_images":11,"lat":39.960659,"lng":-75.711499,"attrs":"['2BR \/ 2Ba', '2002ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-08T16:14:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-bring-your-furry-friend-to\/7576345549.html","post_id":7576345549,"result_date":"Sun Jan 08 2023 21:39:08 GMT+0000 ","title":"Bring your Furry Friend to This Great 2 bed \/ 2 bath! We Love Pets!","description":"The Gateway ApartmentsRENT: $2485 - $3051 \/ MONTH SIZE: 1199 sq ft  BEDROOMS: 2 BATHROOMS: 2 LEASE TERMS: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month show contact info\nUNIT FEATURES:   ➢ Air Conditioning & Heating➢ Cable Ready➢ Carpet➢ Den➢ Dining Room➢ Dishwasher➢ Garbage Disposal➢ Refrigerator, Freezer, Ice Maker➢ Tub\/Shower➢ Walk-In Closets➢ Built-In Microwave Oven➢ Disability Access (select homes)➢ Frost-Free Refrigerator\/Ice Maker➢ Garden\/Spa Tub (select homes)➢ Gas Fire Place (select homes)➢ Kitchen Pantry➢ Large Windows➢ Upgrade➢ Washer And Dryer In Each Apartment Home➢ Wired For High-Speed InternetResidents of our West Chester, PA apartments enjoy a spacious one or two bedroom floor plan which adds warmth and comfort to any lifestyle. The Gateway provides a number of lavish amenities, including a full kitchen, 9-foot ceilings, walk-in closets, and large windows. Our premier location is close to public transportation and the most prominent dining, shopping, and recreational venues in the area, making our community perfect for commuters all across Chester County. Schedule a tour of our West Chester community today and see why residents love coming home.PROPERTY FEATURES: ➢ Business Center➢ Clubhouse➢ Fitness Center➢ Onsite Maintenance➢ Onsite Management➢ Package Service➢ Picnic and Grilling Area➢ Pool and Sundeck➢ Storage Space➢ Walking\/Biking Trails➢ Across From Wawa & Goshen Crossing Shopping Center➢ Beautifully Landscaped Grounds➢ Garages For Lease➢ Gated Entrances➢ Maintenance Free Lifestyle➢ Onsite Leasing Office➢ Pet-Friendly➢ Resort-Style Pool With Sun Deck➢ Three BBQ\/Picnic Areas➢ Wi-Fi Access in Clubhouse and at Pool PET POLICY: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonVISIT OR CALL US TODAY!  1515 Manley RdWest Chester, PA 19380 show contact info\nWebsite: https:\/\/www.thegatewayapartments.com\/ All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYFC0F0603CBEC49\n","num_images":15,"lat":39.967056,"lng":-75.529129,"attrs":"['2BR \/ 2Ba', '1199ft2', 'available now', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T16:35:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-offer-available-renovated\/7576337989.html","post_id":7576337989,"result_date":"Sun Jan 08 2023 21:23:19 GMT+0000 ","title":"#Offer Available - renovated 2 Bedroom 1 Bath house - *(ME)*","description":"LOVELY RENOVATED TWO BEDROOM,ONE BATH APARTMENT HEART OF CITY Philadelphia.\nDesigned with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Philadelphia\nBenefits include: Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\nA state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating and TV\nLobby with our keyless entry system and secure package delivery,Fitness Center, Indoor bike storage maintenance stand, Electric vehicle charging stations, Enclosed residential parking garage\nUnit Features: Gas range cooktop, Washer and dryer, Nest thermostat AND DIGITAL DOOR LOCK. Text Your Number for more info --- lilacole852~gmailcom","num_images":4,"lat":40.0247,"lng":-75.0518,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T16:12:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-with-offstreet\/7576335638.html","post_id":7576335638,"result_date":"Sun Jan 08 2023 21:10:03 GMT+0000 ","title":"One bedroom with offstreet parking","description":"One bedroom\/washer and dryer in unit\/offstreet parking\/basement for tenant only\/Patio\/yard in the back of the apartment. Close to public transportation. Available first week in February","num_images":0,"lat":40.0402,"lng":-75.2231,"attrs":"['1BR \/ 1Ba', '01200ft2', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T16:06:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom-bath\/7576322680.html","post_id":7576322680,"result_date":"Sun Jan 08 2023 20:45:29 GMT+0000 ","title":"Renovated 2 Bedroom 1 Bath apartment in Philadelphia!!","description":"Renovated 2 Bedroom 1 Bath apartment in Philadelphia!! Designed with elegance in mind, offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping. Great location - close to everything. Eat-in Kitchen has bar, good storage space and a built-in hutch\/china cabinet. Spacious backyard - quiet neighborhood. 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping Heat is electric. RENT is $700.00 per month. Great Investment property! Four separate units available on February 5, 2023. Lease is month-to-month. All units are either fully furnished or semi-furnished with necessities. Beautiful, spacious, clean, quiet, two bedroom with a large open living room and dining room area, kitchen with panty, bathroom with tub and shower, second floor apartment very private. wont last. great area, off Street. small private back yard. Tenant responsible for electricity (landlord willing to discuss electric being covered in rent), landlord covers water\/sewer, trash, and WIFI.**PLEASE CALL OR TEXT:-  show contact info","num_images":4,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T15:29:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-warm-up-with-our-hot\/7576324846.html","post_id":7576324846,"result_date":"Sun Jan 08 2023 20:39:37 GMT+0000 ","title":"Warm Up with Our Hot Specials.","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 to 481 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nLeasing Specials\nReduced Security Deposit when you move-in by 2\/15\/2023 and apply within 48 hours of your tour! *Security Deposit reduced from 1 Month's Rent to $1,000.00!\nWaived Application Fee waived when you move-in by 1\/31\/2023 and apply within 48 hours of your tour! *Up to 2 application fees waived.\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our brand new apartment community offers you spacious Studio apartments in the sought after Fishtown\/Northern Liberties area.\nDwell 2nd Street is convenient to I-95, 676 and Girard Avenue, so getting around the city is a breeze whether you're driving, biking, walking or taking public transportation!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Full-size stackable Washer and Dryer in Unit\n» Expansive closets with dust free organizers\n» Wood style plank flooring in Living space\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» Controlled building access\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball\n» Game Room with Pool Table, Foosball and shuffleboard\n» Business Center and conference room\n» Bike storage and repair space\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced dog park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.  Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":23,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '481ft2', 'available jan 10', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T15:35:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/chester-city-view-renovated-bedroom\/7576324034.html","post_id":7576324034,"result_date":"Sun Jan 08 2023 20:37:17 GMT+0000 ","title":"\"City view\" Renovated 2 Bedroom 1 Bath apartment in Chester, PA!!","description":"Beautifully Renovated 2 Bedroom 1 Bath apartment in Chester, PA . Designed with elegance in mind, 2 bedroom apartments and stunning penthouses.\n2-bedroom and penthouse apartments in the heart of Chester, PA !!\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\n. TNX~~~~!!!\n","num_images":4,"lat":39.848912,"lng":-75.367164,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: !To Know Do [txt] thru \"reply\"', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T15:33:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-near-hospital-3bed-3bath\/7576322691.html","post_id":7576322691,"result_date":"Sun Jan 08 2023 20:33:30 GMT+0000 ","title":"Near Hospital!! 3Bed 3Bath Close to Shopping Center and Party Center","description":"welcome\nLuxury renovated 3 Bedroom 3 Bath apartment. Designed with elegance in mind, Estelle offers an impressive collection of 3 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Philadelphia\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you are interested, please send your number.\nPlease, Text Me\njonyhak8 (at)_gmail_(dot)com","num_images":3,"lat":40.0547,"lng":-75.1866,"attrs":"['3BR \/ 3Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T15:29:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-rental-opportunity\/7576306606.html","post_id":7576306606,"result_date":"Sun Jan 08 2023 20:32:43 GMT+0000 ","title":"Great rental opportunity in a great Northeast of Philadelphia area.","description":"Great rental opportunity in a great Northeast of Philadelphia area.\nFreshly Painted, New Floors installed,\nNewly remodeled kitchen offering granite tops, Breakfast island, stainless steel appliances.\nReady for occupancy.\nCentral air\nOne car garage.\n","num_images":0,"lat":40.0369,"lng":-75.0664,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2023-01-08T14:47:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-classic-apartment-2bed\/7576321220.html","post_id":7576321220,"result_date":"Sun Jan 08 2023 20:29:37 GMT+0000 ","title":"A Classic Apartment!! 2Bed 2Bath shopping just 5 minutes away","description":"welcome\nLuxury renovated 2 Bedroom 2 Bath apartment. Designed with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Philadelphia\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you are interested, please send your number.\nPlease, Text Me\njahke8 (at)_gmail_(dot)com","num_images":3,"lat":40.0634,"lng":-74.999,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T15:25:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-near-everything-1bed-1bath\/7576319899.html","post_id":7576319899,"result_date":"Sun Jan 08 2023 20:25:57 GMT+0000 ","title":"Near Everything! 1Bed 1Bath Close to Hospital, Shopping & Party Center","description":"welcome\nLuxury renovated 1 Bedroom 1 Bath apartment. Designed with elegance in mind, Estelle offers an impressive collection of 1 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Philadelphia\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you are interested, please send your number.\nPlease, Text Me\njonyhak8 (at)_gmail_(dot)com","num_images":3,"lat":40.0606,"lng":-75.0471,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T15:21:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-one-bedroom-available\/7576298868.html","post_id":7576298868,"result_date":"Sun Jan 08 2023 20:03:12 GMT+0000 ","title":"🐱 cozy one bedroom available Feb 10th 🐱","description":"Cozy 1 bedroom just off of Baltimore Avenue. The Florence Flats Is A Well Maintained And Affordable Building In Squirrel Hill. This adorable space is conveniently located near Clark Park, shopping, public transportation, University City, major highways, restaurants, Center City, And So Much More.\nThis apartment home has a beautifully updated kitchen with gas cooking, and a fantastic open concept floorplan. The bathroom has neutral tile, and a soaking tub. This space comes with a complimentary storage unit and there is coin operated laundry in the basement.\nBeautifully Updated Kitchens\nCentral Heat & Air\nClose Proximity To Upenn\nEasy Digital Leasing Process\nFree Storage Unit With Each Apartment\nPet Friendly\nShopping And Restaurants\nTiled Bathrooms\n","num_images":3,"lat":40.014,"lng":-75.187,"attrs":"['1BR \/ 1Ba', 'available feb 10', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T14:28:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/media-nice-rooms\/7576306244.html","post_id":7576306244,"result_date":"Sun Jan 08 2023 19:50:48 GMT+0000 ","title":"Nice rooms","description":"Good house","num_images":0,"lat":39.9188,"lng":-75.3991,"attrs":"['4BR \/ 2Ba', '2000ft2', 'available jan 15', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T14:46:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-beautiful-bedroom-bathroom\/7576303077.html","post_id":7576303077,"result_date":"Sun Jan 08 2023 19:42:42 GMT+0000 ","title":"Beautiful 1 bedroom 1 bathroom apartment in Philadelphia, PA","description":"Beautiful 1 bedroom 1 bathroom apartment in Philadelphia, PA Designed with elegance in mind, Estelle offers an impressive collection of 1 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping.\nEstelle offers one-bedroom and penthouse apartments in the heart of Philadelphia, PA.application fee $30 details, If you interested please contact:- show contact info","num_images":4,"lat":39.9375,"lng":-75.2637,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T14:38:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1br-1ba-at-1949-locust\/7576302654.html","post_id":7576302654,"result_date":"Sun Jan 08 2023 19:41:36 GMT+0000 ","title":"1BR\/1BA at 1949 Locust Street! Only Steps from Rittenhouse Square Park","description":"Available now!\nCall or text Annie at  show contact info\nwith any questions or to set up a showing!\nCredit must be in good standing. FICO score and credit history will be reviewed. Monthly income must exceed 3x the rent. No evictions or serious crimes. We only require the security deposit and first month's rent to move in (no last month's rent upfront!)\nThis 1BR apartment is located on the third floor of a walkup. Features include hardwood floors, central AC, in-unit laundry stainless steel appliances including dishwasher and garbage disposal.\nOnly steps from Rittenhouse Square Park! Conveniently located within walking distance of SEPTA bus routes, subway lines, rail lines, and trolley lines. Nearby 30th Street Station is served by SEPTA Regional Rail lines. There is easy access to University City and major roadways via the Walnut Street and South Street Bridges.\nWater is included in the rent. Only security deposit and first month's rent needed to move in! Credit must be in good standing. Cosigners considered.\nAddress: 1949 Locust Street #3F\nThis property is professionally managed by AMC Delancey Group.\nContact Annie to schedule a showing!\nAnnie Oliver\nAMC Delancey\nshow contact info\n- text me!\n","num_images":10,"lat":39.94932,"lng":-75.173523,"attrs":"['1BR \/ 1Ba', 'available jan 15', 'air conditioning', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-01-08T14:37:36-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-putting-green-pet-spa\/7576296414.html","post_id":7576296414,"result_date":"Sun Jan 08 2023 19:25:42 GMT+0000 ","title":"Putting Green , Pet Spa, Clubhouse with Game Room","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nHome is where the heart is, and here at The Point at Glen Mills, it's never been easier to love where you live. Contact us today to schedule your tour. You'll be glad you did!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with granite countertops, stainless steel appliances and a breakfast bar. this unit also features a large entry closet, full sized washer\/dryer, linen closets, and a private balcony. The bedrooms features walk-in closets, and ensuite bathrooms.\nApartment Features\n* Full sized Washer and Dryer in unit\n* Granite Countertops\n* Wood-Like Floors\n* Private Patio or Private Balcony (on select apartments)\n* Extra Storage","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1095ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-01-08T14:21:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-apartment-for\/7576292944.html","post_id":7576292944,"result_date":"Sun Jan 08 2023 19:23:21 GMT+0000 ","title":"Renovated Apartment For Rent!","description":"Beautifully fully renovated apartment, 1 unit of a duplex. New Flooring, new kitchens with modern white cabinet, granite counter top and all new appliances. New Bathroom, new water heater and new appliances. Security Deposit: $4800. 1 year lease duration. Landlord pays for water, renter pays for gas and electric.","num_images":12,"lat":40.056011,"lng":-75.147871,"attrs":"['2BR \/ 1Ba', 'available feb 1', '\\nwednesday 2023-01-11\\n', '\\nsaturday 2023-01-14\\n', 'application fee details: $30 application fee', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T14:12:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-professionally-managed\/7576294636.html","post_id":7576294636,"result_date":"Sun Jan 08 2023 19:20:44 GMT+0000 ","title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nWhen you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Community Kitchen\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Package Acceptance\n* Garage Parking\n* Sun Deck\n* TV Lounge\n* Playground\n* Long Term Lease Available\n* Extra Storage\n* Billiards\n* Outdoor Grill Area\n* Non Smoking Community\n* Community Lounge\n* Professionally Managed\n* Short or Long Term Lease Available\n* Renters Insurance is Required\n* Bark Park\n* WiFi Access\n* Fitness Studio\n* Bike Racks\n* Elevator\n* Credit Cards Accepted\n* Movie Theatre\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access\n* After-Hours Emergency Maintenance\n* EV Charging\n* Landscaped Courtyards\n* Controlled Access\n* Dry Cleaning and Laundry Service\n* Pet Salon\n* Gaming Area\n* Swimming Pool","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1128ft2', 'available jan 13', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T14:16:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-upstairs-you-have-three\/7576292424.html","post_id":7576292424,"result_date":"Sun Jan 08 2023 19:15:04 GMT+0000 ","title":"##Upstairs you have Three bed and two full bath##","description":"Start the new year in this very spacious home in the Valley of Roxborough.  All rooms are very spacious . upstairs you have Three bedrooms and two full baths . On the first floor you have living room , dinning room , Kitchen with an island\nIf you are interested, please send a TEXT: show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\nMove in-Ready\nAmazing renovated 2 Bedroom 1.5 Bath apartment heart of city Scranton.\nDesigned with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature, and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Essex Junction\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you interested please send your contact number, I will contact you as soon as possible asap.\n","num_images":4,"lat":40.0402,"lng":-75.2231,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T14:11:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-upstairs-you-have-three\/7576292385.html","post_id":7576292385,"result_date":"Sun Jan 08 2023 19:14:58 GMT+0000 ","title":"##Upstairs you have Three bed and two full bath##","description":"Start the new year in this very spacious home in the Valley of Roxborough.  All rooms are very spacious . upstairs you have Three bedrooms and two full baths . On the first floor you have living room , dinning room , Kitchen with an island\nIf you are interested, please send a TEXT: show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\nMove in-Ready\nAmazing renovated 2 Bedroom 1.5 Bath apartment heart of city Scranton.\nDesigned with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature, and shopping.\nEstelle offers two-bedroom and penthouse apartments in the heart of Essex Junction\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery\n· Fitness Center\n· Pool and spa\n· Pet spa\n· Indoor bike storage and maintenance stand\n· Electric vehicle charging stations\n· Enclosed residential parking garage\nUnit Features:\n· Gas range cooktop\n· Integrated countertop espresso machine\n· Wine cooler\n· Electric oven\n· Dishwasher\n· Washer and dryer\n· Nest thermostat\n· Digital door lock.\nIf you interested please send your contact number, I will contact you as soon as possible asap.\n","num_images":4,"lat":40.0402,"lng":-75.2231,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T14:10:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-imagine-living-on-14\/7576278468.html","post_id":7576278468,"result_date":"Sun Jan 08 2023 19:14:19 GMT+0000 ","title":"Imagine living on 14 beautiful acres, minutes from Pennypack Park","description":"Imagine living on 14 beautiful acres, minutes from Pennypack Park, in a fully upgraded apartment - in convenient Northeast Philly. You don't have to imagine. Rushwood makes it reality... Choose a 1- or 2-bedroom residence, with spacious closets, 6 different layouts, stainless-steel appliances, abundant natural light, and more. Beyond your walls, enjoy the pool, grilling station, fitness center, resident business center and Wi-Fi lounge, and lush grounds. Easily access I-95, Route 1, Center City, Philly's largest mall, universities, and 29,000 businesses. Give your number.","num_images":5,"lat":40.07809,"lng":-74.985095,"attrs":"['1BR \/ 1Ba', '920ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T13:34:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-stainless-steel-appliances\/7576291093.html","post_id":7576291093,"result_date":"Sun Jan 08 2023 19:11:40 GMT+0000 ","title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nApartment Features\n* Kitchen Island\n* Washer and Dryer in unit\n* Stainless Steel Appliances\n* Garden Tub\n* Walk-in Closet\n* Linen Closet\n* Private Patio or Private Balcony (on select apartments)","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T14:07:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-amazing-bedroom-bathroom-in\/7576290490.html","post_id":7576290490,"result_date":"Sun Jan 08 2023 19:10:07 GMT+0000 ","title":"Amazing 2 bedroom, 2 bathroom in Coatesville. 1178 SqFt!","description":"Community Location: 100 Cobblestone Dr - Coatesville, PA 19320 Rental Information: $1635 - $2255\/Month | 2 Bedroom 2 Bath | 1178 sq ftLeasing Options:  Variable show contact info\nApartment Amenities:  ● Built-In Microwave● Central Heat & Air Conditioning● Disability Access In Select Units● Dishwasher● Full-Size Washer & Dryer In Every Apartment● Mini Blinds On All Windows● Refrigerator\/Freezer With Ice Maker● Walk-In ClosetsProperty Features: ● Business Center● On-Site Leasing Office● Pet-Friendly● Private Garages In Select Units● 24-Hour Emergency Maintenance● Coffee Bar Clubhouse Kitchen● Resident Referral Bonuses Description: THE BEST APARTMENTS IN COATESVILLE, PA\nIf you're looking for the best apartments in Chester County, look no further than Millview Apartment Homes. Our world-class amenities, including a resort-worthy swimming pool, and clubhouse are better than any in the Coatesville area. Our professional leasing staff is eager to welcome you home to a carefree lifestyle. Please schedule a tour and come home to the best Coatesville, PA apartments.Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Call: Millview Apartments at  show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":15,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available jan 20', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T14:06:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-spacious-layout-with\/7576289892.html","post_id":7576289892,"result_date":"Sun Jan 08 2023 19:08:43 GMT+0000 ","title":"Spacious layout with private washer & dryer! 1088 SqFt 2 Bed, 2 Bath","description":"Millview ApartmentsVisit Our Community Today!100 Cobblestone Dr Coatesville, PA 19320  show contact info\nMillview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.Bedrooms: 2 |  Bathrooms:  2  Square Footage: 1088 sq ft Rental Pricing: $1616 - $2232\/Month  Our Residents Enjoy:  ❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral Bonuses This Unit Comes With: ❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In ClosetsWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ Phone-Number:  show contact info\nPet-Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Lease-Length: VariableCall for Directions  EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":12,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'available jan 20', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T14:04:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-ready-to-lease-bed-bath\/7576289309.html","post_id":7576289309,"result_date":"Sun Jan 08 2023 19:07:11 GMT+0000 ","title":"Ready to lease! 1 bed 1 bath home. Check us out!","description":"Millview Apartments - A place to call home! Bed: 1 \/ Bath: 1  Sq. Footage: 845 sq ft Rent: $1450 - $1946\/MonthTerms: Variable show contact info\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Our Apartment Homes Feature:   ❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In Closets Our Residents Enjoy:  ❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral BonusesContact Info: show contact info\n100 Cobblestone Dr Coatesville, PA 19320 Website: https:\/\/www.apartmentsincoatesvillepa.com\/Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. EQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":12,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'available jan 20', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T14:03:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-experience-the-dwell-2nd\/7576287508.html","post_id":7576287508,"result_date":"Sun Jan 08 2023 19:02:37 GMT+0000 ","title":"Experience the Dwell 2nd Street Lifestyle.","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:767-780 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nLeasing Specials\nReduced Security Deposit when you move-in by 2\/15\/2023 and apply within 48 hours of your tour! *Security Deposit reduced from 1 Month's Rent to $1,000.00!\nWaived Application Fee waived when you move-in by 1\/31\/2023 and apply within 48 hours of your tour! *Up to 2 application fees waived.\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 1BR floor-plans in the sought after Fishtown\/Northern Liberties area.\nConvenient to I-95, 676 and Girard Avenue, getting around the city is a breeze whether you're driving, taking public transportation or Uber\/Lyft!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home. Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":22,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '777ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T13:58:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-spacious-and-elegant-youve\/7576283339.html","post_id":7576283339,"result_date":"Sun Jan 08 2023 18:51:12 GMT+0000 ","title":"Spacious and elegant! You've found your ideal 2 bed \/ 2 bath!","description":"The Gateway ApartmentsVisit Our Community Today!1515 Manley Rd West Chester, PA 19380  show contact info\nConveniently located in prestigious Chester County, The Gateway offers unique one and two bedroom apartments with den options in a beautiful setting. Commbine the comforts of home with superior resident services and amenities such as our resort style pool, business center, fitness center, and walking trail.Bedrooms: 2 |  Bathrooms:  2  Square Footage: 1199 sq ft Rental Pricing: $2485 - $3051\/Month  Our Residents Enjoy:  − Business Center− Clubhouse− Fitness Center− Onsite Maintenance− Onsite Management− Package Service− Picnic and Grilling Area− Pool and Sundeck− Storage Space− Walking\/Biking Trails− Across From Wawa & Goshen Crossing Shopping Center− Beautifully Landscaped Grounds− Garages For Lease− Maintenance Free Lifestyle− Onsite Leasing Office− Pet-Friendly− Relaxing Fire Pit− Resort-Style Pool With Sun Deck− Storage Units For Lease− Three BBQ\/Picnic Areas This Unit Comes With: − Air Conditioning & Heating− Cable Ready− Carpet− Dining Room− Dishwasher− Garbage Disposal− High Speed Internet Access− Refrigerator, Freezer, Ice Maker− Tub\/Shower− Walk-In Closets− Built-In Computer Nook (select homes)− Disability Access (select homes)− Frost-Free Refrigerator\/Ice Maker− Gas Fire Place (select homes)− Kitchen Pantry− Large Windows− Mini Blinds On All Windows− Private Entrance To Each Unit− Vaulted Ceiling (select homes)− Wired For High-Speed InternetWebsite: https:\/\/www.thegatewayapartments.com\/ Phone-Number:  show contact info\nPet-Policy: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonLease-Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthCall for Directions  All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYFC0F0603CBEC49\n","num_images":15,"lat":39.967056,"lng":-75.529129,"attrs":"['2BR \/ 2Ba', '1199ft2', 'available now', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-08T13:47:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3br-3br-ft2-bed-bath-home\/7576276935.html","post_id":7576276935,"result_date":"Sun Jan 08 2023 18:49:46 GMT+0000 ","title":"3br - 3br - 1129ft2 - 3 bed, 2 bath home 1 level","description":"Quiet and attractive section of Greater Northeast Philadelphia- it has all the Northeast has to offer. Conveniently located near bus stops, shopping center and banks on Academy Road, and a hop, skip and a jump away from I-95 and Roosevelt Boulevard. Savvy buyers looking for a great value and opportunity, look no more! This well-loved, single-family, 3 bedroom, 1 bath home with a fireplace has good bones and is ready to be revitalized. The living room with ceiling to floor windows can be accessed from either the kitchen or the hallway, a large food pantry provides great storage, two bedrooms and one bathroom complete the first floor. Upstairs, you will find another bedroom and a workshop which can be converted into a fourth bedroom. Outside, a large backyard with a shed offers privacy along with endless possibilities to turn it into an outside oasis. Check out this home with tons of potential, make an appointment to see it while you still can!\nThank you for reading.","num_images":3,"lat":39.988363,"lng":-75.249874,"attrs":"['3BR \/ 2Ba', '1129ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-08T13:30:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-beautifully-furnished\/7576278023.html","post_id":7576278023,"result_date":"Sun Jan 08 2023 18:37:20 GMT+0000 ","title":"Beautifully Furnished Corporate Suite","description":"Available Now\nApt. 1305 — Royal floor plan — 1,293 sq. ft. — $5,496\nThis 3rd floor fully furnished royal boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture, a dining set and bar stools, stainless steel appliances. The master suite comes with an enormous walk-in closet and double sinks with a luminous shower. The guest bedroom is room as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1293ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-08T13:33:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedroom-and-penthouse\/7576267639.html","post_id":7576267639,"result_date":"Sun Jan 08 2023 18:10:32 GMT+0000 ","title":"Two-bedroom and penthouse apartments in the heart of bradenton","description":"Luxury renovated 2 Bedroom 1 Bath house. Designed with elegance in mind, Estelle offers an impressive collection of 2 bedroom apartments and stunning penthouses. By living here, you will be perfectly positioned between dining, culture, nature and shopping. Quartzite countertops, stainless steel appliances, and ample storage space. Up the stairs, you will find the master bedroom with newly updated full bath and two more bedrooms. Heading downstairs, a cozy living room with a fireplace makes you feel right at home. The downstairs also features a 4th bedroom and half bath. The backyard will welcome you with a quaint covered patio and plenty of space to create your own backyard oasis.\nEstelle offers two-bedroom and penthouse apartments in the heart of Bradenton\nBenefits include:\n· Rooftop patio with outdoor theater, barbecue pit, fire pit, lounge seating and\nCity view\n· A state-of-the-art kitchen and entertainment lounge with bar, fireplace, seating,\nand TV\n· Lobby with our keyless entry system and secure package delivery · Enclosed residential parking garage · Gas range cooktop · Integrated countertop espresso machine · Wine cooler · Electric oven · Dishwasher · Washer and dryer · Nest thermostat · Digital door lock.\nContact: TEXT  show contact info","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'no smoking', 'detached garage', 'rent period: monthly']","posted_date":"2023-01-08T13:06:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-yoga-and-ballet-studio\/7576263238.html","post_id":7576263238,"result_date":"Sun Jan 08 2023 17:58:35 GMT+0000 ","title":"Yoga and Ballet Studio, Visit Your New Home, Leasing Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nThe Point at Glen Mills offers all of the amenities your looking for and some you didn't even know you wanted. Check out our two-story clubhouse-complete with flat screen TVs, a 24-hour fitness center and a pool table. Enjoy our on-site yoga studio or our outdoor putting green. Visit us today!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Full sized Washer and Dryer in unit\n* Private Patio or Private Balcony (on select apartments)\n* Granite Countertops\n* Extra Storage\n* Wood-Like Floors","num_images":18,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-01-08T12:54:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath\/7576262783.html","post_id":7576262783,"result_date":"Sun Jan 08 2023 17:57:21 GMT+0000 ","title":"3 bed 2 bath","description":"Welcome home to this 3bedroom 2 Bathroom home with finished basement available for rental. This newly rehabbed property comes equipped with stainless steel appliances. Don’t wait this won’t last long. Call today. Credit score of 650 required for move in. 3 months rent required for move in.","num_images":15,"lat":40.04728,"lng":-75.153605,"attrs":"['3BR \/ 2Ba', '1360ft2', 'available now', 'application fee details: $50', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T12:53:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-perfectly-renovated-studio\/7576252777.html","post_id":7576252777,"result_date":"Sun Jan 08 2023 17:51:40 GMT+0000 ","title":"🧩 Perfectly renovated Studio 🧩","description":"Historic Brownstone In The Heart Of Rittenhouse Square. Easy Access To The Best Restaurants, Shopping And Attractions That Philadelphia Has To Offer\n24 Hour Emergency Maintenance\nCentral Heat & Air\nClassic Architectural Detailing\/Woodwork\nEasy Digital Leasing Process\nPerfectly Renovated Kitchen\nPet Friendly\nSpa Inspired Bathroom\n","num_images":4,"lat":40.014,"lng":-75.187,"attrs":"['0BR \/ 1Ba', 'available apr 10', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-01-08T12:26:40-0500"}]