[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554198998.html","post_id":7554198998,"result_date":"2022-11-06T03:12:26.000Z","title":"3 Bedroom in Northern Liberties with Parking!","description":"Torn between Fishtown and Northern Liberties? Well, welcome to 1101 N Hope Street. Located in The Rye Townhome community, which is perfectly situated 5 minute walking distance from the heart of Northern Liberties AND Fishtown.\nFeaturing 3 bedrooms, 3 full bathrooms, approx. 2,600 square feet, and PARKING. The only home in the community that is 19-feet wide, allowing for a more functional living area. The home was professionally and lovingly designed. Upon entering the home, you will see the stunning 10 foot ceilings, bamboo flooring throughout, shiplap feature wall, and large 8ft+ windows. The kitchen was updated with designer backsplash, custom pendant lights, quartz countertops, and brand-new cabinets including a wine fridge and pantry with pull-out shelves.\nThe second level features two nicely sized bedrooms with double-door sliding closets and custom wood closet organizers. The bathrooms on the second-floor feature Kohler fixtures, floating vanities with granite countertops, and contemporary mirrors and light fixtures. The primary suite is where you will fall in love. 10 foot ceilings, FOUR closets, and an updated primary on-suite! An elegant board and batten wall was added in 2022 along with brand new tile in the walk-in shower, vanity with marble countertop, and wood shelving.\nThe lower level provides ample additional living space! Complete with a home gym, custom built-in entertainment area, home office, laundry, and large storage closet. Convenient peg boards were added for organized storage throughout. The rear patio is private and secure- with a home-built dog porch potty with drain! No feature was spared to allow for a beautiful and functional lifestyle.\nBe in the midst of booming Northern Liberties walk to two grocery stores- Acme & Heirloom, coffeeshops, parks, dog parks, Market\/Frankford Septa line, and countless restaurants all within a 5 min walk! First, last, and security due up front. Pets welcome on case by case basis. Prefer 18 month lease.\nListing courtesy of Long & Foster Real Estate, Inc.\n","num_images":23,"lat":39.967482,"lng":-75.137267,"attrs":"['3BR \/ 3Ba', '2600ft2', 'available dec 19', 'air conditioning', 'application fee details: 40', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T22:56:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554191771.html","post_id":7554191771,"result_date":"2022-11-06T02:54:00.000Z","title":"House for Rent- C and Allegheny Area","description":"Two bedroom house for rent right off if C & Allegheny:\nEverything is new, appliances Stove, Microwave and Refrigerator; bathroom remodeled great Shower:\nQuaint cemented backyard perfect for BBQ with family and Friends. Big Screen TV which is staying in the home.\nHome is well insulated to keep love ones nice and warm doing the winter months. Available now:  With everything new this house won't last.\n","num_images":11,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 1Ba', 'available nov 14', 'house', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T22:14:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554195534.html","post_id":7554195534,"result_date":"2022-11-06T02:39:32.000Z","title":"Large 3 bed Room 2 bath Condo Home 2 Garage Parking Next to PATCO","description":"Spacious and Classic – Three- large bedroom (1962 sq. ft), two bath condo home, with additional large roof top office\/room and outdoor deck in desirable Haddonfield Commons! Freshly painted. Two garage parking spots. Private storage locker and bike storage area in garage.\nConvenient Central Location - Right in the heart of this amazing town of Haddonfield! Just blocks to restaurants, shops, the PATCO train station to Philadelphia, schools and parks. Blue Ribbon School District within walking distance\nGreat Open Layout - Living room, dining room and kitchen are all open to each other for a great layout and flow. Great Kitchen with granite counters and stainless appliances. Primary suite has a large bedroom with walk-in closet, and brand-new full bath with white and gray marble and tile. Two more spacious bedrooms with huge closets as well. Another full second bath with great amenities. Inhouse laundry with shelving and storage.\nBonus Room and Rooftop Deck: Great fourth room on the third level could be made into a bedroom, a home office, playroom, teenage lounge, exercise room. The rooftop deck is a wonderful feature just off the office. Eat dinner outside, or take your work out into the sun!\nOne month security. Rent includes water. Renter is responsible for internet, phone and electricity.\nInterested please email.","num_images":21,"lat":39.891905,"lng":-75.041874,"attrs":"['3BR \/ 2Ba', '1962ft2', 'available now', 'air conditioning', 'condo', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T22:35:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554187015.html","post_id":7554187015,"result_date":"2022-11-06T02:13:59.000Z","title":"Amazing 2 Bed 2 full bath apartment for rent!! (Philadelphia)","description":"Amazing 2 bedroom 2 full bathroom home located on 801 W Girard Ave, Philadelphia. This apartment very close to The Behavioral Wellness Center at Girard .  Enter into the living room with south-facing windows, exposed brick, and hardwood flooring throughout the home. The kitchen features stainless steel appliances, a hidden dishwasher, tons of useful counter space, a farmhouse sink, glass door leading to a private backyard. Upstairs you will find a large bedroom with a nice-sized closet with south-facing windows. You will also find a full bath with a tub on the second floor. There is also an open space that can be used as a bedroom, office, or flex space. This leads to a great deck overlooking the private backyard. The basement is fully finished and has great ceiling height. There is a full bathroom and laundry in the basement as well as an unfinished portion that is great for storage!\nIf you are interest please contract and  give your number Steven  will call you.\nThank You\n","num_images":4,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 2Ba', '8402ft2', 'application fee details: $50 lease processing fee', 'broker fee details: NO Broker Fee!', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', \"listed by: Pre-War Realty ONe MONTH's RENT!\", 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T21:47:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554157127.html","post_id":7554157127,"result_date":"2022-11-05T23:46:24.000Z","title":"$1,650 \/ 2br - 1160ft2 - Bright, Loft Style Space + Backyard, Fishtown","description":"This Bright Common renovation reframed this turn of the century row home into a sustainable gem in this era! Bills are low with efficient utilities and the space is filled with light through all months of the year!\nThis is a 2 bedroom, 1.5 bathroom row home with original pine floors, a loft style layout and artful details through out. The amenities include: dishwasher, washer, dryer, large backyard with permeable pavers + garden beds, a semi-finished basement that could be used as workspace. There is a gated alley entry from the street that is partially covered for bike storage.\nThis home is 3 blocks from the EL (blue line) which allows one to be in Center City within 15 minutes, 3 blocks from the Kensington Community Food Coop, Hello Donuts, Martha, Philadelphia Brewing Company, Franny Lous Porch, The Monkey Bar all within a close skip from the front door of this tiny street that also boasts a pocket park!\nTenant pays all utilities, except water.\nDecember 1st, 1 year lease, credit check needed.\nGet in touch soon to schedule a time to see the space and make this gem yours before the holidays!\n","num_images":9,"lat":39.985185,"lng":-75.124807,"attrs":"['2BR \/ 1.5Ba', '1160ft2', 'available dec 1', 'air conditioning', 'house', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T19:42:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554059273.html","post_id":7554059273,"result_date":"2022-11-05T20:51:05.000Z","title":"3 Bedroom Available Now!","description":"This is a stunning 3 bedroom \/ 2.5 bathroom single family home featuring GARAGE PARKING, hardwood floors, recessed lighting, in-unit laundry, central a\/c, balcony AND a roof deck, and gorgeous finishes throughout. This desirable home welcomes you into a sizable foyer or mud room with great space for shoe & coat storage. The modern staircase leads you upstairs to the main living space boasting an open floor plan for a bright & airy atmosphere. You’ll have tons of room for a variety of different furniture set ups and the space flows nicely back into the kitchen, separated by counter seating. Your beautiful kitchen features white shaker cabinets above & below, great prep space on the granite countertops, white subway tile backsplash, and a full lineup of sleek stainless steel appliances. There’s a powder room off of the kitchen to ensure that entertaining is a breeze! Continue upstairs to view 2 bedrooms, 1 full bathroom, and your in-unit washer & dryer. The back bedroom features a juliet balcony, and both bedrooms are spacious with wall-to-wall carpeting, abundant sunlight, and good closet space. The full bathroom is equipped with a lighted vanity and a fully tiled shower \/ tub combo. Head up to the primary suite boasting a fantastic walk-in closet, ceiling fan for year-round comfort, and a luxurious bathroom with dual sink modern vanity and standing shower with lovely glass doors. A balcony off of the primary suite provides the perfect spot to enjoy your morning coffee or unwind after a long day. You’ll have an unfinished basement for additional storage and off-street parking for ultimate convenience. Don’t forget to check out the city skylines from the vast roof deck on your tour today!\nWalking Distance to:\n- Human Robot 🍺\n- Suttons\n- Eeva\n- Reanimator Coffee\n- Original XIII\n- Front Street Cafe\n- Suraya\n- Hancock Park\nhttps:\/\/jg-realestate.com\/listing\/1620-n-5th-ct\/\nhttps:\/\/youtu.be\/UVM7aJ839mg\n","num_images":7,"lat":39.978,"lng":-75.1459,"attrs":"['3BR \/ 2.5Ba', 'available now', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T15:10:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554098322.html","post_id":7554098322,"result_date":"2022-11-05T20:48:11.000Z","title":"Fully carpeted comfortable floorplans at Silk Factory Lofts","description":"Silk Factory LoftsRENT: $1738 \/ MONTH SIZE: 809 sq ft  BEDROOMS: 1 BATHROOMS: 1 LEASE TERMS: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-Month show contact info\nUNIT FEATURES:   ❖ Cable & Hi-Speed Internet Ready❖ Courtyard View in select apartments❖ Dishwasher❖ Full Size Washer & Dryer❖ Large Windows❖ Range \/ Oven❖ Refrigerator\/Freezer❖ Secured Building Access❖ Storage Spaces❖ Upgraded Kitchens in Select Apartments❖ Cable & Hi-Speed Internet Ready❖ Courtyard View (select apartments)❖ Dishwasher❖ Full-Size Washer & Dryer❖ Large Windows❖ Range \/ Oven❖ Refrigerator\/Freezer❖ Secured Building Access❖ Storage Spaces❖ Upgraded Kitchens (select apartments)SEE WHAT YOU'VE BEEN MISSING  Discover an upscale lifestyle at Silk Factory Apartments. Our landmark historic building features a brick exterior, soaring ceilings, large windows, and a beautiful courtyard with outdoor lounge seating and firepits, a picnic and grilling area with gas grills, and a community herb garden. Inside your spacious loft-style apartment you'll find modern style from your updated kitchen with dishwasher, stove, refrigerator, and microwave, to central air conditioning, and a private in-home washer and dryer. Call us today for a tour!PROPERTY FEATURES: ❖ 18' Long Shuffle Board❖ Dog Wash Room❖ Elevator❖ Game Room & Free Wi-Fi❖ Laundry Facilities❖ Monthly Community Events❖ Pet-Friendly Community❖ Pool Table❖ Smoke-Free❖ Vintage Building❖ Beautifully Landscaped Grounds with Access to Local Businesses❖ Community Lounge featuring free Verizon Fios TV\/Wi-Fi❖ Courtyard featuring tasteful Outdoor Seating and Fire Pits❖ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi❖ Free Parking - 2 Spaces per Apartment Home + Guest Parking❖ Lobby Area with Complimentary Coffee❖ Maintenance-Free Lifestyle❖ Professional On-Site Management Team❖ Storage units - $50\/$75 per month❖ Within Walking Distance to Trains PET POLICY: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephVISIT OR CALL US TODAY!  200 S Line StLansdale, PA 19446 show contact info\nWebsite: https:\/\/www.silkfactoryapts.com\/ Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY261CE302F50E4B\n","num_images":24,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '809ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-05T16:44:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554092867.html","post_id":7554092867,"result_date":"2022-11-05T20:34:24.000Z","title":"Scenic walking trails, Pickle Ball Courts, Tennis","description":"Bedrooms: 1Bathrooms: 1.5Square Feet: 1559Date Available: 2022-11-05Address: One Applewood DriveHeritage Orchard Hill welcomes you to explore our 1-, 2-, and 3-bedroom Perkasie townhomes and schedule a tour to see everything our community has to offer. Enjoy beautiful apartment features, including 9-foot ceilings, a full-size in-unit washer\/dryer, a 3,300 sq. ft swimming pool, an on-site fitness center. Explore our photo gallery to see the contemporary, neutral decor and comfortable living spaces at Heritage Orchard Hill. Call  show contact info\nto speak to a leasing agent today and schedule a tour of your new home today or apply online!Learn more about all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.Our Leasing Office is ready to answer your questions about our luxury townhomes for rent in Perkasie, Pennsylvania. Whether you need extra space for remote working or virtual schooling, or just like to spend some time in a well-appointed townhome, we have the floor plans you are looking for. Reach out and let us show you how easy it is to move into our Bucks County townhomes today! Contact us today to schedule your self-guided or virtual tour! Amenities Include:Pet parkThree tot lots with modern play equipment3,300 square foot swimming pool with adjacent baby poolPet friendly (pets stay free)Pickle Ball CourtsMultiple shopping destinations just miles awayScenic walking trailsConvenient location1,800 square foot open-air deckTennisFitness center with high-tech sound system and televisions4,700 square foot clubhouse available for private partiesCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/qkorzyfs\/heritage-orchard-hill\n","num_images":8,"lat":40.3765,"lng":-75.2648,"attrs":"['1BR \/ 1.5Ba', '1559ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T16:30:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554085480.html","post_id":7554085480,"result_date":"2022-11-05T20:16:20.000Z","title":"Large 2br 2ba W\/Private Balcony! Pet Friendly! W&D in Unit!","description":"Millview Apartments Leasing Office:  100 Cobblestone Dr Coatesville, PA 19320 show contact info\nTake a look at what Millview Apartments has to offer! Our apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort-style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Rental Information: 2 Bedroom \/ 2 Bathroom \/ 1178 sq ft \/ $1646 - $2217\/Month  Lease Terms: VariableApartment Amenities:◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In ClosetsAdditional Information:◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral Bonuses Leasing Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM show contact info\nPet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. Website: https:\/\/www.apartmentsincoatesvillepa.com\/  Management Company: Paradise Management, LLC EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T16:12:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554085339.html","post_id":7554085339,"result_date":"2022-11-05T20:16:00.000Z","title":"24-hour emergency service, Pet-friendly, Designer window treatments","description":"Bedrooms: 3Bathrooms: 2Square Feet: 1870Date Available: 2022-11-05Address: Village WayEnjoy everything that Chalfont, PA has to offer when you lease a luxury townhome rental at Heritage Pointe! With a wide variety of 1-, 2-, and 3-bedroom floor plans, we are confident that you’ll find a townhome that fits you. Signature features and community amenities in your apartment were selected with your comfort in mind, including gourmet kitchens, patio\/deck, and dramatic 9-foot first-floor ceilings. View our photo gallery to see for yourself what we have to offer. Call  show contact info\nand schedule a tour with us today!Deposit is equal to one month’s rentAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.Check out the other Bucks County apartments buildings and current availability. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.We are ready to answer your questions about renting our townhomes in Bucks County, Pennsylvania. We offer some of the largest floor plans in the area. Whether you work from your home office, or are looking for an easy commute, Heritage Pointe is the perfect location and includes all the amenities you need. Give our Leasing Office a call today to schedule your self-guided or virtual tour! Amenities Include:Primary bedroom with cathedral ceiling and walk-in closetsCeiling fansBreakfast barSpacious lower levelsPatio \/ DeckGourmet kitchen with microwave, dishwasher, disposal, and stainless steel sink24-hour emergency servicePet-friendlyMove-in customer service orientationHardwood laminate floorsDesigner window treatmentsFull-sized upgraded washer\/dryer in each homeCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/h3fpzd4s\/heritage-pointe\n","num_images":8,"lat":40.2892,"lng":-75.2149,"attrs":"['3BR \/ 2Ba', '1870ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T16:12:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554084105.html","post_id":7554084105,"result_date":"2022-11-05T20:13:10.000Z","title":"🍂One-Month FREE- W\/D, PETS, Breakfast Bar, 24\/7 Gym","description":"🍂FALL in Love with Wynnewood- Apply Now - Receive One-Month FREE🍂\nApt #C-11 First floor apartment with beautiful courtyard view. Newly renovated and close to the train!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Thursday: 9 am-6 pm, Friday 9 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY","num_images":22,"lat":40.0,"lng":-75.276,"attrs":"['1BR \/ 1Ba', '663ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T16:09:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554084041.html","post_id":7554084041,"result_date":"2022-11-05T20:13:00.000Z","title":"Conveniently Located! 2br 2ba W\/A Wooded View! Call For More Info!","description":"Millview Apartments Visit our community today! 100 Cobblestone Dr Coatesville, PA 19320 show contact info\nUnit Rates:  $1649 - $2219\/month Unit Type: 2-BR 2-BA Unit Size: 1088 sq ftLease Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.What you’ll find in our community: ✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral BonusesDescription: Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.This unit comes with: ✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In ClosetsCall or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Property Management: Paradise Management, LLCEQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T16:09:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554082396.html","post_id":7554082396,"result_date":"2022-11-05T20:09:12.000Z","title":"Comfortable living. Conveniently located, spacious 1 bed 1 bath!","description":"Millview ApartmentsRENT: $1572 - $2042 \/ MONTH SIZE: 845 sq ft  BEDROOMS: 1 BATHROOMS: 1 LEASE TERMS: Variable show contact info\nUNIT FEATURES:   ➢ Built-In Microwave➢ Central Heat & Air Conditioning➢ Disability Access In Select Units➢ Dishwasher➢ Full-Size Washer & Dryer In Every Apartment➢ Mini Blinds On All Windows➢ Refrigerator\/Freezer With Ice Maker➢ Walk-In ClosetsNestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!PROPERTY FEATURES: ➢ Business Center➢ On-Site Leasing Office➢ Pet-Friendly➢ Private Garages In Select Units➢ 24-Hour Emergency Maintenance➢ Coffee Bar Clubhouse Kitchen➢ Resident Referral Bonuses PET POLICY: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.VISIT OR CALL US TODAY!  100 Cobblestone DrCoatesville, PA 19320 show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ EQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":13,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T16:05:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554075155.html","post_id":7554075155,"result_date":"2022-11-05T19:51:13.000Z","title":"Willow Bend - Nice 2 bedroom with 2 bathrooms available now","description":"WILLOW BEND APARTMENTS\n944 E. Johnson St\nPhiladelphia, Pa 19138\nWillow Bend Apartments. Nice 2 bedroom with brand new bathroom available. Call Lisa for details\nOur Mount Airy, pet friendly, apartments offer the best in amenities with garden style apartments featuring spacious closets, modern lighting, and hardwood flooring in select units. Brand new gym will be open in a few weeks.\n* Separate kitchen with gas range\n* Individual climate control\n* On-site laundry facilities\n* Controlled Access\n* Off-street permit parking\n* Nearby access to 309 and 611\n* Pet Friendly\nBrand new fitness room opening soon.\nCall Lisa for details\n","num_images":10,"lat":40.054715,"lng":-75.173323,"attrs":"['2BR \/ 2Ba', '991ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T15:47:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554072345.html","post_id":7554072345,"result_date":"2022-11-05T19:44:33.000Z","title":"Gardens of Mt. Airy nice studio available... Call Lisa for appt.","description":"GARDENS OF MT. AIRY\n1133 E. Mt. Airy Ave\nPhiladelphia, PA 19150\n*** Move in Special **$250 off 1st month rent on **selected units. Must move by 11\/30\/2022. Ask Lisa for details\nCats are welcome!!\nA12 Apartment - 1 bedroom $1158 monthly rent.\nA9 Apartment -2 bedroom apartment with walk-in closet available for now at Gardens of Mt. Airy Apartments.\nMt. Airy apartments for rent with nice high ceilings, generous closet space and other fine amenities.\n* Free heat, hot water, and cooking gas\n* Hardwood flooring in select apartment homes\n* Over-The-Range Microwave\n* Large Closets\n* Controlled Access\n* Cats Welcome\nGardens of Mt. Airy apartments is a jewel located in the Mt. Airy section of Philadelphia identified by MONEY Magazine as one of the \"Best Big City Neighborhoods.\"\nThis apartment will rent quickly, so call us to schedule an appointment and reserve this unit today\n","num_images":12,"lat":40.0726,"lng":-75.1706,"attrs":"['0BR \/ 1Ba', '350ft2', 'available now', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T15:40:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553919784.html","post_id":7553919784,"result_date":"2022-11-05T14:07:08.000Z","title":"3 Bedroom house","description":"BEAUTIFUL 3-BEDOROOM HOUSE\nVERY SPACIOUS\nNEW CARPET ON 2ND FLOOR\nRENOVATED BATHROOM WITH TILES\nNEW FLOORS ON 1ST FLOOR\nBEAUTIFUL KITCHEN WITH NEW COUNTERTOP\nWASHER AND DRYER LOCATED IN BASEMENT\nFRONT PORCH\nCLOSE TO SCHOOL AND TRANSPORTATION\n1732 SCATTERGOOD STREET 19124","num_images":10,"lat":40.0369,"lng":-75.0664,"attrs":"['3BR \/ 1Ba', 'available now', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:03:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553914668.html","post_id":7553914668,"result_date":"2022-11-05T14:04:19.000Z","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #4\nBI-LEVEL\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":22,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:48:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553913982.html","post_id":7553913982,"result_date":"2022-11-05T14:02:16.000Z","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #4\nBI-LEVEL\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":22,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:46:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553913262.html","post_id":7553913262,"result_date":"2022-11-05T14:01:10.000Z","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #4\nBI-LEVEL\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":22,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:44:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553917359.html","post_id":7553917359,"result_date":"2022-11-05T14:00:47.000Z","title":"3 Bedroom house","description":"BEAUTIFUL 3-BEDOROOM HOUSE\nVERY SPACIOUS\nNEW CARPET ON 2ND FLOOR\nRENOVATED BATHROOM WITH TILES\nNEW FLOORS ON 1ST FLOOR\nBEAUTIFUL KITCHEN WITH NEW COUNTERTOP\nWASHER AND DRYER LOCATED IN BASEMENT\nFRONT PORCH\nCLOSE TO SCHOOL AND TRANSPORTATION\n1732 SCATTERGOOD STREET 19124","num_images":10,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 1Ba', 'available now', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:56:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553917265.html","post_id":7553917265,"result_date":"2022-11-05T14:00:31.000Z","title":"Laundry in Unit, Lease Today, Convenient Location","description":"Looking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Yoga Lounge\n* Pet Salon\n* Swimming Pool\n* Community Lounge\n* TV Lounge\n* Putting Green\n* Professionally Managed\n* Sun Deck\n* Bocce Ball\n* Easy Freeway Access\n* Bark Park\n* Minutes from Restaurants, Shopping, and Much More\n* Outdoor Grill Area\n* Fitness Studio","num_images":18,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T09:56:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553916653.html","post_id":7553916653,"result_date":"2022-11-05T13:58:42.000Z","title":"Charming 2-bed Unit condominium in Center City!","description":"Gorgeous bi-level condominium in Center City! The home features a contemporary eat-in kitchen (granite countertops, stainless steel appliances) on the main level, along with a bedroom and full bathroom. Downstairs, you'll find the living room, as well as another bedroom and a full bathroom with a tub. Enjoy central air, in-unit laundry, walk-in closets, a dishwasher, and hardwood floors throughout. The south-facing windows provide lots of light. Short walk to Rittenhouse Square, Broad Street Subway, and dozens of restaurants\/shops.\n1343 Lombard St #A","num_images":6,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '982ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:54:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553916486.html","post_id":7553916486,"result_date":"2022-11-05T13:58:06.000Z","title":"Bi-level 1-bed Apt in the Spring Garden Section of Philadelphia","description":"Live at 1504 Green St unit #1F, a bi-level 1-bedroom apartment in the Spring Garden section of Philadelphia. This home features a modern and updated living space with a large window, an island kitchen with stainless steel appliances and private access to a small balcony area, and a spacious lower level bedroom with a huge closet and en suite bathroom. This apartment is a couple of blocks from the new Giant, Retro Fitness, BSL Station, and plenty more.\n1504 Green St #1F","num_images":5,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:54:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553916186.html","post_id":7553916186,"result_date":"2022-11-05T13:57:12.000Z","title":"3 Bedroom house","description":"3 Bedroom House\nNew Woods Floors\nNew Tile Floors\nNew Bathroom\nNew Kitchen\nClose to transportation\nClose to school\nLarge Front Porch\nLocation: 708 E. Madison Street 19134\nPlease do not e-mail, phone calls are answered faster  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html","num_images":7,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 1Ba', 'available now', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:53:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553915782.html","post_id":7553915782,"result_date":"2022-11-05T13:55:48.000Z","title":"3 Bedroom house","description":"3 Bedroom House\nNew Woods Floors\nNew Tile Floors\nNew Bathroom\nNew Kitchen\nClose to transportation\nClose to school\nLarge Front Porch\nLocation: 708 E. Madison Street 19134\nPlease do not e-mail, phone calls are answered faster  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html","num_images":7,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 1Ba', 'available now', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:51:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553915649.html","post_id":7553915649,"result_date":"2022-11-05T13:55:24.000Z","title":"BiLevel 3BD 2.5BA OWNER's UNIT Delancey PL central heat\/AC avail NOV!","description":"Never before rented Bi-Level owner's unit with all the touches of prior owners who lived and upgraded the unit over 40years.\nHistoric modern upgrades. High ceilings XL rooms with inlaid hardwood floors too many details to mention! Off st pkg in neighborhood! PATIO access!\nEat in Kitchen with wood cabinets, leaded glass inserts, SS appliancces, Island with seating, gas range, french door refrigerator!\nGas fireplace with carved stone mantle, ceiling fans, insustrial lighting, beam ceilings, mini-split HVAC, granite tops, lots of built in storage and shelving. All with views to Fitler Square.\nMassive 2nd floor master bedroom (was separate unit at one time) with inlaid wood floor original fireplace\/mantle. lg windows with original shutters and views directly to Rittenhouse Square. NEWly reno master BA. Restored bath with wht ceramic tile antiue wall paper and reclaimed wainscott.\nXL 2nd bedroom (opposite end of hall for privacy) with inlaid floors, built in shelving, good closet space and views to Delancy Pl. with original window shutters.  Newly updated 2nd bath with marble tub surround, cement tile floor and solid wood vanity. 2nd floor side by side LG W\/D. Central air on separate zone.\nSeparate DEN\/OFFICE\/3RD BD with views up 2300 block Delancey Pl. Great if anyone works from home or separate project room away from hustle and bustle of the household. PS owner will pay 1 car garage parking in the neighborhood. PATIO shrd with 1 unit.\n","num_images":20,"lat":39.948031,"lng":-75.178287,"attrs":"['3BR \/ 2.5Ba', '02150ft2', 'available nov 12', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:51:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553912406.html","post_id":7553912406,"result_date":"2022-11-05T13:54:27.000Z","title":"2 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3\nBI-LEVEL\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":9,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:41:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553915331.html","post_id":7553915331,"result_date":"2022-11-05T13:54:24.000Z","title":"3 Bedroom house","description":"3 Bedroom House\nNew Woods Floors\nNew Tile Floors\nNew Bathroom\nNew Kitchen\nClose to transportation\nClose to school\nLarge Front Porch\nLocation: 708 E. Madison Street 19134\nPlease do not e-mail, phone calls are answered faster  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html","num_images":7,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 1Ba', 'available now', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:50:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553907613.html","post_id":7553907613,"result_date":"2022-11-05T13:53:23.000Z","title":"Spacious 1 Bed Apt in a Landmark Building With a Newly Renovated Lobby","description":"ONE MONTH FREE SPECIAL FOR APPLICATIONS SUBMITTED BY 9\/30!!! $500 Security Deposit and 1st Month's Rent to move-in!! Spacious 1 Bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block away from Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit.\n1411-1 Walnut St #206","num_images":7,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:26:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553911790.html","post_id":7553911790,"result_date":"2022-11-05T13:51:28.000Z","title":"2 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3\nBI-LEVEL\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":9,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:39:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553911208.html","post_id":7553911208,"result_date":"2022-11-05T13:50:40.000Z","title":"2 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3\nBI-LEVEL\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":9,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:37:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553908162.html","post_id":7553908162,"result_date":"2022-11-05T13:45:20.000Z","title":"One-of-a-kind Dramatic Sun-filled Home With Towering Ceilings","description":"One-of-a-kind dramatic sun-filled home with towering ceilings, exposed brick and covered garage parking on a virtually hidden block in the historic Society Hill section of Philadelphia. This home features three levels of living with a massive living room, half bath, dining room and full kitchen conveniently located on the first floor. Following the exposed brick and sun drenched stairs up to the second level opens you to your first two bedrooms, laundry, and first full bathroom. Your master is revealed to you after a long private corridor greeting you with his and hers full bathroom with walk-in closet and tremendous shower room. The third floor features a romantic full floor fourth bedroom option with exposed beams and unprecedented privacy. Those of you who enjoy walkability, shops and a nightlife you can leave at the club will love the accessibility this home offers. Being footsteps away from some of the best restaurants, cafes and farmers markets this home allows you to enjoy the finer things the city has to offer. Highlights of the neighborhood include, The Twisted Tail, Bloomsday Café, Bistro Romano. In the mood for something else? Cherry street pier, Spruce Street Harbor park and Liberty point are only a 15 minute walk. Experience 114 Naudain in person and set up your tour today! Unit is part of an HOA which is included in monthly rent.\n114-18 Naudain St #G\n","num_images":6,"lat":39.9362,"lng":-75.1563,"attrs":"['4BR \/ 3.5Ba', '1973ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T09:28:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553905563.html","post_id":7553905563,"result_date":"2022-11-05T13:45:15.000Z","title":"$500 Security Deposit - Limited Time Move In Special!!","description":"ONE MONTH FREE FOR APPLICATIONS SUBMITTED BY 10\/31!!! $500 Security Deposit - Limited Time Move In Special!! 1 Bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block away from Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit.\n1411 Walnut St #1203\n","num_images":8,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:19:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553910348.html","post_id":7553910348,"result_date":"2022-11-05T13:39:03.000Z","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR AND A HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH  STREET 19121","num_images":23,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:35:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553909448.html","post_id":7553909448,"result_date":"2022-11-05T13:36:12.000Z","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR AND A HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH  STREET 19121","num_images":23,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:32:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553908852.html","post_id":7553908852,"result_date":"2022-11-05T13:34:31.000Z","title":"Pets Welcome, Lease Today, Quiet Community","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nApartment Features\n* Stainless Steel Appliances\n* Kitchen Island\n* Walk-in Closet\n* Private Patio or Private Balcony (on select apartments)\n* Garden Tub\n* Washer and Dryer in unit\n* Linen Closet","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '733ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-05T09:30:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553908716.html","post_id":7553908716,"result_date":"2022-11-05T13:34:03.000Z","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR AND A HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH  STREET 19121","num_images":24,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:30:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553906872.html","post_id":7553906872,"result_date":"2022-11-05T13:27:53.000Z","title":"This Spacious Bi-level Apartment Incredible Location!","description":"This spacious bi-level apartment checks all of the boxes... hardwood floors, central heat\/AC, gas cooking, dishwasher, in-unit laundry, outdoor space, and an incredible location! In fact, this location has a Walk Score of 98, surrounded by some of the city's best coffee shops\/brunch spots (Shot Tower Coffee, Fitzwater Cafe, etc) and neighborhood favorites new and old such as Fitz on 4th, Saloon Restaurant, & Little Fish. Inside the apartment you'll enjoy the top two floors (2nd\/3rd) of the building, so no one living above you. The massive living room with exposed brick walls, 1\/2 bathroom, laundry, and kitchen\/dining area are all located on the 2nd floor. Off of the kitchen\/dining room you can enjoy the first of two decks, convenient for grilling and outdoor dining. On the top floor there is a full bathroom and 3 spacious bedrooms, all with full closets. The rear bedroom also has a sliding door which leads out to your 2nd private deck. Property is vacant and can be scheduled on short notice!\n762 S 5th St","num_images":8,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1.5Ba', '1408ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T09:23:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553902033.html","post_id":7553902033,"result_date":"2022-11-05T13:27:49.000Z","title":"Updated contemporary layout, featuring original hardwood and spacious","description":"Updated contemporary layout, featuring original hardwood and spacious floorplan. Tons of natural light and perfect location in Society Hill, close to the upcoming Heirloom grocery! Inquire to check out our video tour and floorplan. Space is currently under renovation and photos marketed are of similar unit in building. All stainless kitchen with granite countertops, dishwasher, and disposal. Central eat-in kitchen with front livingroom overlooking greenery on Lombard with community center\/park across the corner. Living room features a wide layout, perfect for entertaining -complete with midcentury modern fireplace. Bedrooms are located at the front and rear of the unit, perfect for privacy. Each bedroom is sized for queen bedsets and have large closet space. Laundry in-unit with storage throughout. Property Highlights: - Well maintained building - Light filled - Working fireplace - Storage throughout - Washer\/dryer in unit - Stainless steel kitchen - Hardwood throughout - Central air - Caring and professional landlord Available now Tenant covers gas\/electric Flat $35\/mo water fee\n334 Lombard St #211","num_images":7,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '950ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T09:06:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553906513.html","post_id":7553906513,"result_date":"2022-11-05T13:26:34.000Z","title":"Truly unique, stunning Fishtown townhouse w\/ PARKING for lease!","description":"Truly unique, stunning Fishtown townhouse w\/ PARKING for lease! The first level of the home is the garage that spans the length of the home followed by the rear yard that can be used for gardening, relaxing and entertaining. Up the stairs you have the main level of the home that is completely open with massively tall ceilings and incredible natural light. The tiered level has the living and dining space on the lower level and full kitchen with eat in nook on the upper level. The kitchen has been recently remodeled with new countertops and fixtures. The top level features three bedrooms, stackable laundry closet, hall bathroom and a brand new primary bathroom. The primary bathroom is jawdropping with accented barn door, wall to wall mirrors, gorgeous tiling, waterfall shower and free standing tub. Through the primary bedroom is access to the green roof deck. The roof deck is lined with succulents to make it a true \"green\" roof, has panoramic views of the city, and tons of space for get togethers. Lastly, but perhaps the biggest selling point is the prime location in fishtown right off of Frankford ave and next to Palmer park. The home is just steps away from some of the best dining\/restaurants in the city such as Suraya, Wm Mulherin's & sons, Pizzeria Beddia and La Colombe. This is a rare rental in a perfect location. **Owner would like to keep the back parking spot for his wood work space but could be leased for an additional $200 per month. Home can be rented furnished for an additional $200 per month.\n401 Memphis St","num_images":9,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2Ba', '1894ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T09:22:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553901620.html","post_id":7553901620,"result_date":"2022-11-05T13:26:26.000Z","title":"Here is your fantastic opportunity to rent a perfectly updated!!","description":"Here is your fantastic opportunity to rent a perfectly updated and lovingly customized home in booming Northern Liberties—available for immediate move-in! The first floor has an open concept living area with warm wood floors. The gorgeous kitchen features wood cabinetry with plenty of storage, stainless steel appliances and a modern tile backsplash. There’s a small yard out back, and an unfinished basement down below for storage. Up on the 2nd floor you’ll find a large bedroom with custom closets, bathroom with full size washer and dryer, plus an open den area perfect for working from home, working out, making art, doing yoga etc. so many options with a flex space. The third floor has a whole suite; primary bedroom, lovely, updated bathroom, custom closets and a fabulous roof deck giving you a private oasis to relax. Pets considered on a case-by-case basis, easy online application. Schedule a tour and start packing!\n1120 O'Neil St","num_images":5,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1240ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T09:05:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553903081.html","post_id":7553903081,"result_date":"2022-11-05T13:25:42.000Z","title":"Wonderful large 3 bedroom, 2.5 bath home w\/beautiful private rear yard","description":"Wonderful large 3 bedroom, 2.5 bath home w\/beautiful private rear yard, deck and 1 car off street parking is now available for rent on one of the sweetest blocks in Fairmount. Rear yard has access to historic 'Pigs Alley' which is gated and shared by neighbors- it's a true neighborhood treasure. Enjoy a large open living and dining room area w\/sliders to a brick patio and fenced back yard, perfect for outdoor family time, grilling and entertaining. 1st floor offers half bathroom and efficient kitchen with brand new fridge, dishwasher, microwave, sink and fixtures. Super-sized primary bedroom, full hall bath and laundry w\/washer and dryer on the 2nd floor. Newly installed Sliding glass door to private deck off of the primary bedroom and large closets. Top floor has two additional bedrooms both with great closet spaces. Warm wood floors throughout and lots of natural light add to the charm. One car off street parking is included w\/rent located just steps away at the monthly lot on 23rd Street. Fantastic location close to the River, Museums-packed w\/local amenities and lots of shopping, bars\/restaurants and all the convenience this vibrant neighborhood offers. Online application available. Requires 3 months total rent for move in. Available November 1st.\n2331 Perot St","num_images":6,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 2.5Ba', '2400ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:10:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553906102.html","post_id":7553906102,"result_date":"2022-11-05T13:25:07.000Z","title":"Don’t miss the opportunity to rent at the Pepper Building!","description":"Don’t miss the opportunity to rent at the Pepper Building! A boutique mid-rise located just steps away from historic Rittenhouse Square. This fully remodeled 2 bedroom, 2 bathroom bi-level apartment comes complete with gleaming hardwood floors, updated appliances and fixtures, nest thermostat, sleek quartz countertops, and brand new whirlpool washer and dryer. The ENORMOUS private outdoor space is perfect for enjoying your morning coffee or for soaking in the views with friends in the evening with your libation of choice. The Pepper Building is extremely PET FRIENDLY and your pets will be greeted with treats and hugs upon arrival! Community amenities include outdoor courtyard with grills, luxurious common room with Wi-Fi, and state-of-the-art fitness center just to name a few. The Pepper Building is professionally managed and is secured with 24 hour security and concierge services.\n1830 Lombard St #1108","num_images":8,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '1092ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:21:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553905962.html","post_id":7553905962,"result_date":"2022-11-05T13:24:44.000Z","title":"This 1 bed, 1 bath condo WITH PRIVATE ROOF DECK","description":"Available for move-in early November - This 1 bed, 1 bath condo WITH PRIVATE ROOF DECK and shared rear yard is waiting for you!!! Old world charm mixed with new modern finishes! Best lay-out in the building with 15 ft. high ceilings creating a spacious living area. Hardwood flooring through-out. Eat-in kitchen featuring quartz tops and stainless steel appliances. Large bedroom with large closet & custom storage space. Building features a private roof deck designated to the unit with unobstructed center city skyline views, a shared back yard on ground level and large storage closet in the basement included! ! Fantastic location - walking distance to center city, local restaurants and night life. Easy street parking. Residential quiet block but still close to the action! (note: bedroom color is now neutral - not blue!)\n729 S 12th St #200","num_images":7,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '529ft2', 'available now', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:20:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553899861.html","post_id":7553899861,"result_date":"2022-11-05T13:24:15.000Z","title":"Large Bright Apt for Rent in One of the Best Neighborhoods in Philadel","description":"One of a kind, large bright apartment for rent in one of the best neighborhoods in Philadelphia. This house is nestled on a beautiful tree lined street in the heart of washington SQ West. This home boast 3 full bedrooms and 2 full bathrooms. There are hardwood floors throughout the entire apartment with a lot of closets and storage area. There is a beautiful deck, with grill included, outside of the large eat-in kitchen and dining room on the 3rd floor. The home has central air, washer & dryer, garbage disposal, dishwasher and so much more. This unique home is a very rare find so set up your showings today! There is an additional space on the main floor, great for a small non-retail business that can be rented for an additional $400\/monthly\n1102 Manning St #2","num_images":7,"lat":39.9487,"lng":-75.1593,"attrs":"['3BR \/ 2Ba', '1550ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T08:59:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553902761.html","post_id":7553902761,"result_date":"2022-11-05T13:20:27.000Z","title":"**4 bedroom 2 bathroom house with rooftop deck. **","description":"Welcome to 1208 N Hancock a **4 bedroom 2 bathroom house with rooftop deck. ** with addition is 1861 Sf. This is your beautiful red brick classic Philadelphia home. Head up those front steps and into your front door where you'll walk into a big bright open floor plan living room, dining room and kitchen. The first floor has a ceiling fan, big windows, recessed lighting and hardwood floors throughout. The kitchen has a breakfast bar, dual colored cabinets, ample counter space and storage with stainless steel appliances and a wine fridge! Head out those big beautiful sliding doors and head out to your backyard that has a perfect area for a bbq or entertaining, or even some potted plants. Go back inside and head upstairs where you'll find 2 bedrooms that are full of natural light, ample closet space and a full spacious bathroom on the same floor. Head up to the third floor where you'll find 2 bedrooms to include the owners suite with a double closet and a full bathroom has glass doors, a double sink and large mirror with built in light around it. Head out the door that leads out to the roof deck where you can see blue skies for day! The basement of this home is semi finished with a washer and dryer and tons or space for storage. This home has great space and will make nice home. rent this great house\n1208 N Hancock St","num_images":7,"lat":39.978,"lng":-75.1459,"attrs":"['4BR \/ 2Ba', '1861ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:09:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553904084.html","post_id":7553904084,"result_date":"2022-11-05T13:18:26.000Z","title":"Lease Today, Playground, Luxurious Bathrooms","description":"Schedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '833ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-11-05T09:14:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553903477.html","post_id":7553903477,"result_date":"2022-11-05T13:16:06.000Z","title":"2 bed\/2bath - Luxury Living","description":"Balmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":23,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-05T09:12:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553902379.html","post_id":7553902379,"result_date":"2022-11-05T13:12:04.000Z","title":"Available now ! Three story home with basement and patio\/yard","description":"Available now ! Three story home with basement and patio\/yard. The home offers high ceilings on first level and includes a living\/dining area with newer laminate flooring and newer kitchen with wood cabinetry, ceramic tile floor, dishwasher, disposal, refrigerator, range, and stainless steel hood. The second floor includes two bedrooms and a newer bath with full tub and ceramic tile finishes. The third floor is a large room perfect for third bedroom or family room area. Original hard wood flooring on upper levels. Washer and dryer on site. Gas hot air heat. Garden area at rear yard. Walking distance to South Street Bridge, Fitler Square, Rittenhouse Square, and Center City .The tenant pays for all utilities. First, last and security due at signing.\n514 S 22nd St","num_images":7,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 1Ba', '1275ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T09:08:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553898965.html","post_id":7553898965,"result_date":"2022-11-05T13:09:56.000Z","title":"Center City Philadelphia Apts Near Rittenhouse Sq Be a part of history","description":"Offering Studio, 1 & 2 bedroom apartments. Center City Philadelphia Apartments Near Rittenhouse Square Be a part of history! ICON mixes the beauty of the past with the modern amenities of today. Included on theÃ‚Â National Register of Historic Places this incredible rental building soars to new heights, just like its iconic, ziggurat-topped peak. Looking for a downtown Philadelphia apartment nearÃ‚Â Rittenhouse Square? You've found it! ICON is the most exciting rental property to ever grace Rittenhouse Square. A quintessential example of the Art Deco exuberance that defined the 1920s and 30s, ICON's design is inspired by Art Deco's geometric shapes and today's streamlined lifestyle. With this historic luxury building, you can be within steps of all the fine dining, high-end retail and cultural offerings that Philadelphia has to offer. The most fashionable edifice of its day, ICON is as rich in history as it is in beauty. Opened in 1930, at the beginning of the Great Depression, the building's ground floor tenants included both Cunard's White Star Line and the United States Lines, and the esteemed Pew family maintained a pied-a-terre on the 25th Floor. Today, this history echoes throughout ICON, a building that is a rare architectural experience. The lobby is so stunning it will make you stop in your tracks, with its Art Deco-styled elevators, glazed black brick and grey porcelain flooring and a cast-bronze portal. And the residences feature the kind of classic fixtures, state-of-the-art appliances and iconic details that can only be found in a landmark building. Apartment amenities: Kitchen features include sleek high gloss white cabinets with soft close drawers and doors.Ã‚Â Stainless steel appliances, including a glass top electric range and microwave. Glass-tile, kitchen backsplash. Quartz top kitchen island. Engineered hardwood flooring. Baths with sleek, high gloss cabinets and quartz countertops, glazed 12x12 porcelain tile. Air conditioning. Carpeting in bedrooms. Washer and dryer. Amazing views of Philadelphia. Enhanced Penthouse level finish on 23\/24 floors. Venetian medicine cabinet. Wheelchair Accessible Apartments Available. 2 inch wood window blinds. Community amenities: Sky Deck with 360 View, Includes Grilling Station and Outdoor Living Area with Fireplace. Wellness Floor Featuring a Yoga Studio, Cardio, Weights, TRX & BoxingÃ‚Â . Private Dining Room with Fireplace and Serving Kitchen. Club Level with Kitchen, Billiards, Flat-Screen TVs and Large Screen. Media Room for Private Parties. Business Center with Computers, Printers, Conference Rooms with A\/V Capabilities. Media RoomÃ‚Â . Full Service Concierge. Parking Garage w\/ Valet Parking Option. Package Receiving. Pet Grooming Station. On Site Property Management. Elevator. Charging Stations for Electric Cars. Cold Storage for Grocery Delivery. 24 Hour Emergency Maintenance. Pets Welcome: $500 one-time fee. Max 2 pets per home. $35 \/ month pet rent. On-Site Green Drop Donation Box. ** Pricing and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n1616 Walnut St #1B-1003","num_images":6,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '581ft2', 'available jan 20, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T08:55:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553901042.html","post_id":7553901042,"result_date":"2022-11-05T13:07:07.000Z","title":"1700 Walnut! Just off RITTENHOUSE SQUARE!!! Great space, and value!","description":"1700 Walnut! Just off RITTENHOUSE SQUARE!!! Great space, and value! All open living and dining area. Kitchen with terrific counter and cabinet SPACE. Your bedroom is VERY WELL proportioned with BIG closets. All tile bath is gracious, and a washer\/dryer is in your apartment!!! AND A BRAND NEW GYM in the building!!! Enjoy living in this elevator\/doorman building, with a walking score of 110! And minutes from some of PHILADELPHIA'S best CAFE'S, dining and entertainment, plus University of Pennsylvania and DREXEL UNIVERSITY!!!\n1700 Walnut St #4D","num_images":7,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '534ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T09:03:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553900659.html","post_id":7553900659,"result_date":"2022-11-05T13:05:51.000Z","title":"Be the first to live in this brand new penthouse!","description":"Be the first to live in this brand new penthouse! This bi-level unit is bright, airy and spacious. Located in the heart of Northern Liberties, you will have a plethora of boutiques, bars and restaurants at your footsteps. The unit itself has 3 large bedrooms and 2.5 baths, a private balcony, sanded in place oak floors, vaulted ceiling, central air\/heat, high-end appliances, washer and dryer, intercom system and easy access to the common roof deck. The entire building was completed in 2022. The subway is a 5 minute walk from your front door. The building is pet friendly. 12 month + leases. Furnishing available upon request.\n806 N 2nd St #TOP FLOOR","num_images":5,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2.5Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T09:01:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553900226.html","post_id":7553900226,"result_date":"2022-11-05T13:04:33.000Z","title":"Enjoy modern elegance & contemporary loft living in the heart of Bella","description":"Enjoy modern elegance & contemporary loft living in the heart of Bella Vista offering 1,860 square feet of living space, 20’ ceilings, a deeded roof top deck and 2-car parking. New York City style loft with tall energy efficient windows showcasing beautiful sunsets and breathtaking views of Philadelphia. The luxurious Lofts of Bella Vista is an early 20th Century Industrial pet friendly building. This penthouse unit is one of only 2 penthouse units that include a rooftop deck. This 2 bedroom, 2 bath penthouse unit offers a mirrored floor plan with the bedrooms situated on opposite sides of an open concept kitchen\/living layout. Both bedrooms provide substantial morning light, and ample closet\/storage options. The kitchen and living space allow for seamless entertaining with exposed bricks & polished concrete floors throughout. Entry provides large coat closet and hall laundry room\/pantry. Kitchen by Schiffini with marble countertops and waterfall marble kitchen island. Bathrooms with soaking tubs and vanities by Rifra with Zucchetti fixtures. This unit has custom design features by interior designer Michelle Gage (showcased in design blogs & multiple publications). You will experience the European flair of this completely rehabbed warehouse, which was once inhabited by Curtis Publishing Company. Enjoy 2-car heated garage parking (via parking lift), 24-hour security with front desk concierge, fitness room, a community media\/meeting room with prep kitchen, secured storage unit (monthly fee), and bike storage room. Conveniently located within walking distance to the Italian Market, Avenue of the Arts, Passyunk Square and some of Philadelphia’s top restaurants, boutique shopping, a variety of name brand commercial stores, public transportation and more. Easy access to major highways, sports complexes, and Philadelphia International Airport. Schedule your tour today and come see what living in the heart of one of Philadelphia’s heavily sought-after neighborhoods could offer you!\n1101 Washington Ave #PH3","num_images":9,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '1860ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:00:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553899353.html","post_id":7553899353,"result_date":"2022-11-05T13:01:19.000Z","title":"Great 2 Bedroom House for Rent in Graduate Hospital","description":"Great 2 Bedroom House for Rent in Graduate Hospital with tons of original character! Original Hardwood floors were refinished throughout. White kitchen cabinets along with stainless steel appliances give you a kitchen you will enjoy cooking in. Ample yard and closet space! Tons of natural light! First, Last, and Security Deposit required.\n1802 Montrose St","num_images":6,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '1060ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T08:57:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553896689.html","post_id":7553896689,"result_date":"2022-11-05T12:50:32.000Z","title":"Location, Location, right in the heart of Rittenhouse Square!!!","description":"Welcome to Parc Rittenhouse. Location, Location, right in the heart of Rittenhouse Square. This stylish chic designer studio in this prestigious building offers generous space. Beautiful Brazilian Cherry Floors. Open kitchen features granite counter tops, stainless steel appliances, tile floor and front load washer\/ dryer combo. Large primary bath with beautiful marble floors, marble vanity, and tile bath. No shortage of closet space with 2 large closets as you walk in. Why not live in the heart of it all. Parc Rittenhouse is a full service amenity building. As a resident, you will enjoy 24 hour doorman, brand new state of the art fitness center, community room, beautifully landscaped pool with sundeck, jacuzzi and on site maintenance. Enjoy the beautiful picturesque Rittenhouse Park known for many activites such as: the farmers market, the famous art show or the city's most exclusive fine dining right outside your door such as: Parc, Devon, and Rouge. This is a pet friendly building with restrictions.\n219-29 S 18th St #404","num_images":9,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '506ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T08:46:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553896342.html","post_id":7553896342,"result_date":"2022-11-05T12:49:08.000Z","title":"Extra Large 1 bedroom with finished basement!!","description":"Extra Large 1 bedroom with finished basement (can double as a 2 bedroom), back patio, and laundry. Conveniently one block from the Italian Market, and easy walk to Queen Village \/ Society Hill (near trendy South Street, historic sites, City Center, Convention Center, etc!). Historical charm, plus tons of restaurants, shops, and night life around. Finished basement, washer\/dryer, and small outdoor patio in back.\n1008 S 8th St #1","num_images":8,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T08:45:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553893249.html","post_id":7553893249,"result_date":"2022-11-05T12:34:39.000Z","title":"This is a Sunny 2nd Floor 1 Bed Apt Located in the Heart of Bella!","description":"Available Jan 1. This is a sunny second floor 1 bedroom apartment. Located in the heart of Bella Vista across the street from Available mid April. Isgro's Bakery and one block from Sabrina's. Unit features hardwood floors, one year old kitchen with dishwasher, refrigerator, range\/stove, dining and living area, gas heat, c\/a and your own washer\/dryer with small individual basement storage area. The building is located within walking distance to center city. Tenant pay gas and electric and $50 per month for water and trash.\n1004 Christian St #2ND FLOOR","num_images":7,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '2112ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T08:30:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553889969.html","post_id":7553889969,"result_date":"2022-11-05T12:18:26.000Z","title":"Beautifully updated studio on a high floor of The Dorchester","description":"Beautifully updated studio on a high floor of The Dorchester, located on the west side of Rittenhouse Square. Unit 2015B is bright and sunny with a wall of south facing windows. The updated kitchen features updated floors, white cabinets, granite countertops, and stainless steel appliances. The updated bathroom has a single granite vanity, new floors, and white tiled shower\/tub combination. There is also an oversized walk in closet. Rent includes a twenty-four hour doorman and all utilities, including basic cable. Use of the building's state-of-the-art fitness center, seasonal rooftop pool club, and valet parking in the building's underground garage are available for an additional fee. No pets permitted.\n224 W Rittenhouse Sq #2015B","num_images":8,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '359ft2', 'available dec 19', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T08:14:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553885822.html","post_id":7553885822,"result_date":"2022-11-05T12:17:42.000Z","title":"You Won’t Find A Better Apt To Live With Amenities In The Fairmount Ar","description":"Live at Park Town Place Apartment Homes in Centre City Philadelphia, and you’ll be blocks from the centre of nightlife in Logan Sq and Rittenhouse Square – The unit features modern kitchens, Quartz countertops, stainless steel Appliances, In-Unit Washer & Dryer, Breakfast Bars, Pendant Lighting, Tile Back Splash, Wood Plank Flooring Throughout, Walk-In Closets, Main Street Market & Cafe, featuring Gourmet Coffee & Tea and Much More! Fitness Center with Technogym Equipment, Queenax Boxing Gym, Yoga\/Spin Studio with Indoor\/Outdoor Workoutspace, Social Lounge with Demonstration Kitchen, Outdoor Lounge with Fire Pit, 24-Hour Concierge, 24\/ 7 Package Acceptance, Resident Shuttle Service to Center City and University Cty and More. Make Whole Foods as Your Second Kitchen Conveniently Located Just 1 Block Away. Our Apartments are Within One Mile of Several Institutions of Higher Education: Drexel University, Temple University, University of Pennsylvania, CHOP, Moore College of Art, and Community College of Philadelphia, You Won’t Find A Better Building To Live With Amenities In The Fairmount Area. Park Towns Include 948 Apartment And Penthouse Homes Within Four High Rise Towers. The Community Is Nestled Between Green Acres On The Benjamin Franklin Parkway In The Heart Of Center City Philadelphia’s Museum District. Park Towns Includes 948 Apartment And Penthouses Homes Within Four High Rise Towers. The Community Is Nestle Between Green Acres On Benjmnn Franklin Parkway In The Heart City Philadelphia’s Museums District.\n2200 Benjamin Franklin Pkwy #0B-E1003","num_images":6,"lat":39.9677,"lng":-75.1735,"attrs":"['0BR \/ 1Ba', '425ft2', 'available dec 31', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T07:49:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553889606.html","post_id":7553889606,"result_date":"2022-11-05T12:16:33.000Z","title":"Welcome to the carriage house of Hamilton Hall !!","description":"Welcome to the carriage house of Hamilton Hall Ballroom lofts in Historic Old City. One of kind home tucked away from the bustle of the city on a cobblestone street. This boutique home is on the first floor of a 5 unit condo building with elevator. This home just underwent a stunning renovation throughout with no detail overlooked. Enter into main lobby area or through your own private entrance door by the 1 car parking garage with plenty of storage area and a garage door opener. You can have 2 car parking by parking in front of your own garage with parking painted parking square. Wide open floor plan with original Corinthian columns and 9+ ceilings. New white oak engineered hardwood floors with custom designer painted walls and trim. Oversized windows throughout and new wall sconces and high-hats for plenty of lighting. Kitchen custom designed with white luxury cabinetry w\/ detailed handle hardware and gorgeous Quartz counters. Glazed 4 X 8 subway tile. Center island with seating for 3 more people to share in dining. Oversized living room for fun entertaining. Great space for watching the game or playing games. Master bedroom has plenty of windows and a new ceiling fan. Bathroom is detailed in glazed herringbone tile design with a new glass shower enclosure. Gray double vanity sinks with stately designed vanities. Walk in rainfall shower area with deluxe shower fixtures. Second bedroom has a ceiling fan and private 8X85 side yard with fenced bamboo for privacy. Walk score of 98 to great boutique stores, fabulous restaurants, Penns Landing waterfront, Franklin Park, Cherry Pier, Independence Hall, Constitution Center, Revolution Museum and so much more. Pets are allowed:)\n237-41 N Bread St #1","num_images":10,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T08:12:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553886657.html","post_id":7553886657,"result_date":"2022-11-05T12:15:19.000Z","title":"$1000 MOVE-IN CREDIT IS OFFERED CURRENTLY!!!","description":"$1000 MOVE-IN CREDIT OFFERED CURRENTLY!!! Just $500 deposit and 1st month's rent to move-in!! RENOVATED, Spacious 1 bedroom\/1 bath unit. Carpet in bedrooms, vinyl flooring downstairs. Washer and dryer in unit! Whether CHOP, HUP, Penn, or Drexel, Liberty View is the ideal location. Spectacular city views! Within blocks of prestigious Rittenhouse Square and Philadelphia public transportation, Liberty View is situated along vibrant, tree-lined South Street. Spacious apartment homes available in bi-level, patio, and balcony unit formats offer Center City living with comfortable outdoor space! Pictures are of the actual unit!\n2031 South St #129","num_images":7,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '725ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T07:55:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553884842.html","post_id":7553884842,"result_date":"2022-11-05T12:14:40.000Z","title":"Adorable 2bd Townhouse for rent","description":"I'm renting my charming, cozy two bedroom\/one bath row home in East Passyunk. Hardwood floors throughout, renovated kitchen, huge back patio, and basement with washer dryer. Absolutely in the heart of everything in South Philadelphia steps away from dozens of shops, restaurants, and services, and steps away from Pats\/Geno's and the historic Italian Market.\nThe master bedroom is spacious, has a huge closet, storage space, and built in bookshelf. The second bedroom is big enough for a home office (current use) or a small bedroom.\nAvailable furnished or unfurnished.","num_images":14,"lat":39.92988,"lng":-75.160409,"attrs":"['2BR \/ 1Ba', '756ft2', 'available nov 30', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T07:42:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553889221.html","post_id":7553889221,"result_date":"2022-11-05T12:14:26.000Z","title":"2 bedroom \/ 2 bathroom bi-level apartment is centrally located just of","description":"Available NOW: Welcome to 532 S 15th Street, #1! This 2 bedroom \/ 2 bathroom bi-level apartment is centrally located just of of South Street, walking distance to Center City and Rittenhouse Square. Enter on main level into the spacious living, dining, and kitchen area with lovely bay window in the front. Your modern kitchen boasts beautiful white cabinetry, ample prep space, and sleek stainless steel appliances including electric stove + oven, dishwasher, and fridge. There's a large closet for storage by the kitchen area. Continue back to your 1st bathroom and bedroom. The bathroom features a vanity, window, and separate shower with glass door. Your bedroom is sizable and bright, with a gorgeous accent wall, ceiling fan for year-round comfort, and large closet. There's a door that leads to your outside space - perfect for the warmer months! Head down the lower level to view your other bathroom and bedroom. The bathroom offers stunning floor-to-ceiling tiling, a lighted vanity, cabinet over the toilet, and a full size shower \/ tub combo. The 2nd bedroom features plush wall-to-wall carpeting, a ceiling fan, and good closet space. There's an additional storage area to the back, plus in-unit laundry and central a\/c for added convenience. Schedule your showing today! About The Neighborhood: Located in the Graduate Hospital neighborhood, this is a hot location right around the corner from tons of restaurants, cafes and bars. You'll be steps from the Lombard-South Station for the Broad Street Line, plus surrounded by public transportation bus routes. Walkable to the Marian Anderson Recreation Center and Rittenhouse Square. Check out neighborhood hotspots like Bob & Barbara's Lounge, Founding Fathers Sports Bar & Grill, Loco Pez, Tio Flores, and tons more! Lease Terms: Generally, first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord. $55 application fee per applicant. Pets are conditional on owner's approval and may require an additional fee and monthly pet rent, if accepted. (Generally, $500\/dog and $250\/cat, and monthly pet rent of $30\/month for dogs and $25\/month for cats). There is a maximum weight of 30lbs for dogs. Tenants responsible for: upfront payments of $125 for common area electricity + $395 for water. Tenants are also required to put PECO + wifi\/cable in their name. (If a longer lease is secured, prepayments will be adjusted). Landlord Requirements: Applicants to make a minimum of 3x the monthly rent in verifiable net income, no landlord filings or evictions within the past 4 years, and must have a verifiable rental history.\n532 S 15th St #1","num_images":8,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '2364ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T08:10:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553888939.html","post_id":7553888939,"result_date":"2022-11-05T12:12:43.000Z","title":"Immaculate 2 Bed\/1 Bath Apt Featuring a Bright Interior With Hardwood","description":"Available NOW: 530 S 15th Street, #1. An immaculate 2 bedroom \/ 1 bathroom apartment featuring a bright interior with hardwood floors throughout. Enter your new apartment through the spacious common area with gorgeous bay windows at the front. You'll have space for different living room and dining room furniture set ups, and there is additional counter space and storage off of the kitchen which would serve well for entertaining guests. The kitchen is towards the back of the common area and is equipped with granite countertops, ample cabinetry, and stainless steel appliances. Continue to your 2 bedrooms, the smaller one with good closet space and the larger offering recessed lighting and a closet with frosted sliding glass doors. Head into your bathroom boasting a window, vanity, travertine tiles, stall shower and additional storage. The basement has a washer & dryer, plus tons of storage space and your outdoor space is perfect for the warmer months. Don't miss this opportunity to live in this great location in a fabulous apartment! About The Neighborhood: Located in the Graduate Hospital neighborhood of South Philadelphia. You'll be right on the corner of 15th Street & South Street, surrounded by tons of restaurants, cafes, and bars including Bob & Barbara's Lounge, Tio Flores, Founding Fathers Sports Bar, Southgate, L'Anima, Pumpkin BYOB, and more. Just one block from Broad Street with convenient shopping and public transportation options. Walkable to the Marian Anderson Recreation Center, Christian Street YMCA, and Avenue of the Arts. Lease Terms: Generally, first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord. $55 application fee per applicant. Pets are conditional on owner's approval and will require an additional fee and monthly pet rent, if accepted. (Generally, $500 fee and $30\/month pet rent for dogs, and $300 fee and $25\/month pet rent for cats). Dogs 30lbs or less, please. 1 year prepayment for PECO ($125 for common area electric) and 1 year prepayment for water ($395) due at lease signing. Tenants responsible for all other utilities: in-unit gas, electricity, cable\/internet. Landlord Requirements: Applicants to make a minimum of 3x the monthly rent in verifiable net income, no landlord filings or evictions within the past 4 years, and must have a verifiable rental history.\n530 S 15th St #1","num_images":8,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '750ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T08:08:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553885497.html","post_id":7553885497,"result_date":"2022-11-05T12:08:35.000Z","title":"Spacious studio with sunset city views at The Philadelphian!","description":"Spacious studio with sunset city views at The Philadelphian! Spacious studio on a high floor featuring a 21’ terrace overlooking Fairmount, an open kitchen, and dressing room. The Philadelphian has often been called a “city within a city” due to its many services and amenities that are offered to residents. From a restaurant to a grocery store, multiple medical offices to a beauty parlor, residents of The Philadelphian will rarely need to travel far to accomplish their daily routine. When the need should arise to leave the premises, the building offers a shuttle bus that runs all day long dropping off and picking up residents throughout Center City. Residents also enjoy a 24 hour doorman, indoor and outdoor pools, and fitness center.\n2401 Pennsylvania Ave #16A6","num_images":7,"lat":39.9677,"lng":-75.1735,"attrs":"['0BR \/ 1Ba', '567ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T07:47:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553887659.html","post_id":7553887659,"result_date":"2022-11-05T12:05:29.000Z","title":"Live at 1306 Hancock St, a renovated 2 bedroom 2 bathroom trinity home","description":"Live at 1306 Hancock St, a renovated 2 bedroom 2 bathroom trinity home with tons of charm in Olde Kensington just blocks away from The Piazza. Enjoy a Philadelphia architectural staple, the trinity home with a modern twist. Enjoy a cozy and unique layout with updated hardwood and recessed lighting. The downstairs kitchen is fully updated with a stone backsplash, new tile, extended countertops, shaker cabinets, a hood-cover stove, and stainless steel appliances. Take the spiral staircase up to the first bedroom with tons of space, storage, and natural light. Enjoy a full bathroom with an in-unit washer and dryer. The top-floor bedroom features a loft layout and a walk-out roof deck with an amazing view of American St.\n1306 N Hancock St","num_images":7,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '1204ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T08:01:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553886443.html","post_id":7553886443,"result_date":"2022-11-05T12:03:51.000Z","title":"Beautiful Corner Unit - 2 bed + 1 den","description":"Available NOW | Leasing Special: $1,325\/month for a 18 month lease; or $1,375\/month for a 12 month lease.\nThis 2 bedroom \/ 1 bathroom apartment welcomes you into the main living space with exposed brick, large windows for sunlight, & exposed ductwork. The kitchen area is at the back and is fully equipped with white shaker cabinets, subway tile back splash, and sleek stainless steel appliances including a microwave, dishwasher, electric range, and refrigerator. Continue to your stunning bathroom boasting a modern gray vanity and gorgeous shower stall with detailed floor-to-ceiling tiling and a glass door. On the other side of the unit you will find your 2 bedrooms with spacious closets. The corner bedroom is a bit larger and receives a ton of natural light! Unit features hardwood floors, central air, washer \/ dryer, and recessed lighting throughout! show contact info\nAbout The Neighborhood:\nLocated in Norris Square and walkable to tons of great shopping, eating, and entertainment options. You’ll be surrounded by public transportation bus routes for a quick commute throughout the city. Close proximity to Norris Square Park, Towey Playground, and La Placita Park. Just blocks from fantastic spots including Sunflower Philly, Human Robot, Cousins Supermarket, Luna Cafe, Original 13 Ciderworks, Halftime Goodtimes, Sidekicks Sports Bar & Grill, and countless more!\nLease Terms: show contact info\nGenerally, first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord. $55 application fee per applicant. Strictly, no pets. Tenants responsible for: electricity, cable\/internet, and water. Landlord Requirements: Applicants to make a minimum of 3x the monthly rent in verifiable net income, no landlord filings or evictions within the past 4 years, and must have a verifiable rental history.\n","num_images":6,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T07:53:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553887026.html","post_id":7553887026,"result_date":"2022-11-05T12:01:39.000Z","title":"This fantastic value priced, 2 bedroom 1 bath apartment!!","description":"This fantastic value priced, 2 bedroom 1 bath apartment boasts wonderful open living and dining area, and kitchen with excellent cabinet and counter space. Each bedroom is well proportioned and boasts very good closet space. This awesome location is in the heart of some the city's best dining and night life!!! Just minutes from Pennsylvania and Jefferson Hospitals.\n201 S 13th St #201","num_images":6,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', 'available jan 10, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T07:57:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553885696.html","post_id":7553885696,"result_date":"2022-11-05T11:59:53.000Z","title":"A great studio standard of living at Greene Manor Apartment","description":"A great studio standard of living at Greene Manor Apartment. Each of our four apartment buildings offers a variety of floor plans suited to every lifestyle. Including hardwood floors in most units, and wall-to-wall carpets in others. Mini-blinds cover all windows, and ceiling fans are in every bedroom and dining area. Kitchens are \"eat-in\" and brightened by a window! Our ideal location in the Mount Airy Germantown neighborhood places you just minutes from everything you need, including restaurants, shopping, parks, entertainment!\n- A small pets Ok ( $10 fee one time)\n- One month deposit\n- No smoking!\n- Free Wifi\n- Large living room\n","num_images":1,"lat":40.0338,"lng":-75.1731,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T07:48:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553886329.html","post_id":7553886329,"result_date":"2022-11-05T11:57:07.000Z","title":"MUST SEE 1 bedroom, 1 bath apartment at 1300 Chestnut!","description":"MUST SEE 1 bedroom, 1 bath apartment at 1300 Chestnut! All open living and dining space. Kitchen has plenty of cabinet and counter space. Spacious and gracious bedroom with all tile bath. Enjoy living in this elevator, doorman building (from 12pm to 8pm) in the heart of MIDTOWN. Just minutes from Avenue of the Arts, Jefferson Hospital, and The Reading Terminal Market. Walking score 110! Great space and value and yes a fantastic gym at your disposal as well to use.\n1300-6 Chestnut St #305","num_images":7,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T07:53:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553882460.html","post_id":7553882460,"result_date":"2022-11-05T11:50:26.000Z","title":"FOR A LIMITED TIME: ONE MONTH'S RENT FREE! HUGE 1 bedroom, 1 bath","description":"FOR A LIMITED TIME: ONE MONTH'S RENT FREE! HUGE 1 bedroom, 1 bath, Fantastic Apartment at THE SCHOOL ADMINISTRATION BUILDING. Amazing historic structure! Enjoy this spacious and gracious residence. All hardwood floors throughout, high ceilings, all open living\/dining space, terrific kitchen with granite countertops and stainless steel appliances. Washer\/ Dryer in unit. Central Air. Elevator, doorman building with fitness center and steps from Trader Joe's, Whole Foods and so much more! PARKING available for additional fee. Pictures are of model unit.\n230-38 N 21st St #410","num_images":7,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '1177ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T07:24:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553885170.html","post_id":7553885170,"result_date":"2022-11-05T11:49:12.000Z","title":"New constructed 3B2.5B condo unit in Northbank Community","description":"New constructed 3B2.5B condo unit in Northbank Community. Take in the views with full rooftop terrace! 9' high ceilings add to the appeal and grandeur of this townhome. Park your car in this attached, single car, rear entry garage. Overflow street parking is also available for you and your guests. The kitchen has a generously sized island that is open to the dining room and the expansive great room which leads to a covered deck. Work from home? Two Additional Flex spaces on the main level offer the opportunity to set up a private workspace. The spacious primary bedroom features an additional covered deck. The primary bath includes a double vanity, seated shower, and leads to a large walk-in closet. (Photos are from Model Home)\n3001 City View Walk #201","num_images":6,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2.5Ba', '2406ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T07:45:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553884832.html","post_id":7553884832,"result_date":"2022-11-05T11:46:33.000Z","title":"Massive 3 Bed 2 Bath Nyc Style Loft in the Heart of Northern Liberties","description":"Welcome to this massive 3 bedroom, 2 bathroom, NYC style loft in the heart of Northern Liberties! This loft boasts over 1,850+ square feet of space in addition to the soaring 20+ feet high ceilings, with a private outdoor patio. Door to door service with the 1-car garage parking spot right outside the back door. Step inside to the open concept living and entertaining area complete with a sunken chef’s style kitchen and full breakfast bar. The large private primary bedroom on the main floor is complete with plenty of closet space. Recently renovated, you’ll love the brand new primary bathroom with glass enclosed waterfall shower and dual vanity sinks. Two flex spaces (the second living area + the sitting room) can be found in the home. One of them could absolutely be converted into a true third bedroom, nursery, or fantastic home office! The second floor loft space works perfectly as a second bedroom or living room\/office area; also complete with lots of closet space and an ensuite full bathroom. This loft is complete with a full laundry room, ample closets and storage space throughout. The entrance door alone is surrounded by three deep closets - perfect for all of your storage, coat closet, pantry, and linen closet needs. Located just steps away from Jerry’s Bar, Standard Tap, Dolce Caffe, 3J’s Deli and all that N. 2nd Street has to offer! Only blocks from all of your favorite Northern Liberties & Fishtown hot spots, plus public transportation and access to all of the major highways. Schedule your showing today! **The owner is willing to enclose the second living area or sitting room to make another full bedroom if desired.**\n810 N Hancock St #13","num_images":7,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2Ba', '1854ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T07:42:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553884490.html","post_id":7553884490,"result_date":"2022-11-05T11:44:08.000Z","title":"Wonderful 2 bedroom, 2.5 bath, two-story Penthouse!!","description":"Wonderful 2 bedroom, 2.5 bath, two story Penthouse. This 1422 sqft unit is bathed in light and because of the two levels, gives you the feeling of living in a townhouse with all the amenities of a luxury building. Included utilities, doorman, monitored security, gym, recreation room and incredible walkable location are just a few of the perks here! Freshly painted and ready for you to come enjoy living in a boutique, well managed building in the heart of it all. 18 months preferred.\n1500 Chestnut St #20I","num_images":6,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2.5Ba', '1422ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T07:40:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553884181.html","post_id":7553884181,"result_date":"2022-11-05T11:41:44.000Z","title":"Located at 1735 Brandywine Street in Highly Desirable Spring Garden!!","description":"Located at 1735 Brandywine Street in the highly desirable Spring Garden neighborhood we have a lovely rental option for you to consider. This apartment has it all! Unit #1 is bi-level, newly renovated, and features three bedrooms, 3 bathrooms, and a backyard! There are new hardwood floors and plenty of space throughout the bedrooms and living area. The bathroom is spacious, modern, and comfortable. The kitchen is equipped with a refrigerator, gas stove, and ample counter\/cabinet space.\n1735 Brandywine St #1","num_images":9,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 3Ba', '1400ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T07:37:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553883957.html","post_id":7553883957,"result_date":"2022-11-05T11:39:59.000Z","title":"Newly Updated Townhouse with living room\/dining room Features!!","description":"Newly updated townhouse with living-room\/dining room features and hardwood floors. Spacious deck with amazing views of center city skyline. The property is freshly painted with a newly renovated kitchen and granite counters and stainless steel appliances, updated bathrooms and powder room, large master bedroom suite, washer and dryer, and a newer A\/C unit. One assigned parking spot is included with the property.\n54 Hamilton Cir","num_images":7,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2.5Ba', '1686ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T07:35:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553883718.html","post_id":7553883718,"result_date":"2022-11-05T11:38:07.000Z","title":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!!!!!!!!","description":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!!!!!!!! LET the SUNSETS be your permanent back drop!!!!!!!!! This ONE BEDROOM residence, at FRANKLIN TOWER, located at 16TH and RACE STREET is a must see!!! All open and spacious living and dining area, kitchen with STAINLESS steel appliances, breakfast bar, and CUSTOM cabinetry. The Bedroom is VERY spacious, with an all tile EUROPEAN style bathroom. There is nothing like FRANKLIN TOWER apartments, in all of Philadelphia!!! With amenities on EVERY FLOOR, Peloton Rooms, Yoga studios, Screening Rooms, Game Rooms, Lounges, and Gyms, as well as the ROOF TOP LOUNGE , with flat screen, grills, and fire place. A BASKETBALL COURT, and GARAGE PARKING. Parking available for additional cost. Photo's are of model unit.\n200 N 16th St #817","num_images":7,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '2700ft2', 'available dec 27', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T07:34:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553883453.html","post_id":7553883453,"result_date":"2022-11-05T11:36:09.000Z","title":"!!Nestled in a charming Old City street!!","description":"Nestled in a charming Old City street- walking distance to boutiques, and trendy restaurants Studio currently being completely renovated with a new kitchen, bath, flooring and best of all CONVERTED TO A JUNIOR ONE BEDROOM - WASHER DRYER IN UNIT, high ceilings, brick exposed walls. Desk person building. Photos are prior to renovating - renovating will be taking place in the month of December. Owner is a licensed PA realtor. Floor plan is attached with wall drawn in. Countertops will be quartz, white kitchen cabinets, stainless steel appliances, engineered wood floors thru-out living and kitchen; new bath tile, tub, tub surround, vanity, mirror AND BEST OF ALL A SEPARATE BEDROOM AREA WITH A SLIDING BARN DOOR. For more detail, please contact listing agent.\n315 New St #511","num_images":6,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '485ft2', 'available jan 9, 2023', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T07:32:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553883158.html","post_id":7553883158,"result_date":"2022-11-05T11:34:13.000Z","title":"$500 Security Deposit!!! 427 Vine, Located in a Historic Old City","description":"$500 Security Deposit!!! 427 Vine, located in a quiet courtyard in historic Old City, is a converted former convent featuring eight spacious 1-bedroom apartments. Architectural detailing and antiquity give this building character and appeal. Dishwasher, full-size washer and dryer in most apartments, high-efficiency, individually controlled A\/C and heat. Pictures are of the actual unit, but it now has hardwood floors installed. Parking is available for an additional fee-$175.\n427 Vine St #6","num_images":7,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '500ft2', 'available dec 21', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T07:30:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553882759.html","post_id":7553882759,"result_date":"2022-11-05T11:30:58.000Z","title":"Deluxe 1 Bed With Well Over 1,000 Sqft, Beautiful View of Washington!!","description":"Deluxe one bedroom with well over 1,000 square feet and a view overlooking beautiful Washington Square park and the center city skyline. This home features parquet wood flooring, a renovated kitchen with granite counters and stainless appliances, a renovated bathroom as well, tremendous closets including an extremely large entry closet which can also double as the perfect home office. The Hopkinson House is a very well run high-rise building which has (extra fees) underground monthly parking, a rooftop pool with sensational skyline views, and a convenience store accessed directly from the building. The rent includes utilities. Cable and internet are an extra $59.00 per mo currently. At the signing of the lease, the tenant is required to pay the first month’s rent plus two month’s security.\n604-36 S Washington Sq #1714","num_images":8,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '1063ft2', 'available now', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T07:26:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553877471.html","post_id":7553877471,"result_date":"2022-11-05T11:14:40.000Z","title":"2br - 840ft2 -this 2 bedroom 1 full bath home in Burlington","description":"This 2 bedroom 1 full bath home in Burlington.Come see this diamond in the rough-with less than a 2 year old furnace, water heater and roof along with major renovations just completed-this is an incredible opportunity to live at Crestwood in Burlington. New custom kitchen cabinets along with custom butcher block as well as new tiled back splash, LVP flooring, countertop, sink and faucet installed. Freshly painted throughout with new carpet. Bathroom renovation includes a subway tile shower surround, new counter and faucet with new lvp flooring.","num_images":3,"lat":40.0293,"lng":-74.9497,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-11-05T06:32:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553865912.html","post_id":7553865912,"result_date":"2022-11-05T09:04:51.000Z","title":"Spacious 1 bedroom\/1.5 bath end-unit condo in a walk-to","description":"Exceptional, carefree living right in the heart of desirable Ardmore! Originally built by renowned Main Line builder B.J. Drueding Builders, this is a rare opportunity to rent a fabulous, spacious 1 bedroom\/1.5 bath end-unit condo in a walk-to everything location. Enter through the marble foyer to gleaming Brazilian Cherry hardwood floors that flow throughout. You'll enjoy effortless entertaining with a gourmet kitchen, designed with Brookhaven cabinets, stainless steel appliances and granite countertops. Adjacent to the kitchen is the dining room, ready for your family and guests. French doors lead to an intimate flagstone patio and garden to enjoy your morning coffee or an evening cocktail. The living room is spacious and airy, highlighted by a slate surround wood-burning fireplace, built-in cabinetry, shelving and bay window. The bright and spacious master suite is complete with walk-in closet, luxurious master bath with limestone vanity and large seamless glass shower. Special upgrades include all new energy efficient windows and sliding glass doors, updated HVAC, two new patios with exterior lighting, overhead cooling fans, new outside landscaping and hardwood floors throughout. For your convenience, you'll also find a laundry area with stackable washer and dryer. This well-situated condo includes two designated parking spaces, one in the enclosed garage, as well as a large storage unit. Enjoy the quiet and convenience of your new home as it is located within walking distance from Lower Merion HS, Suburban Square, Trader Joes and the Ardmore Farmer's Market. The nearby Ardmore train station provides Septa and Amtrak service to Center City, NY or Washington D.C. so that you may indulge in the best of the suburbs and easy access to the city.\nParking Information\nGarage Features: Covered Parking\n# of Total Garage and Parking Spaces: 2\n# of Assigned Spaces: 2\n# of Garage Spaces: 1\nParking Garage - # of Spaces: 1\nParking Lot - # of Spaces: 1\nAssigned\nParking Garage, Parking Lot\nUtilities Information\nCentral Air\nCooling Type: Central A\/C\nCooling Fuel: Electric\nForced Air\nHeating Fuel: Electric\nHot Water: Electric\nSewer Septic: Public Sewer\nWater Source: Public\n","num_images":14,"lat":40.007269,"lng":-75.281531,"attrs":"['1BR \/ 1.5Ba', '1276ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T03:23:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553865953.html","post_id":7553865953,"result_date":"2022-11-05T08:37:27.000Z","title":"Updated Open kitchen with granite counter tops invites you to gather","description":"Welcome to this cozy one bedroom, one full bath condo at the Valley Forge Towers 1000 building. Updated Open kitchen with granite counter tops invites you to gather around for socializing. Recently updated sliding glass door, white shutters, newer flooring, vanity and toilette complete the renovation. This ready to move in one bedroom is a perfect starter home or a nest for downsizing individuals. Monthly rent includes ALL UTILITIES electic, water and sewer), replacement and service of Heating, Air-conditioning and water heater. Club house offers a Party room that can be rented for private gatherings. Pets are allowed. The Upper Merion Rambler picks up at the front lobby and can take you to community locations, library, Wegmans as well as King Of Prussia Mall.\nParking Information\nParking Lot\nUtilities Information\nCentral Air\nCooling Type: Central A\/C\nCircuit Breakers\nElectric, Forced Air\nHeating Fuel: Electric\nHot Water: Electric\nSewer Septic: Public Sewer\nCable TV\nWater Source: Public\nInterior Information\nAppliances: Built-In Range, Oven - Wall, Dishwasher, Disposal\nFlooring Type: Fully Carpeted, Tile\/Brick\nInterior Features: Kitchen - Eat-In\nLiving Area Sq.Ft. Source: Assessor\n","num_images":22,"lat":40.104201,"lng":-75.412747,"attrs":"['1BR \/ 1Ba', '840ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T03:24:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553865950.html","post_id":7553865950,"result_date":"2022-11-05T08:35:23.000Z","title":"Valley Forge Towers simply the best 1 bedroom unit in the Towers","description":"Welcome home to Unit 1221 at Valley Forge Towers, simply the best 1 bedroom unit in the Towers. This \"show case\" unit has a second \"bonus\" room with direct balcony access that doubles as an office, second bedroom or nursery. This is truly a one of a kind unit, with one bedroom, the bonus room and one and a half bathrooms. Walk through the front door of this unit and you are welcomed with a warm and charming open floor plan. The kitchen has been recently remodeled with stainless steel appliances and an island . Both bathrooms have been recently updated, the full bath with a whirlpool tub and dual sinks. Enjoy the beautiful balcony with center views. Also included in the Monthly rent are: Water, sewer, trash, common area and lawn maintenance, security, electricity, cable,. The condo is served by Septa and the UM Rambler bus service. This condo is convenient to major roads and public transportation, great schools, and unparalleled shopping and restaurants* Base electric is covered.\nParking Information\nParking Lot\nInterior Information\nAppliances: Dishwasher, Disposal, Dryer, Microwave, Oven\/Range - Electric, Refrigerator, Stainless Steel Appliances, Washer\nInterior Features: Kitchen - Island, WhirlPool\/HotTub\nLiving Area Sq.Ft. Source: Assessor\nUtilities Information\nCentral Air\nCooling Type: Central A\/C\nCooling Fuel: Electric\nForced Air\nHeating Fuel: Electric\nHot Water: 60+ Gallon Tank\nSewer Septic: Public Sewer\nWater Source: Public\n","num_images":22,"lat":40.104201,"lng":-75.412747,"attrs":"['1BR \/ 1.5Ba', '1225ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T03:24:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553859186.html","post_id":7553859186,"result_date":"2022-11-05T05:56:53.000Z","title":"2 Bedroom 1 Bath Apartment for rent available soon","description":"6211 Elmwood Ave, Philadelphia PA 19142\nFully renovated 2 bedroom 1 bathroom apartment.\nSpacious rooms with great closet space and open kitchen living room.\nStainless steel appliances with great cabinet space and granite counter top.\nMarble bathroom with deep soak tub.\nCentral heating system.\nShared laundry room in basement.\nGood credit is required and income over 3.5 times the monthly rent.\nRent: $1335 (includes water and laundry fee)\nGas and electric not included in rent.\nAvailable January 2023 or sooner if needed.\nPlease email us with any questions, inquiries and application about the apartment.","num_images":14,"lat":39.9248,"lng":-75.227,"attrs":"['2BR \/ 1Ba', 'available jan 1, 2023', 'application fee details: Application fee $50', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T01:47:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554062644.html","post_id":7554062644,"result_date":"2022-11-05T19:41:46.000Z","title":"Beautiful Home 3bed 1bath","description":"Nearby 95, train station, schools, shopping.\n3 month deposit and first month so total 4month for move in\nContact Please:\nshow contact info","num_images":6,"lat":39.998537,"lng":-75.101555,"attrs":"['3BR \/ 1Ba', '1080ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T15:17:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554070718.html","post_id":7554070718,"result_date":"2022-11-05T19:40:31.000Z","title":"Extra storage available, Laundry facilities on-site, Cat-friendly","description":"Bedrooms: 1Bathrooms: 1Square Feet: 495Date Available: 2022-11-05Address: 212 East Mount Vernon StreetReach out to our Leasing Office today to schedule a tour of our convenient Montgomery County apartments for rent. We can answer all your questions about living in Lansdale. We look forward to hearing from you. Contact us today to schedule your self-guided tour! Amenities Include:Private, off-street parkingLaundry facilities on-siteWall-to-wall-carpetingAmple closet spaceCat-friendlyExtra storage availableCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/mnj5fluk\/heritage-house\n","num_images":8,"lat":40.2378,"lng":-75.2955,"attrs":"['1BR \/ 1Ba', '495ft2', 'available now', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T15:36:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554067516.html","post_id":7554067516,"result_date":"2022-11-05T19:33:17.000Z","title":"Cute & Bright 2 Bedroom 1 Bath House for rent","description":"LUXURY ROOMS TO RENT IN LUXURY LOCATION! THIS IS A DRUG AND ALCOHOL FREE BUILDING. No drugs or alcohol will be tolerated on the premises. Property is under 24 hour camera surveillance. Only A few left. HURRY! $750\/month with utilities - ALL INCLUDED. Each room comes fully furnished with a full-size bed, night stand & lamp, armoire, and desk with chair. Rent $750 a month plus a $500 deposit and a $1 application fee required upon move-in. required upon move-in. Strict house guidelines, Veterans and SSI are welcomed. Only serious applicants should inquire. We also pre-qualify individuals for permanent housing, so if interested, please ask us how. Text now for any information:: krysta7744𝐆𝐦𝐚𝐢𝐥com","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T15:29:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554062185.html","post_id":7554062185,"result_date":"2022-11-05T19:20:42.000Z","title":"Convenient location, Scenic walking trails, Pet park","description":"Bedrooms: 3Bathrooms: 2.5Square Feet: 2002Date Available: 2022-11-05Address: One Applewood DriveHeritage Orchard Hill welcomes you to explore our 1-, 2-, and 3-bedroom Perkasie townhomes and schedule a tour to see everything our community has to offer. Enjoy beautiful apartment features, including 9-foot ceilings, a full-size in-unit washer\/dryer, a 3,300 sq. ft swimming pool, an on-site fitness center. Explore our photo gallery to see the contemporary, neutral decor and comfortable living spaces at Heritage Orchard Hill. Call  show contact info\nto speak to a leasing agent today and schedule a tour of your new home today or apply online!Learn more about all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.Our Leasing Office is ready to answer your questions about our luxury townhomes for rent in Perkasie, Pennsylvania. Whether you need extra space for remote working or virtual schooling, or just like to spend some time in a well-appointed townhome, we have the floor plans you are looking for. Reach out and let us show you how easy it is to move into our Bucks County townhomes today! Contact us today to schedule your self-guided or virtual tour! Amenities Include:Scenic walking trailsThree tot lots with modern play equipmentPickle Ball CourtsCommunity parties and events scheduled throughout the yearPet parkTennisPet friendly (pets stay free)Convenient location4,700 square foot clubhouse available for private parties3,300 square foot swimming pool with adjacent baby poolMultiple shopping destinations just miles away1,800 square foot open-air deckCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/x26tsth3\/heritage-orchard-hill\n","num_images":8,"lat":40.3765,"lng":-75.2648,"attrs":"['3BR \/ 2.5Ba', '2002ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T15:16:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554045557.html","post_id":7554045557,"result_date":"2022-11-05T19:00:03.000Z","title":"Pet-friendly living, Online Payments Available, Bark park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:On-site bike storageUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingPet-friendly livingBark parkBocce ball fieldOnline Payments Available48-hour Maintenance CommitmentUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsState-of-the-art fitness center overlooking the Manayunk canalHuge walk-in closets with ample storageMarble master baths, some with deep linen storageCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/uuu5mogg\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-05T14:40:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554048028.html","post_id":7554048028,"result_date":"2022-11-05T18:49:28.000Z","title":"Washer & Dryer Inside\/ Third Floor\/ Cat & Dog Friendly\/ Pool\/ Gym","description":"RENT PERIOD: YEARLY\nAsk about apartment home H09 on the third floor, available November 12th!!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up a tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday: 9:00 am-6:00 pm, Fridays: 9am – 5pm and also Saturday from 10:00 am-4:00 pm. * Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\n-Full Size Washer\/Dryer In select homes.\nCOMMUNITY FEATURES:\n-On-Site Management\n-On-site maintenance\/24 hour emergency service\n-Septa Bus stop on the corner\n-Ivy Ridge Train Station blocks away\n-Online Payments Available\n-Cable Ready\n-On line service request\n-Septa Transportation outside the Rental Office\n-Pool located at sister property(Pool membership available. Fees Apply)\n-Gym located at sister property\nThe Metropolitan Manayunk Hill apartment homes, are just minutes to Center City Philadelphia, Manayunk Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA turnpike. Walk to Ivy Ridge Shopping Center and ShopRite Supermarket. Convenient to Ivy Ridge Train Station to Center City, Andorra Shopping Center, Target and more! The Metropolitan Manayunk Hill apartment homes are a great choice for both convenience and a quality of life. that's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity.\n","num_images":8,"lat":40.043502,"lng":-75.236199,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T14:45:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554047062.html","post_id":7554047062,"result_date":"2022-11-05T18:47:24.000Z","title":"Immediate Move-In Available! Book your Tour TODAY!","description":"Welcome to The Gateway Apartments!1515 Manley Rd West Chester, PA 19380Rental Size: 1 BR - 1 BA - 779 sq ft | Per Month: $1834 - $2487 | Lease Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month show contact info\nOffering a vibrant selection of living options, The Gateway Apartment Homes maintains the prime for luxury apartments in West Chester, PA. Our open and inviting floor plans are enhanced by a variety of exclusive features which define the unique lifestyle only found at our community. With a great location in the East Goshen Township, you will love calling our apartments your home.Please take our virtual tour\nhttps:\/\/my.matterport.com\/show\/?m=4RkQ1PobBkE&brand=0  Our community features:   ❖ Business Center❖ Clubhouse❖ Fitness Center❖ Onsite Maintenance❖ Onsite Management❖ Package Service❖ Picnic and Grilling Area❖ Pool and Sundeck❖ Storage Space❖ Walking\/Biking Trails❖ Beautifully Landscaped Grounds❖ Garages For Lease❖ Gated Entrances❖ Maintenance Free Lifestyle❖ Onsite Leasing Office❖ Pet-Friendly❖ Resort-Style Pool With Sun Deck❖ Storage Units For Lease❖ Three BBQ\/Picnic Areas❖ Wi-Fi Access in Clubhouse and at Pool  Our unit features: ❖ Alarm❖ Cable Ready❖ Carpet❖ Den❖ Dining Room❖ Dishwasher❖ Trash Compactor❖ Tub\/Shower❖ Walk-In Closets❖ Window Coverings❖ Built-In Microwave Oven❖ Disability Access (select homes)❖ Frost-Free Refrigerator\/Ice Maker❖ Garden\/Spa Tub (select homes)❖ Gas Fire Place (select homes)❖ Kitchen Pantry❖ Vaulted Ceiling (select homes)❖ Washer And Dryer In Each Apartment Home❖ Wired For High-Speed Internet❖ Wooded View\/Pool View (select homes)   Contact us for more information! --  show contact info\n--Our Pet-Policy: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonWebsite: https:\/\/www.thegatewayapartments.com\/Property Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY970F506CB0054A\n","num_images":19,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '779ft2', 'available now', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T14:43:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554046198.html","post_id":7554046198,"result_date":"2022-11-05T18:45:30.000Z","title":"2 Bedroom 1 Bath Luxury Apartment in Wash Sq. West","description":"Gorgeous 2 bedroom apt with a huge island kitchen locatged 1 block off of the Broad St. Line","num_images":6,"lat":39.943569,"lng":-75.1648,"attrs":"['2BR \/ 1Ba', '850ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T14:41:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554041950.html","post_id":7554041950,"result_date":"2022-11-05T18:36:27.000Z","title":"Amazing amenities can be yours at Silk Factory Lofts! 2 bed, 1.5 bath","description":"Silk Factory LoftsRENT: $2267 \/ MONTH SIZE: 1411 sq ft  BEDROOMS: 2 BATHROOMS: 1.5 LEASE TERMS: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-Month show contact info\nUNIT FEATURES:   ❖ Cable & Hi-Speed Internet Ready❖ Central Air Conditioning❖ Courtyard View in select apartments❖ Dishwasher❖ Full Size Washer & Dryer❖ Large Windows❖ Range \/ Oven❖ Refrigerator\/Freezer❖ Secured Building Access❖ Storage SpacesSEE WHAT YOU'VE BEEN MISSING  Live the luxurious lifestyle you're looking for in a building rich with history enhanced with modern amenities at Silk Factory Lofts. Our Lansdale, PA apartments feature open-concept loft-style layouts with high ceilings, chic kitchens, and oversized windows that make each home bright and welcoming. Communal spaces are designed with residents' comfort and convenience in mind at our Lansdale apartments. Residents can hang out in our upscale lounge, maintain work out goals at the on-site fitness center, and so much more at our apartments in Lansdale, PA.PROPERTY FEATURES: ❖ 18' Long Shuffle Board❖ 2 Weber Propane Grills❖ Business Center❖ Elevator❖ Game Room & Free Wi-Fi❖ Monthly Community Events❖ Package Service❖ Pet-Friendly Community❖ Pool Table❖ Smoke-Free❖ Beautifully Landscaped Grounds with Access to Local Businesses❖ Close to Montgomeryville Mall and Routes 202 & 309❖ Community Lounge featuring free Verizon Fios TV\/Wi-Fi❖ Courtyard featuring tasteful Outdoor Seating and Fire Pits❖ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting❖ Free Parking - 2 Spaces per Apartment Home + Guest Parking❖ Lobby Area with Complimentary Coffee❖ Maintenance-Free Lifestyle❖ Professional On-Site Management Team❖ Storage units - $50\/$75 per month PET POLICY: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephVISIT OR CALL US TODAY!  200 S Line StLansdale, PA 19446 show contact info\nWebsite: https:\/\/www.silkfactoryapts.com\/ Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYF76CF909050544A5\n","num_images":24,"lat":40.237106,"lng":-75.280919,"attrs":"['2BR \/ 1.5Ba', '1411ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T14:32:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554037220.html","post_id":7554037220,"result_date":"2022-11-05T18:26:15.000Z","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nCommunity Features\n* Pet Salon\n* Community Lounge\n* TV Lounge\n* Bark Park\n* Minutes from Restaurants, Shopping, and Much More\n* Billiards\n* Spa\n* Easy Freeway Access\n* Professionally Managed\n* Yoga Lounge\n* Outdoor Grill Area\n* Swimming Pool\n* Fitness Studio\n* Sun Deck\n[#9470281]","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-05T14:22:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554036808.html","post_id":7554036808,"result_date":"2022-11-05T18:25:16.000Z","title":"Schedule a Tour, Granite Countertops, Playground","description":"A pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nCommunity Features\n* Playground\n* Elevator\n* Short or Long Term Lease Available\n* Easy Freeway Access\n* Swimming Pool\n* Pet Salon\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Garage Parking\n* Fitness Studio\n* Landscaped Courtyards\n* Non Smoking Community\n* Extra Storage\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Long Term Lease Available\n* Bike Racks\n* Sun Deck\n* WiFi Access\n* EV Charging\n* Renters Insurance is Required\n* Outdoor Grill Area\n* Professionally Managed\n* Controlled Access\n* Community Lounge\n* Dry Cleaning and Laundry Service\n* Credit Cards Accepted\n* Movie Theatre\n* TV Lounge\n* Community Kitchen\n* After-Hours Emergency Maintenance\n* Bark Park\n* Gaming Area\n* Billiards\n* Package Acceptance\n* Minutes from Restaurants, Shopping, and Much More","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1207ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-11-05T14:21:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554034427.html","post_id":7554034427,"result_date":"2022-11-05T18:19:58.000Z","title":"Incredible Amenities, Stylish Features, Lease Today","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nLease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T14:15:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554006986.html","post_id":7554006986,"result_date":"2022-11-05T18:13:57.000Z","title":"Three Bedroom 1 Bath w\/Central Air","description":"This COMPLETE REHAB directly behind Temple University Medical School is a must-see! This two-bedroom two full bathroom property is on N. 15th, one block from Temple medical school. It is one block to the Broad St. subway line with a 15-minute commute into downtown Philadelphia. The property boasts the following features: - New Kitchen - Central Air & Forced Heat - All new Windows - New recessed lighting - New laminate hardwood throughout the entire unit - Second-floor unit - Yard access - Washer\/Dryer on site The landlord requires first, last and security deposit to move in. No evictions will be considered. This property will go quickly. Section 8 is not approved.","num_images":7,"lat":40.0118,"lng":-75.1456,"attrs":"['3BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T13:19:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554030162.html","post_id":7554030162,"result_date":"2022-11-05T18:11:13.000Z","title":"Pickle Ball Courts, Tennis, Three tot lots with modern play equipment","description":"Bedrooms: 2Bathrooms: 3.5Square Feet: 1576Date Available: 2022-11-05Address: One Applewood DriveHeritage Orchard Hill welcomes you to explore our 1-, 2-, and 3-bedroom Perkasie townhomes and schedule a tour to see everything our community has to offer. Enjoy beautiful apartment features, including 9-foot ceilings, a full-size in-unit washer\/dryer, a 3,300 sq. ft swimming pool, an on-site fitness center. Explore our photo gallery to see the contemporary, neutral decor and comfortable living spaces at Heritage Orchard Hill. Call  show contact info\nto speak to a leasing agent today and schedule a tour of your new home today or apply online!Learn more about all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.Our Leasing Office is ready to answer your questions about our luxury townhomes for rent in Perkasie, Pennsylvania. Whether you need extra space for remote working or virtual schooling, or just like to spend some time in a well-appointed townhome, we have the floor plans you are looking for. Reach out and let us show you how easy it is to move into our Bucks County townhomes today! Contact us today to schedule your self-guided or virtual tour! Amenities Include:Scenic walking trailsConvenient location3,300 square foot swimming pool with adjacent baby poolTennis4,700 square foot clubhouse available for private partiesPickle Ball CourtsCommunity parties and events scheduled throughout the year1,800 square foot open-air deckPet parkPet friendly (pets stay free)Multiple shopping destinations just miles awayFitness center with high-tech sound system and televisionsCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/vfxgncys\/heritage-orchard-hill\n","num_images":8,"lat":40.3765,"lng":-75.2648,"attrs":"['2BR \/ 3.5Ba', '1576ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T14:07:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554013755.html","post_id":7554013755,"result_date":"2022-11-05T17:47:37.000Z","title":"2 Bedroom Apartments Available","description":"Apt. 2510 — Oxford floor plan — 1,203 sq. ft. — $3,510\nThis 5th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":19,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-05T13:33:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554012816.html","post_id":7554012816,"result_date":"2022-11-05T17:35:48.000Z","title":"Ceiling fans, Gas fireplaces, Central air","description":"Bedrooms: 2Bathrooms: 3Square Feet: 1790Date Available: 2022-11-05Address: 1 Applewood DriveEnjoy dramatic 9-foot ceilings, walk-in closets, and gas fireplaces in your luxury townhome at Heritage Greene. Our community provides comfortable and convenient amenities, including garage parking and a swimming pool. Heritage Greene offers residents access to storage space and free fitness center at our sister property Heritage Orchard Hill. Our residential community is pet-friendly so bring your furry friends along to enjoy our two spacious pet parks surrounded by meticulously landscaped open space. Check out our photo gallery to see more of what we have to offer. Schedule a tour with a leasing agent today – call  show contact info\n!Deposit is equal to one month’s rentAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.Check availability at all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.We are looking forward to telling you about our townhomes to rent in Bucks County, Pennsylvania. At Heritage Greene, our detached garages expand your living space and are ideal whether you are working or schooling remotely or looking for a pet-friendly place to call home. Contact our leasing office today to schedule your self-guided or virtual tour! Amenities Include:Individually controlled, high-efficiency gas heat and hot waterLuxurious tile bathrooms with large soaking tubsFree fitness center and clubhouse less than 2 miles away at sister community, Heritage Orchard HillFull-sized heavy duty washer\/dryer in each homeCentral airPet-friendlyAvailable garage parkingDaily office hours1,200 square foot swimming pool with adjacent baby pool24-hour emergency serviceTwo spacious pet parks surrounded by meticulously landscaped open spaceGourmet kitchen with microwave, dishwasher, disposal, and stainless sinkCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/hwv7wvfm\/heritage-greene\n","num_images":8,"lat":40.3765,"lng":-75.2648,"attrs":"['2BR \/ 3Ba', '1790ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T13:31:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554003698.html","post_id":7554003698,"result_date":"2022-11-05T17:17:22.000Z","title":"Tennis, Convenient location, Pet park","description":"Bedrooms: 2Bathrooms: 2.5Square Feet: 1660Date Available: 2022-11-05Address: One Applewood DriveHeritage Orchard Hill welcomes you to explore our 1-, 2-, and 3-bedroom Perkasie townhomes and schedule a tour to see everything our community has to offer. Enjoy beautiful apartment features, including 9-foot ceilings, a full-size in-unit washer\/dryer, a 3,300 sq. ft swimming pool, an on-site fitness center. Explore our photo gallery to see the contemporary, neutral decor and comfortable living spaces at Heritage Orchard Hill. Call  show contact info\nto speak to a leasing agent today and schedule a tour of your new home today or apply online!Learn more about all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.Our Leasing Office is ready to answer your questions about our luxury townhomes for rent in Perkasie, Pennsylvania. Whether you need extra space for remote working or virtual schooling, or just like to spend some time in a well-appointed townhome, we have the floor plans you are looking for. Reach out and let us show you how easy it is to move into our Bucks County townhomes today! Contact us today to schedule your self-guided or virtual tour! Amenities Include:Community parties and events scheduled throughout the yearPet parkMultiple shopping destinations just miles awayTennisThree tot lots with modern play equipmentScenic walking trailsPet friendly (pets stay free)1,800 square foot open-air deck4,700 square foot clubhouse available for private parties3,300 square foot swimming pool with adjacent baby poolFitness center with high-tech sound system and televisionsPickle Ball CourtsCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/rdtagvdd\/heritage-orchard-hill\n","num_images":8,"lat":40.3765,"lng":-75.2648,"attrs":"['2BR \/ 2.5Ba', '1660ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T13:13:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7554002402.html","post_id":7554002402,"result_date":"2022-11-05T17:14:44.000Z","title":"On-Site Management, BBQ\/Picnic Area, Custom Subway Tile Backsplashes","description":"Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Call Now:  show contact info\nx 20OR Text 20 to  show contact info\nto chat!Interested in more information? See link below:https:\/\/mack.touraptnow.com\/mx1010 This is a 1 Bedroom, 1 Bath, approximately 776 Sq. Ft. Features - Electronic Thermostat  - Large Closets with Organizing Systems  - Patio\/Balcony*  - Air Conditioner  - Cable Ready  - Tons of Natural Lighting Throughout  - Flush Mount Sinks with Goose Neck Faucets  - Disposal  - Hardwood Style Flooring  - Selected  - Dishwasher  - Washer\/Dryer  - Stone Counters  - Premium Stainless Steel Appliance Package  - Gas Range  - Custom Subway Tile Backsplashes *In Select Apartment Homes Community Amenities - Fitness Center  - Parisian Style Café with Demonstration Kitchen  - Covered Parking  - Multiple, Expansive Outdoor Spaces  - Free Weights  - Garage  - Tennis Court  - On-Site Maintenance  - Smoke-Free Community  - Off Street Parking  - Sundeck  - Multiple Co-Working Studios  - On-Site Management  - Selected  - Elevator  - BBQ\/Picnic Area  - Courtyard  - Playground  - Rooftop Dog Park Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMThe Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Bk0L0e4f\n","num_images":7,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '776ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T13:10:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553991862.html","post_id":7553991862,"result_date":"2022-11-05T17:09:26.000Z","title":"30 N 41st St, =>>Very COOL -  3BD+2B.A","description":"Super spacious 3 bedroom attached townhome in 30 N 41st St, Philadelphia, PA. This large townhouse scan be used as a 1 bed with bonus space, or 2 bed 1.5 bath apartment. There are high ceilings, stainless appliances, stacked off-street parking, washer\/dryer in-unit and a large living space. On the first floor is one bedroom, the living room, half-bath, kitchen, access to the basement where the washer\/dryer is located and additional storage. Off of the kitchen is outdoor storage space access. The First floor has a bedroom and the full bath with a walk-in shower. There is on demand hot-water, newer windows, and granite countertops. Landlord pays water\/sewer, landscaping\/plowing. Tenant pays utilities. Still tenant occupied, showings will begin TODAY . Pet would be considered. Income and credit requirement restrictions apply, must have a Good current credit score, must make 2X income of monthly rent. Year lease required.","num_images":6,"lat":39.978,"lng":-75.1459,"attrs":"['3BR \/ 2Ba', 'available nov 25', 'air conditioning', 'application fee details: $11 every applicants (no credit & background) & $22 lease processing fee', 'broker fee details: NO BROKER FEE==>', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T12:49:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553999371.html","post_id":7553999371,"result_date":"2022-11-05T17:08:55.000Z","title":"Pet friendly houses for rent Montgomery County","description":"Pet friendly houses... first, last, security and good credit required, must meet pets.\nPLEASE RESPOND WITH HOW MANY PEOPLE, PETS, AND MOVE DATE. Thank you\nBridgeport 3 br 1800.00 central air, gas heat, washer and dryer, deck, fenced yard, living room, dining room, eat in kitchen, avail. Dec 1 2022\nSwedeland (King of Prussia) 4 br 2000.00, gas heat, new carpet, fresh paint, rear fenced yard with deck, front porch, washer and dryer, living room, dining room, kitchen with island.  Avail. Jan 2023\n","num_images":7,"lat":40.107382,"lng":-75.343294,"attrs":"['3BR \/ 1Ba', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T13:04:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553991700.html","post_id":7553991700,"result_date":"2022-11-05T16:53:06.000Z","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"You will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nApartment Features\n* Full sized Washer and Dryer in unit\n* Wood-Like Floors\n* Extra Storage\n* Granite Countertops\n* Private Patio or Private Balcony (on select apartments)\n[#9470123]","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T12:49:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553973611.html","post_id":7553973611,"result_date":"2022-11-05T16:38:32.000Z","title":"Pet friendly, Amazing Views, Spacious closet, Floor to Ceiling Window","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Online Payments AvailableHuge walk-in closets with ample storage48-hour Maintenance CommitmentAlexa or Google Home Capable in all ApartmentsBBQ and deck areaUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densPet-friendly livingGame Room with Billiards Table, Shuffle Board, and moreFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingJogging trail right outside your doorBark parkState-of-the-art fitness center overlooking the Manayunk canalCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/zxotnfot\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-11-05T12:11:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553981512.html","post_id":7553981512,"result_date":"2022-11-05T16:32:11.000Z","title":"Eat-In Kitchen\/ Big Master Bedroom\/ Second Floor\/Pool\/Gym\/Pet Friendly","description":"RENT PERIOD: YEARLY\nAsk about apartment home A07 on the second floor, available now!!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up a tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday: 9:00 am-6:00 pm, Fridays: 9am – 5pm and also Saturday from 10:00 am-4:00 pm. * Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\n-Full Size Washer\/Dryer In select homes.\nCOMMUNITY FEATURES:\n-On-Site Management\n-On-site maintenance\/24 hour emergency service\n-Septa Bus stop on the corner\n-Ivy Ridge Train Station blocks away\n-Online Payments Available\n-Cable Ready\n-On line service request\n-Septa Transportation outside the Rental Office\n-Pool located at sister property(Pool membership available. Fees Apply)\n-Gym located at sister property\nThe Metropolitan Manayunk Hill apartment homes, are just minutes to Center City Philadelphia, Manayunk Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA turnpike. Walk to Ivy Ridge Shopping Center and ShopRite Supermarket. Convenient to Ivy Ridge Train Station to Center City, Andorra Shopping Center, Target and more! The Metropolitan Manayunk Hill apartment homes are a great choice for both convenience and a quality of life. that's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity.\n","num_images":13,"lat":40.043502,"lng":-75.236199,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T12:28:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553979429.html","post_id":7553979429,"result_date":"2022-11-05T16:27:33.000Z","title":"Studio Apts. Becoming Available!! Heat\/Water Included!!!","description":"Sunny, studio apartments becoming available STARTING at $1,080! Apartments feature upgraded kitchens and baths, amazing views, large windows and 9 ft. ceilings. Ask about our NO SECURITY DEPOSIT program!! Cats are welcome (add'l fee)! All apartments are rented unfurnished.\nChancellor Apartments is a convenient high rise apartment community in an amazing location in Center City. We are close to most major schools and universities, public transportation, historical attractions, shopping, restaurants and theaters. Center City at its best!!\nRent includes: heat, hot\/cold water, 24-hour front desk attendant, free bike storage room, package acceptance service, 24-hour emergency maintenance service, on-site smart card laundry plus card access system and BuildingLink resident services portal access for all residents.\nThe Chancellor boasts several different studio and one bedroom floor plans. Apartments feature high ceilings, large bright windows, ceiling fans in most units, hardwood floors and breathtaking views of the Philadelphia skyline and Delaware River. Many apartments have large walk-in closets, too!\nWe have partnered with Optimal Sport Health Club to offer a generous discounted gym membership (we pay your initiation fee!). There are several off street parking lots and garages in the area, too!\nCHANCELLOR APARTMENTS\n206 S. 13th Street\nPhiladelphia, PA 19107\nshow contact info\nFranceina Thorne, REALTOR\nHours:\nMon. - Fri. 8:30 to 5:00\nSaturday - 10:00 to 3:00\nAppointments are highly recommended","num_images":14,"lat":39.948681,"lng":-75.162197,"attrs":"['0BR \/ 1Ba', 'available jan 14, 2023', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T12:23:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553978244.html","post_id":7553978244,"result_date":"2022-11-05T16:24:59.000Z","title":"Private Balcony, Quiet Community, Move In Now","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\n[#9470029]","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1232ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-05T12:20:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553978234.html","post_id":7553978234,"result_date":"2022-11-05T16:24:58.000Z","title":"Pet friendly (pets stay free), Scenic walking trails, Pet park","description":"Bedrooms: 2Bathrooms: 1.5Square Feet: 1624Date Available: 2022-11-05Address: One Applewood DriveHeritage Orchard Hill welcomes you to explore our 1-, 2-, and 3-bedroom Perkasie townhomes and schedule a tour to see everything our community has to offer. Enjoy beautiful apartment features, including 9-foot ceilings, a full-size in-unit washer\/dryer, a 3,300 sq. ft swimming pool, an on-site fitness center. Explore our photo gallery to see the contemporary, neutral decor and comfortable living spaces at Heritage Orchard Hill. Call  show contact info\nto speak to a leasing agent today and schedule a tour of your new home today or apply online!Learn more about all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.Our Leasing Office is ready to answer your questions about our luxury townhomes for rent in Perkasie, Pennsylvania. Whether you need extra space for remote working or virtual schooling, or just like to spend some time in a well-appointed townhome, we have the floor plans you are looking for. Reach out and let us show you how easy it is to move into our Bucks County townhomes today! Contact us today to schedule your self-guided or virtual tour! Amenities Include:Convenient location3,300 square foot swimming pool with adjacent baby poolScenic walking trailsPet parkMultiple shopping destinations just miles away1,800 square foot open-air deckFitness center with high-tech sound system and televisions4,700 square foot clubhouse available for private partiesThree tot lots with modern play equipmentTennisPet friendly (pets stay free)Pickle Ball CourtsCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/xvpfg2wj\/heritage-orchard-hill\n","num_images":8,"lat":40.3765,"lng":-75.2648,"attrs":"['2BR \/ 1.5Ba', '1624ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T12:20:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553978015.html","post_id":7553978015,"result_date":"2022-11-05T16:24:30.000Z","title":"VERY CLEAN & AFFORDABLE!!! GREAT THINGS COME IN SMALL PACKAGES","description":"**Available Immediately! ** GREAT THINGS COME IN SMALL PACKAGES!!This adorable 3 bedroom, 2 bath cottage packs a punch! Looking to downsize or just have a low maintenance getaway? This little gem might be exactly what you have been looking for.The first thing you notice upon entering the home is the unique wood-paneled walls that add a rustic\/modern vibe to the living room and bedroom. Gorgeous wide plank wood floors extend from the living room into the bedroom and kitchen. The tall ceilings give the cottage a spacious feel.A newly constructed wall separating the living and kitchen spaces has a built in electric fireplace which not only adds warmth, but great ambiance to the space. The bedroom, with closet, is quite sizeable for a small home. Recent upgrades to the kitchen include light fixtures, stove and cabinets. A closet with barn style doors houses a new hot water heater and washer\/dryer unit. The full bathroom has a claw foot tub with shower. An attic with access from pull-down stairs provides plenty of storage or has the potential to be converted into additional living space.Walk out the door off of the kitchen onto a beautiful stone patio. This is where you will want to enjoy your morning coffee or afternoon drinks.Outside upgrades including the stone patio, landscaping, and gravel driveway add to the curb appeal of the cottage. All of this on just over 2 acres with frontage on 2 town maintained roads.Just outside the historic village of Jefferson, which offers great dining choices, farmers market, and various shops. No Email, Just calls.\nCall Ashley\/Brian: ( 8 5 5 ) 6 5 3 - 0 8 5 9\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nOne bedroom, studio, or private room wanted. I'm a retired teacher currently working for the Cashmere District part-time. Non everything. No smoke, drink, drugs, drama, or other issues. No pets. Vaccinated, fingerprinted, healthy and active, I'm just a quiet solitary old guy who otherwise likes to write. Can move by Nov. 15th, or later if needed. Looking in the $700-$1000 rangeMy name is dawn .I am a r43 year old with a 6 year 9ld pit .she is very friendly.8 live 8n the8untains and it's winter time so I had to leave cause the future weather.i am very hard working and need a place to set up my tent for the winter months.8 would like to trade work for a spot to stay.8 can some cash.i have good references.i am a jackett of almoat all trades.please we are desperate 8 have binHello, I?m looking for a short term 1-3 months place to rent (room, sublet, cottage, whatever you have). I?m 39, great morals, rent ethics, and all of that good stuff. Waiting on a piece of land, and just need a place to rent for a few months. Always thoroughly paid up on rent and could definitely meet any requirements needed. I have a contracting business, so I'm usually really busy. Easy to get along with, quiet, neat, and always respectful. Thanks,My name is Anthony, I'm a single 33 year old that keeps a pretty quiet life. I work in construction but right now I'm painting full time. I make 800 a week at the moment. I work under the table so the only proof of income I have is going to work all day, everyday. Even over the table jobs are not secure these days so anyone could have a job 1 day an not the next. I work a lot on my weekends so I won't be around a lot. I'm looking for a quiet relaxed place with a room or a 5th wheel situation under 800 a month I would like to meet for a little bit in person to get a good feeling of someone to see if it would be a great fit an a better understanding of who someone is more than through a message. I enjoy my beer after work an currently trying to quit smoking. I do smoke weed. I some times stay out late on a rare occasion.Hello. I?m looking for a clean furnished room starting Nov.1st. I?m a gardener and I also work at the restaurant. I have a well behaved rescue cat with me. I?m looking for something month to month. My budget is $600. I?m 37.F. Please let me know if you are looking for a roommate. Thank you.Husband and I are looking for a sm house. We both are on social Security. We are looking for second chances, my husband is a felon , he completed what was asked of him, he's on the right path. Have skills to help someone out also. We are honest christians. Do not have lots of money for fees. have animalsLooking for a room to rent in the price of up to $480\/month. I have a benefit check that is small but stable to cover rent. I have no pets, no , am single, drug-free, don't smoke, don't drink, am busy most of the time outside the home, and I'm fairly quiet, respecting quiet hours and am respectful all around.I'm a 31 year old looking for a place in McMinnville Oregon or at least near by. I can afford at least $500 to $700 a month with utilities already included in the price. I work 4 days a week as the closing dishwasher at my job in McMinnville Oregon. Serious inquiries only.I?m a quiet, mature, clean, conscientious seeking a 1-2 bedroom rental as either a stand alone cottage, or ADU\/duplex\/own suite type arrangement, into organic living, don?t spray the land, etc. Seeking healthy, peaceful, rental. I don?t smoke or drink, I have no pets, (but love them). I?m a native Oregonian and have great references and credit, and will take good care of my new home. If shared space\/land, I mostly keep to myself, but also open to sharing occasional meal and conversation on occasion, if this suits the situation. Looking to move soon as my current rental is being sold, but can maybe be flexible for good fit. Prefer long-term, but open to short-term. (Please, no basement units)I?m seeking a room (or 2, would like a small bonus room for a bit of storage and writing space) with ideally one other in fragrance-free, more natural-oriented, healthy home. Would also like a yard\/green space. Or also interested in a mother-in-law type cottage\/ADU apt on the property. I?m mature, tidy, quiet, conscious, responsible, mid-50s f, non-smoker\/drinker, for non-smoking rental, I have no pets, but love them, I have stable income, great credit and references, and will take great care of my new home! I am pretty quiet and like to do my own thing, but also up for chat or meal sharing on occasion if we choose, but I?m also very independent. I?m looking to move now, as my current rental has sold, but some flexibility with dates can be possible. Would prefer to rent longer-term, but may be interested in shorter-term while I look, too. Open to outer areas.My name is Scott Brill and I work full time in Issaquah at DARIGOLD. I am also a homeless Veteran in a program that will pay everything it takes to get into my own studio or one bedroom apartment. And also up to six months rent?after that I?m responsible for 50 percent of the rent and the VA pays the other half from two to four years. Then I?ll be able to handle any rent beyond that time period. I?m I. This position due to the current president and the insane amount of gas and food prices. I?m clean and very responsible. Please contact me and I?ll respond d when I?m able to.Motel 6 Seattle South is located off Interstate 5, exit 151 Nearby attractions are Westfield Southcenter Mall and 3.3 miles from 6 Seattle Tacoma International Airport. Saint Anne Hospital is within 3.8 miles. Eateries nearby include Subway, El Pollo Loco, IHOP, McDonalds, and many more. At Motel 6 Seattle South, guests have access to truck parking and a coin laundry on site. Relax in our outdoor pool open seasonally. All smoke-free guest rooms have a kitchenette along with free Wi-fi, local calls, and extended cable service Wi-Fi freeMy name is James, I?m a 20 year old Loss Prevention Detective for TJX, I have a dog so I?m looking for a room with a yard or nearby park, I can afford 1150\/month, I don?t drink or smoke, I?m looking for a to a 2-6 month agreement with any number of roommates.I am a single . No or pets. I am looking for a small house\/apartment\/mobile home to rent. The most I would like to pay is $1000.00 per month. I would like to find at least a one bedroom one bath. Larger would be great. I work near Ridgefield so would like to find something in North Vancouver, Battleground, Ridgefield or La Center.I recently started a new job in Bothell and would love to find a temporary room rental in the area. A little about us: 35yo with a charming cat who thinks he?s a puppy. He?s very friendly, a big Seahawks fan, enjoys long conversations, & the company of other dogs\/cats. During the pandemic I organized large scale aid efforts to rural Indigenous communities in the U.S. & Canada and recently moved to Bothell for work. I enjoy books, learning, history, arts\/craft, teaching, good coffee, healthy boundaries, and would like to make new friends who introduce me to all the good restaurants in the area. If all that sounds like someone you?d enjoy welcoming into your home for a month or two?feel free to respond with a bit about you, details of the room available, & your expectations of a guest. I?d love to hear from you.Hi, since people are sensitive after COVID, I?ll mention first hand im of Asian-descent. Im in my 30s, and facing a situation where im stuck in this State and just lost everything, and broken up which resulted in me staying in my car. Staying at some people I know will just complicate situations. If I can have the alternative, I?ll do just that. I work part time locally, so I can exchange rent money with some housekeeping, and or if u run your own business we can arrange some work for me to get done for the exchange. I am a quick learner and I know with some training I can perform office work or more manual labor. As long as it feels fair and make sense, I?m down for it and if not then, oh well. I don?t mind no full privacy, such as sharing bathroom or room, please no sharing bed And this is temporary, I?m fully intent to head back to the State where my family resides Pls first contact me via text message. When I feel comfortable, we can chat thru the phone or meet somewhere in public.We are a couple both 41 looking for room to rent. We are clean people keep to ourselves like to cook garden when time is right. I work construction other works in housekeeping type business can help around house as well cleaning n such please reply with any questions thanksI am a single Christian man 43 years old, who is desperately needing to find a room to rent ASAP. I am alcohol and drug free and don't smoke. I would like to live in a sober living environment. I am on social security income (hearing loss) , I am clean, organized and very respectful. I have a voucher that can be used for rent. My price range is $300 -400 max utilities included. I'm on a fixed income. Have strong reliable rental history and references upon request I don't own any pets but I'm okay living with them.Hi I am a 39 year ol and my fiancee who is a 49 year old are looking for a 3 bedroom house to rent in Gresham she has lived at our current residence for 6 years and I got sick and lost my residency 4 years ago and had to start my life over due to medical issues I have worked at ups the last 2 years and she has worked at Ross the last 6 years I lost my son to cps because I had 3 strokes and was in a comma for four months and now I am about to get him back however me and my fiancee live in a 2 bedroom apartment and she already has 2 one is 10 and the other is 11 and my son is 12 however inorder to get my son back we need a bigger place so we must find a 3 or 4 bedroom house for every one we are looking for a house in Gresham so if anyone has a house for rent in the Gresham area and want great tenants that are hard working and very clean people please send me a email and let me know about the house and how much you are trying to rent it for we are a family trying to get a nice house for us and are however we also have a dog and 2 cats that are also part of are family so please be pet friendly please get ahold of us and you will have great tenants that will take care of your house for you my fiancee is a ocd neat freak so are house is always spotless so If you want someone that will take good care of your home we are them please send me an email if you are interested ty for your time\n","num_images":7,"lat":40.2378,"lng":-75.2955,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-05T12:20:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553975740.html","post_id":7553975740,"result_date":"2022-11-05T16:19:43.000Z","title":"Theater Room, Quiet Community, Move In Now","description":"Discover a brand-new community designed to take luxury to the next level while keeping you close to everything you need. Lease now at The Point at Exton!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, ensuite bathrooms, walk-in closets, and a washer\/dryer!\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nCommunity Features\n* Bike Racks\n* Controlled Access Parking\n* Easy Freeway Access\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* Professionally Managed\n* Sun Deck\n* Fitness Studio\n* Community Kitchen\n* Garage Parking\n* TV Lounge\n* Swimming Pool\n* Outdoor Grill Area\n* Extra Storage\n* Package Acceptance","num_images":24,"lat":40.031462,"lng":-75.628976,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T12:15:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553974836.html","post_id":7553974836,"result_date":"2022-11-05T16:17:55.000Z","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nFind yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two story two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, two patio\/balconies, and a loft with a closet upstairs!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Pantry\n* Stainless Steel Appliances\n* Roommate Friendly Floor Plan\n* Granite Countertops\n* Central Heat and Air\n* Disposal\n* Window Coverings\n* Breakfast Bar\n* Full sized Washer and Dryer in unit\n* Garden Tub\n* Linen Closet\n* Pre-wired for internet and cable\n* Lofty Vaulted Ceilings\n* Walk-in Closet\n* Ceiling Fan\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Private Patio or Private Balcony (on select apartments)\n* High Efficiency Lighting Fixtures\nCommunity Features\n* Garage Parking\n* Long Term Lease Available\n* Gaming Area\n* WiFi Access\n* Fitness Studio\n* Extra Storage\n* Community Kitchen\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Elevator\n* Easy Freeway Access\n* Billiards\n* Pet Salon\n* TV Lounge\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Package Acceptance\n* Controlled Access\n* Credit Cards Accepted\n* Playground\n* Short or Long Term Lease Available\n* Renters Insurance is Required\n* Bike Racks\n* Community Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* After-Hours Emergency Maintenance\n* Landscaped Courtyards\n* Sun Deck\n* EV Charging\n* Bark Park\n* Professionally Managed\n* Movie Theatre\n* Outdoor Grill Area\n* Dry Cleaning and Laundry Service\n* Non Smoking Community\n* Swimming Pool","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1376ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-11-05T12:13:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553969123.html","post_id":7553969123,"result_date":"2022-11-05T16:06:31.000Z","title":"Near area attractions, Daily office hours, 24-hour emergency service","description":"Bedrooms: 2Bathrooms: 2.5Square Feet: 1660Date Available: 2022-11-05Address: 1 Applewood DriveEnjoy dramatic 9-foot ceilings, walk-in closets, and gas fireplaces in your luxury townhome at Heritage Greene. Our community provides comfortable and convenient amenities, including garage parking and a swimming pool. Heritage Greene offers residents access to storage space and free fitness center at our sister property Heritage Orchard Hill. Our residential community is pet-friendly so bring your furry friends along to enjoy our two spacious pet parks surrounded by meticulously landscaped open space. Check out our photo gallery to see more of what we have to offer. Schedule a tour with a leasing agent today – call  show contact info\n!Deposit is equal to one month’s rentAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.Check availability at all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.We are looking forward to telling you about our townhomes to rent in Bucks County, Pennsylvania. At Heritage Greene, our detached garages expand your living space and are ideal whether you are working or schooling remotely or looking for a pet-friendly place to call home. Contact our leasing office today to schedule your self-guided or virtual tour! Amenities Include:5,000 square foot tot lot with modern play equipmentSpacious finished basementsHardwood laminate floorsIndividually controlled, high-efficiency gas heat and hot waterDaily office hoursAvailable garage parkingPrimary bedroom with cathedral ceiling and walk-in closetsDesigner window treatmentsPet-friendlyDramatic 9-foot first-floor ceilingsIndividual storage space1,200 square foot swimming pool with adjacent baby poolCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/ixcs4ooe\/heritage-greene\n","num_images":8,"lat":40.3765,"lng":-75.2648,"attrs":"['2BR \/ 2.5Ba', '1660ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T12:02:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553939960.html","post_id":7553939960,"result_date":"2022-11-05T16:03:03.000Z","title":"Efficiency apartment for rent ($900 a month)","description":"I have a three story house which I rent out rooms. All the rooms are currently occupied but I live in the efficiency apartment on the 1st floor and I’m moving out this week to move in my other property. If you are interested please contact me with no games. Comes furnished with two lovely brand new couches and a full size mattress. You can’t beat this has a beautiful kitchen and bathroom all on one floor. It’s $900 a month and you will also need a $900 security deposit. Sorry for the pictures I’m currently packing everything up.. Total $1800 to move in…\nContact me for more info!!\n","num_images":9,"lat":39.931312,"lng":-75.252399,"attrs":"['1BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:55:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553961097.html","post_id":7553961097,"result_date":"2022-11-05T15:48:14.000Z","title":"3 Bedroom apartment 2075.00","description":"3 bedroom apartment located in Wyncote Pa. Cheltenham Township. Walking distance of Arcadia University.\nRent is 2075.00 per month with one month security and last month rent  based on credit report. Cats are allowed.\n","num_images":22,"lat":40.0867,"lng":-75.1524,"attrs":"['3BR \/ 2Ba', '1650ft2', 'available now', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T11:44:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553958131.html","post_id":7553958131,"result_date":"2022-11-05T15:41:05.000Z","title":"1 bedroom apartment","description":"1 bedroom apt living room dining  room bath room kitchen laundry hook up in basement rear deck and small yard 2 car parking in rear heat included must pay own electric 1 month security deposit $1150.00 +$1150.00 to move in must fill out application","num_images":0,"lat":40.246737,"lng":-75.277891,"attrs":"['1BR \/ 1Ba', 'available nov 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T11:37:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553927966.html","post_id":7553927966,"result_date":"2022-11-05T15:35:28.000Z","title":"3 Bed\/1 Bath  includes access to the Valley Forge Towers clubhouse!!","description":"Look at this single home for rent that includes access to the Valley Forge Towers clubhouse! The amenities included in the rent include but are not limited to an outside pool, indoor pool that is open year-round and heated, exercise room with gym equipment, inside work areas, and an outside area for relaxing or hanging out with friends. The rent also includes lawn maintenance, snow removal, trash, water and sewer. The convenience of living in a condo but having the privacy of a single home!\nThe home features 3 bedrooms and 1 full bath all on the main floor. The kitchen features a stainless-steel refrigerator and a microwave. Adjoining the kitchen is the dining room with a great space for a table and chairs for your meals. The spacious living room features a gas fireplace insert for a cozy night in.\n","num_images":0,"lat":40.0956,"lng":-75.3737,"attrs":"['3BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T10:24:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553953994.html","post_id":7553953994,"result_date":"2022-11-05T15:31:05.000Z","title":"Pickle Ball Courts, Pet park, Scenic walking trails","description":"Bedrooms: 1Bathrooms: 1.5Square Feet: 1559Date Available: 2022-11-05Address: One Applewood DriveHeritage Orchard Hill welcomes you to explore our 1-, 2-, and 3-bedroom Perkasie townhomes and schedule a tour to see everything our community has to offer. Enjoy beautiful apartment features, including 9-foot ceilings, a full-size in-unit washer\/dryer, a 3,300 sq. ft swimming pool, an on-site fitness center. Explore our photo gallery to see the contemporary, neutral decor and comfortable living spaces at Heritage Orchard Hill. Call  show contact info\nto speak to a leasing agent today and schedule a tour of your new home today or apply online!Learn more about all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.Our Leasing Office is ready to answer your questions about our luxury townhomes for rent in Perkasie, Pennsylvania. Whether you need extra space for remote working or virtual schooling, or just like to spend some time in a well-appointed townhome, we have the floor plans you are looking for. Reach out and let us show you how easy it is to move into our Bucks County townhomes today! Contact us today to schedule your self-guided or virtual tour! Amenities Include:Community parties and events scheduled throughout the yearConvenient locationTennisMultiple shopping destinations just miles away3,300 square foot swimming pool with adjacent baby poolPet friendly (pets stay free)Fitness center with high-tech sound system and televisionsScenic walking trailsPickle Ball Courts4,700 square foot clubhouse available for private partiesThree tot lots with modern play equipment1,800 square foot open-air deckCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/i4hdy3xr\/heritage-orchard-hill\n","num_images":8,"lat":40.3765,"lng":-75.2648,"attrs":"['1BR \/ 1.5Ba', '1559ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T11:27:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553949979.html","post_id":7553949979,"result_date":"2022-11-05T15:21:29.000Z","title":"Lots Of Natural Light, Big Breakfast Bar, In-Unit Laundry Room, Pool","description":"RENT PERIOD: YEARLY\nAsk about apartment home G10 on the third floor, available now!!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up a tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Thursday: 9:00 am-6:00 pm, Fridays: 9am – 5pm and also Saturday from 10:00 am-4:00 pm. * Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\n-Full Size Washer\/Dryer In select homes.\nCOMMUNITY FEATURES:\n-On-Site Management\n-On-site maintenance\/24 hour emergency service\n-Septa Bus stop on the corner\n-Ivy Ridge Train Station blocks away\n-Online Payments Available\n-Cable Ready\n-On line service request\n-Septa Transportation outside the Rental Office\n-Pool located at sister property(Pool membership available. Fees Apply)\n-Gym located at sister property\nThe Metropolitan Manayunk Hill apartment homes, are just minutes to Center City Philadelphia, Manayunk Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA turnpike. Walk to Ivy Ridge Shopping Center and ShopRite Supermarket. Convenient to Ivy Ridge Train Station to Center City, Andorra Shopping Center, Target and more! The Metropolitan Manayunk Hill apartment homes are a great choice for both convenience and a quality of life. that's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity.\n","num_images":14,"lat":40.043502,"lng":-75.236199,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T11:17:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553943454.html","post_id":7553943454,"result_date":"2022-11-05T15:13:02.000Z","title":"The Grande at Riverview! This beautifully maintained 1-bed\/1-bath,","description":"Welcome Home to Suite #1315 at The Grande at Riverview! This beautifully maintained 1-bed\/1-bath, 3rd floor suite features a bonus room that could serve as a home office, guest room, dressing room - the opportunities are endless! As you enter the suite you'll be greeted by a well appointed kitchen complete with granite counters (including breakfast bar seating), 42\" cherry cabinetry, and hardwood flooring. Beyond the kitchen is a sizable dining area and living room with sliding glass doors to the balcony. The balcony offers views of downtown Conshohocken and also contains a storage closet for any additional storage needs. The large bedroom is bright and features a sizable walk-in closet. You can move right in and start enjoying The Grande lifestyle featuring deeded garage parking (space #45 in the upper garage level), secure building access, community pool and fitness center, and private outdoor gathering areas complete with gas grills and an outdoor fireplace. The Grande offers immediate access to the Schuylkill River Trail, the Norristown\/Manayunk Regional Rail Line, local restaurants, shops, and downtown amenities. A very quick commute to Routes 76, 476 and the PA Turnpike, and close distances to King of Prussia and Center City Philadelphia. Please note, The Grande at Riverview.","num_images":5,"lat":40.073009,"lng":-75.307827,"attrs":"['1BR \/ 1Ba', '825ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T11:03:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553946144.html","post_id":7553946144,"result_date":"2022-11-05T15:12:40.000Z","title":"Spacious finished basements, Pet-friendly, Available garage parking","description":"Bedrooms: 1Bathrooms: 1.5Square Feet: 1605Date Available: 2022-11-05Address: 1 Applewood DriveEnjoy dramatic 9-foot ceilings, walk-in closets, and gas fireplaces in your luxury townhome at Heritage Greene. Our community provides comfortable and convenient amenities, including garage parking and a swimming pool. Heritage Greene offers residents access to storage space and free fitness center at our sister property Heritage Orchard Hill. Our residential community is pet-friendly so bring your furry friends along to enjoy our two spacious pet parks surrounded by meticulously landscaped open space. Check out our photo gallery to see more of what we have to offer. Schedule a tour with a leasing agent today – call  show contact info\n!Deposit is equal to one month’s rentAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.Check availability at all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.We are looking forward to telling you about our townhomes to rent in Bucks County, Pennsylvania. At Heritage Greene, our detached garages expand your living space and are ideal whether you are working or schooling remotely or looking for a pet-friendly place to call home. Contact our leasing office today to schedule your self-guided or virtual tour! Amenities Include:24-hour emergency serviceHardwood laminate floorsTwo spacious pet parks surrounded by meticulously landscaped open spaceNear area attractionsAvailable garage parkingIndividually controlled, high-efficiency gas heat and hot waterCentral airDesigner window treatmentsSpacious finished basementsCeiling fansAttentive and professional full-time management teamDramatic 9-foot first-floor ceilingsCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/4qfp6z5k\/heritage-greene\n","num_images":8,"lat":40.3765,"lng":-75.2648,"attrs":"['1BR \/ 1.5Ba', '1605ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T11:08:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553945750.html","post_id":7553945750,"result_date":"2022-11-05T15:11:50.000Z","title":"2 Bedroom Apartments Available","description":"Balmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":23,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-05T11:07:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553945662.html","post_id":7553945662,"result_date":"2022-11-05T15:11:37.000Z","title":"Large Closets with Organizing Systems, On-Site Management","description":"The Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Call Now -  show contact info\nx 19OR Text 19 to  show contact info\nto text our leasing team.Use this link for more info:https:\/\/mack.touraptnow.com\/2p8k74 Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree. This is a 1 Bedroom, 1 Bath, approximately 650 Sq. Ft.  The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia. Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMB9EyPeVMK\n","num_images":10,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '650ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-05T11:07:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553924833.html","post_id":7553924833,"result_date":"2022-11-05T14:47:20.000Z","title":"Bright and sunny apartment with a Fully Enclosed Bedroom","description":"Bright and sunny apartment with a Fully Enclosed Bedroom and Oversized Windows located in the heart of the historic Old City! 315 Flats is an Elevator Building with a welcoming lobby featuring Marble Floors and an Intercom\/Camera system for Additional Security. Upon entering unit 301, you're greeted by 10-foot ceilings and South-Facing Oversized Windows filling the living space with natural light. The kitchen features Stainless Steel Appliances, a built-in Microwave and Dishwasher, Granite Countertops, Modern Cabinetry, and an Island overlooking the living area. Hardwood Floors are throughout the living space and bedroom. The living room\/dining room combo offers views of The historic Quaker Meeting House and plenty of room for entertaining. The Bathroom includes a Double Sink, a Tub\/Shower combo, and Tiled floors. The in-unit Washer & Dryer are conveniently located in a dedicated closet. The 10-foot Ceilings and Oversized Windows continue in the spacious bedroom, which includes a Walk-In Closet and a modern shelving unit for additional storage. 315 Flats is situated in the heart of the neighborhood and steps from excellent restaurants, shops, Spruce Harbor Park, Independence Hall, Philadelphia's most historic sites, and all that Old City offers. Easy access to I-95, the Vine Street Expressway, and Ben Franklin Bridge. Schedule a private tour today! Garage parking options are located right around the corner.\n315 Arch St #301","num_images":7,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '777ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-05T10:16:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553924805.html","post_id":7553924805,"result_date":"2022-11-05T14:42:14.000Z","title":"Welcome home! Located in Bella Vista","description":"Welcome home! Located in Bella Vista in the much sought after Meredith catchment this 2 bedroom home is snuggled inside a private gated courtyard directly across from the neighborhood favorite Cianfrani Park. As you enter into the spacious living area accented by beautiful hardwood flooring and the first of two fireplaces you're enveloped with the warm feeling of love that has filled this home. Flowing off the living room of this expanded trinity, the full eat in kitchen is contemporarily designed with a subway tiled back splash, granite countertops, a brightly lit skylight shining down from the second floor, and a unique cut out above the sink allowing for the open flow feel of this wonderful living space. The second floor features the first of two bedrooms continuing with the hardwood flow throughout, your full bathroom bright with light from your second skylight, and the perfect hallway nook accented by that same skylight that shines all the way down to the kitchen. The master bedroom on the third floor features the second fireplace as well as a lighter hard wood finish that seems to draw in all of the natural light. This along with the high slanting ceiling give this room a very open airy feel making it a truly \"feel good\" space. Off of the master you will find the crown of this jewel of a home in a roof deck perfect for relaxing and enjoying all of the wonderful changing seasons our city has to offer. Take advantage of this amazing opportunity to be a part of a community that truly cares for each other in a home that will truly care for you.\n725-727 Pemberton St #6","num_images":6,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '858ft2', 'available now', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:16:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553932718.html","post_id":7553932718,"result_date":"2022-11-05T14:40:57.000Z","title":"Live stylishly! Classic hardwood flooring! Tour today!","description":"Silk Factory Lofts200 S Line St Lansdale, PA 19446A wonderful home in Lansdale is waiting for you!We currently have a gorgeous 1 bedroom 1 bathroom renting for $1738 per month. This unit comes with 809 sq ft. SEE WHAT YOU'VE BEEN MISSING  Located in the heart of Lansdale, Pennsylvania, Silk Factory Lofts offer an irresistible lifestyle set in a historic landmark building. Our open loft-style apartments feature oversized windows, high ceilings and modern kitchens. Our community boasts an upscale resident lounge, modern fitness center and beautiful courtyards. Apartment options include 1, 2 and 3 bedroom floor plans. Silk Factory Lofts is located close to public transportation, shopping, dining and entertainment. If you want to venture out, we offer convenient access to major highways, and we're less than an hour from downtown Philadelphia. show contact info\nCommunity Highlights:● 2 Weber Propane Grills● Business Center● Dog Wash Room● Elevator● Monthly Community Events● Package Service● Pet-Friendly Community● Pool Table● Smoke-Free● Vintage Building● Close to Montgomeryville Mall and Routes 202 & 309● Community Lounge featuring free Verizon Fios TV\/Wi-Fi● Courtyard featuring tasteful Outdoor Seating and Fire Pits● Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting● Free Parking - 2 Spaces per Apartment Home + Guest Parking● Lobby Area with Complimentary Coffee● Maintenance-Free Lifestyle● Professional On-Site Management Team● Storage units - $50\/$75 per month● Within Walking Distance to TrainsUnit Highlights:● Cable & Hi-Speed Internet Ready● Central Air Conditioning● Courtyard View in select apartments● Full Size Washer & Dryer● Large Windows● Range \/ Oven● Refrigerator\/Freezer● Secured Building Access● Storage Spaces● Upgraded Kitchens in Select Apartments● Cable & Hi-Speed Internet Ready● Central Air Conditioning● Courtyard View (select apartments)● Dishwasher● Large Windows● Range \/ Oven● Refrigerator\/Freezer● Secured Building Access● Storage Spaces● Upgraded Kitchens (select apartments)Contact:  show contact info\nFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/Leasing Options: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthPet Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German Sheph Management: Paradise Management, LLC Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITY2A6F1CAF76CF407\n","num_images":22,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '809ft2', 'available nov 30', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:36:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553924728.html","post_id":7553924728,"result_date":"2022-11-05T14:40:03.000Z","title":"Amazing 2 Bed 2 full bath home located on Bella Vista!","description":"Amazing 2 bedroom 2 full bathroom home located on a quiet side street in Bella Vista! Enter into the living room with south-facing windows, exposed brick, and hardwood flooring throughout the home. The kitchen features stainless steel appliances, a hidden dishwasher, tons of useful counter space, a farmhouse sink, glass door leading to a private backyard. Upstairs you will find a large bedroom with a nice-sized closet with south-facing windows. You will also find a full bath with a tub on the second floor. There is also an open space that can be used as a bedroom, office, or flex space. This leads to a great deck overlooking the private backyard. The basement is fully finished and has great ceiling height. There is a full bathroom and laundry in the basement as well as an unfinished portion that is great for storage!\n1013 Salter St","num_images":7,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1.5Ba', '840ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:16:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553923156.html","post_id":7553923156,"result_date":"2022-11-05T14:20:57.000Z","title":"2 Bed 1 Bath - 3rd Floor Apartment -Across White Hall - Temple Area -","description":"**Video Tour Coming Soon!**\n2 Bedroom 1 Bath\nBoast a large kitchen where you can fit a dining table\nSizable Bedrooms and Living Room\nThe Apartment can come partially furnished - Or we can remove Items - Ask us about it\nLocated near 15th & Diamond across from the White Hall dorms 1 block away from Temple's campus and Broad Street\nWindow A\/C Units Included\nShared Washer\/Dryer in building\nWater\/sewer is included - Tenants pay for for all other utilities\nIndoor Cats allowed only- no extra fee or deposit\nFirst month's rent and 2-month security deposit must be paid prior to move-in\nText us with Property address to schedule a showing\nBroker\/Owner\nPhiladelphia Apartment Rentals Inc.\n","num_images":6,"lat":39.985769,"lng":-75.157514,"attrs":"['2BR \/ 1Ba', '850ft2', 'air conditioning', 'cats are OK - purrr', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:11:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553924779.html","post_id":7553924779,"result_date":"2022-11-05T14:20:09.000Z","title":"Large 2 Bedroom 2 Bathroom Apartment Right by the Philadelphia","description":"IMAGES ARE OF ANOTHER UNIT IN THE SAME BUILDING UNIT ITSELF HAS A DIFFERENT LAYOUT. Large 2 bedroom 2 bathroom apartment right by the Philadelphia Rail Park. Unit is available at the beginning of August 2021. 1 Year Lease terms, $45 application fee. A minimum credit score of 620 is required or have a co-signer. If you have further questions, please feel free to contact me and I will do my best to answer them.\n439-47 N 13th St #1A","num_images":6,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '11700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:16:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553921896.html","post_id":7553921896,"result_date":"2022-11-05T14:19:34.000Z","title":"TEMPLE AREA - 3RD FLOOR - 2 BED 1 BATH APARTMENT- 1 BLOCK FROM BROAD","description":"**Video Tour Coming Soon!**\nAvailable August 1st, 2023\n2 Bedroom 1 Bath\nBoast a large kitchen where you can fit a dining table\nSizable Bedrooms and Living Room\nThe Apartment can come partially furnished - Or we can remove Items - Ask us about it\nLocated near 15th & Diamond across from the White Hall dorms 1 block away from Temple's campus and Broad Street\nWindow A\/C Units Included\nShared Washer\/Dryer in building\nWater\/sewer is included - Tenants pay for for all other utilities\nIndoor Cats allowed only- no extra fee or deposit\nFirst month's rent and 2-month security deposit must be paid prior to move-in\nText us with Property address to schedule a showing\nBroker\/Owner\nPhiladelphia Apartment Rentals Inc.\n","num_images":6,"lat":39.985884,"lng":-75.157535,"attrs":"['2BR \/ 1Ba', '850ft2', 'air conditioning', 'cats are OK - purrr', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:08:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553917460.html","post_id":7553917460,"result_date":"2022-11-05T14:19:03.000Z","title":"Temple Area 2 Bedroom 1 Bath First Floor Apt w\/ HUGE Private Backyard","description":"**ONLINE VIDEO TOUR AVAILABLE- PLEASE REACH OUT TO VIEW THIS PROPERTY TODAY**\nAvailable Now or August 1st, 2023\nThis spacious 2 bedroom 1 bath is located near 15th & Diamond across from the White Hall dorms\nOnly 1 block away from Temple's campus!\nShared Washer\/Dryer in building\nWater is included, tenants pay for all other utilities\nPossible furnishings included.\n-First month's rent and 2-month security deposit must be paid prior to move-in\n-Broker\/Owner\nPhiladelphia Apartment Rentals Inc.\n*Text us with the property address to receive information and a link to schedule a showing!*\n","num_images":7,"lat":39.985785,"lng":-75.157492,"attrs":"['2BR \/ 1Ba', '850ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:57:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553924030.html","post_id":7553924030,"result_date":"2022-11-05T14:18:15.000Z","title":"3 Bedroom house","description":"3 BEDROOM HOUSE RENOVATED\nNEW BATHROOM\nNEW KITCHEN\nBACKYARD SECLUDED BLOCK\nLOCATION: 618 BRINTON STREET 19138 (EAST MOUNT AIRY)","num_images":8,"lat":40.0568,"lng":-75.1569,"attrs":"['3BR \/ 1Ba', 'available now', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:14:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553916187.html","post_id":7553916187,"result_date":"2022-11-05T14:18:12.000Z","title":"Perfect Location the building represents the best in Rittenhouse Squar","description":"Available for lease starting December 1st! All utilities included in the rent!! This condominium features granite counter tops and parquet floors, Large closet space, The Dorchester building is right on the square in the heart of center city. The location is perfect, The building represents the finest of Rittenhouse Square. The Dorchester provides exceptional services and amenities professional doorman, all utilities and basic cable TV. There is parking under the building which belongs to the phila parking authority, rooftop pool, and fitness room available for additional reasonable fees. Looking for a tenant to move in starting after November 30th. One year lease available. Rent spree application is $42. Move in fee of $425. is required by tenant at move in.\n224-30 W Rittenhouse Sq #803","num_images":7,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '583ft2', 'available dec 1', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:53:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553923486.html","post_id":7553923486,"result_date":"2022-11-05T14:16:52.000Z","title":"3 Bedroom house","description":"3 BEDROOM HOUSE RENOVATED\nNEW BATHROOM\nNEW KITCHEN\nBACKYARD SECLUDED BLOCK\nLOCATION: 618 BRINTON STREET 19138 (EAST MOUNT AIRY)","num_images":8,"lat":40.0568,"lng":-75.1569,"attrs":"['3BR \/ 1Ba', 'available now', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:12:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553922970.html","post_id":7553922970,"result_date":"2022-11-05T14:15:25.000Z","title":"3 Bedroom house","description":"3 BEDROOM HOUSE RENOVATED\nNEW BATHROOM\nNEW KITCHEN\nBACKYARD SECLUDED BLOCK\nLOCATION: 618 BRINTON STREET 19138 (EAST MOUNT AIRY)","num_images":8,"lat":40.0568,"lng":-75.1569,"attrs":"['3BR \/ 1Ba', 'available now', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:11:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553915913.html","post_id":7553915913,"result_date":"2022-11-05T14:15:13.000Z","title":"$500 security deposit to move-in!!! 1 Bed 1 bath","description":"1\/2 MONTH FREE FOR APPLICATIONS BEFORE 10\/15!!! Just 1st month's rent and $500 security deposit to move-in!!! 1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. Hardwood floors in the living area and the bedroom is carpeted. The Warehouse Property is located in a highly walkable area with access to all forms of public transportation. Secured entry, gated property, gym\/fitness center and on-site parking- add'l $200 mo. with full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a similar unit.\n9-1 N 9th St #608","num_images":6,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '635ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:52:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553920417.html","post_id":7553920417,"result_date":"2022-11-05T14:14:45.000Z","title":"Month-to-month lease* Comfortable 3-bedroom home for rent","description":"Terrific family home for rent. Solar panels greatly reduce your electric bills. Easy to care for and comfortable 3-bedroom home for rent $1,100 per month. FREE internet! Great hiking area just one block You can get anywhere in the Valley quickly and easily, which will reduce your commute time. Nice yard and safe neighborhood. Cat or dog with vaccines, OK. Month-to-month lease after 90 days, deposit required. Patio with awning. Lease does not allow subletting of rooms. Principals only please. Painting is allowed to make it your own, so you'll love it! TEXT right away for Nov 10 or Dec 1st. Please note off-street parking only, no garage, no pool. $1,100 per month rent. Application and deposit required.","num_images":6,"lat":39.9597,"lng":-75.2024,"attrs":"['3BR \/ 2Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:04:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553922330.html","post_id":7553922330,"result_date":"2022-11-05T14:13:37.000Z","title":"3 Bedroom house","description":"BEAUTIFUL 3-BEDOROOM HOUSE\nVERY SPACIOUS\nNEW CARPET ON 2ND FLOOR\nRENOVATED BATHROOM WITH TILES\nNEW FLOORS ON 1ST FLOOR\nBEAUTIFUL KITCHEN WITH NEW COUNTERTOP\nWASHER AND DRYER LOCATED IN BASEMENT\nFRONT PORCH\nCLOSE TO SCHOOL AND TRANSPORTATION\n1732 SCATTERGOOD STREET 19124","num_images":10,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 1Ba', 'available now', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T10:09:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7553916964.html","post_id":7553916964,"result_date":"2022-11-05T14:10:35.000Z","title":"Great value in Fairmount! A tree-lined block in the heart of Fairmount","description":"Great value in Fairmount!! A tree-lined block in the heart of Fairmount acts as the idyllic foreground to 1707 Wallace St #2R. This updated 2 bed, 1.5 bath bi-level apartment sits on the top two floors of a 4-unit building. The exterior of the building features a classic red brick facade and detailed cornice trim. Inside the unit, you're greeted by a bright and open living room and dining area with soaring 9ft ceilings, tall windows, and beautiful hardwood floors. There's also a huge storage closet and a powder room. The home's kitchen is fitted with tons of cabinetry space, stainless steel appliances, including a dishwasher, and the in-unit laundry closet. The home's second level has a spacious bedroom, with great closet space, at the front. A full bathroom and another bedroom, ideal for an office or nursery, complete this level. 1707 Wallace St's central Fairmount location is a walker's paradise, earning a WalkScore of 92. The Philadelphia Museum of Art, Kelly Drive, and The Community College of Philadelphia are all within walking distance. Nearby Fairmount Ave and North Broad Street are lined with local shops, gyms, and restaurants, including Bar Hygge, Rybread cafe, SOUTH, and Osteria. Whole Foods, Target, and Wine & Spirits are also close by. Plus, there's easy access to public transportation, I-76, Drexel University, and The University of Penn. Schedule your in-person or virtual tour today!\n1707 Wallace St #2R","num_images":9,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1.5Ba', '990ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-05T09:55:35-0400"}]