[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-home-for-rent-holy-family\/7613699063.html","post_id":7613699063,"title":"Home for Rent (Holy Family) $1,800.00","description":"Home located on the 4000 Block of Carteret Dr. w\/in walking distance to Holy Family College.  3 bdrm, 1.5 bth w\/Deck, Finished Bsmnt & Rear Yard, storm & decorative front door, ceramic tile foyer entrance, main level w\/large living rm, built-in gas fireplace, large bow window & crown molding. H\/W Floor throughout.  Large Dining rm w\/coat closet, decorative chandelier, wainscotting, entrance to bsmnt & powder rm.  Kitchen offers plenty of counter space & cabinets w\/ceramic tile floor & backsplash, peninsula island, granite counters, 2 drawer DW, deep stainless sink w\/garbage disposal, goose neck faucet, 5 burner gas stove, microwave, 4 door refrigerator, pantry, recessed lights, ceiling fan & French door to large deck. Upper level features hallway w\/2 closets, 3-piece ceramic tile hall bth.  Mstr bdrm w\/plenty of closets, built-in vanity & ceiling fan. Other 2 spacious bdrm w\/plenty of closets, w2w carpet & ceiling fans. C\/A, finished bstmnt offers a laundry rm w\/W&D, w2w carpet, plenty of storage w\/Exit to rear yard.  Private Driveway. 1ST, Last & Security required, Great Credit, NO Prior Evictions and References Needed. $150.00 application fee for accepted tenants only.  Non-smoker & No Pets","num_images":8.0,"lat":40.0634,"lng":-74.999,"attrs":"['3BR \/ 1.5Ba', 'available may 1', '\\nsaturday 2023-04-29\\n', 'air conditioning', 'application fee details: 150.00 accepted tenants only', 'house', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly']","posted_date":"2023-04-23T20:31:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-unds-have-on-site-laundry\/7613710433.html","post_id":7613710433,"title":"unds have on-site laundry, cleaners, a market, and top-rated restauran","description":"1\nbed\n1\nbath\n803sqft\n803 square feet\n200 Locust St, Philadelphia, PA 19106\n1 bed, 1 bath corner condo with modern finishes and expansive floor-to-ceiling windows that display mesmerizing skyline and river views. This sought-after, fully amenitized building offers a welcome desk and security staffed 24\/7, a fitness center, a brand new saltwater pool, garage parking, and barbecues. In addition, the meticulously manicured grounds have on-site laundry, cleaners, a market, and top-rated restaurants steps away. Stepping into the unit, you're welcomed by a foyer with a coat closet and wide plank hardwood floors that continue throughout. The main living space is open, bright, and airy, with the towering wall of windows providing a feeling of floating in the sky. The stunning gourmet kitchen is fitted with quartz countertops, shaker-style cabinets, stainless steel appliances, a marble backsplash, recessed lighting, and a contrasting island with seating. The living and dining areas have plenty of space to create a layout that combines form and function. Completing the unit is the large bedroom with more picturesque windows and a luxurious bathroom adorned with a quartz vanity and marble tile shower. In addition to everything inside, this fantastic location earns a Walk Score of 98! James Beard Awarded Zahav restaurant is sat on the grounds, while Positano Coast and Landmark's Ritz Five theater are across the street. (i really need a neat and clean person who can take care of my things as im not available)","num_images":17.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '803ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-04-23T21:21:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ness-center-brand-new-saltwater-pool\/7613709137.html","post_id":7613709137,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fishtown-4br-25ba-3000ft2\/7613694256.html","post_id":7613694256,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-home-for-rent\/7613675059.html","post_id":7613675059,"title":"Amazing home for rent.","description":"Home Adress: 1339 S 31st St, Philadelphia, PA 19146\nRent - $1000\nText -  show contact info\nDeposit - $1000\nWelcome to this beautiful home for rent in Grays Ferry! This property is a 2 bedroom 1 bath, with an updated kitchen and bathroom. This home is bright and spacious with an eat in kitchen. Enjoy the nice weather as you will have access to your own back patio area. Upstairs you will find two spacious bedrooms and the bathroom.\nBedroom- 2\nBathroom- 1\nFull Bathroom -1\n","num_images":7.0,"lat":39.939,"lng":-75.185,"attrs":"['2BR \/ 1Ba', 'available now', 'house', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T19:03:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-apartment\/7613674301.html","post_id":7613674301,"title":"@...BED 1 BATH APARTMENT,,","description":"Great location for this two bedroom apartment in Philadelphia,PA, with heat and hot water included in rent. Nice kitchen with granite counters and good size rooms. Apartment comes with off street parking for two parking spots, Washer\/dryer hookups in unit (machines not included) or onsite, coin op washer\/dryer if preferred.\nTenant responsible for electricity (has electric heat and hot water) and prorated water. IF YOU ARE INTERESTED PLEASE, SEND CONTACT INFO.  show contact info","num_images":4.0,"lat":40.0568,"lng":-75.1379,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T19:00:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-studio-style-room\/7613657546.html","post_id":7613657546,"title":"Beautiful Studio Style room","description":"Beautiful studio style room with private bathroom available for rent. Utilities included, free wifi, laundry on site, storage and more. Close to downtown. Walking distance to all public transportation. Please call\/text Mr. Lee if interested at\nshow contact info\n.\nSingle occupancy\nNo smoking\nNo pets","num_images":6.0,"lat":39.9925,"lng":-75.1415,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T18:02:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-1br-new-construction-luxury\/7613659586.html","post_id":7613659586,"title":"1br - New construction luxury townhouse will be ready to move in","description":"Available: May 1th 2023, 1 Bedroom 1 bath Apartment in long island. Off first month rent with signed lease! Large two bedroom, 1 bath upper apartment with water included in secured building! Kitchen includes all major appliances and leads directly into the dining room. Dining room has extra large closets for storage and is open concept to the living room that has tons of natural light and air conditioning! First bedroom has walk-in closet. ! Coin-operated laundry on site, and 1 assigned parking space per apartment. Walking distance to the park! Additional and guest parking on street. This is a smoke and pet free property. Which features master bedrooms with a walk-in closets! Also features: Kitchen, dining area, Living room space and more! We also have playground, and swimming pool area, for family and friends to enjoy! Utilities includes: Water, Trash, and Sewer! Lofts 640 combines commuter convenience of center city living with the spectacular urban spaciousness of true \"loft living.\" At Lofts 640, indoor garage parking ($600 per month), indoor pool and jacuzzi, full fitness center with Free Classes, long island, yoga studio, and all units cable-ready! making transportation convenient to and from employment, shopping, entertainment and cultural centers. long island Apartments and Townhomes is just 5 minutes from restaurants and shopping entertainment in historic\nPhiladelphia  area and it’s less than 10 minutes from, dining and entertainment. Come by and take a tour of our Apartments\/Townhomes!If you interested please contact:\n","num_images":4.0,"lat":39.9375,"lng":-75.2637,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-23T18:09:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-price-drop-one-month-free\/7613531037.html","post_id":7613531037,"title":"PRICE DROP! ONE MONTH FREE! WOW! 2 BED 1 BATH, W\/D, YARD & MORE!!!!!!!","description":"4833 Germantown Ave #1  – 2 bed 1 bath apartment w\/private entrance & in-unit laundry! $1199\/month\nONE MONTH FREE RENT!\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co. or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nExcellent spacious 2 bed 1 bathroom first floor apartment with private entrance.  Eat – in kitchen with gas stove and full-sized refrigerator. Boasting hardwood flooring throughout, bedrooms offer plenty of room. Living space is large featuring bay windows and classic fireplace mantle. Exclusive access to basement and storage purposes.\nLaundry is a breeze with your own in unit washer & dryer!\nFeaturing:\n2 bedrooms\n1 bathroom\nGas stove\nFull sized refrigerator\nFull basement storage\nHardwood floors\nPrivate entrance\nIn Unit Laundry\nAND MORE!","num_images":12.0,"lat":40.028245,"lng":-75.162125,"attrs":"['2BR \/ 1Ba', 'available may 1', 'application fee details: $50.00 per applicant', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T12:04:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-price-drop-one-month-free\/7613531049.html","post_id":7613531049,"title":"PRICE DROP! ONE MONTH FREE! 3 BED 1.5 BATH, W\/D IN UNIT, A\/C & MORE!!!","description":"5046  Germantown Ave #1  – 3 bed 1.5 bath apartment w\/private entrance & in-unit laundry! $1299\/month\nONE MONTH FREE RENT!\nCome see why so many people are calling Germantown home! Located on Germantown Ave. within walking distance of Loudon Park & Wayne Junction. Hit the avenue or catch some local music and food at Attic Brewing Co., or Dekes Garage BBQ! Bursting with activity, this location boasts new restaurants and classic outdoor space.\nTerrific 3 bed 1.5 bath 1st floor apartment. Large open concept living space with. Three spacious bedrooms with closet storage. Full sized 3-piece bathroom with tub\/shower, vanity and toilet. Eat-in kitchen with stainless steel appliances including dishwasher, microwave & gas stove.\nLaundry is a breeze with convenient laundry room! CENTRAL AIR! keeping you cool in the summertime!\nFeaturing:\n3 bedrooms\n1.5 bathroom\nCentral Air\nGas stove\nMicrowave\nDishwasher\nEat – in kitchen\nFull sized refrigerator\nPrivate entrance\nIn-unit laundry\nPrivate yard\/patio space\nAND MORE!","num_images":14.0,"lat":40.029945,"lng":-75.164949,"attrs":"['3BR \/ 1.5Ba', 'available may 1', 'application fee details: $50.00 per applicant', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T12:04:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-new-beginnings-here-at-park\/7613529083.html","post_id":7613529083,"title":"New Beginnings Here at Park Lane!!","description":"Apt. 1504 — Dorchester floor plan — 881 sq. ft. — $2,483\nLocated on the 5th floor, this 1-bedroom apartment has a great view from a large private balcony! This apartment boats LVT flooring, central heat and air, a washer and dryer, stainless steel appliances, and plenty of cabinet space in the kitchen. This apartment also comes equipped with a spacious living area and walk-in closet. This gorgeous apartment is within close proximity to our clubhouse—featuring a 24-hour fitness center, theatre, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '881ft2', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T11:59:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stunning-studio-2-and\/7613520887.html","post_id":7613520887,"title":"Stunning studio, 1, 2, and 3-bedroom apartments. Upscale Amenities!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card!  Residences at One Brown 1 Brown Street, Philadelphia, PA, 19123Call Now -  show contact info\nx 137OR Text 137 to  show contact info\nto text our leasing team.Follow The Link Below:https:\/\/archcompanies.aptglance.com\/dr2ke7 Stunning Apartments in Northern LibertiesThis is a 1 Bedroom, 1 Bath, Approximately 690 Sq. Ft. Residences at 1 Brown offers stunning and spacious studios, one, two, and three bedroom apartments with premium features designed to help you live your best life every day. Each unit has oversized bedrooms and enough living space for both a media center and kitchen table. You will thoroughly enjoy the soaking up the ample space to relax or host guests! Upscale kitchens with cherry wood cupboards are brimming with the latest appliances complemented by granite countertops and ample storage space. Nearby, you can enjoy a spa shower and Jacuzzi tub in your bathroom, take advantage of your personal washer and dryer, and set up a special place for your pets. As you come home to your 1 Brown apartment each day, you're stepping into a place of comfort, convenience and class. Call Today! Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMPhotos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! Equal Housing Opportunity O20gtrMQKRqk\n","num_images":16.0,"lat":39.962145,"lng":-75.137734,"attrs":"['1BR \/ 1Ba', '690ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T11:35:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-heart-of-fairmount-bedroom\/7613498309.html","post_id":7613498309,"title":"$1,900 - Heart of Fairmount 1 Bedroom 1 Bathroom Apartment","description":"Apartment just off Fairmount Avenue on beautiful Uber street. Just minutes from all the restaurants and bars on Fairmount Ave. High end finishing, full size washer\/ dryer, dish washer, microwave, farmhouse sink, GE Cafe 5 burner range oven, GE Cafe Refrigerator with built in hot water heater and Kurig brewer, double vanity in bathroom and Central Heating and cooling! Amazing 1 bedroom, 1 bathroom apartment in Philadelphia. Amenities included: Central air, central heat, dishwasher, hardwood floors, stainless steel appliance, updated kitchen, updated bathroom, all window coverings included, washer, dryer, garbage disposal, microwave, 5 burner range oven, and range exhaust hood, balcony. Unit is pet friendly. Date Available: Immediate Move in. $1,900\/month rent. $1,900 security deposit required. Please submit the form on this page or contact Brian at  show contact info\nto learn more.","num_images":11.0,"lat":39.968988,"lng":-75.168987,"attrs":"['1BR \/ 1Ba', '800ft2', 'available now', 'air conditioning', 'application fee details: $30 Application Fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T10:24:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-tv-lounge-incredible-features\/7613507376.html","post_id":7613507376,"title":"TV Lounge, Incredible Features, Central Location","description":"The Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nJust minutes from the Exton Train Station and area highways, The Point at Exton gives you easy access to King of Prussia and Center City Philadelphia while also keeping you close to the area's top outdoor trails and nature destinations. Lease now!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, coat closet, walk-in closet, and a washer\/dryer!\nCommunity Features\n* Community Kitchen\n* TV Lounge\n* Package Acceptance\n* Outdoor Grill Area\n* Controlled Access Parking\n* Swimming Pool\n* Pet Salon\n* Garage Parking\n* Bike Racks\n* Extra Storage\n* Easy Freeway Access\n* Sun Deck\n* Minutes from Restaurants, Shopping, and Much More\n* Fitness Studio\n* Professionally Managed\n[#9659852]","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '876ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T10:54:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bd-ba-garden-level\/7613493632.html","post_id":7613493632,"title":"2 BD\/1 BA Garden Level Apartment","description":"Newly renovated 2 BED\/1 BAT Missoula Northside apartment. secured building! Kitchen includes all major appliances and leads directly into the dining room. Dining room has extra large closets for storage and is open concept to the living room that has tons of natural light and air conditioninggarden level windows provide ample light. NEW luxury vinyl plank flooring, baseboards, trim, light fixtures, outlets, light switches, and paint throughout. New heaters & thermostats. Freshly painted kitchen cabinets and new faucet. New bath fan, vanity\/sink\/faucet and shower head. This apartment does not have a yard or laundry. No pets. This is a non-smoking property inside and out. Available May 1. Rent includes water, sewer and trash. Tenant pays electric.","num_images":3.0,"lat":39.9448,"lng":-75.2288,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T10:07:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-cat-and-dog-heaven-amazing\/7613501369.html","post_id":7613501369,"title":"Cat and Dog Heaven! Amazing Pet-Friendly Community! 1 Bed \/ 1 Bath","description":"The Gateway ApartmentsVisit Our Community Today!1515 Manley Rd West Chester, PA 19380 Upgraded ApartmentConveniently located in prestigious Chester County, The Gateway offers unique one and two bedroom apartments with den options in a beautiful setting. Commbine the comforts of home with superior resident services and amenities such as our resort style pool, business center, fitness center, and walking trail.Bedrooms: 1 |  Bathrooms:  1  Square Footage: 842 sq ft Rental Pricing: $2062 - $2682\/Month  Our Residents Enjoy:  ● Business Center● Clubhouse● Fitness Center● Onsite Maintenance● Onsite Management● Package Service● Picnic and Grilling Area● Pool and Sundeck● Storage Space● Walking\/Biking Trails● Across From Wawa & Goshen Crossing Shopping Center● Beautifully Landscaped Grounds● Garages For Lease● Gated Entrances● Onsite Leasing Office● Pet-Friendly● Relaxing Fire Pit● Resort-Style Pool With Sun Deck● Storage Units For Lease● Wi-Fi Access in Clubhouse and at Pool This Unit Comes With: ● Air Conditioning & Heating● Alarm● Cable Ready● Den● Dining Room● Dishwasher● Garbage Disposal● High Speed Internet Access● Trash Compactor● Window Coverings● Built-In Computer Nook (select homes)● Built-In Microwave Oven● Garden\/Spa Tub (select homes)● Gas Fire Place (select homes)● Kitchen Pantry● Large Windows● Mini Blinds On All Windows● Upgrade● Vaulted Ceiling (select homes)● Wooded View\/Pool View (select homes)Website: https:\/\/www.thegatewayapartments.com\/ Phone-Number:  show contact info\nPet-Policy: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonLease-Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthCall for Directions  All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY66333F8967D246\n","num_images":14.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '842ft2', 'available may 5', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T10:35:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-expansive-furnished\/7613498243.html","post_id":7613498243,"title":"Expansive Furnished Rooftop with Stunning Views. Must see apartments!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Stunning Apartments in Northern Liberties Residences at 1 Brown offers stunning and spacious studios, one, two, and three bedroom apartments with premium features designed to help you live your best life every day. Each unit has oversized bedrooms and enough living space for both a media center and kitchen table. You will thoroughly enjoy the soaking up the ample space to relax or host guests! Upscale kitchens with cherry wood cupboards are brimming with the latest appliances complemented by granite countertops and ample storage space. Nearby, you can enjoy a spa shower and Jacuzzi tub in your bathroom, take advantage of your personal washer and dryer, and set up a special place for your pets. As you come home to your 1 Brown apartment each day, you're stepping into a place of comfort, convenience and class. Call Today!  Call Now:  show contact info\nx 22OR Text 22 to  show contact info\nto text our team directly.Use this link for more info:https:\/\/archcompanies.aptglance.com\/83720gThis is a 2 Bedroom, 2 Bath, Approximately 1286 Sq. Ft.Features - Generous Closet Space  - Large Bathrooms  - 9 Ft Ceilings  - Gourmet Eat-In Kitchens with Cherry Wood Cupboards  - Nest Thermostats  - Full Size Washer\/Dryer in unit  - Largest Apartments in the Area  - Spa Shower System & Jacuzzi Tub  - Floor to Ceiling Windows  - Quartz Counter Tops  - Stainless Steel Appliances Community Amenities - Spectacular Resort Style Pool Area  - Amazing Views and Rooftop Lounge  - Dry Cleaning Service  - 24-Hour Concierge Service  - Spacious Highrise Living  - Rooftop Walking Track & Dining Areas  - Fully Outfitted Fitness Center Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMResidences at One Brown 1 Brown Street, Philadelphia, PA, 19123 Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! Equal Housing Opportunity 4ZEqbg81NPjC\n","num_images":15.0,"lat":39.962145,"lng":-75.137734,"attrs":"['2BR \/ 2Ba', '1286ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T10:24:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-society-hill-west-unit-b5\/7613483799.html","post_id":7613483799,"title":"Society Hill West Unit-B5","description":"Society Hill West\n1122 Spruce Street - Unit B5 is a 350 square foot studio apartment available 6\/1\/23 for $1,250.00. The Unit offers a newer kitchen with stainless-steel appliances, central air condition and wood floors. The heat is included. The washer dryers are in the basement.  There is a shared rear courtyard.  In walking distance to South Street, Old City, Penn's Landing, Center City, public transportation, large markets, restaurants, both Jefferson and Pennsylvania Hospitals.","num_images":7.0,"lat":39.946722,"lng":-75.160551,"attrs":"['0BR \/ 1Ba', '350ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T09:28:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-redefining-luxury-at-park\/7613482606.html","post_id":7613482606,"title":"Redefining Luxury at Park Lane!!","description":"Apt. 1401 — Trafalgar floor plan — 1,452 sq. ft. — $3,945\nThis large 4th floor corner apartment has so much to offer! This apartment home includes LVT flooring throughout the spacious living area, central heat and air, a spacious laundry room, stainless steel appliances, a large private balcony, and ample storage space. The master bedroom is equipped with a spacious walk-in closet and generously-sized bathroom with double vanity sinks. The guest bedroom and bathroom are spacious, as well! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T09:23:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/blooming-glen-home-in-the-country\/7613481692.html","post_id":7613481692,"title":"Home in the country","description":"Home in the country ( location, location, location- 6 miles from Doylestown). Gorgeous views. Home has LR, DR, beautiful eat-in kitchen, 2 BR, One BA. Office area. Two outside decks, lovely garden, beautiful grounds. Separate two car garage. Can accommodate a horse or two. Please leave your contact phone number.","num_images":0.0,"lat":40.3765,"lng":-75.2648,"attrs":"['2BR \/ 1Ba', '1800ft2', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T09:18:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-shop-eat-sleep-and-more-at\/7613463985.html","post_id":7613463985,"title":"Shop, Eat, Sleep and More at Park Lane!!","description":"Apt. 2410 — Oxford floor plan — 1,203 sq. ft. — $3,460\nThis 4th floor 2-bedroom\/2-bathroom apartment home has much to offer! It comes upgraded with hardwood LVT flooring, central heat and air, upgraded stainless steel appliances, and a lovely tile backsplash! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive living area is perfect for hosting! This gorgeous apartment has a beautiful view of the Philadelphia skyline. It is also within close proximity to our Clubhouse — featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T07:24:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia\/7613457611.html","post_id":7613457611,"title":"Spacious1Bedroom,withAdditionalRoom,H\/DFlrs,3BlksFrMainSt","description":"Spacious 1 Bedroom apartment with Additional Room for an office, 3 Blocks From Main St and all Public Transportation.\nHardwood Floors thoughout, Freshly painted and new kitchen and bathroom.  Call for easy showings and photo's.\n","num_images":0.0,"lat":40.033506,"lng":-75.225849,"attrs":"['1BR \/ 1Ba', '900ft2', 'available may 15', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T05:40:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-positioned-perfectly-in\/7613438708.html","post_id":7613438708,"title":"Positioned perfectly in close proximity to the elevator","description":"Positioned perfectly in close proximity to the elevator, it sits on the top floor, with a neighbor only on one side. This situation keeps the unit nice and quiet. Enjoy all of the amenities that Green Hill possesses. The Green Hill Condominium is a friendly community of 543 condominium apartments situated on 23 beautifully wooded and landscaped acres in the desirable Wynnewood, Lower Merion school district with so many to offer. Lushly landscaped grounds with acres of mature trees, manicured lawns, shaded walkways and a delightful wooded picnic area near a meandering stream. Uniformed doormen are on duty 24-hours a day, every day of the year. Attended gatehouse at Green Hill’s property entrance for monitoring and controlling access. Green Hill’s campus is comprised of 2 separate 11 story buildings.","num_images":14.0,"lat":39.984281,"lng":-75.260729,"attrs":"['1BR \/ 1Ba', '936ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-23T00:08:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-rare-and-lovely-unit\/7613437118.html","post_id":7613437118,"title":"~~~ RARE AND LOVELY UNIT!~~~","description":"The eat in kitchen offers raised maple kitchen cabinets, new gas stove & cooking, built in microwave, newer dishwasher and stainless steel sink. All appliances are included to make moving in that much easier. The living room is an open floor plan with the dining room area located in the shared area. The patio is accessible from the living room and is covered for all weather grilling and entertaining. The main bedroom is spacious in size and offers a large walk in closet. Also remodeled is the bath with newer ceramic tile, clear glass shower doors and a new maple cabinet completes this spacious bath. Laundry is located within this unit just off of the kitchen and offers plenty of room for additional pantry storage. Enjoy your summer soaking up the sun by the communities pool. A little oasis for a quiet swim! No window ac here, just flip on that Central air & the gas hot air heat.  Just a short drive to Skippack for the enjoyment of live music and numerous restaurants.","num_images":7.0,"lat":40.229476,"lng":-75.316127,"attrs":"['1BR \/ 1Ba', '787ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-22T23:53:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-all-new-bedrooms-bath\/7613432575.html","post_id":7613432575,"title":"⭐⭐⭐ ALL NEW, 2 BEDROOMS & 2 BATH APARTMENT LOCATED IN WEST PHILADELPHI","description":"Property Address\n4130 W Girard Ave | PHILADELPHIA PA 19104\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ NOT YOUR USUAL APARTMENT, CAN YOU SAY OVERSIZED?\n✔️ ALL BRAND NEW! LARGE, BI-LEVEL 2 BEDROOM & 2 BATH APARTMENT LOCATED IN THE BELMONT AREA OF WEST PHILLY!\n✔️ ALL BRAND NEW! STYLISH INTERIOR WALLS DESIGN!\n✔️ LUXURY KITCHEN W\/ CUSTOM DESIGNER BACKSPLASH & STYLISH ISLAND FEATURING GRANITE COUNTERTOPS!\n✔️ VINYL LAMINATE FLOORING THROUGHOUT FOR EASY CLEANING!\n✔️ THE KITCHEN IS EQUIPPED W\/ ALL BRAND-NEW STAINLESS STEEL APPLIANCES!\n✔️ HUGE LIVING ROOM W\/ PLENTY OF SPACE FOR ENTERTAINING GUESTS!\n✔️ DESIGNER BATHROOMS W\/ ALL NEW VANITIES!\n✔️ CENTRAL AIR & CENTRAL HEAT FOR YOUR COMFORT!\n✔️ WASHER & DRYER HOOK-UP FOR ADDED CONVENIENCE!\n✔️ BI-LEVEL APARTMENT\n✔️ LOCATED CLOSE TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO CENTER CITY!\n✔️ APPLY TODAY! REDBLOCK.COM\/APARTMENT\/ THIS WILL NOT LAST LONG!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 2 BA\nSquare Feet: 1100\nRental Terms\nRent: $1400\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":7.0,"lat":39.973853,"lng":-75.20666,"attrs":"['2BR \/ 2Ba', '1100ft2', 'flat', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:16:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-office-15-bath-row\/7613427831.html","post_id":7613427831,"title":"2 Bed + Office, 1.5 Bath Row Home in Fishtown","description":"The house is for rent by owners. We take personal pride in its upkeep.\nOpen house Sunday, April 30 1 pm - 4 pm\nThe home features:\n• 1st Floor: living room, dining area, kitchen, breakfast nook, and ½ bath\n• 2nd Floor: 3 bedrooms, including one currently set up as a huge walk-in closet, and a full bath\n• Central air conditioning \/ heating (gas, electric, and water paid by tenant)\n• Kitchen with microwave, dishwasher, garbage disposal, and gas stove\n• Wireless internet already hooked up\n• A basement (good for storage) with a washer and dryer\n• A nice-sized back yard\n• Great neighbors\nIt's a great place to live, fun neighborhood with an awesome gastropub (Memphis Taproom), an organic nursery\/urban farm with an award winning CSA (farm share) and farmers market all one block away (Greensgrow Farms). A few blocks from grocery and fitness center on Aramingo. It also has great night spots like Kraftwork, Johnny Brendas and Frankford Hall all easy walk away. It's easy to get onto 95 and quick to get just about anywhere in the city. Easy street parking. There's also public transportation a block away.\nPets allowed on a case-by-case basis.","num_images":16.0,"lat":39.979747,"lng":-75.121811,"attrs":"['2BR \/ 1.5Ba', '992ft2', 'available jul 1', '\\nsunday 2023-04-30\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T22:43:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7613434597.html","post_id":7613434597,"title":"SPACIOUS 1 BEDROOM & 1 BATH LOCATED IN POWELTON VILLAGE! SHORT DISTANC","description":"Property Address\n524 N Preston Street | PHILADELPHIA PA 19104\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️POWELTON VILLAGE!\n✔️BEST VALUE APARTMENT ⭐⭐⭐⭐⭐\n✔️Large 1 BEDROOM!!!!\n✔️Spacious living room\n✔️Updated kitchen, bath, floors, windows, and appliances!\n✔️Laminate flooring\n✔️Plenty of closets\n✔️Attic Space for Storage\n✔️Backyard access\n✔️Walk to Drexel and Penn\n✔️A short ride from USP\n✔️Close to public transportation\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 1 BD\/ 1 BA\nSquare Feet: 750\nRental Terms\nRent: $900\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $1800\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":6.0,"lat":39.961814,"lng":-75.20388,"attrs":"['1BR \/ 1Ba', '750ft2', 'duplex', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:32:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-1bd-1bath\/7613434914.html","post_id":7613434914,"title":"⭐⭐⭐ BRAND NEW 1BD & 1BATH LOCATED IN WEST OAK LANE! ⭐⭐⭐","description":"Property Address\n5800 N 17th Street | PHILADELPHIA PA 19141\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ BRAND NEW EVERYTHING!!!\n✔️ NEW! 1 BEDROOM & 1 BATH APARTMENT LOCATED IN WEST OAK LANE AREA!!!\n✔️ NEW! FULLY EQUIPPED MODERN EAT-IN KITCHEN W\/ GRANITE COUNTERTOPS!!!\n✔️ BRAND NEW APPLIANCES (MICROWAVE, ELECTRIC RANGE, FRIDGE)!!!\n✔️ DESIGNER BATHROOM W\/ NEW VANITIES!!!\n✔️ DESIGNER BATHROOM TILES\n✔️ NEW! LAMINATE FLOORING!!!\n✔️ SPACIOUS BEDROOMS!!!\n✔️ LARGE CLOSETS!!!\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 1 BD\/ 1 BA\nSquare Feet: 500\nRental Terms\nRent: $900\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $1800\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":7.0,"lat":40.042036,"lng":-75.149086,"attrs":"['1BR \/ 1Ba', '500ft2', 'flat', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:35:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-studio-located-in\/7613434316.html","post_id":7613434316,"title":"⭐⭐⭐ COZY STUDIO LOCATED IN CEDAR PARK\/WEST PHILLY!!!! ⭐⭐⭐","description":"Property Address\n5013 Cedar Ave | PHILADELPHIA PA 19143\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ COZY Studio and 1 bath apartment!\n✔️ BEST VALUE HOME!!! ⭐⭐⭐⭐⭐\n✔️ Modern kitchen w\/Stove, Fridge, and Microwave\n✔️ Open layout, plenty of closet space\n✔️ Laminate flooring\n✔️ Updated bathroom\n✔️ Ceiling fan\n✔️ Cable ready\n✔️ All electric utilities\n✔️ Few blocks away from Baltimore ave\n✔️ Walking distance to USP\n✔️ Easy access to public transportation\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 0 BD\/ 1 BA\nSquare Feet: 575\nRental Terms\nRent: $900\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $1800\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":4.0,"lat":39.950004,"lng":-75.223156,"attrs":"['0BR \/ 1Ba', '575ft2', 'flat', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:30:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-1bd-1bath-apartment\/7613434013.html","post_id":7613434013,"title":"⭐⭐⭐ MODERN 1BD & 1BATH APARTMENT LOCATED WALKING DISTANCE TO PENN, PEN","description":"Property Address\n437 N 40th Street | PHILADELPHIA PA 19104\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n*** AVAILABLE FOR AUGUST 1ST MOVE-IN!\n✔️ SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN UNIVERSITY CITY!\n✔️ MODERN KITCHEN W\/ STAINLESS STEEL APPLIANCES\n✔️ GRANITE COUNTERTOP AND DESIGNER TILED BACKSPLASH\n✔️ LAMINATE FLOORING THROUGHOUT FOR EASY CLEAN\n✔️ CENTRAL AIR & CENTRAL HEATING\n✔️ EXPOSED MODERN DUCTS DESIGN\n✔️ WASHER\/ DRYER IN-UNIT\n✔️ QUIET LIVING & MAXIMUM COMFORT\n✔️ PRIVATE UNIT, PRICE FOR THE ENTIRE UNIT\n✔️ WALK TO PENN, PENN MEDICINE, DREXEL UNIVERSITY\n✔️ 5-STAR TENANT REVIEWS\n✔️ STUDY LOUNGE\n✔️ 24HR GYM\n✔️ ELEVATOR\n✔️ LOBBY\/ PACKAGE AREA\n✔️ CONTROLLED ACCESS\n✔️ WIFI FOR TENANTS\n✔️ ROOF DECK***\n✔️ BIKE PARKING\n✔️ MODERN LOFT-LIKE DESIGN\n✔️ PET FRIENDLY\n✔️ PROFESSIONALLY MANAGED\n✔️ 15-MINUTE WALK TO PENN, PENN MEDICINE, DREXEL\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 1 BD\/ 1 BA\nRental Terms\nRent: $1450\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2900\nPet Policy\nCats allowed\nDogs allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":8.0,"lat":39.961292,"lng":-75.202199,"attrs":"['1BR \/ 1Ba', '600ft2', 'flat', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:27:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-1bd-1bath-apartment\/7613433369.html","post_id":7613433369,"title":"⭐⭐⭐ MODERN 1BD & 1BATH APARTMENT WALKING DISTANCE TO PENN, PENN MEDICI","description":"Property Address\n437 N 40th Street | PHILADELPHIA PA 19104\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n*** AVAILABLE FOR AUGUST 1ST MOVE-IN!\n✔️ SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN UNIVERSITY CITY!\n✔️ MODERN KITCHEN W\/ STAINLESS STEEL APPLIANCES\n✔️ GRANITE COUNTERTOP AND DESIGNER TILED BACKSPLASH\n✔️ LAMINATE FLOORING THROUGHOUT FOR EASY CLEAN\n✔️ CENTRAL AIR & CENTRAL HEATING\n✔️ EXPOSED MODERN DUCTS DESIGN\n✔️ WASHER\/ DRYER IN-UNIT\n✔️ QUIET LIVING & MAXIMUM COMFORT\n✔️ PRIVATE UNIT, PRICE FOR THE ENTIRE UNIT\n✔️ WALK TO PENN, PENN MEDICINE, DREXEL UNIVERSITY\n✔️ 5-STAR TENANT REVIEWS\n✔️ STUDY LOUNGE\n✔️ 24HR GYM\n✔️ ELEVATOR\n✔️ LOBBY\/ PACKAGE AREA\n✔️ CONTROLLED ACCESS\n✔️ WIFI FOR TENANTS\n✔️ ROOF DECK***\n✔️ BIKE PARKING\n✔️ MODERN LOFT-LIKE DESIGN\n✔️ PET FRIENDLY\n✔️ PROFESSIONALLY MANAGED\n✔️ 15-MINUTE WALK TO PENN, PENN MEDICINE, DREXEL\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 1 BD\/ 1 BA\n600 Sq Ft\nRental Terms\nRent: $1400\nAvailable: August 1st 2023\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":15.0,"lat":39.961292,"lng":-75.202199,"attrs":"['1BR \/ 1Ba', '600ft2', 'flat', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:22:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-1bd-1bath-walking\/7613433718.html","post_id":7613433718,"title":"⭐⭐⭐ MODERN 1BD & 1BATH WALKING DISTANCE TO PENN, PENN MEDICINE, DREXEL","description":"Property Address\n437 N 40th Street | PHILADELPHIA PA 19104\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n*** AVAILABLE FOR AUGUST 1ST MOVE-IN!\n✔️ COZY 1 BEDROOMS & 1 BATH APARTMENT LOCATED IN UNIVERSITY CITY!\n✔️ MODERN KITCHEN W\/ STAINLESS STEEL APPLIANCES\n✔️ GRANITE COUNTERTOP, DESIGNER TILED BACKSPLASH, & BREAKFAST BAR\n✔️ LAMINATE FLOORING THROUGHOUT FOR EASY CLEAN\n✔️ CENTRAL AIR & CENTRAL HEATING\n✔️ EXPOSED MODERN DUCTS DESIGN\n✔️ WASHER\/ DRYER IN-UNIT\n✔️ QUIET LIVING & MAXIMUM COMFORT\n✔️ PRIVATE UNIT, PRICE FOR THE ENTIRE UNIT\n✔️ WALK TO PENN, PENN MEDICINE, DREXEL UNIVERSITY\n✔️ 5-STAR TENANT REVIEWS\n✔️ STUDY LOUNGE\n✔️ 24HR GYM\n✔️ ELEVATOR\n✔️ LOBBY\/ PACKAGE AREA\n✔️ CONTROLLED ACCESS\n✔️ WIFI FOR TENANTS\n✔️ ROOF DECK***\n✔️ BIKE PARKING\n✔️ MODERN LOFT-LIKE DESIGN\n✔️ PET FRIENDLY\n✔️ PROFESSIONALLY MANAGED\n✔️ 15-MINUTE WALK TO PENN, PENN MEDICINE, DREXEL\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 1 BD\/ 1 BA\nRental Terms\nRent: $1400\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":8.0,"lat":39.961292,"lng":-75.202199,"attrs":"['1BR \/ 1Ba', '600ft2', 'loft', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:25:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-1bd-1bath-apartment\/7613433004.html","post_id":7613433004,"title":"⭐⭐⭐ MODERN 1BD & 1BATH APARTMENT WALKING DISTANCE TO PENN, PENN MEDICI","description":"Property Address\n437 N 40th Street | PHILADELPHIA PA 19104\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n*** AVAILABLE FOR AUGUST 1ST MOVE-IN!\n✔️ SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN UNIVERSITY CITY!\n✔️ MODERN KITCHEN W\/ STAINLESS STEEL APPLIANCES\n✔️ GRANITE COUNTERTOP AND DESIGNER TILED BACKSPLASH\n✔️ LAMINATE FLOORING THROUGHOUT FOR EASY CLEAN\n✔️ CENTRAL AIR & CENTRAL HEATING\n✔️ EXPOSED MODERN DUCTS DESIGN\n✔️ WASHER\/ DRYER IN-UNIT\n✔️ QUIET LIVING & MAXIMUM COMFORT\n✔️ PRIVATE UNIT, PRICE FOR THE ENTIRE UNIT\n✔️ WALK TO PENN, PENN MEDICINE, DREXEL UNIVERSITY\n✔️ 5-STAR TENANT REVIEWS\n✔️ STUDY LOUNGE\n✔️ 24HR GYM\n✔️ ELEVATOR\n✔️ LOBBY\/ PACKAGE AREA\n✔️ CONTROLLED ACCESS\n✔️ WIFI FOR TENANTS\n✔️ ROOF DECK***\n✔️ BIKE PARKING\n✔️ MODERN LOFT-LIKE DESIGN\n✔️ PET FRIENDLY\n✔️ PROFESSIONALLY MANAGED\n✔️ 15-MINUTE WALK TO PENN, PENN MEDICINE, DREXEL\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 1 BD\/ 1 BA\n600 Sq Ft\nRental Terms\nRent: $1400\nAvailable: August 1st 2023\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":10.0,"lat":39.961292,"lng":-75.202199,"attrs":"['1BR \/ 1Ba', '600ft2', 'flat', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:19:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-chestnut-street-beautiful\/7613433595.html","post_id":7613433595,"title":"Chestnut Street - Beautiful Newly Renovated Apt For Rent!!!","description":"Welcome to your new home! This stunning 2-bedroom, 1-bathroom apartment located at 5001 Chestnut Street in Philadelphia, PA is the perfect place for you to call home. Radiator heating will keep you warm and cozy during the colder months, and the new wood flooring throughout the apartment will make your space feel modern and fresh.\nThe updated appliances in the kitchen will make cooking a breeze, and the spacious and well-lit rooms will give you plenty of space to relax and unwind after a long day. You'll love the prime location of this apartment, which is conveniently located near shopping, dining, and entertainment options.\nWith a monthly rent of $1,350 this apartment is affordable and budget-friendly.  As the tenant, you will be responsible for paying utilities in your name.\nDon't miss your chance to make this beautiful apartment your new home! Contact us today to schedule a viewing and see all this property has to offer.\nIn summary, we are searching for respectful tenants who will care for the property and pay rent on time. To be qualified you must submit the following for review:\n1. Background\/Credit check (which will be a $41.99 charge up front to you and for which you must provide us your e-mail address to send this to).\n2. Proof of employment (preferably 30% of your monthly income should be available for paying rent).\n3. You must have first month rent + security deposit available in cash at time of move in = $3,400 total due at move in.\nNo pets allowed at this time.\nThe property is still available. At this time we are working to schedule viewings of the property to those who are interested. Scheduling can be done with my partner Johnny who can be reached at  show contact info\n(call\/text). After being shown the property and you love what you see, we will move forward with the approval process. The approval process would be contingent on a successful credit\/background screening, proof of employment, and reviewing\/signing a lease agreement. Please let me know if you have any other questions. Thank you!\n","num_images":14.0,"lat":39.957984,"lng":-75.221244,"attrs":"['2BR \/ 1Ba', 'available now', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:24:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-all-new-bedrooms-baths\/7613431854.html","post_id":7613431854,"title":"⭐⭐⭐ ALL NEW, 3 BEDROOMS & 2 BATHS APARTMENT LOCATED IN WEST PHILADELPH","description":"Property Address\n4130 W Girard Ave | PHILADELPHIA PA 19104\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ NOT YOUR TYPICAL APARTMENT, CAN YOU SAY OVERSIZED?\n✔️ ALL BRAND NEW! LARGE, BI-LEVEL 3 BEDROOM & 2 BATHS APARTMENT LOCATED IN THE BELMONT AREA OF WEST PHILLY!\n✔️ ALL BRAND NEW! STYLISH INTERIOR WALLS DESIGN!\n✔️ LUXURY KITCHEN W\/ CUSTOM DESIGNER BACKSPLASH & STYLISH ISLAND FEATURING GRANITE COUNTERTOPS!\n✔️ TILED KITCHEN FOR EASY CLEANING, WITH ALL BRAND NEW STAINLESS STEEL APPLIANCES, & A PANTRY CLOSET FOR EXTRA STORAGE!\n✔️ LARGE LIVING ROOM W\/ PLENTY OF SPACE FOR ENTERTAINING GUESTS!\n✔️ DESIGNER BATHROOMS W\/ ALL NEW VANITIES!\n✔️ HUGE WALK-IN CLOSET FOR EXTRA CONVENIENCE!\n✔️ LARGE FINISHED BASEMENT W\/ AN EXTRA ROOM, CUSTOM BATHROOM, AND EXTRA ENTERTAINMENT SPACE!\n✔️ BI-LEVEL APARTMENT W\/ CENTRAL AIR TO KEEP THE SPACE COOL AND COMFORTABLE!\n✔️ WASHER & DRYER HOOK-UP FOR ADDED CONVENIENCE!\n✔️ LOCATED CLOSE TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO CENTER CITY!\n✔️ APPLY TODAY! REDBLOCK.COM\/APARTMENT\/ THIS WILL NOT LAST LONG!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1100\nRental Terms\nRent: $1600\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $3200\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":10.0,"lat":39.973853,"lng":-75.20666,"attrs":"['3BR \/ 2Ba', '1100ft2', 'duplex', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:11:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-all-new-bedrooms-bath\/7613432224.html","post_id":7613432224,"title":"⭐⭐⭐ ALL NEW, 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN WEST PHILADELPHI","description":"Property Address\n4130 W Girard Ave | PHILADELPHIA PA 19104\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ ALL BRAND NEW! SPACIOUS 2 BEDROOM & 1 BATH APARTMENT LOCATED IN THE BELMONT AREA OF WEST PHILLY!\n✔️ ALL BRAND NEW! STYLISH INTERIOR DESIGN WALL!\n✔️ LUXURY KITCHEN W\/ CUSTOM DESIGNER BACKSPLASH & STYLISH ISLAND FEATURING GRANITE COUNTERTOPS!\n✔️ TILED KITCHEN FOR EASY CLEANING & ALL NEW STAINLESS STEEL APPLIANCES!\n✔️ LARGE LIVING ROOM W\/ PLENTY OF SPACE FOR ENTERTAINING GUESTS!\n✔️ DESIGNER BATHROOM W\/ ALL NEW VANITIES!\n✔️ VINYL LAMINATE FLOORING THROUGHOUT FOR EASY CLEANING\n✔️ WASHER & DRYER HOOK-UP FOR ADDED CONVENIENCE!\n✔️ CENTRAL AIR & CENTRAL HEAT\n✔️ LOCATED CLOSE TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO CENTER CITY!\n✔️ APPLY TODAY! REDBLOCK.COM\/APARTMENT\/ THIS WILL NOT LAST LONG!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 800\nRental Terms\nRent: $1300\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2600\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":5.0,"lat":39.973853,"lng":-75.20666,"attrs":"['2BR \/ 1Ba', '800ft2', 'flat', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:13:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-2bd-home-recent\/7613432932.html","post_id":7613432932,"title":"Gorgeous 2bd Home - recent rehab -- tons of light","description":"HOUSE FOR RENT\nGorgeous 2 Bedroom 1.5 Bath House for Rent in Graduate Hospital \/ SWCC\n$2,500 \/ Monoth plus utilities\nRecent rehab with finished basement\nTons of light \/ Great finishes \/ Big Backyard \/ Great Closets!\nGorgeous Kitchen with Granite Counters \/ Stainless Appliances \/ Gas Stove \/ DW \/ Microwave \/ Garb Disposal\nHardwood & Tile Floors \/ Huge Skylight\nAVAILABLE JUNE 1","num_images":4.0,"lat":39.941619,"lng":-75.175762,"attrs":"['2BR \/ 1.5Ba', '1300ft2', 'available jun 1', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:18:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7613431082.html","post_id":7613431082,"title":"⭐⭐⭐SPACIOUS 2 BEDROOM & 1 BATH LOCATED IN WEST OAK LANE⭐⭐⭐","description":"Property Address\n1440 W Grange Ave | PHILADELPHIA PA 19141\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ UPDATED, 2 BEDROOM & 1 BATH APARTMENT LOCATED IN WEST OAK LANE\n✔️ OPEN LAYOUT\n✔️ SPACIOUS KITCHEN\n✔️ SPACIOUS BEDROOM\n✔️ LAMINATE FLOORING\n✔️ LARGE CLOSETS\n✔️ LOTS OF NATURAL LIGHT\n✔️ ALL-ELECTRIC\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 750\nRental Terms\nRent: $1100\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2200\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":11.0,"lat":40.041284,"lng":-75.145171,"attrs":"['2BR \/ 1Ba', '750ft2', 'duplex', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:06:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-rittenhouse-condo\/7613430326.html","post_id":7613430326,"title":"-->1 bed\/bath RITTENHOUSE CONDO<----","description":"1 bed\/1 bath condo at 20th and Chestnut in Chestnut View condominiums available for rent! This is a fabulous condo in a PERFECT location with the right mix of restaurants and bars with easy access to center city businesses and all universities in the area.\nThe apartment is renovated with stainless steel appliances (including a dishwasher!) and hardwood floors. There are laundry facilities in the building and the unit has an AC\/Heating system. Further, there are 2 elevators in the building to provide easy access to your 6th floor apartment!\nApartment is FULLY FURNISHED including 2 TVs! Just bring your bags!\nWill consider both long and short let tenancies.","num_images":9.0,"lat":39.952052,"lng":-75.173489,"attrs":"['1BR \/ 1Ba', 'available may 19', 'air conditioning', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:00:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-bedroom-and-15\/7613431409.html","post_id":7613431409,"title":"BRAND NEW! 1 BEDROOM AND 1.5 BATH APARTMENT LOCATED IN STRAWBERRY MANS","description":"Property Address\n3143 W Norris Street – 1F | PHILADELPHIA PA 19121\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ BEST VALUE APARTMENT! ⭐⭐⭐\n✔️ SPACIOUS 1 BEDROOMS AND 1.5 BATHS APARTMENT LOCATED IN STRAWBERRY MANSION AREA!\n✔️ GRANITE COUNTERTOP KITCHEN\n✔️ 42 INCH DESIGNER KITCHEN CABINETS\n✔️ STAINLESS STEEL APPLIANCES\n✔️ CUSTOM BACKSPLASH AND FLOOR TILES\n✔️ MODERN PARQUET FLOORING\n✔️ DESIGNER PAINTER COLORS\n✔️ CUSTOM TILED BATHROOM W\/ ALL-NEW VANITIES\n✔️ CENTRAL AIR\n✔️ BACKYARD\n✔️ BASEMENT FOR STORAGE\n✔️ ALL-ELECTRIC\n✔️ CLOSE TO PUBLIC TRANSPORTATION!\n✔️ EASY ACCESS TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO AND FROM THE CITY!\n✔️ APPLY TODAY!!!\nDetails\n– $35 app fee per person\n– Full background checks.\n– Yearly leases only.\n– Available ASAP\n– 3-months rent to move in\n– Tenant pays all own utilities\n*** Build your credit! We report rent payments to Experian! ***\n*** Please apply online at https:\/\/redblock.com ***\nAmenities\nall-electric\nopen layout\nconveniently located\nSize\nBeds\/Baths: 1 BD\/1.5 BA\nSquare Feet: Apx. 565\nRental Terms\nRent: $900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1800.00\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES ***\n","num_images":8.0,"lat":39.986805,"lng":-75.184848,"attrs":"['1BR \/ 1.5Ba', '565ft2', 'duplex', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-04-22T23:08:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/horsham-charming-hatboro-home\/7613639604.html","post_id":7613639604,"title":"Charming Hatboro Home","description":"3 BR, 1.5 BA brick & vinyl sided Rancher extra wide driveway. Entryway offering hardwood floors opens to formal Living room with wall-to-wall carpet & triple window welcoming in the sunshine. Large Eat-in Kitchen with hardwood floors, oak cabinetry, granite countertops, stainless steel undermount sink, ceramic tile backsplash, pantry, built-in dishwasher & electric cerran top range. Kitchen opens to Family room with wall-to-wall carpet, corner, floor to ceiling brick hearth with propane gas fireplace, large casement window overlooking rear yard, access to powder room & door leading to brick side patio. Three nice-sized bedrooms all offer wall-to-wall carpet & ceiling fans. Full bath with ceramic tile floor & walls, pedestal sink & tub\/shower combination. Large rear yard. Oil, hot water baseboard heat & central air. Newer roof. Andersen windows throughout. WHAT ARE YOU WAITING FOR!!","num_images":8.0,"lat":40.208231,"lng":-75.133522,"attrs":"['3BR \/ 2Ba', '1440ft2', 'available now', '\\nsunday 2023-04-23\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T17:04:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-location-for-this\/7613637441.html","post_id":7613637441,"title":"Great location for this two bedroom apartment in philadelphia","description":"Great location for this two bedroom apartment in philadelphia with heat and hot water included in rent. Nice kitchen with granite counters and good size rooms. Apartment comes with off street parking for two parking spots, Washer\/dryer hookups in unit (machines not included) or onsite, coin op washer\/dryer if preferred.\nTenant responsible for electricity (has electric heat and hot water) and prorated water. IF YOU ARE INTERESTED PLEASE, SEND CONTACT lucy85828gmail.com\n","num_images":1.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'detached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T16:58:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ridley-park-over-sized-bedroom-with\/7613634218.html","post_id":7613634218,"title":"Over sized bedroom with large closet","description":"Beautiful One Bedroom One Bathroom condo in the exclusive Parker Building featuring, Large Living Room with new carpeting, Dining Area with seating for six people, Modern Kitchen with new flooring & ceiling, tile back splash, upgraded counter tops, new stove, new dishwasher and pantry. Over sized bedroom with large closet, Updated Full Bathroom. Some additional amenities; Lovely Private Balcony(best views in the building), New Central, New Heater, Freshly Painted, New Sliding Glass Door & window, lots of closet space(++), extremely well maintained","num_images":18.0,"lat":39.875462,"lng":-75.322482,"attrs":"['1BR \/ 1Ba', '700ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T16:48:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-br-1bath-apt-av-now\/7613639849.html","post_id":7613639849,"title":"Updated, 1 BR\/1BATH Apt AV-NoW!!","description":"Available Now!!, 1 Bedroom 1 bath Apartment in Philadelphia. Off first month rent with signed lease! Large two bedroom, 1 bath upper apartment with water included in secured building! Kitchen includes all major appliances and leads directly into the dining room. Dining room has extra large closets for storage and is open concept to the living room that has tons of natural light and air conditioning! First bedroom has walk-in closet. ! Coin-operated laundry on site, and 1 assigned parking space per apartment. Walking distance to the park! Additional and guest parking on street. This is a smoke and pet free property. Which features master bedrooms with a walk-in closets! Also features: Kitchen, dining area, Living room space and more! We also have playground, and swimming pool area, for family and friends to enjoy! Utilities includes: Water, Trash, and Sewer! Lofts 640 combines commuter convenience of center city living with the spectacular urban spaciousness of true \"loft living.\" indoor pool and jacuzzi, full fitness center with Free Classes, Philadelphia, yoga studio, and all units cable-ready! making transportation convenient to and from employment, shopping, entertainment and cultural centers. Philadelphia Apartments and Townhomes is just 5 minutes from restaurants and shopping entertainment in historic\nPhiladelphia area and it’s less than 10 minutes from, dining and entertainment. Come by and take a tour of our Apartments\/Townhomes!If you interested please contact: show contact info","num_images":5.0,"lat":40.0343,"lng":-75.1213,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-23T17:05:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-br-1bath-apt\/7613628691.html","post_id":7613628691,"title":"Updated, 2 BR\/1BATH Apt","description":"Available: May 1th 2023, 1 Bedroom 1 bath Apartment in Philadelphia. Off first month rent with signed lease! Large two bedroom, 1 bath upper apartment with water included in secured building! Kitchen includes all major appliances and leads directly into the dining room. Dining room has extra large closets for storage and is open concept to the living room that has tons of natural light and air conditioning! First bedroom has walk-in closet. ! Coin-operated laundry on site, and 1 assigned parking space per apartment. Walking distance to the park! Additional and guest parking on street. This is a smoke and pet free property. Which features master bedrooms with a walk-in closets! Also features: Kitchen, dining area, Living room space and more! We also have playground, and swimming pool area, for family and friends to enjoy! Utilities includes: Water, Trash, and Sewer! Lofts 640 combines commuter convenience of center city living with the spectacular urban spaciousness of true \"loft living.\" At Lofts 640, indoor garage parking ($600 per month), indoor pool and jacuzzi, full fitness center with Free Classes, Philadelphia, yoga studio, and all units cable-ready! making transportation convenient to and from employment, shopping, entertainment and cultural centers. Philadelphia Apartments and Townhomes is just 5 minutes from restaurants and shopping entertainment in historic\nPhiladelphia area and it’s less than 10 minutes from, dining and entertainment. Come by and take a tour of our Apartments\/Townhomes!If you interested please contact:  show contact info","num_images":4.0,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-23T16:32:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-dont-wait-come-home-today\/7613626515.html","post_id":7613626515,"title":"Don't wait! Come home today to The Gateway Apartments! 2 bed \/ 2 bath!","description":"The Gateway Apartments1515 Manley Rd West Chester, PA 19380Pricing: $2518 - $3367\/Month*Bedrooms: 2  Bathrooms: 2 Square Footage: 1363 sq ft show contact info\nFeatures in this apartment home:❖ Air Conditioning & Heating❖ Cable Ready❖ Carpet❖ Den❖ Dining Room❖ Dishwasher❖ High Speed Internet Access❖ Refrigerator, Freezer, Ice Maker❖ Trash Compactor❖ Tub\/Shower❖ Built-In Computer Nook (select homes)❖ Disability Access (select homes)❖ Frost-Free Refrigerator\/Ice Maker❖ Garden\/Spa Tub (select homes)❖ Gas Fire Place (select homes)❖ Kitchen Pantry❖ Private Entrance To Each Unit❖ Upgrade❖ Vaulted Ceiling (select homes)❖ Washer And Dryer In Each Apartment HomeAbout the community:  Offering a vibrant selection of living options, The Gateway Apartment Homes maintains the prime for luxury apartments in West Chester, PA. Our open and inviting floor plans are enhanced by a variety of exclusive features which define the unique lifestyle only found at our community. With a great location in the East Goshen Township, you will love calling our apartments your home. Amenities at our property:❖ Business Center❖ Clubhouse❖ Fitness Center❖ Onsite Maintenance❖ Onsite Management❖ Package Service❖ Picnic and Grilling Area❖ Pool and Sundeck❖ Storage Space❖ Walking\/Biking Trails❖ Across From Wawa & Goshen Crossing Shopping Center❖ Beautifully Landscaped Grounds❖ Garages For Lease❖ Gated Entrances❖ Maintenance Free Lifestyle❖ Onsite Leasing Office❖ Relaxing Fire Pit❖ Resort-Style Pool With Sun Deck❖ Storage Units For Lease❖ Three BBQ\/Picnic AreasAdditional information:Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthPets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonWebsite: https:\/\/www.thegatewayapartments.com\/Phone:  show contact info\n*Prices are subject to change without notice All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYA39AF6E09A284C9\n","num_images":13.0,"lat":39.967056,"lng":-75.529129,"attrs":"['2BR \/ 2Ba', '1363ft2', 'available jun 14', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T16:25:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-make-your-move-today\/7613614166.html","post_id":7613614166,"title":"Make Your Move Today, Stunning Delaware River Views! 1 Mo Free & More!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Stunning Apartments in Northern Liberties Residences at 1 Brown offers stunning and spacious studios, one, two, and three bedroom apartments with premium features designed to help you live your best life every day. Each unit has oversized bedrooms and enough living space for both a media center and kitchen table. You will thoroughly enjoy the soaking up the ample space to relax or host guests! Upscale kitchens with cherry wood cupboards are brimming with the latest appliances complemented by granite countertops and ample storage space. Nearby, you can enjoy a spa shower and Jacuzzi tub in your bathroom, take advantage of your personal washer and dryer, and set up a special place for your pets. As you come home to your 1 Brown apartment each day, you're stepping into a place of comfort, convenience and class. Call Today!  Call Now:  show contact info\nx 24OR Text 24 to  show contact info\nto contact us.Want more info on this unit? See the link (below):https:\/\/archcompanies.aptglance.com\/8pk9m3This is a 2 Bedroom, 2 Bath, Approximately 1286 Sq. Ft.Features - Generous Closet Space  - Floor to Ceiling Windows  - Quartz Counter Tops  - Full Size Washer\/Dryer in unit  - Gourmet Eat-In Kitchens with Cherry Wood Cupboards  - Nest Thermostats  - Large Bathrooms  - Spa Shower System & Jacuzzi Tub  - 9 Ft Ceilings  - Stainless Steel Appliances  - Largest Apartments in the Area Community Amenities - Rooftop Walking Track & Dining Areas  - Fully Outfitted Fitness Center  - Dry Cleaning Service  - Spacious Highrise Living  - 24-Hour Concierge Service  - Spectacular Resort Style Pool Area  - Amazing Views and Rooftop Lounge Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMResidences at One Brown 1 Brown Street, Philadelphia, PA, 19123 Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! Equal Housing Opportunity WAc2YpDy\n","num_images":14.0,"lat":39.962145,"lng":-75.137734,"attrs":"['2BR \/ 2Ba', '1286ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T15:50:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-stainless-steel-appliances\/7613611895.html","post_id":7613611895,"title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\n[#9659997]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T15:44:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-rittenhouse\/7613597118.html","post_id":7613597118,"title":"Charming Rittenhouse Apartment (Philadelphia)","description":"* * * Please include contact phone number with your reply or your questions.\nCharming One Bedroom, One Bath apartment in a great neighborhood on Locust Street!!\nAvailable for one (1) person. Private apartment with separate unit entrance. (Not a studio)\nAvailable May 15th (or maybe sooner).\nThis lovely apartment is just off of Rittenhouse Square, Schuylkill River Banks walk, downtown shopping and dining.\nBeautiful hardwood floors throughout, except for tiled bathroom.\nCeiling fans. Renovated kitchen.\nThis apartment is on the second floor of a private house.\nApproximately 750 sq. ft.\n$1,200.00 per month + electric, and gas for stove.\nRent includes hot & cold water, heat, and washer\/dryer in basement.\nNo pets or smokers please.\nResidential on-street parking is available with permit decal purchased from Philadelphia.\n* * * Please remember to include contact phone number with your reply or your questions.\nThank you.","num_images":8.0,"lat":39.949614,"lng":-75.175989,"attrs":"['1BR \/ 1Ba', '750ft2', 'available may 15', 'air conditioning', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T15:02:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-maintained-bed\/7613603259.html","post_id":7613603259,"title":"Beautifully maintained 1 bed 1 bath Trinity home","description":"This end of Row is sure to impress! Entering the front door is a great sized living room with hardwood floors, and a ton of natural light, the perfect space for greeting and entertaining guests. Just off the living room you have an updated kitchen with upgraded appliances, modern cabinetry, Corian counter tops, and floating wood shelves. Off the kitchen is a great size back patio, another great place for entertaining guests and firing up the grill! There is a private breezeway for easy access to back patio, excellent for storing bikes and trash can. Text \/call  show contact info\nfor more information to schedule move in date..","num_images":13.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '927ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T15:18:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-professionally-managed\/7613596716.html","post_id":7613596716,"title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nWhen you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nApartment Features\n* Disposal\n* Linen Closet\n* Window Coverings\n* High Efficiency Lighting Fixtures\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Central Heat and Air\n* Full sized Washer and Dryer in unit\n* Walk-in Closet\n* Pantry\n* Lofty Vaulted Ceilings\n* Breakfast Bar\n* Roommate Friendly Floor Plan\n* Private Patio or Private Balcony (on select apartments)\n* Pre-wired for internet and cable\n* Stainless Steel Appliances\n* Granite Countertops\n* Ceiling Fan\n* Garden Tub\n[#9660017]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1138ft2', 'available apr 28', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T15:01:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-temple-university-vicinity\/7613589294.html","post_id":7613589294,"title":"Temple University Vicinity","description":"New Construction\/2020- Large and Beautiful\/1100 SQ Feet- Large living room with wooden flooring-Ultra kitchen with refrigerator, microwave, disposal, dishwasher, overhead and base cabinetry, ceramic tile backsplash- Two large bedrooms with floor to ceiling windows, spacious closets. Each bedroom has it's own full ceramic tile bathroom- Ceramic tile powder room in main living area. Laundry area with washer and dryer- Central air-conditioning. Immediate possession!","num_images":0.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', '1100ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T14:41:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-apartments-near-your\/7613585273.html","post_id":7613585273,"title":"Large Apartments near your favorite destinations in Northern Liberties","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card!  Welcome to Residences at One BrownCall Now -  show contact info\nx 138OR Text 138 to  show contact info\nto text us.This is a 1 Bedroom, 1 Bath, Approximately 690 Sq. Ft. 1 Brown will check off everything on your list of must-haves with stunning luxury apartments in the neighborhood of Northern Liberties. Take a look at the variety of floor plans and choose the perfect spot for your lifestyle. No matter which residence you choose, your home will boast a spacious layout with classic, sophisticated interior finishes.A variety of relaxing amenities await you, including a rooftop with scenic waterfront views and, a fitness center, and a heated resort style pool. Conveniently located in the heart of the Northern Liberties neighborhood of Philadelphia, you’ll be surrounded by historical sites as well as a wealth of restaurants, entertainment options, and shopping. Features: Largest Apartments in the Area, Nest Thermostats, Spa Shower System & Jacuzzi Tub, Floor to Ceiling Windows, 9 Ft Ceilings, Stainless Steel Appliances, Generous Closet Space, Large Bathrooms, Full Size Washer\/Dryer in unit, Quartz Counter Tops, Gourmet Eat-In Kitchens with Cherry Wood Cupboards  Community Amenities: Spacious Highrise Living, 24-Hour Concierge Service, Spectacular Resort Style Pool Area, Amazing Views and Rooftop Lounge, Rooftop Walking Track & Dining Areas, Fully Outfitted Fitness Center, Dry Cleaning Service Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Follow This Link for More Information:https:\/\/archcompanies.aptglance.com\/43n77o Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! Equal Housing Opportunity zjdE67sZ\n","num_images":15.0,"lat":39.962145,"lng":-75.137734,"attrs":"['1BR \/ 1Ba', '690ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T14:30:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studios-available-dwell\/7613581403.html","post_id":7613581403,"title":"Studios Available! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', '\\nsunday 2023-04-23\\n', '\\nmonday 2023-04-24\\n', '\\ntuesday 2023-04-25\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T14:20:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-parking-garage-modern\/7613577972.html","post_id":7613577972,"title":"Parking Garage, Modern Amenities, Incredible Features","description":"At The Point at Exton, you're exactly where you want to be in a place that brings out the best in life. Contact us today for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, walk-in closet, and a washer\/dryer!\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nApartment Features\n* Wood-Like Floors\n* Kitchen Island\n* Quartz Countertops\n* Stainless Steel Appliances\n* Garden Tub\n* Granite Countertops\n* Washer and Dryer in unit\n[#9659999]","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '732ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-23T14:11:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-temple-hospital-vicinity\/7613576121.html","post_id":7613576121,"title":"Temple Hospital Vicinity","description":"Bi-Level apartment- 1st level: Large living room with wood flooring- Modern kitchen with double oven range, microwave, refrigerator, overhead and base cabinets- Ceramic tile bathroom. 2nd level: Three bedrooms all with wooden flooring.\nWasher\/Dryer in the building. Immediate possession!\n","num_images":0.0,"lat":40.0118,"lng":-75.1456,"attrs":"['3BR \/ 1Ba', '800ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T14:06:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-house-for-rent\/7613567227.html","post_id":7613567227,"title":"Amazing House for Rent","description":"House for rent\n7804 Granville Rd, Philadelphia, PA 19128\n2 bedroom 1.5 bathroom\nSqft 1,434\nMonthly rent 850\nDescription\nRecently renovated 2 bedroom house for\nrent\nNote :This lovely 2 bedroom 1.5 bathroom property is available from rent now . currently occupied but would be ready in a week from now\nApply now! NO SECTION 8\nGarage parking\nCentral heating\nCentral ac\nPets allowed\nYearly lease\nAvailable may 1\nPlease text for more information or to apply.  show contact info","num_images":9.0,"lat":40.052587,"lng":-75.237277,"attrs":"['2BR \/ 1.5Ba', '1434ft2', 'available may 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2023-04-23T13:42:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-immediate-move-in\/7613565338.html","post_id":7613565338,"title":"Immediate Move-In Available! 1BD\/1Bath Upgraded Unit! Ready to Tour!","description":"Community Location: 1515 Manley Rd - West Chester, PA 19380 Rental Information: $1919 - $2518\/Month | 1 Bedroom 1 Bath | 779 sq ftLeasing Options:  3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month show contact info\nApartment Amenities:  ◾ Alarm◾ Cable Ready◾ Carpet◾ Den◾ Garbage Disposal◾ High Speed Internet Access◾ Trash Compactor◾ Tub\/Shower◾ Walk-In Closets◾ Window Coverings◾ Built-In Microwave Oven◾ Disability Access (select homes)◾ Frost-Free Refrigerator\/Ice Maker◾ Garden\/Spa Tub (select homes)◾ Mini Blinds On All Windows◾ Private Entrance To Each Unit◾ Vaulted Ceiling (select homes)◾ Washer And Dryer In Each Apartment Home◾ Wired For High-Speed Internet◾ Wooded View\/Pool View (select homes)Property Features: ◾ Business Center◾ Clubhouse◾ Fitness Center◾ Onsite Maintenance◾ Onsite Management◾ Package Service◾ Picnic and Grilling Area◾ Pool and Sundeck◾ Storage Space◾ Walking\/Biking Trails◾ Across From Wawa & Goshen Crossing Shopping Center◾ Beautifully Landscaped Grounds◾ Garages For Lease◾ Gated Entrances◾ Pet-Friendly◾ Relaxing Fire Pit◾ Resort-Style Pool With Sun Deck◾ Storage Units For Lease◾ Three BBQ\/Picnic Areas◾ Wi-Fi Access in Clubhouse and at Pool Description: Residents of our West Chester, PA apartments enjoy a spacious one or two bedroom floor plan which adds warmth and comfort to any lifestyle. The Gateway provides a number of lavish amenities, including a full kitchen, 9-foot ceilings, walk-in closets, and large windows. Our premier location is close to public transportation and the most prominent dining, shopping, and recreational venues in the area, making our community perfect for commuters all across Chester County. Schedule a tour of our West Chester community today and see why residents love coming home.Please take our virtual tour\nhttps:\/\/my.matterport.com\/show\/?m=4RkQ1PobBkE&brand=0Pets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonCall: The Gateway Apartments at  show contact info\nFacebook: https:\/\/www.facebook.com\/TheGatewayApartmentsAParadiseManagementCommunity\/ Website: https:\/\/www.thegatewayapartments.com\/All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY970F506CB0054A\n","num_images":14.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '779ft2', 'available now', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T13:37:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-charming-remodeled-bungalow\/7613556592.html","post_id":7613556592,"title":"Charming Remodeled Bungalow with Spacious Loft - Ready for Rent","description":"Welcome to your dream home! We are excited to present this stunning remodeled bungalow with a spacious loft, now available for rent. This one-of-a-kind gem combines classic charm with modern comfort and style, making it the perfect place to call home.\n•\tThis stunning home has recently been renovated to offer modern conveniences and classic charm.\n•\tMaster bedroom on the first floor\n•\tThe loft can be a large second bedroom or a fantastic bonus room.\n•\tThe gleaming hardwood floors and natural light create a warm and welcoming atmosphere.\n•\tThe kitchen has been fully updated with custom cabinets.\n•\tThe bathroom has also been updated with new fixtures and finishes.\n•\tFree trash service\nSchedule a viewing; call us today","num_images":9.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 1Ba', 'available now', 'apartment', 'w\/d hookups', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T13:12:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/thorndale-beautifully-remodeled-home-to\/7613559231.html","post_id":7613559231,"title":"Beautifully Remodeled Home to Rent","description":"Are you looking for a beautifully remodeled home to rent? Then, you have come to the right place!\n•\tThis stunning home has recently been renovated to offer modern conveniences and classic charm.\n•\tThe gleaming hardwood floors and natural light create a warm and welcoming atmosphere.\n•\tThe kitchen has been fully updated with custom cabinets.\n•\tUpstairs, you'll find three bedrooms, each with its own closet space and plenty of natural light.\n•\tA renovated attic can be used as a fourth bedroom or bonus room.\n•\tThe bathroom has also been updated with new fixtures and finishes.\n•\tIts convenient location and easy access to public transportation make this home an ideal place to live.\n•\tThe property also features a great outdoor space for entertaining.\n•\tFree trash service\nSchedule a viewing, call us today","num_images":7.0,"lat":39.971437,"lng":-75.746784,"attrs":"['3BR \/ 1Ba', 'available now', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T13:20:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-uarts-jefferson-med\/7613553650.html","post_id":7613553650,"title":"UArts\/Jefferson Med-Nursing School, Kahn Part","description":"Sunny, spacious 2 Bdr. Entire 2nd Fl. Living room w\/separate dining area, both w\/windows overlooking beautiful Kahn Park and west view of CC skyline. Kitchen w\/tile backsplash, DW, disposal, Gas range, full-size refrigerator, Euro washer\/dryer.\n2 quiet rear bedrooms w\/morning sunlight overlooking private quiet garden. Tile bath, entrance hall, coat closet, rear hall w\/linen closet. Hardwood floors throughout. Walking distance to everything in Wash West, Gayborhood, Center City; Whole Foods, Acme, Pharmacies, TJU, UofArts. Heat and hot\/cold water included. Quiet, clean, owner- occupied property. Tenant access to private garden. Heat, Hot & Cold water provided.\n","num_images":11.0,"lat":39.945051,"lng":-75.159436,"attrs":"['2BR \/ 1Ba', '900ft2', 'available jul 5', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T13:05:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-everything-you-want-and-more\/7613554077.html","post_id":7613554077,"title":"Everything you want and MORE! 916 sq ft 1 bed, 1 bath available!","description":"Silk Factory Lofts Visit our community today! 200 S Line St Lansdale, PA 19446 show contact info\nUnit Rates:  $1736\/month Unit Type: 1-BR 1-BA Unit Size: 920 sq ftLease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthPet Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephWhat you’ll find in our community: ➢ 2 Weber Propane Grills➢ Business Center➢ Dog Wash Room➢ Elevator➢ Laundry Facilities➢ Package Service➢ Pet-Friendly Community➢ Pool Table➢ Smoke-Free➢ Vintage Building➢ Close to Montgomeryville Mall and Routes 202 & 309➢ Community Lounge featuring free Verizon Fios TV\/Wi-Fi➢ Courtyard featuring tasteful Outdoor Seating and Fire Pits➢ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting➢ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi➢ Lobby Area with Complimentary Coffee➢ Maintenance-Free Lifestyle➢ Professional On-Site Management Team➢ Storage Locker - $75\/$100➢ Within Walking Distance to TrainsDescription: SEE WHAT YOU'VE BEEN MISSING  Discover an upscale lifestyle at Silk Factory Apartments. Our landmark historic building features a brick exterior, soaring ceilings, large windows, and a beautiful courtyard with outdoor lounge seating and firepits, a picnic and grilling area with gas grills, and a community herb garden. Inside your spacious loft-style apartment you'll find modern style from your updated kitchen with dishwasher, stove, refrigerator, and microwave, to central air conditioning, and a private in-home washer and dryer. Call us today for a tour!Bright and Cheery one bedroom Apartment home with brand new plank flooring.This unit comes with: ➢ Cable & Hi-Speed Internet Ready➢ Central Air Conditioning➢ Courtyard View in select apartments➢ Full Size Washer & Dryer➢ Large Windows➢ Range \/ Oven➢ Refrigerator\/Freezer➢ Secured Building Access➢ Storage Spaces➢ Upgraded Kitchens in Select ApartmentsCall or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY5E8167B8E9FC4A\n","num_images":19.0,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '920ft2', 'available jul 14', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T13:06:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-specials-floor-to\/7613553176.html","post_id":7613553176,"title":"Amazing Specials, Floor to Ceiling Windows with Stunning Views!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Residences at One Brown 1 Brown Street, Philadelphia, PA, 19123Want more info on this unit? See the link (below):https:\/\/archcompanies.aptglance.com\/v4g40y Call Now:  show contact info\nx 23OR Text 23 to  show contact info\nto text our team.Stunning Apartments in Northern LibertiesThis is a 2 Bedroom, 2 Bath, Approximately 1286 Sq. Ft. Residences at 1 Brown offers stunning and spacious studios, one, two, and three bedroom apartments with premium features designed to help you live your best life every day. Each unit has oversized bedrooms and enough living space for both a media center and kitchen table. You will thoroughly enjoy the soaking up the ample space to relax or host guests! Upscale kitchens with cherry wood cupboards are brimming with the latest appliances complemented by granite countertops and ample storage space. Nearby, you can enjoy a spa shower and Jacuzzi tub in your bathroom, take advantage of your personal washer and dryer, and set up a special place for your pets. As you come home to your 1 Brown apartment each day, you're stepping into a place of comfort, convenience and class. Call Today! Features - Nest Thermostats  - Full Size Washer\/Dryer in unit  - Stainless Steel Appliances  - Floor to Ceiling Windows  - Largest Apartments in the Area  - Large Bathrooms  - Spa Shower System & Jacuzzi Tub  - 9 Ft Ceilings  - Gourmet Eat-In Kitchens with Cherry Wood Cupboards  - Quartz Counter Tops  - Generous Closet Space Community Amenities - Amazing Views and Rooftop Lounge  - Spectacular Resort Style Pool Area  - Fully Outfitted Fitness Center  - Rooftop Walking Track & Dining Areas  - Spacious Highrise Living  - 24-Hour Concierge Service  - Dry Cleaning Service Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMPet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today!  Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! Equal Housing Opportunity VPT8r0hTuE\n","num_images":14.0,"lat":39.962145,"lng":-75.137734,"attrs":"['2BR \/ 2Ba', '1286ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T13:04:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-stop-by-today-at-the-bed-bath\/7613551388.html","post_id":7613551388,"title":"Stop by today at the 1 bed \/ 1 bath of your dreams! 797 Sq Ft!","description":"Silk Factory Lofts - A place to call home! Bed: 1 \/ Bath: 1  Sq. Footage: 797 sq ft Rent: $1697\/MonthTerms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-Month show contact info\nSEE WHAT YOU'VE BEEN MISSING  Located in the heart of Lansdale, Pennsylvania, Silk Factory Lofts offer an irresistible lifestyle set in a historic landmark building. Our open loft-style apartments feature oversized windows, high ceilings and modern kitchens. Our community boasts an upscale resident lounge, modern fitness center and beautiful courtyards. Apartment options include 1, 2 and 3 bedroom floor plans. Silk Factory Lofts is located close to public transportation, shopping, dining and entertainment. If you want to venture out, we offer convenient access to major highways, and we're less than an hour from downtown Philadelphia.Our Apartment Homes Feature:   ◾ Cable & Hi-Speed Internet Ready◾ Courtyard View in select apartments◾ Dishwasher◾ Full Size Washer & Dryer◾ Large Windows◾ Range \/ Oven◾ Refrigerator\/Freezer◾ Secured Building Access◾ Storage Spaces◾ Upgraded Kitchens in Select Apartments Our Residents Enjoy:  ◾ 2 Weber Propane Grills◾ Business Center◾ Dog Wash Room◾ Laundry Facilities◾ Monthly Community Events◾ Package Service◾ Pet-Friendly Community◾ Pool Table◾ Smoke-Free◾ Vintage Building◾ Beautifully Landscaped Grounds with Access to Local Businesses◾ Close to Montgomeryville Mall and Routes 202 & 309◾ Courtyard featuring tasteful Outdoor Seating and Fire Pits◾ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi◾ Free Parking - 2 Spaces per Apartment Home + Guest Parking◾ Lobby Area with Complimentary Coffee◾ Maintenance-Free Lifestyle◾ Professional On-Site Management Team◾ Storage Locker - $75\/$100◾ Within Walking Distance to TrainsContact Info: show contact info\n200 S Line St Lansdale, PA 19446Facebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Pets: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German Sheph Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY5B53DF9B2A4041\n","num_images":20.0,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '797ft2', 'available jun 15', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T12:59:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-listed-bed-25-bath\/7613533875.html","post_id":7613533875,"title":"JUST LISTED! 3 BED 2.5 BATH HOUSE, A\/C, PARKING, IN UNIT W\/D & MORE!!!","description":"6207 Wayne Ave. – 3 bed 1.5 bath house - H\/W floors, Central Air, Private backyard, In unit W\/D & off-street parking! $2349\/month  - AVAILABLE SEPT 1\nCome see why so many people are calling Germantown home!! Located on Wayne Ave. within walking distance of the Fairmount Park towpath, Ultimo Coffee & MORE! This location is teeming with new and classic businesses from restaurants to small boutiques.\nLovingly maintained 3-bedroom 2.5 bath house with off street parking and more! Open floor plan in your living and dining area with hardwood flooring. Excellent light pours into the bay windows at the front of the house, perfect for your morning coffee! Updated kitchen with new tile flooring, stainless steel microwave, dishwasher and oven. Enjoy entertaining with your bar height kitchen island with room for seating.\nGet comfortable upstairs featuring three large bedrooms each with closet space with plenty of room for wardrobe and sneaker collection. Primary bedroom is a suite with private bathroom and shower.\nOff-street parking with garage space, and private backyard space perfect for hosting!\nFully finished basement with half bathroom and laundry room. CENTRAL AIR for those hot sticky days of summer!\nFeaturing:\n3 bedrooms\n2.5 bath\nStove\nDishwasher\nFull sized refrigerator\nMicrowave\nWasher & dryer\nCentral Air\nOff-street parking\nFull basement storage\nAND MORE!","num_images":16.0,"lat":40.036027,"lng":-75.186295,"attrs":"['3BR \/ 2.5Ba', 'available sep 1', 'application fee details: $50.00 per applicant', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T12:11:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-central-location-upgraded\/7613542831.html","post_id":7613542831,"title":"Central Location, Upgraded Finishes Available, Pet Park","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nThe Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Pantry\n* Disposal\n* Walk-in Closet\n* Private Patio or Private Balcony (on select apartments)\n* Stainless Steel Appliances\n* Lofty Vaulted Ceilings\n* Central Heat and Air\n* Roommate Friendly Floor Plan\n* Garden Tub\n* Window Coverings\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Full sized Washer and Dryer in unit\n* Linen Closet\n* Ceiling Fan\n* Breakfast Bar\n* High Efficiency Lighting Fixtures\n* Granite Countertops\n* Pre-wired for internet and cable","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1207ft2', 'available apr 28', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T12:35:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-incredible-features-resort\/7613542102.html","post_id":7613542102,"title":"Incredible Features, Resort Style Pool, Upgraded Finishes Available","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester is the perfect location for your new home. Explore our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, Den, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Breakfast Bar\n* Full sized Washer and Dryer in unit\n* Garden Tub\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Stainless Steel Appliances\n* Pre-wired for internet and cable\n* Disposal\n* Linen Closet\n* Window Coverings\n* Private Patio or Private Balcony (on select apartments)\n* Pantry\n* Ceiling Fan\n* Lofty Vaulted Ceilings\n* High Efficiency Lighting Fixtures\n* Walk-in Closet\n* Granite Countertops\n* Roommate Friendly Floor Plan\n* Central Heat and Air\n[#9659855]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available apr 28', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T12:33:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-laundry-in-unit-central\/7613539675.html","post_id":7613539675,"title":"Laundry in Unit, Central Location, Ideal Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\n[#9659904]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1110ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T12:26:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fitness-center-incredible\/7613539436.html","post_id":7613539436,"title":"Fitness Center, Incredible Features, Central Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nBe the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nApartment Features\n* Stainless Steel Appliances\n* Garden Tub\n* Kitchen Island\n* Washer and Dryer in unit\n* Linen Closet\n* Private Patio or Private Balcony (on select apartments)\n* Walk-in Closet","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '789ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-23T12:25:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-price-drop-bed-15-bath\/7613531056.html","post_id":7613531056,"title":"PRICE DROP! 3 BED 1.5 BATH HOUSE, W\/D IN UNIT, A\/C, PARKING & MORE!!!!","description":"6766 Germantown Ave – 3 bed 1.5 bath house  - H\/W floors, Central Air, in unit W\/D & off-street parking! $2099\/month -  AVAILABLE AUGUST 1\nCome see why so many people are calling Mt. Airy home! Located on Germantown Ave. within walking distance from Lovett Park and all points Mt. Airy. Head down the street for dinner at McMenamin’s or Earth & Bready Brewery, or hop into town for a night.\nLovingly maintained 3-bedroom 1.5 bath house with off street parking and more! Open floor plan in your living and dining area with hardwood flooring. Excellent light pours into the updated kitchen with new tile flooring, stainless steel microwave, dishwasher and oven.\nConvenient half bath off the living space with newly installed vanity. Second floor features three spacious bedrooms with generous closet space, and a full three-piece bathroom.\nDon’t forget your very own WASHER & DRYER! Laundry is a breeze!! CENTRAL AIR! Keeping you cool during those hot HUMID summer days!\nFeaturing:\n3 bedrooms\n1.5 bath\nStove\nDishwasher\nFull sized refrigerator\nMicrowave\nWasher & dryer\nCentral Air\nOff-street parking\nFull basement storage\nAND MORE!","num_images":12.0,"lat":40.053966,"lng":-75.186516,"attrs":"['3BR \/ 1.5Ba', 'available aug 1', 'application fee details: $50.00 per applicant', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-23T12:04:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-for-rent-bed-15-bath\/7613532671.html","post_id":7613532671,"title":"HOUSE FOR RENT 3 BED 1.5 BATH","description":"This wonderfully traditional home, with all new upgrades, is just steps from South Philly's famous \"Eatery Row!\" An attractive colonial front is the first tip-off of what is to come! Spacious and open living room\/dining room combo with refinished original hardwood flooring, and a large \"eat-in\" kitchen - with plenty of cabinets and food preparation space. The rear outdoor space is perfect for a private BBQ and friendly gatherings. The first floor also includes a half bath which is perfect for you and guest so that company does not have to use the main bathroom on the 2nd floor. Besides the main full bath, the 2nd level is comprised of 1 large bedroom and 2 regular sized bedrooms. A full open clean basement with cement walls, a newer water heater, laundry area w\/ additional refrigerator and freezer; and plenty of room for storage.\nUpgrades include:\nAll new window A\/C units in every room\nEntire house painted\nAll new ceiling fans and light fixtures in every room\nBrand-new refrigerator and oven\nTV Mount installed in living room (Fits 42\"-75\" TVs)\nRing security camera \/ flood light installed\nSchedule your showing today!\nTenant is responsible for all Utilities. Security deposit due before moving in and first months rent due the day the lease begins\n","num_images":15.0,"lat":39.921652,"lng":-75.173006,"attrs":"['3BR \/ 1.5Ba', '1116ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-23T12:08:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-package-room-central-location\/7613535257.html","post_id":7613535257,"title":"Package Room, Central Location, Ideal Location","description":"VIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nOur pet-friendly studio, one, two and three bedroom apartments in Exton deliver distinctive living in one of the area's most desired locations. The Point at Exton is the perfect community for your new home!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, ensuite bathrooms, walk-in closets, and a washer\/dryer!\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nApartment Features\n* Granite Countertops\n* Kitchen Island\n* Quartz Countertops\n* Washer and Dryer in unit\n* Stainless Steel Appliances\n* Wood-Like Floors\n* Garden Tub\n[#9659907]","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['2BR \/ 2Ba', '1248ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-23T12:14:42-0400"}]