[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/haverford-24-hour-house-room-airbnb\/7483845576.html","post_id":7483845576,"result_date":"2022-05-14 23:07","title":"24 Hour House\/Room AirBNB Setup & Management Company","description":"Do you have a home, an extra room or space and need to make some quick money?\nDon't have the time or knowledge on how to make thousands of dollars a month from it?\nWe find valued guests. We handle all issues with guests. We even have cleaning services to clean units between guests visits. WE HANDLE IT ALL. You just sit back and collect money!\nYou already have the space. Why not make it work for you. We are available 24\/7!!\nSIMPLE FEES\nOne Time Management Set-Up Fee $199\nBENEFITS\n24 Hour Response To Guests Concerns\nScreen Guests Including ID Requests\nBooking Management\nMoney Direct Deposited To You\nCleaning Services Available\nNo Hassle. No Worries. We handle IT ALL!\nIf you said YES to these questions email us your name, city, number and the best time to reach you and one of our property managers will contact you to see if your space qualifies.\n","num_images":3.0,"lat":40.0097,"lng":-75.3121,"attrs":"['1BR \/ 1Ba', 'apartment', 'no laundry on site', 'off-street parking']","posted_date":"2022-05-14T22:26:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-apartments\/7483838292.html","post_id":7483838292,"result_date":"2022-05-14 21:54","title":"Beautiful apartments 2 bedrooms- 1 bedroom spacious in philadelphia","description":"Beautiful apartments 2 bedrooms- 1 bedroom spacious in philadelphia . Enjoy our beautiful Affordable Family Community. Visit Butterfly Grove Apartments today for a personal tour and discover for yourself why we are one of Fresno's most desirable Affordable Family Butterfly Grove Apartments, one visit and you'll discover why so many people have chosen Butterfly Grove Apartments for their home. Newer high efficiency furnace. Washer\/dryer hookups. Cats and some small dogs allowed with prior approval only. Must show proof of income of $680 or more. Newer well pump. For all that sent an offer you will receive a phone call form listing agent or co-listing agent. Look no further! Grove Apartments, one visit and you'll discover why so many people have chosen Butterfly Grove Apartments for their home. Enjoy our beautiful Affordable Family Community. Visit Butterfly Grove Apartments today for a personal tour and discover for yourself. Each brand new apartment includes hardwood style flooring, granite countertops, stainless steel appliances, private bathrooms and much more! Sq. Ft. square foot home in a friendly community with stunning amenities. Move-in ready 2 bed and 1 bath units are available right now. A nice bright and sunny 1st floor with a picture window in the living room, sliders to the yard in the dining room. Hardwood floors throughout both 1st and 2nd levels. Kitchen has been renovated with granite counters and glass tile backsplash. Basement is partially finished with access to laundry facilities. Newer high efficiency furnace. Washer\/dryer hookups. For quick move in, Text here::zabrina53356 (at)_gmailcom","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'off-street parking']","posted_date":"2022-05-14T21:50:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/chadds-ford-windows-that-actually-open\/7483824630.html","post_id":7483824630,"result_date":"2022-05-14 20:57","title":"Windows that actually open with screens.","description":"Enjoy walking just a few blocks to PBR, restaurants, shops Swan Lake and Maymont Park. You will love living in this 2 bedroom 1 bath 2nd floor apt with a lot of natural light. Both bedrooms have closets and will fit queen size beds.\nIdeal for a roommate. Separate entrances with living space in the middle. No need to share a laundry unit when you here. Washer\/Dryer is in your apartment. Hardwood floors throughout with ceiling fans in each room, central air and heat.\n","num_images":0.0,"lat":39.8648,"lng":-75.5885,"attrs":"['3BR \/ 2Ba', '1800ft2', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-14T20:53:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-the-irvine-offers\/7483786609.html","post_id":7483786609,"result_date":"2022-05-14 20:32","title":"The Irvine offers creatively designed, innovative apartments for rent","description":"The Irvine offers creatively designed, innovative apartments for rent in West Philly. From studios to three bedrooms, each room features spacious layouts, sleek black fixtures, urban-design, and modern appliances and finishes. Residents can also enjoy private amenities such as an outdoor kitchen and lounge, multiple dog parks, a community garden, designated co-working spaces, and a fully-equipped fitness center. Located near Philly's lively Baltimore Avenue, the neighborhood also offers a plethora of local experiences ranging from coffee shops to co-ops to restaurants and more.","num_images":9.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', '430ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage']","posted_date":"2022-05-14T18:45:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-apartments\/7483811054.html","post_id":7483811054,"result_date":"2022-05-14 20:07","title":"Beautiful apartments 2 bedrooms- 1 bedroom spacious in Philadelphia.","description":"Beautiful apartments 2 bedrooms- 1 bedroom spacious in Philadelphia. Enjoy our beautiful Affordable Family Community. Visit Butterfly Grove Apartments today for a personal tour and discover for yourself why we are one of Fresno's most desirable Affordable Family Butterfly Grove Apartments, one visit and you'll discover why so many people have chosen Butterfly Grove Apartments for their home. Newer high efficiency furnace. Washer\/dryer hookups. Cats and some small dogs allowed with prior approval only. Must show proof of income of $680 or more. Newer well pump. For all that sent an offer you will receive a phone call form listing agent or co-listing agent. Look no further! Grove Apartments, one visit and you'll discover why so many people have chosen Butterfly Grove Apartments for their home. Enjoy our beautiful Affordable Family Community. Visit Butterfly Grove Apartments today for a personal tour and discover for yourself. Each brand new apartment includes hardwood style flooring, granite countertops, stainless steel appliances, private bathrooms and much more! Sq. Ft. square foot home in a friendly community with stunning amenities. Move-in ready 2 bed and 1 bath units are available right now. A nice bright and sunny 1st floor with a picture window in the living room, sliders to the yard in the dining room. Hardwood floors throughout both 1st and 2nd levels. Kitchen has been renovated with granite counters and glass tile backsplash. Basement is partially finished with access to laundry facilities. Newer high efficiency furnace. Washer\/dryer hookups. For quick move in, Text here::melissa772077 (at)_gmailcom","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry in bldg', 'off-street parking']","posted_date":"2022-05-14T20:03:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/royersford-rent-to-own-homes-starting\/7483806425.html","post_id":7483806425,"result_date":"2022-05-14 19:51","title":"Rent To Own Homes Starting at $2,000..","description":"❗️Why Buy Over Renting....❗️\nLet's be frank: Buying a home is no small expense. Not only are there recurring property taxes and insurance payments to make, but maintenance and upkeep gets expensive, fast.\nThere is huge benefits. Consider that someday, your house might be worth more than you paid for it, and you'll move on at a profit. You might also have a potential for future passive income, if that's the route you want to take. And paying off your home to live mortgage-free can set you up for a comfortable retirement.\nAnd then there's the emotional appeal of owning a home — the house is yours, and for some people, you can't put a price on that.\nBuying versus renting a home is a very individual decision.\nIf you want to Rent, Lease To Own, Sell or Buy I am the girl for you!! Let's talk!\n","num_images":1.0,"lat":40.2075,"lng":-75.5329,"attrs":"['3BR \/ 2Ba', 'available jun 14', 'house', 'w\/d in unit', 'attached garage', 'rent period: yearly']","posted_date":"2022-05-14T19:47:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-luxury-apartment-living\/7483803767.html","post_id":7483803767,"result_date":"2022-05-14 19:48","title":"****..New Luxury Apartment Living..****","description":"A stunning new luxury apartment community in a highly sought after location. Come and experience this community for yourself. We are ready to take you on a fabulous tour and help ensure you have a great place to call home at The Forge on Main. Washer\/Dryer included in every unit and valet \"to your door\" trash pick-up. Secure Building Entry.\nContact me or stop by today! We can be reached at mail : Michaelclark19972gmail.com\n24 hour fitness center access, Bike storage, Mail room, secure package delivery room Open work lounge.\n","num_images":4.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-14T19:39:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/glenside-rent-to-own-homes-starting-at\/7483805122.html","post_id":7483805122,"result_date":"2022-05-14 19:47","title":"Rent To Own Homes Starting at $2,000..","description":"❗️Why Buy Over Renting....❗️\nLet's be frank: Buying a home is no small expense. Not only are there recurring property taxes and insurance payments to make, but maintenance and upkeep gets expensive, fast.\nThere is huge benefits. Consider that someday, your house might be worth more than you paid for it, and you'll move on at a profit. You might also have a potential for future passive income, if that's the route you want to take. And paying off your home to live mortgage-free can set you up for a comfortable retirement.\nAnd then there's the emotional appeal of owning a home — the house is yours, and for some people, you can't put a price on that.\nBuying versus renting a home is a very individual decision.\nIf you want to Rent, Lease To Own, Sell or Buy I am the girl for you!! Let's talk!\n","num_images":1.0,"lat":40.1096,"lng":-75.155,"attrs":"['3BR \/ 2.5Ba', 'available jun 14', 'house', 'w\/d in unit', 'attached garage', 'rent period: yearly']","posted_date":"2022-05-14T19:43:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/trenton-looking-for-convenience-well\/7483803427.html","post_id":7483803427,"result_date":"2022-05-14 19:41","title":"Looking For Convenience? Well, Look No Further! Train Minutes Away!","description":"show contact info\np>Contact info:\nThe Crossings at Hamilton | Edgewood Properties |  show contact info\nTHE CROSSINGS AT HAMILTON STATION\n900 Grand Central Drive, Hamilton, NJ 08619\nshow contact info\nwww.apartmentsathamiltonstation.com\nDESCRIPTION\nThe Crossings at Hamilton Station, a pristine community located in the heart of Hamilton, will make you wish you never lived anywhere else but here! Our perfect location offers residents the ability to access a multitude of delicious restaurants, shopping centers, and endless entertainment. We are just steps away from the Hamilton Train Station, providing quick rail service to Philadelphia, New York, Princeton, and Trenton. Our brand new 1, 2, and 3 bedroom apartments and 3 bedroom, 2.5 bathroom townhomes are designed to complement your lifestyle featuring open floorplans, stainless steel appliances, granite countertops, and so much more. Schedule your tour today to see why everyone is falling in love with The Crossings.\nCommunity Perks and Top-of-the Line Amenities\n❇️ Luxurious Clubhouse and Concierge Service\n❇️ Large Resort-Style Swimming Pool and Grill Area\n❇️ 24\/7 Emergency Maintenance\n❇️ 24-hour Business Center\n❇️ 24-hour Fitness Center\n❇️ Brand New Playground\n❇️ Fenced-in Dog Park\n❇️ Continental Sunday Breakfast\nSleek and Modern Apartments and Townhouses\n❇️ Spacious, Open Floorplans\n❇️ Soaking Tubs\/Walk-in Showers\n❇️ Large Washer\/Dryer in the unit\n❇️ Granite Countertops\n❇️ Large Walk-in Closets\n","num_images":12.0,"lat":40.2418,"lng":-74.6962,"attrs":"['2BR \/ 2Ba', '1194ft2', 'available now', '\\nsunday 2022-05-15\\n', '\\nmonday 2022-05-16\\n', '\\ntuesday 2022-05-17\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-14T19:37:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-welcome-home-to-madison\/7483783222.html","post_id":7483783222,"result_date":"2022-05-14 19:02","title":"Welcome home to Madison Lansdale Station Apartments.","description":"Welcome home to Madison Lansdale Station Apartments. Brand new and joined with ground-level retail, our apartments in Lansdale, PA, are ready to become your urban nest of comfort and convenience. Pets allowed!\nFilled to the brim with modern touches and luxurious details, our community stands proudly right in the heart of Downtown Lansdale. You can balance work and play effortlessly and enjoy the convenience of living in a carefully crafted, vibrant, and creative space. Our studios, one, and two-bedrooms all feature an open-concept layout with tall ceilings, modern lighting, USB outlets, full-size washers & dryers, stainless steel appliances, and everything else needed for a stress-free living experience.\nOutside the comfort of our Lansdale apartments, you will find a well-equipped gym, billiards room with large TV, a clubhouse with a demo kitchen, and a private courtyard, all ready to entertain you and cater to your needs. Plus, with a host of boutiques, restaurants, and entertainment venues within walking distance from our community, dull moments will become a thing of the past as soon as you make Madison Lansdale Station Apartments your home.\nYou can also say goodbye to stressful commutes as we are STEPS away from SEPTA Regional Rail, which means you can reach Center City and top employers like Merck & CO. or Johnson & Johnson in no time. Not to mention that Montgomery Mall and the ever-evolving Main Street are just as close and ready to show you a good time. Find out more about our apartments for rent in Lansdale, PA, and email our team to set up a personal visit!\n","num_images":7.0,"lat":40.2378,"lng":-75.2955,"attrs":"['1BR \/ 1Ba', '725ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage']","posted_date":"2022-05-14T18:35:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-of-kind-condominium\/7483771780.html","post_id":7483771780,"result_date":"2022-05-14 18:45","title":"One of kind condominium residence at Cuthbert Lofts in the heart of O","description":"One of kind condominium residence at Cuthbert Lofts in the heart of Old City. Enter into this unique space and feel the charm and history of the city with exposed wood beams, exposed brick walls, and an open floor plan with abundant natural light; perfect for entertaining. Formerly two units that are now seamlessly combined into one, this layout offers 1,800 square feet of living space, allowing ample space for a generously furnished living room, dining space and home office. A decorator s dream with plenty of wall space to showcase art, photographs, and more. The gourmet kitchen features all stainless steel appliances, granite countertops, a breakfast bar with pendant lighting, and a large, walk-in pantry with rustic shelving. The master bedroom suite is huge with plenty of room to accommodate large furniture and features a beautiful exposed brick wall. Tons of closets, and separate laundry room, as well as a private full bathroom. 1 car deeded parking and 2 private storage units in the basement included. This elevator building offers a shared roof deck with 360-degree views of the city.","num_images":22.0,"lat":39.951292,"lng":-75.143476,"attrs":"['1BR \/ 1Ba', '1838ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage']","posted_date":"2022-05-14T18:03:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/pennsville-affordable-one-bedroom-one\/7483762502.html","post_id":7483762502,"result_date":"2022-05-14 18:19","title":"Affordable One bedroom \/ One bathroom home","description":"This adorable and affordable One bedroom \/ One bathroom home in Pennsville? Located within walking distance to Riverview Beach Park. Corner oversized lot with a fenced in yard and has a shed. Living room, Eating area, and Kitchen all have ample space for all your needs. Washer and Dryer is included. Brand new hot water heater as of September. Bathroom has a tub shower with new flooring and upgraded vanity.","num_images":10.0,"lat":39.6491,"lng":-75.5155,"attrs":"['1BR \/ 1Ba', '570ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-14T17:39:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-bed-bath-apartment\/7483775399.html","post_id":7483775399,"result_date":"2022-05-14 18:17","title":"Luxury 2 Bed \/ 2 Bath Apartment with Balcony in University City","description":"Available starting August\nLocated on a quiet block yet conveniently close to public transit and all the amenities of University City.\nAttention to detail and high quality finishes sets this unit apart from the rest and this unit it is newly constructed!\n2 bedroom 2 bath\nBalcony\nGated bike rack\nGated outdoor space\nPre-wired for Comcast or Verizon Fios in every room\nTenants responsible for gas & electric.\n409 N 41st Street, 2F, Philadelphia PA 19104\nLocated in West Powelton, University City. Close to Drexel University, University of Pennsylvania and University of the Sciences Campus.\nLicensed PA salesperson with ownership interest.\n","num_images":23.0,"lat":39.960212,"lng":-75.205323,"attrs":"['2BR \/ 2Ba', '1000ft2', 'available aug 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: yearly']","posted_date":"2022-05-14T18:13:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bed-bath-in\/7483762740.html","post_id":7483762740,"result_date":"2022-05-14 17:56","title":"Amazing 2 bed 1 bath in Philadelphia","description":"Available NOW\nPremium Top Floor (no units above) Pell Place Residence! Mint condition and quiet home features beautiful\/private easterly views, open floor plan with tile throughout the living area, in-unit washer and dryer, granite counters, Armstrong blinds, warm cabinetry and stainless appliances. From the family room you can walk out to your roomy balcony to catch a hawks nest view and welcome the fresh coastal air. Spacious master bedroom w\/ mirrored door walk-in closet. Newer AC system. One assigned underground parking space. Elevator. Amazing Location in the heart of Carmel Valley; walking distance to One Paseo, the Del Mar WaterYork, PA town Center featuring Sky Deck & many other amazing restaurants, as well as the tennis club. No pets. No smoking. contact : susandavis22444gmail.com","num_images":4.0,"lat":39.9523,"lng":-75.1638,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'wheelchair accessible']","posted_date":"2022-05-14T17:39:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom\/7483764058.html","post_id":7483764058,"result_date":"2022-05-14 17:47","title":"Renovated 1 bedroom available now at 4800 Brown st!","description":"Experience forward-thinking urban living.\n1, 2 & 3 bedroom luxury loft-style apartments located in an affordable up-and-coming district just north of University City make up this 34-unit complex. We offer thoughtful architecture and design creating a contemporary feel in an old factory setting. Elevator access, stainless steel appliances including a dishwasher and garbage disposal, a multi-camera security system, intercom system with remote door buzzer, on-site laundry, high ceilings, custom cabinetry with self-closing hardware, granite counters, kitchen pantry, exposed brick & concrete in many units, tile flooring, central heat & air, LED lighting, extra large commercial sized windows, large closets and large bright common hallways will be more than enough to make you want to come home!\nLive the uptown urban lifestyle you crave!\nAmenities:\n-Water $35.00 per month\n-Elevator\n-Assigned gated parking available for car and scooters ($150 per space, coming Summer 2021)\n-Multi-camera security system\n-Intercom system with electronic door opener\n-On-site laundry\n-Choice of Comcast or Verizon\n-Full-size stainless steel appliances\n-Bus line at corner\n-Garbage disposal\n-High ceilings\n-Large closets\n-Custom cabinetry with self closing cabinet doors & drawers\n-Sinks with magnetic retractable faucet hose\n-Granite counters\n-Pantries\n-Exposed ductwork, brick & concrete floors\/ceilings (in some units)\n-Central air and heat\nIn addition to monthly rent, tenant is responsible for their own electricity bill, a water fee of $35 & a liability insurance fee of $9.50\nCall Alena fro showing at  show contact info\nCity wide realty\n","num_images":13.0,"lat":39.966337,"lng":-75.216657,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: yearly']","posted_date":"2022-05-14T17:43:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-for-rent\/7483763402.html","post_id":7483763402,"result_date":"2022-05-14 17:45","title":"2 Bedroom apartment for rent","description":"6424 Ogontz Avenue 2nd Floor- This remarkable newly renovated apartment is located near Stenton and Ogontz Avenues, facing the Mount Airy Church of God. This unity is great for anyone that uses public transportation and wants to live in a quiet style apartment.  You will need one month security and one month payment to mov-in.  You pay gas and electric, owner pay water.  The bedrooms are in laminated floor, kitchen and bath in ceramic tiles. New kitchen countertop, new cabinets and ceiling fan.","num_images":3.0,"lat":40.052345,"lng":-75.15004,"attrs":"['2BR \/ 1Ba', '8400ft2', 'available may 16', 'condo', 'no laundry on site', 'off-street parking', 'rent period: yearly']","posted_date":"2022-05-14T17:41:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-premium-and-amazing\/7483573199.html","post_id":7483573199,"result_date":"2022-05-14 11:16","title":"Premium and amazing Apartments 2bed 2bath in PA.Butterfly Grove Apartm","description":"Available NOW\nshow contact info\nPremium 1st Floor (no units above) Pell Place Residence! Mint condition and quiet home features beautiful\/private easterly views, open floor plan with tile throughout the living area, in-unit washer and dryer, granite counters, Armstrong blinds, warm cabinetry and stainless appliances. From the family room you can walk out to your roomy balcony to catch a hawks nest view and welcome the fresh coastal air. Spacious master bedroom w\/ mirrored door walk-in closet. Newer AC system. One assigned underground parking space. Elevator. Amazing Location walking distance to One Paseo, tCenter featuring Sky Deck & many other amazing restaurants, as well as the tennis club.","num_images":10.0,"lat":40.0596,"lng":-75.0818,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-14T11:12:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-trinity-with\/7483572710.html","post_id":7483572710,"result_date":"2022-05-14 11:15","title":"this Trinity with beautiful original details","description":"Character and Charm are found throughout this Trinity with beautiful original details. Located on a small quiet, tree lined street, this property is just a short walk to Rittenhouse Square, Fitler Square, UPENN, CHOP and HUP. Enter the property through a gated brick hallway which provides access to the side entrance and backyard. Lovely original hardwood floors are found throughout, updated kitchen, living room with decorative fireplace and flat screen TV. The second floor features a nice sized bedroom with fabulous built-in closets, and a hall bath with radiant heated floors. The third floor features an additional bedroom with murphy bed, exposed brick, built-ins and sky light which provides plenty of sun light. The property includes a private back patio which is perfect for a morning cup of coffee or enjoying the weather. This property is truly a must see, tucked away on a cozy, quiet street, but conveniently located just one block from the Lombard Swim Club, City Fitness Gym and many other popular restaurants\/cafes. Property can be rented fully furnished (minus the bed in the second floor bedroom and tenants personal possessions). No pets.\nCentral Air Parking available  Hardwoodfloor\nContact Us For More Info","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', 'available jul 1', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T11:11:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-now-you-can-call-the\/7483572639.html","post_id":7483572639,"result_date":"2022-05-14 11:15","title":"Now you can call the hottest location in Northern Liberties home!","description":"Now you can call the hottest location in Northern Liberties home! This newer construction unit delivers everything you could ever want. Hardwood flooring throughout the open living and dining room space showcasing the modern kitchen, featuring stainless steel appliances, quartz counter-tops & pendant lighting. Off the kitchen is your own a private deck. The Master Bedroom is filled with natural light with floor to ceiling windows plush carpet and ceiling fan. The spacious second bedroom is also as luxurious with its carpeting, large windows, ceiling fan and plenty of closet space. Discover the full bathroom, with its designer tile flooring, modern vanity and large frameless glass enclosed shower. Washer and dryer included in the unit. Shared rooftop to enjoy the city views. This hot spot is just mere steps away from a variety of great restaurants, cafes and shopping\nCentral Air Parking available Stainless Steel Appliances Hardwoodfloor Pets Allowed Main Floor Laundry\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '7632ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T11:11:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-perfectly-situated-bedroom\/7483572576.html","post_id":7483572576,"result_date":"2022-05-14 11:15","title":"Perfectly situated 3 bedroom, 1 full bath, 2 half bath","description":"Perfectly situated 3 bedroom, 1 full bath, 2 half bath home with TWO CAR PARKING and a rear yard! The ideal location of being near Center City, Hawthrone Park, and surrounded by plenty of amazing restaurants, shops, and cafes!\nCentral Air Parking available Stainless Steel Appliances Hardwoodfloor Pets Allowed\nContact Us For More Info-","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1.5Ba', '1381ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T11:11:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-exceptional-bedroom-15\/7483572514.html","post_id":7483572514,"result_date":"2022-05-14 11:15","title":"Exceptional 1 bedroom, 1.5 bathroom home","description":"Exceptional 1 bedroom, 1.5 bathroom home in a coveted boutique condominium building in Rittenhouse Square. The living and dining areas offer high ceilings, gleaming hardwood floors and a wall of windows which flood your space with an abundance of natural light. The generous living and dining area provides plenty of room for a work-from-home area or additional entertaining space. The gourmet kitchen features sleek cabinetry complemented by stainless appliances, chrome fixtures, rich granite countertops, pantry closet and a large breakfast bar. Beyond the living area is a pristine powder room and convenient laundry area. The luxe primary bedroom suite is a retreat spacious enough for all of your furniture plus desk space, along with a wall of closets and a dramatic black marble, windowed, en suite bathroom with frameless glass shower. A gracious entry, beautiful hardwood floors, excellent closet\/storage space, and overhead lighting are just some of the special features. All this in a boutique condo building with a private courtyard and bike parking, mere steps from Rittenhouse Square. This is a truly central location with quick access to UPenn, Drexel, HUP and CHOP, 30th St Station, all major highways and public transportation. Rittenhouse Square is one of Philadelphia's most prized neighborhoods, featuring some of the city's best restaurants, shopping, nightlife, and recreation - you will love it here!\nCentral Air Parking available  Stainless Steel Appliances Hardwoodfloor Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1.5Ba', '889ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T11:11:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bedroom-unit-is\/7483572434.html","post_id":7483572434,"result_date":"2022-05-14 11:14","title":"This 1 bedroom unit is spacious and priced right!","description":"$500 SECURITY DEPOSIT!!! Urban charm and spacious floor plans! This 1 bedroom unit is spacious and priced right! Located just one block from scenic Washington Square Park, our properties along Spruce Street are the perfect place to call home. These affordably priced properties are located close to shopping, dining, and entertainment venues, as well as all forms of public transportation. Hardwood flooring Exposed brick walls Living room Master bath Some units with decorative fireplaces. Pictures are of the actual unit. Parking on-site available at 225.00 a month.\nCentral Air Laundry in Building Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '611ft2', 'available jul 22', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-05-14T11:10:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-with-private\/7483569503.html","post_id":7483569503,"result_date":"2022-05-14 11:08","title":"1 bed, 1 bath with PRIVATE backyard available in Washington Square","description":"1 bed, 1 bath with PRIVATE backyard available in Washington Square West. Available July 1. This unit has an open spacious design, hardwood floors, central air conditioning, and gas heat. The BRAND NEW kitchen features granite counters, breakfast bar, built in microwave, garbage disposal, new stainless steel refrigerator, new range\/oven. FREE USE OF SHARED LAUNDRY IN BASEMENT ONLY SHARED WITH 1 OTHER UNIT. Hot & cold water included in rent. Tenant pays gas & electric. NO dogs, cat OK. Walk everywhere to enjoy all the Center City offers, fine dining & entertainment, historic and cultural sites, museums, Avenue of the Arts. Just steps from Jefferson and Pennsylvania Hospitals, public transit, major highways & bridges, NJ PATCO High Speed Line. Easy commute to UPENN, Drexel U, HUP, CHOP. Two blocks to Broad Street Subway to T.U.. Requires first month rent, last month rent and security deposit up front at lease signing.\nCentral Air  Laundry in Building Parking available  Pets Allowed Hardwoodfloor Stainless Steel Appliances Granite counter tops\nContact Us For More Info","num_images":6.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '650ft2', 'available jul 1', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T11:04:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wow-and-wow-take-advantage\/7483569429.html","post_id":7483569429,"result_date":"2022-05-14 11:08","title":"Wow! and Wow! Take advantage of the past and the present","description":"Wow! and Wow! Take advantage of the past and the present in this quiet-streeted neighborhood cutie that is mere steps from everything the main drag of Fishtown has to offer! Cuddle up to coziness when you step into this sweet home that dates to 1894 but offers the most gorgeous, brand new kitchen. Imagine this charming home with wood floors throughout, as well as a lovely fireplace and bronze covered, original coal chute smack in the middle of your living room! There, you can relax in the charming room and take your meals on the living room side of the windowed kitchen, so that you can talk to the designated cook who is diligently cooking your meals in the beautifully modern kitchen. In case the weather cooperates, you can also take your meals in your very own enclosed patio, accessible through your kitchen. Upstairs, you have two roomy bedrooms, a hall closet and a good sized bathroom. Relax in the gorgeous claw-foot tun or take that quick shower in the the modern stall shower.\nLaundry in Building Parking available  Pets Allowed Hardwoodfloor Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', '960ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T11:04:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-dishwasher-refrigerator\/7483568590.html","post_id":7483568590,"result_date":"2022-05-14 11:06","title":"Dishwasher, Refrigerator, Microwave","description":"Bedrooms: 0Bathrooms: 1Square Feet: 397Date Available: 2022-05-14Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Bike StorageRecyclingWasher\/Dryer24\/7 Front Desk AttendantElectronic ThermostatLarge ClosetsOn-Site ManagementElevatorParking Garage (Additional Fees)RefrigeratorMicrowavePackage ReceivingCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/cxlnemmv\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '397ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-14T11:02:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-your-bedroom-is-very-well\/7483567964.html","post_id":7483567964,"result_date":"2022-05-14 11:05","title":"Your bedroom is VERY WELL proportioned with BIG closets","description":"1700 Walnut! Just off RITTENHOUSE SQUARE!!! Great space, and value! All open living and dining area. Kitchen with terrific counter and cabinet SPACE. Your bedroom is VERY WELL proportioned with BIG closets. All tile bath is gracious, and a washer\/dryer is in your apartment!!! AND A BRAND NEW GYM in the building!!! Enjoy living in this elevator\/doorman building, with a walking score of 110! And minutes from some of PHILADELPHIA'S best CAFE'S, dining and entertainment, plus University of Pennsylvania and DREXEL UNIVERSITY!!!\nCentral Air Main Floor Laundry  gym available Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '555ft2', 'available aug 8', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T11:01:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-old-city-bi-level\/7483567620.html","post_id":7483567620,"result_date":"2022-05-14 11:04","title":"Old City , Bi level Apartment with a full kitchen","description":"Old City , Bi level Apartment with a full kitchen , Open living room\/ dining\/kitchen with tile floor with a spiral staircase leading up to the spacious bedroom suite. Hardwood floors on second level, large closet and full bathroom with large shower. Includes private side yard. Ready for move in. Application available. $50 app fee. 3 months required (first, 2 months security deposit). Vacant and easy to show.\nCentral Air Main Floor Laundry Hardwoodfloor Pets Allowed Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T11:00:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rare-availability-on-this\/7483567390.html","post_id":7483567390,"result_date":"2022-05-14 11:04","title":"Rare availability on this beautiful boutique Wildey estate!","description":"Rare availability on this beautiful boutique Wildey estate! Specious 3 bed 2 bath with private rooftop with city skyline view! Perfect location to live! Block away from the subway and the Frankford corridor. Will be available on October 1st!(photos from another unit not the same layout. 2 of the bedrooms are in the basement level)\nCentral Air  Main Floor Laundry Parking available  Pets Allowed  Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2Ba', '1900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T11:00:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-mid-size-studio-available\/7483567056.html","post_id":7483567056,"result_date":"2022-05-14 11:04","title":"Mid-size Studio Available For June 1st!! Most Utilities Included!!","description":"Mid-sized studio apartment available for June 1st! Apartment features upgraded kitchen and bath. Floor plan 07 studio apartment. Apartment features large windows and 9 ft. ceilings. NO SECURITY DEPOSIT program!! Cats are welcome (add'l fee)! All apartments are rented unfurnished.\nChancellor Apartments is a convenient high rise apartment community in an amazing location in Center City. We are close to most major schools and universities, public transportation, historical attractions, shopping, restaurants and theaters. Center City at its best!!\nRent includes: heat, hot\/cold water, 24-hour front desk attendant, free bike storage room, package acceptance service, 24-hour emergency maintenance service, on-site smart card laundry plus card access system and BuildingLink resident services portal access for all residents.\nThe Chancellor boasts several different studio and one bedroom floor plans. Apartments feature high ceilings, large bright windows, ceiling fans in most units, hardwood floors and breathtaking views of the Philadelphia skyline and Delaware River. Many apartments have large walk-in closets, too!\nWe have partnered with Optimal Sport Health Club to offer a generous discounted gym membership (we pay your initiation fee!). There are several off street parking lots and garages in the area, too!\nCHANCELLOR APARTMENTS\n206 S. 13th Street\nPhiladelphia, PA 19107\nshow contact info\nFranceina Thorne, REALTOR\nHours:\nMon. - Fri. 8:30 to 5:00\nSaturday - 10:00 to 3:00\nAppointments are highly recommended\nProfessionally Managed by: Chancellor Properties, Inc.\nwww.cpihome.com\n\"CONSUMER NOTICE\"\nChancellor Properties, Inc. hereby states that with respect to this property, they are acting in the following capacity: an agent of the owner\/landlord pursuant to a property management or exclusive leasing agreement.\nEQUAL HOUSING OPPORTUNITY\n","num_images":9.0,"lat":39.948681,"lng":-75.162197,"attrs":"['0BR \/ 1Ba', '352ft2', 'available jun 1', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T11:00:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-the-becker\/7483566793.html","post_id":7483566793,"result_date":"2022-05-14 11:03","title":"Welcome to the Becker Building everything you're looking for","description":"Welcome to the Becker Building! Located near groceries, shopping, dining and public transit this building has everything you're looking for! Building amenities include a bi-level roof, 24- hour gym, free hot beverages and atm conveniently located in the lobby. Many floorplans available. Parking availability changes daily and requires additional fee- please inquire if interested in parking. $45 flat fee for sewer and water. Tenants also pay gas and electric. *Photos are of model unit in the building. * Any lease term less than 12 months will be subject to premium pricing.\nMain Floor Laundry Parking available  Pets Allowed Stainless Steel Appliances gym available\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '680ft2', 'available jun 13', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-14T10:59:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7483566304.html","post_id":7483566304,"result_date":"2022-05-14 11:02","title":"1 Bedroom Apartment","description":"1 Bedroom Apartment - Apt 3A\nCompletely New Construction\nNew Floors\nNew Kitchen\nNew Bathroom\nNew Appliances\nElevator in Building\nLaundry in Building\nClose to Schools, Hospital & Transportation\nNo Pets Allowed","num_images":6.0,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:58:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house\/7483563069.html","post_id":7483563069,"result_date":"2022-05-14 10:55","title":"3 Bedroom house","description":"LARGE 3 BEDROOM HOUSE\nWOOD FLOOR\nFRONT PORCH\nCLOSE TO SCHOOL\nCLOSE TO TRANSPORTATION\nLOCATION: 1721 BRIDGE ST 19124 (NORTHEAST)","num_images":7.0,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:51:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/haddonfield-efficiency-4brall-utilities\/7483538019.html","post_id":7483538019,"result_date":"2022-05-14 10:53","title":"Efficiency 4BR^All Utilities >< quiet well-Newer roof-A Lots of Space","description":"Extremely well maintained 2 family in a quiet well sought after neighborhood with plenty of off-street parking. Updated EVERYTHING - windows, kitchens, bathrooms, electric service, newer roof, HW heaters, brand new lower unit boiler and more! Each unit has 2 bedrooms and a full bath with classic hardwood flooring throughout. Move in Ready, well maintained 2-Bedroom 1st floor unit in a desirable neighborhood. Many recent upgrades and plenty of off street parking with nice fenced in yard to enjoy.\nIf you have any questions, please ask. Just email now : +++++   ananafrin574gmail.com","num_images":6.0,"lat":39.8954,"lng":-75.0417,"attrs":"['4BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-14T09:53:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house\/7483562233.html","post_id":7483562233,"result_date":"2022-05-14 10:53","title":"3 Bedroom house","description":"LARGE 3 BEDROOM HOUSE\nWOOD FLOOR\nFRONT PORCH\nCLOSE TO SCHOOL\nCLOSE TO TRANSPORTATION\nLOCATION: 1721 BRIDGE ST 19124 (NORTHEAST)","num_images":7.0,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:49:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-on-small-quiet\/7483557764.html","post_id":7483557764,"result_date":"2022-05-14 10:43","title":"Located on a small quiet, tree lined street","description":"Character and Charm are found throughout this Trinity with beautiful original details. Located on a small quiet, tree lined street, this property is just a short walk to Rittenhouse Square, Fitler Square, UPENN, CHOP and HUP. Enter the property through a gated brick hallway which provides access to the side entrance and backyard. Lovely original hardwood floors are found throughout, updated kitchen, living room with decorative fireplace and flat screen TV. The second floor features a nice sized bedroom with fabulous built-in closets, and a hall bath with radiant heated floors. The third floor features an additional bedroom with murphy bed, exposed brick, built-ins and sky light which provides plenty of sun light. The property includes a private back patio which is perfect for a morning cup of coffee or enjoying the weather. This property is truly a must see, tucked away on a cozy, quiet street, but conveniently located just one block from the Lombard Swim Club, City Fitness Gym and many other popular restaurants\/cafes. Property can be rented fully furnished (minus the bed in the second floor bedroom and tenants personal possessions). No pets.\nCentral Air Parking available  Hardwoodfloor\nContact Us For More Info","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', 'available jul 1', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T10:39:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-trinity-with\/7483557705.html","post_id":7483557705,"result_date":"2022-05-14 10:43","title":"this Trinity with beautiful original details","description":"Character and Charm are found throughout this Trinity with beautiful original details. Located on a small quiet, tree lined street, this property is just a short walk to Rittenhouse Square, Fitler Square, UPENN, CHOP and HUP. Enter the property through a gated brick hallway which provides access to the side entrance and backyard. Lovely original hardwood floors are found throughout, updated kitchen, living room with decorative fireplace and flat screen TV. The second floor features a nice sized bedroom with fabulous built-in closets, and a hall bath with radiant heated floors. The third floor features an additional bedroom with murphy bed, exposed brick, built-ins and sky light which provides plenty of sun light. The property includes a private back patio which is perfect for a morning cup of coffee or enjoying the weather. This property is truly a must see, tucked away on a cozy, quiet street, but conveniently located just one block from the Lombard Swim Club, City Fitness Gym and many other popular restaurants\/cafes. Property can be rented fully furnished (minus the bed in the second floor bedroom and tenants personal possessions). No pets.\nCentral Air Parking available  Hardwoodfloor\nContact Us For More Info","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', 'available jul 1', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T10:39:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-now-you-can-call-the\/7483557630.html","post_id":7483557630,"result_date":"2022-05-14 10:43","title":"Now you can call the hottest location in Northern Liberties home!","description":"Now you can call the hottest location in Northern Liberties home! This newer construction unit delivers everything you could ever want. Hardwood flooring throughout the open living and dining room space showcasing the modern kitchen, featuring stainless steel appliances, quartz counter-tops & pendant lighting. Off the kitchen is your own a private deck. The Master Bedroom is filled with natural light with floor to ceiling windows plush carpet and ceiling fan. The spacious second bedroom is also as luxurious with its carpeting, large windows, ceiling fan and plenty of closet space. Discover the full bathroom, with its designer tile flooring, modern vanity and large frameless glass enclosed shower. Washer and dryer included in the unit. Shared rooftop to enjoy the city views. This hot spot is just mere steps away from a variety of great restaurants, cafes and shopping\nCentral Air Parking available Stainless Steel Appliances Hardwoodfloor Pets Allowed Main Floor Laundry\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '7632ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T10:39:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-perfectly-situated-bedroom\/7483557561.html","post_id":7483557561,"result_date":"2022-05-14 10:43","title":"Perfectly situated 3 bedroom, 1 full bath, 2 half bath","description":"Perfectly situated 3 bedroom, 1 full bath, 2 half bath home with TWO CAR PARKING and a rear yard! The ideal location of being near Center City, Hawthrone Park, and surrounded by plenty of amazing restaurants, shops, and cafes!\nCentral Air Parking available Stainless Steel Appliances Hardwoodfloor Pets Allowed\nContact Us For More Info-","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1.5Ba', '1381ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T10:39:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-exceptional-bedroom-15\/7483557477.html","post_id":7483557477,"result_date":"2022-05-14 10:42","title":"Exceptional 1 bedroom, 1.5 bathroom home","description":"Exceptional 1 bedroom, 1.5 bathroom home in a coveted boutique condominium building in Rittenhouse Square. The living and dining areas offer high ceilings, gleaming hardwood floors and a wall of windows which flood your space with an abundance of natural light. The generous living and dining area provides plenty of room for a work-from-home area or additional entertaining space. The gourmet kitchen features sleek cabinetry complemented by stainless appliances, chrome fixtures, rich granite countertops, pantry closet and a large breakfast bar. Beyond the living area is a pristine powder room and convenient laundry area. The luxe primary bedroom suite is a retreat spacious enough for all of your furniture plus desk space, along with a wall of closets and a dramatic black marble, windowed, en suite bathroom with frameless glass shower. A gracious entry, beautiful hardwood floors, excellent closet\/storage space, and overhead lighting are just some of the special features. All this in a boutique condo building with a private courtyard and bike parking, mere steps from Rittenhouse Square. This is a truly central location with quick access to UPenn, Drexel, HUP and CHOP, 30th St Station, all major highways and public transportation. Rittenhouse Square is one of Philadelphia's most prized neighborhoods, featuring some of the city's best restaurants, shopping, nightlife, and recreation - you will love it here!\nCentral Air Parking available  Stainless Steel Appliances Hardwoodfloor Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1.5Ba', '889ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T10:38:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house\/7483556773.html","post_id":7483556773,"result_date":"2022-05-14 10:41","title":"3 Bedroom house","description":"LARGE 3 BEDROOM HOUSE\nWOOD FLOOR\nFRONT PORCH\nCLOSE TO SCHOOL\nCLOSE TO TRANSPORTATION\nLOCATION: 1721 BRIDGE ST 19124 (NORTHEAST)","num_images":7.0,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:37:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-pine-view-unit-3c\/7483554906.html","post_id":7483554906,"result_date":"2022-05-14 10:38","title":"Pine View Unit-3C","description":"345 S.13th Street Unit-3C is a 400 square foot furnished apartment available 6\/1\/22 for $1,190.00. It offers a newer kitchen with stainless steel appliances and granite counters. There is a washer dryer on the floor.  I can send a virtual tour to your cell phone,","num_images":9.0,"lat":39.945588,"lng":-75.162504,"attrs":"['0BR \/ 1Ba', '400ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: yearly']","posted_date":"2022-05-14T10:33:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7483545373.html","post_id":7483545373,"result_date":"2022-05-14 10:37","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #2\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":8.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:10:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-dog-and-cat-friendly\/7483555014.html","post_id":7483555014,"result_date":"2022-05-14 10:37","title":"Dog and Cat-Friendly 1157 SqFt 2 Bed \/ 2 Bath! Pets Welcome Here!","description":"The Glen at Lafayette Hill Visit our community today! 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nUnit Rates:  $2366 - $2454\/month Unit Type: 2-BR 2-BA Unit Size: 1157 sq ftLease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.What you’ll find in our community: ● 24 Hour Availability● Cardio Machines● Elevator● Furnished Units Available● Multi-Use Room● Online Services● Pet Friendly● Pet Play Area● Planned Social Activities● Recycling● BBQ Picnic Garden● Billiards, Club Lounge, Cafe Area, Library and Community Room● Fitness Center w\/ Free Weights, Weight Machines● Message Therapist Practice On-site● Outdoor Cafe & Coffee Bar● Outdoor Patio Lounge● Sprinkler System● Storage Space● Wi-Fi at ClubhouseDescription: Are you searching for the best apartments in Lafayette Hill? Look no further than The Glen Apartments. Take a tour of our property to see everything our pet-friendly Lafayette Hill apartments have to offer. Our professional staff is waiting to welcome you home to a care-free lifestyle. Please schedule a tour today and see what the best Lafayette Hill, PA apartments have for you.\n* We have Garages ( Approx. 19.5x9.5) available for $185.00 Monthly & Storage Lockers available for $40.00 Monthly ( Approx. 4x4x7) & $75.00 Monthly ( Approx. 4x8x7)This unit comes with: ● Air Conditioning & Heating● Carpet● Ceiling Fans (Select Floor Plans)● Dining Room● Heating● Range, Oven, Disposal, Oven● Refrigerator, Freezer and Ice Maker● Tub\/Shower● Wi-Fi● Window Coverings● Crown Molding (Select Floor Plans)● High Speed Internet Access● Linen Closet● Storage Units● Tile Floors● Trash Compactor● Vaulted Ceiling (Select Floor Plans)● Walk-In Closets (Select Floor Plans)● Washer\/Dryer● Wheelchair Accessible (Rooms)Call or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.comProperty Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":18.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-14T10:33:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7483547388.html","post_id":7483547388,"result_date":"2022-05-14 10:34","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3B\nDUPLEX\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":7.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:15:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7483545833.html","post_id":7483545833,"result_date":"2022-05-14 10:32","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #2\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":8.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:12:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bedroom-unit-is\/7483551973.html","post_id":7483551973,"result_date":"2022-05-14 10:30","title":"This 1 bedroom unit is spacious and priced right!","description":"$500 SECURITY DEPOSIT!!! Urban charm and spacious floor plans! This 1 bedroom unit is spacious and priced right! Located just one block from scenic Washington Square Park, our properties along Spruce Street are the perfect place to call home. These affordably priced properties are located close to shopping, dining, and entertainment venues, as well as all forms of public transportation. Hardwood flooring Exposed brick walls Living room Master bath Some units with decorative fireplaces. Pictures are of the actual unit. Parking on-site available at 225.00 a month.\nCentral Air Laundry in Building Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '611ft2', 'available jul 22', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-05-14T10:26:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-with-private\/7483551818.html","post_id":7483551818,"result_date":"2022-05-14 10:30","title":"1 bed, 1 bath with PRIVATE backyard available in Washington Square","description":"1 bed, 1 bath with PRIVATE backyard available in Washington Square West. Available July 1. This unit has an open spacious design, hardwood floors, central air conditioning, and gas heat. The BRAND NEW kitchen features granite counters, breakfast bar, built in microwave, garbage disposal, new stainless steel refrigerator, new range\/oven. FREE USE OF SHARED LAUNDRY IN BASEMENT ONLY SHARED WITH 1 OTHER UNIT. Hot & cold water included in rent. Tenant pays gas & electric. NO dogs, cat OK. Walk everywhere to enjoy all the Center City offers, fine dining & entertainment, historic and cultural sites, museums, Avenue of the Arts. Just steps from Jefferson and Pennsylvania Hospitals, public transit, major highways & bridges, NJ PATCO High Speed Line. Easy commute to UPENN, Drexel U, HUP, CHOP. Two blocks to Broad Street Subway to T.U.. Requires first month rent, last month rent and security deposit up front at lease signing.\nCentral Air  Laundry in Building Parking available  Pets Allowed Hardwoodfloor Stainless Steel Appliances Granite counter tops\nContact Us For More Info","num_images":6.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '650ft2', 'available jul 1', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T10:26:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wow-and-wow-take-advantage\/7483551751.html","post_id":7483551751,"result_date":"2022-05-14 10:30","title":"Wow! and Wow! Take advantage of the past and the present","description":"Wow! and Wow! Take advantage of the past and the present in this quiet-streeted neighborhood cutie that is mere steps from everything the main drag of Fishtown has to offer! Cuddle up to coziness when you step into this sweet home that dates to 1894 but offers the most gorgeous, brand new kitchen. Imagine this charming home with wood floors throughout, as well as a lovely fireplace and bronze covered, original coal chute smack in the middle of your living room! There, you can relax in the charming room and take your meals on the living room side of the windowed kitchen, so that you can talk to the designated cook who is diligently cooking your meals in the beautifully modern kitchen. In case the weather cooperates, you can also take your meals in your very own enclosed patio, accessible through your kitchen. Upstairs, you have two roomy bedrooms, a hall closet and a good sized bathroom. Relax in the gorgeous claw-foot tun or take that quick shower in the the modern stall shower.\nLaundry in Building Parking available  Pets Allowed Hardwoodfloor Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', '960ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T10:26:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7483546869.html","post_id":7483546869,"result_date":"2022-05-14 10:29","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3B\nDUPLEX\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":7.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:14:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-your-bedroom-is-very-well\/7483551498.html","post_id":7483551498,"result_date":"2022-05-14 10:29","title":"Your bedroom is VERY WELL proportioned with BIG closets","description":"1700 Walnut! Just off RITTENHOUSE SQUARE!!! Great space, and value! All open living and dining area. Kitchen with terrific counter and cabinet SPACE. Your bedroom is VERY WELL proportioned with BIG closets. All tile bath is gracious, and a washer\/dryer is in your apartment!!! AND A BRAND NEW GYM in the building!!! Enjoy living in this elevator\/doorman building, with a walking score of 110! And minutes from some of PHILADELPHIA'S best CAFE'S, dining and entertainment, plus University of Pennsylvania and DREXEL UNIVERSITY!!!\nCentral Air Main Floor Laundry  gym available Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '555ft2', 'available aug 8', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T10:25:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-old-city-bi-level\/7483551394.html","post_id":7483551394,"result_date":"2022-05-14 10:29","title":"Old City , Bi level Apartment with a full kitchen","description":"Old City , Bi level Apartment with a full kitchen , Open living room\/ dining\/kitchen with tile floor with a spiral staircase leading up to the spacious bedroom suite. Hardwood floors on second level, large closet and full bathroom with large shower. Includes private side yard. Ready for move in. Application available. $50 app fee. 3 months required (first, 2 months security deposit). Vacant and easy to show.\nCentral Air Main Floor Laundry Hardwoodfloor Pets Allowed Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T10:25:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7483548336.html","post_id":7483548336,"result_date":"2022-05-14 10:29","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3B\nDUPLEX\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":7.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:18:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7483546321.html","post_id":7483546321,"result_date":"2022-05-14 10:28","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #2\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH STREET 19121","num_images":8.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:13:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-full-1st-floor-1bd-prvt\/7483549133.html","post_id":7483549133,"result_date":"2022-05-14 10:24","title":"Full 1st floor 1BD w\/prvt YARD high ceil, good light,cent AC JULY 15","description":"JULY 15 move in special! Full floor 1st floor LG apt with Private Back Yard! Updated SS appliances, euro cabinets, Central AC! Just fully painted. NEW carpet and tub surround! 1132 Mt. Vernon Street is a renovated 3 story townhouse apartment building located on a charming residential street in the Spring Arts area of North Broad Philadelphia. This three-story boutique building only has 3 apartments and features a laundry room. All amenities are exclusive to 1132 Mt. Vernon Street residents. The building is on an architecturally stunning historic block with new construction on the corner and is conveniently located a a few blocks from Broad with Marc Vetri and Steven Star restaurants and NEW CVS, bank, Starbucks. This unique vintage building has all of the historic charm of a converted townhouse mansion, coupled with modern conveniences of brand NEW apartment kitchens.","num_images":16.0,"lat":39.963339,"lng":-75.157052,"attrs":"['1BR \/ 1Ba', '0900ft2', 'available jul 15', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-05-14T10:20:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rare-availability-on-this\/7483547473.html","post_id":7483547473,"result_date":"2022-05-14 10:20","title":"Rare availability on this beautiful boutique Wildey estate","description":"Rare availability on this beautiful boutique Wildey estate! Specious 3 bed 2 bath with private rooftop with city skyline view! Perfect location to live! Block away from the subway and the Frankford corridor. Will be available on October 1st!(photos from another unit not the same layout. 2 of the bedrooms are in the basement level)\nCentral Air  Main Floor Laundry Parking available  Pets Allowed  Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2Ba', '1900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T10:16:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-the-becker\/7483547391.html","post_id":7483547391,"result_date":"2022-05-14 10:19","title":"Welcome to the Becker Building everything you're looking for","description":"Welcome to the Becker Building! Located near groceries, shopping, dining and public transit this building has everything you're looking for! Building amenities include a bi-level roof, 24- hour gym, free hot beverages and atm conveniently located in the lobby. Many floorplans available. Parking availability changes daily and requires additional fee- please inquire if interested in parking. $45 flat fee for sewer and water. Tenants also pay gas and electric. *Photos are of model unit in the building. * Any lease term less than 12 months will be subject to premium pricing.\nMain Floor Laundry Parking available  Pets Allowed Stainless Steel Appliances gym available\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '680ft2', 'available jun 13', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-14T10:15:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-garden-style\/7483547384.html","post_id":7483547384,"result_date":"2022-05-14 10:19","title":"Large 1 Bedroom Garden Style Apartments","description":"Contact info:Property Manager | Greene Street Apartments |  show contact info\nGreene Street Apartments5926 Greene St, Philadelphia, PA 19144$1100\/mo KEY FEATURESBedrooms:  1 BedBathrooms:  1 BathParking:  4+ Off streetLaundry:  SharedProperty Type:  ApartmentRENTAL FEATURESLiving roomDining roomWalk-in closetRange \/ OvenRefrigeratorDishwasherGarbage disposalHeat: forced airAir conditioningCable-readyHigh-speed internetIntercom systemCOMMUNITY FEATURESNew propertyControlled accessDisability accessOff-street parkingContact info:  Property Manager:  Greene Street Apartments  show contact info\n","num_images":1.0,"lat":40.036068,"lng":-75.179662,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking']","posted_date":"2022-05-14T10:15:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7483543602.html","post_id":7483543602,"result_date":"2022-05-14 10:19","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH  STREET 19121","num_images":14.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:06:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-trinity-with\/7483545208.html","post_id":7483545208,"result_date":"2022-05-14 10:14","title":"this Trinity with beautiful original details","description":"Character and Charm are found throughout this Trinity with beautiful original details. Located on a small quiet, tree lined street, this property is just a short walk to Rittenhouse Square, Fitler Square, UPENN, CHOP and HUP. Enter the property through a gated brick hallway which provides access to the side entrance and backyard. Lovely original hardwood floors are found throughout, updated kitchen, living room with decorative fireplace and flat screen TV. The second floor features a nice sized bedroom with fabulous built-in closets, and a hall bath with radiant heated floors. The third floor features an additional bedroom with murphy bed, exposed brick, built-ins and sky light which provides plenty of sun light. The property includes a private back patio which is perfect for a morning cup of coffee or enjoying the weather. This property is truly a must see, tucked away on a cozy, quiet street, but conveniently located just one block from the Lombard Swim Club, City Fitness Gym and many other popular restaurants\/cafes. Property can be rented fully furnished (minus the bed in the second floor bedroom and tenants personal possessions). No pets.\nCentral Air Parking available  Hardwoodfloor\nContact Us For More Info","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', 'available jul 1', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T10:10:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-now-you-can-call-the\/7483545099.html","post_id":7483545099,"result_date":"2022-05-14 10:14","title":"Now you can call the hottest location in Northern Liberties home!","description":"Now you can call the hottest location in Northern Liberties home! This newer construction unit delivers everything you could ever want. Hardwood flooring throughout the open living and dining room space showcasing the modern kitchen, featuring stainless steel appliances, quartz counter-tops & pendant lighting. Off the kitchen is your own a private deck. The Master Bedroom is filled with natural light with floor to ceiling windows plush carpet and ceiling fan. The spacious second bedroom is also as luxurious with its carpeting, large windows, ceiling fan and plenty of closet space. Discover the full bathroom, with its designer tile flooring, modern vanity and large frameless glass enclosed shower. Washer and dryer included in the unit. Shared rooftop to enjoy the city views. This hot spot is just mere steps away from a variety of great restaurants, cafes and shopping\nCentral Air Parking available Stainless Steel Appliances Hardwoodfloor Pets Allowed Main Floor Laundry\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '7632ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T10:10:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-microwave-bike-storage\/7483545025.html","post_id":7483545025,"result_date":"2022-05-14 10:14","title":"Microwave, Bike Storage, Fitness Center w\/ Peloton Bikes","description":"Bedrooms: 0Bathrooms: 1Square Feet: 390Date Available: 2022-05-14Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:RefrigeratorHardwood FloorsFOB Controlled AccessRecyclingElectronic ThermostatWindow CoveringsMicrowavePackage ReceivingSmart Home FeaturesLarge ClosetsFitness Center w\/ Peloton BikesOn-Site ManagementCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/cvjmbylk\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '390ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-14T10:10:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7483540389.html","post_id":7483540389,"result_date":"2022-05-14 10:12","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH  STREET 19121","num_images":14.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T09:59:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-temple\/7483541314.html","post_id":7483541314,"result_date":"2022-05-14 10:12","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLOCATION: 2153 N. 19TH  STREET 19121","num_images":14.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T10:01:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-convenient-location-fitness\/7483544096.html","post_id":7483544096,"result_date":"2022-05-14 10:11","title":"Convenient Location, Fitness Center, Close to Shops and Dining","description":"The Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nThe Point at Pennbrook Station has all the modern amenities in a great location. You will enjoy complimentary coffee, WiFi, and printing services in our clubhouse. or you can use our social hub, complete with computers and individual or communal workspaces, to work on your passion project. We have everything you need! Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, walk-inc lost, laundry room with washer\/dryer, and a private porch!","num_images":12.0,"lat":40.226234,"lng":-75.283466,"attrs":"['1BR \/ 1Ba', '755ft2', 'available jul 13', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-14T10:07:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-studio-apartment\/7483530079.html","post_id":7483530079,"result_date":"2022-05-14 10:11","title":"Spacious Studio Apartment Home, City View, Wood Floors, Pets Welcome","description":"The studio apartment home at 2503 is available for lease at this moment! This home on the 25th floor features large windows that face east for morning sunshine and afternoon shade and have a city view! The renovated kitchen features a dishwasher, disposal, gas stove, and microwave. This home features wood floors. The Rittenhouse Claridge is located on Rittenhouse Square. Move into your new home as early as June 1, 2022!\nDue to planned renovations, please note that the stay in this particular home is from 2, 3, 4, and 5 months only, until October 31, 2022.\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to shopping and dining! The Rittenhouse Market, Target, and Trader Joe's are nearby. Retail stores on Rittenhouse Row include Barnes & Noble, Anthropologie, Lovesac, Athleta, lululemon, and Madewell. Local restaurants include Rouge, Devon, Parc, Barclay Prime, Gran Caffe L'Aquila, and Marathon Grill. Sip a coffee at La Colombe. Buy bread at Metropolitan Bakery. Savor a selection of macarons from Miel Patisserie.\nCommunity Amenities:\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* 8,000 square foot resident lounge with wifi\n* Top-of-the-line fitness center\n* Yoga\/Fitness studio\n* Sauna\n* Package lockers by Luxer One\n* Elevator building with 24\/7 doorman and concierge desk staff\n* Amazing roof deck with fantastic views\n* Laundry room on every floor\n* Larger laundry room on 3rd floor\n* Attached parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Studio apartment home on 25th floor\n* 475 square feet\n* City view\n* East-facing windows\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* White kitchen cabinets\n* Granite kitchen countertops\n* Wood floors\n* All utilities included (except cable and internet)\nWondering if this home is still available for lease? Visit our website at rittenhouseclaridge.com to see if 2503 is still listed under the Monet floor plan. Please make an appointment to tour with Resmate, our robot concierge on our website. Live virtual tours on FaceTime and in Zoom available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 5 month lease term.\n2, 3, 4, and 5 month lease terms on this particular home available!\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24.0,"lat":39.949803,"lng":-75.17056,"attrs":"['0BR \/ 1Ba', '475ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage']","posted_date":"2022-05-14T09:32:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-br-15-bath-duplex\/7483531674.html","post_id":7483531674,"result_date":"2022-05-14 10:04","title":"--Spacious 3 br, 1.5 bath duplex.  Apartment","description":"Spacious 3 br, 1.5 bath duplex. Applicant must have good credit, references and source of income\/ Two month sec and first month rent in advance. Townhouse style. W\/D hook-ups on main floor. Storage in basement.","num_images":6.0,"lat":39.954221,"lng":-75.170013,"attrs":"['3BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking']","posted_date":"2022-05-14T09:36:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-perfectly-situated-bedroom\/7483538157.html","post_id":7483538157,"result_date":"2022-05-14 09:57","title":"Perfectly situated 3 bedroom, 1 full bath, 2 half bath","description":"Perfectly situated 3 bedroom, 1 full bath, 2 half bath home with TWO CAR PARKING and a rear yard! The ideal location of being near Center City, Hawthrone Park, and surrounded by plenty of amazing restaurants, shops, and cafes!\nCentral Air Parking available Stainless Steel Appliances Hardwoodfloor Pets Allowed\nContact Us For More Info-","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1.5Ba', '1381ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T09:53:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-exceptional-bedroom-15\/7483538069.html","post_id":7483538069,"result_date":"2022-05-14 09:57","title":"Exceptional 1 bedroom, 1.5 bathroom home","description":"Exceptional 1 bedroom, 1.5 bathroom home in a coveted boutique condominium building in Rittenhouse Square. The living and dining areas offer high ceilings, gleaming hardwood floors and a wall of windows which flood your space with an abundance of natural light. The generous living and dining area provides plenty of room for a work-from-home area or additional entertaining space. The gourmet kitchen features sleek cabinetry complemented by stainless appliances, chrome fixtures, rich granite countertops, pantry closet and a large breakfast bar. Beyond the living area is a pristine powder room and convenient laundry area. The luxe primary bedroom suite is a retreat spacious enough for all of your furniture plus desk space, along with a wall of closets and a dramatic black marble, windowed, en suite bathroom with frameless glass shower. A gracious entry, beautiful hardwood floors, excellent closet\/storage space, and overhead lighting are just some of the special features. All this in a boutique condo building with a private courtyard and bike parking, mere steps from Rittenhouse Square. This is a truly central location with quick access to UPenn, Drexel, HUP and CHOP, 30th St Station, all major highways and public transportation. Rittenhouse Square is one of Philadelphia's most prized neighborhoods, featuring some of the city's best restaurants, shopping, nightlife, and recreation - you will love it here!\nCentral Air Parking available  Stainless Steel Appliances Hardwoodfloor Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1.5Ba', '889ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T09:53:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-townhouse-2bedroom1bedroom\/7483503842.html","post_id":7483503842,"result_date":"2022-05-14 09:57","title":"Townhouse 2bedroom+++1bedroom","description":"Gorgeous 2 bedroom\/1 bathroom upgraded apts in the heart of Roxborough. With central air conditioning. Application of 50 per adult Garage and Off street parking.\n-Rent - 1050\n-Security deposit-800\n-App fee -50\n","num_images":14.0,"lat":40.0402,"lng":-75.2231,"attrs":"['2BR \/ 1Ba', '750ft2', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-14T07:56:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bedroom-unit-is\/7483538011.html","post_id":7483538011,"result_date":"2022-05-14 09:57","title":"This 1 bedroom unit is spacious and priced right!","description":"$500 SECURITY DEPOSIT!!! Urban charm and spacious floor plans! This 1 bedroom unit is spacious and priced right! Located just one block from scenic Washington Square Park, our properties along Spruce Street are the perfect place to call home. These affordably priced properties are located close to shopping, dining, and entertainment venues, as well as all forms of public transportation. Hardwood flooring Exposed brick walls Living room Master bath Some units with decorative fireplaces. Pictures are of the actual unit. Parking on-site available at 225.00 a month.\nCentral Air Laundry in Building Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '611ft2', 'available jul 22', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-05-14T09:53:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-with-private\/7483537971.html","post_id":7483537971,"result_date":"2022-05-14 09:57","title":"1 bed, 1 bath with PRIVATE backyard available in Washington Square","description":"1 bed, 1 bath with PRIVATE backyard available in Washington Square West. Available July 1. This unit has an open spacious design, hardwood floors, central air conditioning, and gas heat. The BRAND NEW kitchen features granite counters, breakfast bar, built in microwave, garbage disposal, new stainless steel refrigerator, new range\/oven. FREE USE OF SHARED LAUNDRY IN BASEMENT ONLY SHARED WITH 1 OTHER UNIT. Hot & cold water included in rent. Tenant pays gas & electric. NO dogs, cat OK. Walk everywhere to enjoy all the Center City offers, fine dining & entertainment, historic and cultural sites, museums, Avenue of the Arts. Just steps from Jefferson and Pennsylvania Hospitals, public transit, major highways & bridges, NJ PATCO High Speed Line. Easy commute to UPENN, Drexel U, HUP, CHOP. Two blocks to Broad Street Subway to T.U.. Requires first month rent, last month rent and security deposit up front at lease signing.\nCentral Air  Laundry in Building Parking available  Pets Allowed Hardwoodfloor Stainless Steel Appliances Granite counter tops\nContact Us For More Info","num_images":6.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '650ft2', 'available jul 1', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T09:53:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wow-and-wow-take-advantage\/7483537900.html","post_id":7483537900,"result_date":"2022-05-14 09:57","title":"Wow! and Wow! Take advantage of the past and the present","description":"Wow! and Wow! Take advantage of the past and the present in this quiet-streeted neighborhood cutie that is mere steps from everything the main drag of Fishtown has to offer! Cuddle up to coziness when you step into this sweet home that dates to 1894 but offers the most gorgeous, brand new kitchen. Imagine this charming home with wood floors throughout, as well as a lovely fireplace and bronze covered, original coal chute smack in the middle of your living room! There, you can relax in the charming room and take your meals on the living room side of the windowed kitchen, so that you can talk to the designated cook who is diligently cooking your meals in the beautifully modern kitchen. In case the weather cooperates, you can also take your meals in your very own enclosed patio, accessible through your kitchen. Upstairs, you have two roomy bedrooms, a hall closet and a good sized bathroom. Relax in the gorgeous claw-foot tun or take that quick shower in the the modern stall shower.\nLaundry in Building Parking available  Pets Allowed Hardwoodfloor Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', '960ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T09:53:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-furnished-luxury-bedroom\/7483536353.html","post_id":7483536353,"result_date":"2022-05-14 09:53","title":"Furnished Luxury 1 Bedroom Apartment, Gym, Lounge, Near Restaurants","description":"Stay in a furnished luxury one bedroom one bathroom apartment home on the 11th floor in a building located on Rittenhouse Square! The renovated kitchen is fully-equipped with a gas stove, microwave, disposal, and dishwasher. Savor a cup of coffee, tea, or cocoa at the breakfast bar every morning. There is abundant closet space for plenty of storage. A must see, this home is beautiful with its wood floors and high-end furniture!\nThe Rittenhouse Claridge offers you the opportunity to stay in Philadelphia’s most vibrant, walkable neighborhood. So close to stores, restaurants, coffee shops, and bakeries! Target, Trader Joe's, Giant, Sue's Produce Market, Rittenhouse Market, Spruce Food Market, and Di Bruno Bros. are grocery stores within walking distance! Retail stores on Rittenhouse Row include Anthropologie, Barnes & Noble, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, Madewell, Shakespeare & Co., L'Occitane, Boyds, and Sephora. Nearby dining options include: Rouge, Devon Seafood Grill, Parc, Pietro's Coal Oven Pizzeria, Alice Pizza, and Marathon Grill. Sip a coffee at Ultimo, La Colombe, Elixr, and Gran Caffe L'Aquila. Pick up a French dessert at Miel Patisserie. Grab a scone at Metropolitan Bakery.\nCommunity Features:\n* 24\/7 8,000 square foot resident lounge with wifi\n* 24\/7 Top-of-the-line fitness center\n* Fitness\/Yoga studio\n* Sauna\n* Package room\n* Bike storage\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Elevator building with 24\/7 front door attendant and concierge desk staff\n* Amazing roof deck with fantastic views\n* Laundry room on every floor\n* Large laundry room on 3rd floor\n* Attached parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\n* Online resident portal for rent payments, maintenance requests, and more!\nApartment Home Features:\n* Oversized floor plan\n* Large closets\n* Wood floors\n* Breakfast bar\n* Renovated kitchen\n* White kitchen cabinets\n* Granite kitchen counters\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* All utilities included\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to find out! Please make an appointment to tour with Resmate, our robot concierge on our website. Live virtual tours on FaceTime and in Zoom available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24.0,"lat":39.949753,"lng":-75.170581,"attrs":"['1BR \/ 1Ba', '875ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage']","posted_date":"2022-05-14T09:49:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-your-bedroom-is-very-well\/7483533720.html","post_id":7483533720,"result_date":"2022-05-14 09:46","title":"Your bedroom is VERY WELL proportioned with BIG closets","description":"1700 Walnut! Just off RITTENHOUSE SQUARE!!! Great space, and value! All open living and dining area. Kitchen with terrific counter and cabinet SPACE. Your bedroom is VERY WELL proportioned with BIG closets. All tile bath is gracious, and a washer\/dryer is in your apartment!!! AND A BRAND NEW GYM in the building!!! Enjoy living in this elevator\/doorman building, with a walking score of 110! And minutes from some of PHILADELPHIA'S best CAFE'S, dining and entertainment, plus University of Pennsylvania and DREXEL UNIVERSITY!!!\nCentral Air Main Floor Laundry  gym available Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '555ft2', 'available aug 8', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T09:42:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-old-city-bi-level\/7483533650.html","post_id":7483533650,"result_date":"2022-05-14 09:46","title":"Old City , Bi level Apartment with a full kitchen","description":"Old City , Bi level Apartment with a full kitchen , Open living room\/ dining\/kitchen with tile floor with a spiral staircase leading up to the spacious bedroom suite. Hardwood floors on second level, large closet and full bathroom with large shower. Includes private side yard. Ready for move in. Application available. $50 app fee. 3 months required (first, 2 months security deposit). Vacant and easy to show.\nCentral Air Main Floor Laundry Hardwoodfloor Pets Allowed Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T09:42:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rare-availability-on-this\/7483533583.html","post_id":7483533583,"result_date":"2022-05-14 09:46","title":"Rare availability on this beautiful boutique Wildey estate!","description":"Rare availability on this beautiful boutique Wildey estate! Specious 3 bed 2 bath with private rooftop with city skyline view! Perfect location to live! Block away from the subway and the Frankford corridor. Will be available on October 1st!(photos from another unit not the same layout. 2 of the bedrooms are in the basement level)\nCentral Air  Main Floor Laundry Parking available  Pets Allowed  Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2Ba', '1900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T09:42:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-the-becker\/7483533536.html","post_id":7483533536,"result_date":"2022-05-14 09:45","title":"Welcome to the Becker Building everything you're looking for","description":"Welcome to the Becker Building! Located near groceries, shopping, dining and public transit this building has everything you're looking for! Building amenities include a bi-level roof, 24- hour gym, free hot beverages and atm conveniently located in the lobby. Many floorplans available. Parking availability changes daily and requires additional fee- please inquire if interested in parking. $45 flat fee for sewer and water. Tenants also pay gas and electric. *Photos are of model unit in the building. * Any lease term less than 12 months will be subject to premium pricing.\nMain Floor Laundry Parking available  Pets Allowed Stainless Steel Appliances gym available\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '680ft2', 'available jun 13', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T09:41:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-be-one-of-the-first-to\/7483533480.html","post_id":7483533480,"result_date":"2022-05-14 09:45","title":"Be one of the first to live here!","description":"Must-See New Construction! Be one of the first to live here! Unit 2 offers one bedroom plus a fully finished basement, which can be used as a den or a second bedroom, and 2 full baths. These spacious units with high ceilings offer tons of natural light and ample closet storage all throughout. This unit is just over 1000 sq feet and welcomes you into the combined living space and modern-design kitchen, which includes marble countertops, white cabinets, all stainless steel appliances, and plenty of pantry storage. Down the hall, you’ll find the first full bathroom with a large vanity sink and white-tiled bathtub. The first bedroom faces your private backyard space, offering lots of natural light and closet space. Downstairs, you’ll find the second full bathroom with a shower, as well as the in-unit washer and dryer. Whether you use the downstairs space for a second bedroom or another living space, you’ll have lots of natural light and storage. Your private backyard can serve as your own oasis from the hustle and bustle of the town, or as a hosting area. You can also enjoy the massive 1200+ sqft shared roof deck to take in beautiful city views. Don't miss out on this gorgeous new construction apartment in a prime location! This stunning newly-constructed apartment home is right in the heart of Philly’s hippest neighborhood of Fishtown. Only a block away from both Frankford and Girard Ave, this unbeatable location puts you within walking distance of public transport, vibrant nightlife locations, bars, restaurants, and galleries.\nCentral Air Parking available Pets Allowed Main Floor Laundry Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 2Ba', '1053ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T09:41:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7483532389.html","post_id":7483532389,"result_date":"2022-05-14 09:42","title":"Lease Today, Playground, Luxurious Bathrooms","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nSchedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nCommunity Features\n* Sun Deck\n* Bark Park\n* Easy Freeway Access\n* Fitness Studio\n* Swimming Pool\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* EV Charging\n* Gaming Area\n* Billiards\n* Playground\n[#9217390]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '833ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-14T09:38:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-designed-with-desirable-br\/7483516236.html","post_id":7483516236,"result_date":"2022-05-14 09:38","title":"Designed with desirable 2 BR Apartment!","description":"Designed with desirable 2 bedroom apartment an open concept living and kitchen area that includes a wrap-around kitchen with countertop seating and upgraded appliances. All the bedrooms can fit a full size bed and desk set up and has access to a full size bath This 2 bed 2 bath rental is available. Do not miss your chance to rent this unit, schedule a viewing today! Landlord pays all utilities. Off-street parking.\nMove In Fee (First, Security Deposit, Plus 500 Move in Fee.\n*Best food\n*Unique location\n*Free wifi\n*Close to everything\nLocation: 1705 Arlington St UNIT A, Philadelphia, PA 19121","num_images":1.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-14T08:47:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-be-one-of-the-first-to\/7483529976.html","post_id":7483529976,"result_date":"2022-05-14 09:35","title":"Be one of the first to live here!","description":"Must-See New Construction! Be one of the first to live here! Unit 2 offers one bedroom plus a fully finished basement, which can be used as a den or a second bedroom, and 2 full baths. These spacious units with high ceilings offer tons of natural light and ample closet storage all throughout. This unit is just over 1000 sq feet and welcomes you into the combined living space and modern-design kitchen, which includes marble countertops, white cabinets, all stainless steel appliances, and plenty of pantry storage. Down the hall, you’ll find the first full bathroom with a large vanity sink and white-tiled bathtub. The first bedroom faces your private backyard space, offering lots of natural light and closet space. Downstairs, you’ll find the second full bathroom with a shower, as well as the in-unit washer and dryer. Whether you use the downstairs space for a second bedroom or another living space, you’ll have lots of natural light and storage. Your private backyard can serve as your own oasis from the hustle and bustle of the town, or as a hosting area. You can also enjoy the massive 1200+ sqft shared roof deck to take in beautiful city views. Don't miss out on this gorgeous new construction apartment in a prime location! This stunning newly-constructed apartment home is right in the heart of Philly’s hippest neighborhood of Fishtown. Only a block away from both Frankford and Girard Ave, this unbeatable location puts you within walking distance of public transport, vibrant nightlife locations, bars, restaurants, and galleries.\nCentral Air Parking available Pets Allowed Main Floor Laundry Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 2Ba', '1053ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T09:31:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-updated-1bedroom\/7483529920.html","post_id":7483529920,"result_date":"2022-05-14 09:35","title":"Beautiful & Updated 1bedroom condo","description":"Beautiful & Updated 1bedroom condo situated in the heart of Art Museum\/Fairmount area. You'll love to live here! This spectacular picturesque, Art Museum area is close within proximity to everything, to include nice walking distance to Rittenhouse Square and all of Center City lifestyles! Walk Score is 91. Terrific layout. Enter this wonderful unit into the main living & Kitchen area boasting great size windows, and new flooring. The new kitchen has ample cabinetry, a stainless-steel gas range\/oven, microwave, refrigerator. The unit also offers a dishwasher. The recently updated bathroom is separate from the living area along a hall with ample storage space. The unit is equipped with a washer\/dryer. This home is warm, inviting, and a walkers paradise. Just outside the hustle and bustle of Center City, residents enjoy the privilege of being just blocks away from coffee shops, restaurants, parks, public transit, and more. Located across from the Art Museum and Fairmount Park, this beautiful pet-friendly condo is close to Kelly Drive, Boat House Row, Wholefoods Market, the Barnes Foundation, and great restaurants! 2601 Pennsylvania offers 24-hour concierge desk, a fitness center, a community center, restaurant on the ground floor and a free shuttle bus service making stops from the Schuylkill to the Delaware River. Please note there is a $400 move-in\/move-out fee, which is the tenant's responsibility.\nParking available Pets Allowed Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '591ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T09:31:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-property-is-perfect\/7483529859.html","post_id":7483529859,"result_date":"2022-05-14 09:35","title":"This property is perfect FOR RENt","description":"This property is perfect. Enter through the front door to a open floor plan with a gorgeous kitchen\/living room combination. The floating stairs lead to a two bedrooms on the second floor with a hall bathroom and the next level includes the main bedroom suite with a full bathroom. Continue to a rooftop deck with spectacular views of the entire city. The property includes a finished basement with a full bathroom. The basement would make an excellent office, den or even a fourth bedroom. Since this home was completed in 2020, it includes all the modern amenities that one would expect such as: central AC and new appliances. This property is in an excellent location for anyone working at Penn or Center City. This home is within walking distance of cafes, restaurants, entertainment and many other interesting activities. There is also easy access to all major highways so getting anywhere in the region is very easy. The landlord requires first, last and security to move into this extraordinary property. Property to be rented FURNISHED\/not negotiable at this time. Landlord will consider a shorter lease to the tenant who rents it furnished.\nCentral Air Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 3Ba', '1700ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-05-14T09:31:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-apartment-in\/7483529799.html","post_id":7483529799,"result_date":"2022-05-14 09:35","title":"Spacious 2 apartment in a landmark building","description":"$500 Security Deposit and 1st Month's Rent to move in!! Spacious 2 apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block off the Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of the actual unit! Washer\/Dryer in unit!\nCentral Air Main Floor Laundry Hardwoodfloors Gym Available Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '970ft2', 'available may 25', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T09:31:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-society-hill\/7483529765.html","post_id":7483529765,"result_date":"2022-05-14 09:35","title":"Welcome to Society Hill Towers!","description":"Welcome to Society Hill Towers! Located in the heart of Society Hill, this prized building provides easy access to Old City, Spruce Street Harbor Park, I-95 and more! This bright and charming apartment features hardwood floors throughout, a spacious bedroom with large closet and a full bathroom with new fixtures and amenities. The open living space offers large windows with lots of light and city views. The kitchen features stainless steel appliances and modern finishes. Fabulous restaurants are nearby with Zahav, Positano Coast and The Old Original Bookbinders within blocks. All utilities except cable\/internet are included. ONE PARKING SPACE INCLUDED! Pool and fitness center are available through Society Hill Towers with memberships at tenants' expense. There is shared laundry in the building. No pets allowed.\nCentral Air Laundry in Building Hardwoodfloors Stainless Steel Appliances Gym Available\nContact Us For More Info","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '699ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-05-14T09:31:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-one-bedroom\/7483528846.html","post_id":7483528846,"result_date":"2022-05-14 09:32","title":"Spacious One Bedroom Apartment Home on Rittenhouse Square, Gym, Lounge","description":"The home at 2109 is a 875 square foot Picasso one bedroom one bathroom apartment home on the 21st floor that features large windows that face south and have a view of Chancellor Street and in a building located on Rittenhouse Square! This renovated, fully-equipped kitchen features a gas stove, microwave, disposal, and dishwasher. The bathroom is renovated as well. This home features wood floors. There is abundant closet space for plenty of storage. Move into your new home as early as July 15, 2022!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to grocery stores, retail shops, coffee shops, restaurants, and entertainment venues! Target, Trader Joe's, Giant, Sue's Produce Market, Rittenhouse Market, Spruce Food Market, and Di Bruno Bros. are grocery stores within walking distance! Retail stores on Rittenhouse Row include Anthropologie, Barnes & Noble, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, Madewell, Boyds, Sephora, and Nordstrom Rack. Sip a cappuccino at Ultimo, La Colombe, Elixr, Miel Patisserie, and Gran Caffe L'Aquila. Nearby dining options include: Rouge, Parc, Pietro's Coal Oven Pizzeria, Devon Seafood Grill, a.bar, a.kitchen, Spice Finch, Via Locusta, The Love, Alice Pizza, and Marathon Grill.\nCommunity Features:\n* 24\/7 8,000 square foot resident lounge with wifi\n* Top-of-the-line fitness center with park view\n* Fitness\/Yoga studio\n* Sauna\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Package room\n* Bike storage\n* Elevator building with 24\/7 front door attendant and concierge desk staff\n* Amazing roof deck with fantastic views\n* Laundry room on every floor\n* Large laundry facility on 3rd floor\n* Attached parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\n* Online resident portal for rent payments, maintenance requests, and more!\nApartment Home Features:\n* Oversized floor plan\n* Large closets\n* Large windows\n* Wood floors\n* Renovated kitchen\n* White kitchen cabinets\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* All utilities included (except cable and internet)\nWondering if this home is still available for rent? Visit our website at rittenhouseclaridge.com to see if 2109 is still listed! Please make an appointment to tour using Resmate, our robot concierge on our website 24\/7. Live virtual tours on FaceTime and in Zoom available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nPrice posted is for the 22 month lease term.\n1-22 month lease terms available!\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24.0,"lat":39.949819,"lng":-75.170603,"attrs":"['1BR \/ 1Ba', '875ft2', 'available jul 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage']","posted_date":"2022-05-14T09:28:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-each-thoughtfully-designed\/7483526465.html","post_id":7483526465,"result_date":"2022-05-14 09:25","title":"Each thoughtfully designed unit includes kitchens","description":"Broadridge is an unrivaled community filled with sculptural, modern elements and endless amenities that deliver an unparalleled living experience. Each thoughtfully designed unit includes kitchens with custom-crafted cabinetry, bathrooms with novel design elements, and open floorplans for the modern connoisseur. Located in one of Philadelphia's most vibrant neighborhoods, Broadridge brings the best of an urban community together with a luxurious place to call home. Here, access to spaces designed for coworking, lounging, and fitness are complemented by unique features like a personal theater, expansive pool and deck, pet spa, and state-of-the-art demonstration kitchen. Steps outside Broadridge you'll find an energetic neighborhood that boasts diverse treasures like Umai Umai and La Calaca Feliz and local favorites like Fairmount Farmer's Market and Bad Brother. These reside in between rich cultural attractions like the Met and the Philadelphia Museum of Art. Unit Amenities include custom-crafted light-oak grain and navy cabinetry, Euro-styled stainless steel appliances, a dishwasher and microwave, nine-foot ceilings, sweeping city views in most residences, and your own washer and dryer. Building amenities include a lounge, coworking space, fitness center, screen room, pet spa, laundry room, demonstration kitchen, pool, deck and lounge, the West Roof Terrace, dog run, and East Terrace. **Parking Pricing: $175 unreserved $199 reserved ***Availability and Pricing is Subject to change ** **Photos are of model units\nCentral Air Main Floor Laundry Pets Allowed Parking available\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1173ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-14T09:21:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bedroom-bath-unit\/7483526411.html","post_id":7483526411,"result_date":"2022-05-14 09:24","title":"this 3 bedroom, 2 bath unit with BALCONY.","description":"Great space, light, and value in this 3 bedroom, 2 bath unit with BALCONY. First floor boasts kitchen with terrific cabinet and counter space, and all open living & dining area. Second floor consists of 3 very well proportioned bedrooms, and two full bathrooms. Enjoy living just t minutes from Jefferson University, Pennsylvania Hospital, Whole Foods Market, and Washington Square Park.\nCentral Air Stainless Steel Appliances Hardwoodfloors\nContact Us For More Info","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', '1200ft2', 'available jun 1', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-05-14T09:20:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-apartment-in-the\/7483526358.html","post_id":7483526358,"result_date":"2022-05-14 09:24","title":"Beautiful apartment in the highly sought-after Art Museum area.","description":"Beautiful apartment in the highly sought-after Art Museum area. Fantastic area with easy access to highways, grocery stores, public transportation, Kelly Drive, Philadelphia Museum of Art and countless bars restaurants, and shopping that line Fairmount Ave. A Gated community consisting of 12 buildings make this triangle complex known as The Point. High-end finishes and quality construction in a gated community.Gorgeous 3 bedroom 2 bathroom bi-level apartment with everything you could possibly want including central air and heat, stainless steel appliances including dishwasher, gas stove, microwave, refrigerator, and more. Front-loading washer and Dryer in unit!! Lovely hardwood floors throughout, tall ceilings, recessed lighting, good natural light, granite countertops with breakfast bar, and spacious outdoor space for entertaining.Apartment Features: Hardwood Floors Central air and heat Ceiling fans Gourmet kitchen with granite counters Stainless steel appliances including dishwasher Front loading washer and dryer Energy efficient double pained windows Secure entry Spacious rooms Great storage Double wide closets Bi-Level Layout 2 BathroomsThis is a must-see!\nCentral Air Parking available Granite counter tops Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2Ba', '1250ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T09:20:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-year-old-home-is\/7483526317.html","post_id":7483526317,"result_date":"2022-05-14 09:24","title":"This 3-year old home is brand new and updated","description":"Available May 1st. Schedule your showing today! This 3-year old home is brand new and updated and is looking for it's new tenants. Landlord is looking for first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord. There also is an application fee per applicant. Pets are conditional on owner's approval and may require an additional deposit, if accepted. ($500\/dog and $250\/cat). Tenants responsible for all utilities: water, gas, electricity, cable\/internet.","num_images":0.0,"lat":39.978,"lng":-75.1459,"attrs":"['3BR \/ 3Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T09:20:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-recently-updated\/7483526288.html","post_id":7483526288,"result_date":"2022-05-14 09:24","title":"2 bed 1 bath recently updated Duplex in the heart of the Graduate","description":"Available May 1st is a 2 bed 1 bath recently updated Duplex in the heart of the Graduate Hospital neighborhood. Unit 2 has its own private entrance. A quick walk up 1 flight takes you to an open layout Kitchen \/ Livingroom \/dining room. The unit offers 2 bedrooms with plenty of closet space in each bedroom. Washer and dryer inside the unit as well as a small deck off the master bedroom. The unit has been completely updated which includes newer kitchen as well as all new HVAC, windows, fresh paint to entire unit, flooring throughout, new deck. Duplex is very close to Restaurants ,shopping as well as public transpiration\nCentral Air Parking available Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T09:20:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-queen-king-sizable-864-sq\/7483522019.html","post_id":7483522019,"result_date":"2022-05-14 09:11","title":"Queen + king sizable 864 sq ft,1+bedrooms,1 full baths","description":"Look at this beauty! This wonderful two-bedroom home offers space, space and more space. The full bath has a jacuzzi style tub. Living room offers a decorative fireplace, wall to wall carpet and wood flooring throughout. Ceiling fans in most rooms. Kitchen offers ample cabinets with updated appliances, rustic tile floor, washer, and dryer. French doors leading to a large yard with a shed. Apply today!\nLarge lot of land.\nFeatures:\n• Hardwood floors\n• Dishwasher\n• Fenced yard\n• Fireplace\n• Dryer\n• Carpet\n• Ceiling fan\n","num_images":3.0,"lat":39.954994,"lng":-75.19713,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-05-14T09:07:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/havertown-this-wonderful-three-bedroom\/7483500173.html","post_id":7483500173,"result_date":"2022-05-14 08:45","title":"This wonderful three-bedroom home offers space","description":"Look at this beauty! This wonderful three-bedroom home offers space, space and more space. The full bath has a jacuzzi style tub. Living room offers a decorative fireplace, wall to wall carpet and wood flooring throughout. Ceiling fans in most rooms. Kitchen offers ample cabinets with updated appliances, rustic tile floor, washer, and dryer. French doors leading to a large yard with a shed. Apply today!\nLarge lot of land.\nFeatures:\n• Hardwood floors\n• Dishwasher\n• Fenced yard\n• Fireplace\n• Dryer\n• Carpet\n• Ceiling fan\nPlease feel free to contact our office at : show contact info","num_images":11.0,"lat":39.9774,"lng":-75.3106,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry in bldg', 'attached garage']","posted_date":"2022-05-14T07:35:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-beds-and-bath\/7483491803.html","post_id":7483491803,"result_date":"2022-05-14 07:00","title":"spacious 2 beds and 1 bath house for rent","description":"-2 beds, 1 bath\n-Fully finished basement with laundry room, w\/d included\n-Stainless Steel kitchen appliances, including over the range microwave and\ndishwasher.\n-Custom tile counter\n-Fenced in back yard with deck\n-Central heating and cooling\n-Large bedroom closets\n","num_images":5.0,"lat":39.936927,"lng":-75.189206,"attrs":"['2BR \/ 1Ba', '766ft2', 'air conditioning', 'application fee details: $50 per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-14T06:31:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-studio-available-now\/7483763060.html","post_id":7483763060,"result_date":"2022-05-14 17:44","title":"Cozy studio available now at 3412 Spring garden!","description":"Cozy studio available now in university city area. Walking distance to Drexel university. Laundry room in the building. Window air conditioning. Hardwood floors. Tenants will be responsible only for electric. Security deposit, first and last month to move in. $55 application fee.\nRental Terms\nRent: $890\nApplication Fee: $55\nSecurity Deposit: $890\nAvailable now\nPet Policy\nCats allowed\nDogs allowed\nCall Alena for showing at  show contact info\nAlena Skorynina\nCity wide realty\n","num_images":11.0,"lat":39.9597,"lng":-75.2024,"attrs":"['0BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: yearly']","posted_date":"2022-05-14T17:40:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-sunny-space-golf\/7483762498.html","post_id":7483762498,"result_date":"2022-05-14 17:43","title":"Bright Sunny Space, Golf Simulator, State of the Art Fitness Center","description":"Bedrooms: 0Bathrooms: 1Square Feet: 473Date Available: 2022-05-14Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.Call:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/gb22sgn6\/lincoln-square\n","num_images":1.0,"lat":39.9379,"lng":-75.1794,"attrs":"['0BR \/ 1Ba', '473ft2', 'available now', 'apartment', 'w\/d in unit', 'carport']","posted_date":"2022-05-14T17:39:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-house\/7483761929.html","post_id":7483761929,"result_date":"2022-05-14 17:42","title":"BEAUTIFUL HOUSE","description":"Beautiful 3Bedroon 1Bath House that's sitting on a very quiet Cul-De-Sec street in the Yorktown area of Philadelphia only minutes from Center City and Temple's main campus and the new and beautiful Met","num_images":15.0,"lat":39.9845,"lng":-75.2282,"attrs":"['3BR \/ 1Ba', '1228ft2', 'available now', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-14T17:38:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-in-the-heart-of\/7483731225.html","post_id":7483731225,"result_date":"2022-05-14 17:23","title":"Located in the heart of Center City, this 1 bedroom 1 bathroom condo o","description":"Located in the heart of Center City, this 1 bedroom 1 bathroom condo offers private, low maintenance living in a beautiful elevator building! Enter into a spacious and bright living area with hardwood flooring. The kitchen offers granite counter tops and plenty of storage, as well as a built in dishwasher! A quiet bedroom hosts generous closet space. Enjoy the convenience of an in-unit washer and dryer. Just around the corner is a large bathroom featuring a bathtub, vanity sink, and tons of bright lighting. To top it off, additional storage is located in the basement of the building. From the shared roof deck, you can see all that your new neighborhood has to offer. Only blocks from Rittenhouse Square and it's surrounding eateries like Parc, Marathon, and Rouge. You'll be steps away from all that the Center City shopping district has to offer, with easy access to all major forms of public transport, and a quick commute to University City.","num_images":16.0,"lat":39.946299,"lng":-75.173115,"attrs":"['1BR \/ 1Ba', '535ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-14T16:23:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-perfect-location-fenced-dog\/7483753477.html","post_id":7483753477,"result_date":"2022-05-14 17:20","title":"Perfect Location, Fenced Dog Park, Fitness Center","description":"Lease today at The Point at Plymouth Meeting in Norristown, PA. Our community has a resort-style swimming pool, an outdoor lounge, and a newly renovated clubhouse. Contact us for more information!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, entry closet, washer\/dryer, walk-in closet, and a private patio\/balcony!\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nCommunity Features\n* Non Smoking Community\n* Swimming Pool\n* Extra Storage\n* Professionally Managed\n* Liability Insurance is Required\n* E-Lounge\n* Community Kitchen\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Short or Long Term Lease Available\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Sun Deck\n* WiFi Access\n* Bark Park\n* Car Wash Area\n* Community Lounge\n* Renters Insurance is Required\n* After-Hours Emergency Maintenance\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access\n* Credit Cards Accepted\n* Package Acceptance\n* Outdoor Grill Area\n* Smoke Free Community\n* Bike Racks","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['1BR \/ 1Ba', '769ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking']","posted_date":"2022-05-14T17:16:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-lease-today-close-to-shops\/7483753098.html","post_id":7483753098,"result_date":"2022-05-14 17:19","title":"Lease Today, Close to Shops and Dining, Laundry in Unit","description":"VIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nThe Point at Plymouth Meeting offers open floor plans, clean white cabinetry, and sleek kitchens that immerse you in style, while sunny dining areas, wall-to-wall carpeting, and private patios will lull you into the easy life. Visit us today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, entry closet, washer\/dryer, walk-in closet, and a private patio\/balcony!\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nCommunity Features\n* Community Lounge\n* Renters Insurance is Required\n* Easy Freeway Access\n* Outdoor Grill Area\n* Package Acceptance\n* Bike Racks\n* Credit Cards Accepted\n* Smoke Free Community\n* Bark Park\n* Short or Long Term Lease Available\n* Non Smoking Community\n* Community Kitchen\n* Extra Storage\n* Car Wash Area\n* Sun Deck\n* Professionally Managed\n* Liability Insurance is Required\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Minutes from Restaurants, Shopping, and Much More\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Swimming Pool\n* WiFi Access\n* After-Hours Emergency Maintenance\n* E-Lounge","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['1BR \/ 1Ba', '769ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking']","posted_date":"2022-05-14T17:15:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this\/7483735620.html","post_id":7483735620,"result_date":"2022-05-14 17:02","title":"Welcome to this beautifully appointed corner 1BR\/1BA home, peacefully","description":"Welcome to this beautifully appointed corner 1BR\/1BA home, peacefully tucked away just off Rittenhouse Square. On Spruce and 18th you'll find this charming condominium, the perfect retreat from the hustle and bustle of the city. Take the glorious staircase or the elevator to the landing and enter through a gracious large custom door met with a fantastic and open handsomely finished living area. Off to the left is the chef's kitchen featuring a Subzero refrigerator, vented Viking stove, dishwasher, marble countertops, and ample pantry space, allowing you to comfortably prepare your favorite meals. The sun-splashed South-West facing wing boasts two windows, offering city views. A gas fireplace and a wall of custom built-ins perfectly round off the space creating an ideal setting to store and display your most cherished belongings. The large bedroom offers wonderful light and contains two large closets and an area for a small desk. The well-appointed bathroom contains a shower\/tub combination, linen closet, and rain shower. Additional features include 11’ ceilings, pre-war details throughout including tasteful moldings and oak floors. Not to be missed is the newly finished large deck that will bring the outdoors in. Last but not least, your very own washer\/dryer. The boutique building has bike storage and general storage. Located in the heart of the Rittenhouse Square, you are is just a stone's throw from local transportation, Supermarkets, Rittenhouse Sq Park, and fabulous neighborhood restaurants and amenities such as Parc, Metropolitan Bakery, and Trader Joes.","num_images":24.0,"lat":39.94763,"lng":-75.169998,"attrs":"['1BR \/ 1Ba', '574ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-14T16:33:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-condo-has-been\/7483728477.html","post_id":7483728477,"result_date":"2022-05-14 16:59","title":"This condo has been completely renovated top to bottom","description":"Mint condition deluxe one bedroom with complete Rittenhouse Park frontage. This condo has been completely renovated top to bottom. This is as turn key as it gets :) You're going to love this layout and how about 50 yard line positioning overlooking the Square from the 10th floor. Tree top views plus stunning skyline views. This unit is a treat. Beautifully located at the quiet, south side of Rittenhouse Square, the Rittenhouse Savoy offers glorious park-side living in Philadelphia's most sought-after neighborhood. The handsome 1950s building welcomes visitors with a midcentury modern lobby, and residents enjoy 24-hour desk services, a spectacular sun deck with panoramic views and fitness center. Short walk to UPENN, Drexel University, Chop, Jefferson Hospital, 30th Street Station, central business district, Kimmel Center, Schuylkill River Park, high-end retail and Philadelphia's best bars, cafes, and restaurants.","num_images":24.0,"lat":39.948561,"lng":-75.171185,"attrs":"['1BR \/ 1Ba', '825ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-14T16:16:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-simply-exquisite-this\/7483732562.html","post_id":7483732562,"result_date":"2022-05-14 16:57","title":"Simply exquisite. This incomparably elegant one-bedroom, one-bath Ritt","description":"Simply exquisite. This incomparably elegant one-bedroom, one-bath Rittenhouse gem shouldn't be missed. Located on the second floor of a boutique condo building in the heart of area restaurants, shops and amenities, this recently renovated home combines historic charm with modern amenities. Enter the double doors into a foyer with a decorative marble fireplace mantel from the late 1800's and be greeted by soaring coffered ceilings, inlaid floors, and an abundance of natural light. The galley kitchen with thoughtful counter nook opens to the living room\/dining room giving a lofty feel to this bright and airy home. Behind original pocket doors is the bedroom with an updated closet system for added storage. Off the bedroom, accessible through a historic \"Jefferson\" door, is a private balcony with gorgeous wrought iron railings and an unrivaled view of the city beyond. The new bathroom features stylish tile floors and a large vanity. This special home is a retreat in the middle of the city delightful in its splendor. There is additional storage in the basement of the building and washer\/dryers accessible to residents. Return to city life with this stunning home.","num_images":24.0,"lat":39.947422,"lng":-75.168313,"attrs":"['1BR \/ 1Ba', '592ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-14T16:26:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-wonderful-three\/7483716304.html","post_id":7483716304,"result_date":"2022-05-14 16:56","title":"This wonderful three-bedroom home offers space","description":"Look at this beauty! This wonderful three-bedroom home offers space, space and more space. The full bath has a jacuzzi style tub. Living room offers a decorative fireplace, wall to wall carpet and wood flooring throughout. Ceiling fans in most rooms. Kitchen offers ample cabinets with updated appliances, rustic tile floor, washer, and dryer. French doors leading to a large yard with a shed. Apply today!\nLarge lot of land.\nFeatures:\n• Hardwood floors\n• Dishwasher\n• Fenced yard\n• Fireplace\n• Dryer\n• Carpet\n• Ceiling fan\nPlease feel free to contact our office at :  show contact info","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'attached garage']","posted_date":"2022-05-14T15:51:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-beautiful-condo-has\/7483719660.html","post_id":7483719660,"result_date":"2022-05-14 16:55","title":"This beautiful condo has been completely updated with new hardwood fl","description":"Welcome to one of the nicest units in the building. This beautiful condo has been completely updated with new hardwood floors, recess lighting, custom closets, custom Kitchen, new bathroom and more. Enter into this 1 bedroom, 1 bath condominium featuring an open floor plan, very tasteful finishes, and an overflow of natural sunlight from the floor to ceiling bay windows in both the living room and the bedroom with endless city skyline views! The kitchen features ample cabinetry, granite countertops and new stainless steel appliances. The bedroom is large enough for a king bed, office space and more. Location and the building amenities are hard to beat. City Living at its best! Live in the heart of Rittenhouse Square in the recently updated, desirable Wanamaker House featuring a 24 hour door person, spectacular roof top pool, gym, lounge and conference room. Garage parking is an additional fee subject to availability.","num_images":24.0,"lat":39.950562,"lng":-75.174064,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-14T15:58:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-24-front-desk-attendant\/7483735655.html","post_id":7483735655,"result_date":"2022-05-14 16:37","title":"24\/7 Front Desk Attendant, Dishwasher, Window Coverings","description":"Bedrooms: 1Bathrooms: 1Square Feet: 798Date Available: 2022-05-14Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:24\/7 Front Desk AttendantPackage ReceivingOn-Site ManagementWindow CoveringsElectronic ThermostatRecyclingBike StorageRooftop DeckElevatorDishwasherRefrigeratorFitness Center w\/ Peloton BikesCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/kdj2so66\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '798ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-14T16:33:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-truly-deluxe-one-bedroom\/7483726656.html","post_id":7483726656,"result_date":"2022-05-14 16:32","title":"Truly a DELUXE one bedroom CORNER UNIT at The Dorchester,","description":"Truly a DELUXE one bedroom CORNER UNIT at The Dorchester, one of Philadelphia's Rittenhouse Square's most exclusive addresses. This gorgeous corner unit has been completely renovated with top of the line appliances and natural materials. A marble entry greets you as you enter the condo and come into a large open-concept living room with eat-in kitchen and spacious dining room. This unit is highly upgraded from the five-inch wide real wooden plank floors, to the beautiful multi-tiered crown molding through the space. The kitchen is a chef's dream with plentiful granite counter-tops, a large breakfast bar island with seating for three, a lux Sub-Zero refrigerator, quiet close Kraft-Made cabinets and drawers, under cabinet lighting and a Bosch dishwasher. The kitchen also has a 48 bottle GE Profile wine refrigerator and an ASKO combo washer and dryer! No trips to the basement necessary! High-end lighting including recessed lights over the kitchen island, and multi-track and movable art lighting placed thoughtfully throughout the living space. The dining area is front and center to amazing downtown Philadelphia views! A stunning marble and granite bath is truly a spa-like experience.","num_images":14.0,"lat":39.949539,"lng":-75.172934,"attrs":"['1BR \/ 1Ba', '848ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-14T16:12:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-perfect-bed-bath\/7483717513.html","post_id":7483717513,"result_date":"2022-05-14 16:18","title":"This perfect 1 bed, 1 bath luxury condominium at The Aldrich is brimmi","description":"Timeless treasure on 12th and Spruce. This perfect 1 bed, 1 bath luxury condominium at The Aldrich is brimming with daring detail from top to bottom. Step into an open, light-soaked living area with an original fireplace, hardwood floors and a stunning coffered ceiling complete with chandelier. The kitchen features custom cabinets, black granite countertops, a farmhouse sink, and stainless steel appliances, and adjacent to the dining area with a bay window. The bedroom is generous in size. The ensuite bathroom has undergone a stunning renovation with classic touches like bronze hardware, hexagonal tiles, floor to ceiling marble, and a large basin sink. Off the bedroom suite is an extensive private deck. The unit also possesses in-unit washer\/dryer and a large storage unit in the basement. Located in the heart of Washington Sq West, its prime location is steps from Antique Row, and dozens of dining, entertainment and shopping destinations.","num_images":12.0,"lat":39.946607,"lng":-75.161745,"attrs":"['1BR \/ 1Ba', '641ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-14T15:53:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bed-bath-in\/7483713477.html","post_id":7483713477,"result_date":"2022-05-14 16:11","title":"Amazing 2 bed 1 bath in Philadelphia, PA.","description":"Available NOW\nPremium Top Floor (no units above) Pell Place Residence! Mint condition and quiet home features beautiful\/private easterly views, open floor plan with tile throughout the living area, in-unit washer and dryer, granite counters, Armstrong blinds, warm cabinetry and stainless appliances. From the family room you can walk out to your roomy balcony to catch a hawks nest view and welcome the fresh coastal air. Spacious master bedroom w\/ mirrored door walk-in closet. Newer AC system. One assigned underground parking space. Elevator. Amazing Location in the heart of Carmel Valley; walking distance to One Paseo, the Del Mar WaterYork, PA town Center featuring Sky Deck & many other amazing restaurants, as well as the tennis club. No pets. No smoking. contact : elina00900𝐆𝐦𝐚𝐢𝐥com\n","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-14T15:44:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-of-rittenhouse-squares\/7483723727.html","post_id":7483723727,"result_date":"2022-05-14 16:10","title":"One of Rittenhouse Square's most charming 1 bedroom residences","description":"Where 17th Street meets Delancey. One of Rittenhouse Square's most charming 1 bedroom residences. A warm and wonderful condominium with loads of character and an ideal layout. Very high ceilings, original moldings, hardwood floors throughout. Lovely, move-in condition. Open stainless and granite kitchen with ceramic tile backsplash. Recessed lighting, New Washer and Dryer. Central AC. A well-managed, pet friendly, boutique 6 unit building. And the best location, less than 2 blocks off the square. 99 Walk Score. Parking available close by though you can walk everywhere--restaurants, supermarket, spectacular Rittenhouse Farmers' Market, coffee shops, tons of shopping, universities, hospital, and 30th Street Station. Great for biking and SEPTA as well. 99 WalkScore. 100 TransitScore. 93 BikeScore.","num_images":19.0,"lat":39.946993,"lng":-75.169745,"attrs":"['1BR \/ 1Ba', '535ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-05-14T16:06:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-dont-miss-this-move-in\/7483717753.html","post_id":7483717753,"result_date":"2022-05-14 16:04","title":"Don't miss this move in ready 2 Bedroom 1 Bath Home","description":"2 BR \/ 1 BA Fun Fan Living! Peaceful townhouse with off-street parking. Available now! - Renovated townhouse style apartment in the historic Fan District. Updated kitchen with granite counter tops and stainless steel appliances. Ceramic tiled bathroom. Hardwood flooring on the first floor areas. Bedrooms and full bath are located on the second level of the unit. Shared laundry in the basement area. Convenient to stores & restaurants. Two off-street parking spaces. Additional parking available at additional expense. Water, Sewer, and Trash included in rent! pets allowed. br>\nCALL ...::  show contact info\nWonderful quiet duplex near K College and parks, plus restaurants on West Main and downtown! Richmond a non-smoking property, enjoy quiet privacy in sunny south-facing one level duplex with lovely hardwood floors, a garage, a washer\/dryer (non coin and shared with one neighbor) and patio to private back yard. Plenty of space in the kitchen with dishwasher. Tenants responsible for their own snow removal, but nice to have that garage!. Water and trash are included, and tenant pays gas and electric and internet. Portable air conditioner included!! Butterfly Grove Apartments, one visit and you'll discover why so many people have chosen Butterfly Grove Apartments for their home. Enjoy our beautiful Affordable Family Community.  show contact info","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-14T15:54:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-perfect-location-direct-access\/7483720476.html","post_id":7483720476,"result_date":"2022-05-14 16:04","title":"Perfect Location, Direct Access Garages, Fitness Center","description":"The Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nYou will love living at The Point at Pennbrook Station. From our prime location in Lansdale, PA, you can easily travel to North Wales, Hatfield, Blue Bell, City Center Philadelphia, and the Philadelphia International Airport. Visit us today!\nThis first floor  two bedroom two bathroom apartment features a fully equipped kitchen with island, coat closet, walk-in closet sand  washer\/dryer.\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nApartment Features\n* Stainless Steel Appliances\n* Granite Countertops\n* Microwave\n* Dishwasher\n* Refrigerator\n* Wood-Like Floors\n* Full sized Washer and Dryer in unit\n* Central Heat and Air\n* Disposal\nCommunity Features\n* Sun Deck\n* Outdoor Grill Area\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Community Kitchen\n* After-Hours Emergency Maintenance\n* Easy Freeway Access\n* Easy Access to Public Transportation\n* Fitness Studio\n* Package Acceptance\n* WiFi Access\n* Minutes from Restaurants, Shopping, and Much More\n* Community Lounge\n* Garage Parking\n* Short Term Lease Available\n* Swimming Pool\n* Bark Park","num_images":11.0,"lat":40.226234,"lng":-75.283466,"attrs":"['2BR \/ 2Ba', '1206ft2', 'available aug 6', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-14T16:00:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-comfortable-living\/7483719692.html","post_id":7483719692,"result_date":"2022-05-14 16:02","title":"Comfortable living. Conveniently located, spacious 1 bed 1 bath! W\/D!","description":"Millview Apartments 100 Cobblestone Dr Coatesville, PA 19320  show contact info\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Rental Size:  1 BR - 1 BA - 845 sq ft  Per Month: $1581 - $2091  Lease Length: Variable  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Features and Amenities: ➢ Business Center➢ On-Site Leasing Office➢ Pet-Friendly➢ Private Garages In Select Units➢ 24-Hour Emergency Maintenance➢ Coffee Bar Clubhouse Kitchen➢ Resident Referral Bonuses. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . This Unit Comes With: ➢ Built-In Microwave➢ Central Heat & Air Conditioning➢ Disability Access In Select Units➢ Dishwasher➢ Full-Size Washer & Dryer In Every Apartment➢ Mini Blinds On All Windows➢ Refrigerator\/Freezer With Ice Maker➢ Walk-In Closets. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Call us for more information! --  show contact info\n-- Website: https:\/\/www.apartmentsincoatesvillepa.com\/Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  EQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-14T15:58:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-conveniently-located-2br\/7483717264.html","post_id":7483717264,"result_date":"2022-05-14 15:57","title":"Conveniently Located! 2br 2ba W\/A Wooded View! Schedule Your Tour Now!","description":"Community Location: 100 Cobblestone Dr - Coatesville, PA 19320 Rental Information: $1591 - $2198\/Month | 2 Bedroom 2 Bath | 1088 sq ftLeasing Options:  Variable show contact info\nApartment Amenities:  ● Built-In Microwave● Central Heat & Air Conditioning● Disability Access In Select Units● Dishwasher● Full-Size Washer & Dryer In Every Apartment● Mini Blinds On All Windows● Refrigerator\/Freezer With Ice Maker● Walk-In ClosetsProperty Features: ● Business Center● On-Site Leasing Office● Pet-Friendly● Private Garages In Select Units● 24-Hour Emergency Maintenance● Coffee Bar Clubhouse Kitchen● Resident Referral Bonuses Description: Complete with a soothing sauna, dry-cleaning pick-up and delivery, a resort style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Call: Millview Apartments at  show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-14T15:53:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-where-luxury-meets\/7483716518.html","post_id":7483716518,"result_date":"2022-05-14 15:55","title":"Where Luxury Meets Convenience!!","description":"Bedrooms: 1Bathrooms: 1Square Feet: 566Date Available: 2022-06-11Address: 1000 South Broad Street\nExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/5e3xys2o\/lincoln-square\n","num_images":1.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '566ft2', 'available jun 11', 'apartment', 'w\/d in unit', 'carport']","posted_date":"2022-05-14T15:51:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-2br-2ba-move-in-ready-d-in\/7483715249.html","post_id":7483715249,"result_date":"2022-05-14 15:52","title":"2br 2ba Move in Ready! W\/D In Unit! Handicap Accessible!","description":"Millview Apartments100 Cobblestone Dr Coatesville, PA 19320Pricing: $1584 - $2189\/Month*Bedrooms: 2  Bathrooms: 2 Square Footage: 1018 sq ft show contact info\nFeatures in this apartment home:✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In ClosetsAbout the community:  THE BEST APARTMENTS IN COATESVILLE, PA\nIf you're looking for the best apartments in Chester County, look no further than Millview Apartment Homes. Our world-class amenities, including a resort-worthy swimming pool, sauna, and clubhouse are better than any in the Coatesville area. Our professional leasing staff is eager to welcome you home to a carefree lifestyle. Please schedule a tour and come home to the best Coatesville, PA apartments. Amenities at our property:✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral BonusesAdditional information:Terms: VariablePets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Website: https:\/\/www.apartmentsincoatesvillepa.com\/Phone:  show contact info\nProfessionally managed by Paradise Management, LLC *Prices are subject to change without notice EQUAL HOUSING OPPORTUNITY7252BEBBC7094AC\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1018ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-14T15:48:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wifi-lounge-indoor-parking\/7483714906.html","post_id":7483714906,"result_date":"2022-05-14 15:52","title":"WIFI Lounge, Indoor Parking, Shopping Onsite, 24 HR Concierge","description":"Bedrooms: 0Bathrooms: 1Square Feet: 380Date Available: 2022-05-14Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.Call:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/zyhjwxw7\/lincoln-square\n","num_images":1.0,"lat":39.9379,"lng":-75.1794,"attrs":"['0BR \/ 1Ba', '380ft2', 'available now', 'apartment', 'w\/d in unit', 'carport']","posted_date":"2022-05-14T15:48:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-convenient-location-in\/7483714200.html","post_id":7483714200,"result_date":"2022-05-14 15:50","title":"Convenient location in Lafayette Hill - Come see our 2 Bed \/ 2 bath!","description":"The Glen at Lafayette Hill Bedroom: 2 | Bathroom: 2Square Footage: 1157 sq ftMonthly Rent: $2366 - $2454 show contact info\nCommunity Description  Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.    Community Amenities✓ Business Center✓ Conference Room✓ Elevator✓ Gated, Controlled Access✓ Multi-Use Room✓ Online Services✓ Pet Play Area✓ Planned Social Activities✓ Recycling✓ Renters Insurance Program✓ BBQ Picnic Garden✓ Billiards, Club Lounge, Cafe Area, Library and Community Room✓ Fitness Center w\/ Free Weights, Weight Machines✓ Message Therapist Practice On-site✓ Outdoor Cafe & Coffee Bar✓ Outdoor Patio Lounge✓ Sprinkler System✓ Storage Space✓ Wi-Fi at ClubhouseUnit Features✓ Cable Ready✓ Carpet✓ Ceiling Fans (Select Floor Plans)✓ Dining Room✓ Heating✓ Range, Oven, Disposal, Oven✓ Refrigerator, Freezer and Ice Maker✓ Tub\/Shower✓ Wi-Fi✓ Window Coverings✓ Dishwasher✓ High Speed Internet Access✓ Linen Closet✓ Microwave✓ Storage Units✓ Tile Floors✓ Vaulted Ceiling (Select Floor Plans)✓ Walk-In Closets (Select Floor Plans)✓ Washer\/Dryer✓ Wheelchair Accessible (Rooms)  Contact InformationVisit Us: 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.com   Additional DetailsPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthManagement Company: Paradise Management, LLC Price is subject to change without prior noticeAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":18.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-14T15:46:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/no-broker-fee-fully-remodel-bed2full\/7483712129.html","post_id":7483712129,"result_date":"2022-05-14 15:46","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-butterfly-grove-apartments\/7483711001.html","post_id":7483711001,"result_date":"2022-05-14 15:43","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-move-in-ready-rental-2bd\/7483672611.html","post_id":7483672611,"result_date":"2022-05-14 15:13","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-package-receiving-on-site\/7483694763.html","post_id":7483694763,"result_date":"2022-05-14 15:10","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/augusta-wonderful-spacious-bed-bath\/7483642329.html","post_id":7483642329,"result_date":"2022-05-14 14:56","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/augusta-head-to-our-website-for\/7483639159.html","post_id":7483639159,"result_date":"2022-05-14 14:53","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-love-this-building-love\/7483676643.html","post_id":7483676643,"result_date":"2022-05-14 14:35","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fob-controlled-access-on\/7483676434.html","post_id":7483676434,"result_date":"2022-05-14 14:35","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7483674997.html","post_id":7483674997,"result_date":"2022-05-14 14:32","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\n[#9217990]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-14T14:28:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-home-stunning\/7483668556.html","post_id":7483668556,"result_date":"2022-05-14 14:30","title":"Welcome Home! Stunning brick-front 4 bedroom, 2.5 bath house for rent","description":"Welcome Home! Stunning brick-front 4 bedroom, 2.5 bath twin in the popular Somerton neighborhood of Northeast Philly boasts brand new roof, replacement windows & blinds throughout, lush back yard with privacy fence, and spacious Trex deck with pergola! The large foyer has wide-plank tile flooring, custom front door, deep coat closet, and adorable nook for shoes & jackets. The sundrenched living room boasts Pergo floors, modern ceiling fan, tilt-in double-hung windows, and fresh paint! The fabulous remodeled kitchen is sure to impress with its white shaker cabinetry, soft-close dovetail drawers, quartz countertops, stainless steel appliances, gas stove, wine fridge, and massive quartz island with tumbled stone base . The expansive dining room features Pergo floors, recessed lighting, & oversized crank window. The open floor plan is perfect for entertaining! Even the powder room has been updated! The second level includes the master suite with full bathroom and ample double closets. Three additional bedrooms are spacious, with fresh paint, large closets, 8 ft ceilings, and share a large hall bathroom. But wait - the fully finished basement boasts an enormous family room with wall-to-wall carpet, recessed lighting, and French doors leading to the patio and your private backyard oasis, designed to maximize your time spent outdoors relaxing and enjoying the company of family and friends. Don't forget the separate laundry room with extra storage, as well as the 1-car garage & driveway parking! Minutes from 232, Byberry Rd, Philmont Ave, Bustleton Ave, Roosevelt Blvd, Fox Chase, & Philmont Country Club ! This incredible home won't last long - schedule your showing today!\nPlease call me to schedule a showing:☎️ show contact info","num_images":1.0,"lat":40.1166,"lng":-75.0198,"attrs":"['4BR \/ 3Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-05-14T14:16:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-1st-floor\/7483670204.html","post_id":7483670204,"result_date":"2022-05-14 14:27","title":"~!~ Newly renovated 1st-floor 2br\/2ba apartment stainless-appliance","description":"show contact info\nLuxurious 2 Bd\/2Ba Fully Remodeled apartment  overlooking La Costa Golf Course! - Available to view by appointment only,Amazing top floor, third story unit! Single level unit with elevator access and two balconies with beautiful panoramic views of the prestigious La Costa Golf Course! Enjoy dual master bedrooms with completely remodeled bathrooms. Master w\/sliding glass door overlooks front courtyard. 2nd bedroom w\/walk-in closet & sliding glass door that opens to balcony w\/beautiful views of the golf course. Enter through your private entry courtyard to the unit. Vaulted ceilings throughout, open floor plan and plenty of natural light! Exquisite state of the art new kitchen with beautiful black splash, cabinet\/drawers and new stainless steel appliances. Brand new everything...including windows, recessed lighting throughout and designer fixtures. Laundry closet w\/hook-ups inside the unit for stackable washer & dryer, or use buildings facilities conveniently located right next to the elevator access. Brand new vinyl plank designer \"wood\" flooring throughout the entire condo, no carpets! Property has complete new whole-house fan, A\/C and ceiling fans to keep you cool, and energy efficient forced air heat for cool days. Enjoy lower energy bills with new Title 24 lighting and appliances. You must see this home to fully appreciate it! Secured garage on the 1st level which also has a large, private storage cabinet. Two large assigned parking spaces. Rent includes: Water; Garbage, Laundry show contact info","num_images":8.0,"lat":39.9207,"lng":-75.1595,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-05-14T14:18:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-convenient-location-fitness\/7483671600.html","post_id":7483671600,"result_date":"2022-05-14 14:25","title":"Convenient Location, Fitness Center, Close to Shops and Dining","description":"Discover an easier, more fulfilling way of life at The Point at Plymouth Meeting. We have all the modern amenities in a great location close to some if the areas best dining, retail, and entertainment options. Call for a tour!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, walk-in closet, and a private patio\/balcony!\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['2BR \/ 2Ba', '1078ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking']","posted_date":"2022-05-14T14:21:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-large-bedroom-apartment\/7483670171.html","post_id":7483670171,"result_date":"2022-05-14 14:22","title":"Large 2 Bedroom Apartment","description":"Large 2 Bedroom Apartment. Please text me your phone number for quick response. Please text contact  show contact info\nNO SMOKING so skip me if you are a smoker! Living room and Bedroom have 12 foot ceilings with ceiling fans with lights. 5 Foot Walk in Closet with double hanging for bedroom. Kitchen has large NEW refrigerator and a gas stove. Back porch with entry to rear courtyard. It's all yours. I pay UGI gas heat, water, sewer, trash and recycling. You pay Electric and gas for the stove. Neighborhood has laundrymat across street. ( Mennonite owner) Close to CC Reading but close to highways. We have lots of closet and cabinet space in kitchen and porch. Our Neighbors are very helpful. On street permit parking . Security Deposit and first month required. Electric and gas for stove in your name before move in. Visit Butterfly Grove Apartments today for a personal tour and discover for yourself why we are one of New Haven's most desirable Affordable Family Communities. Grove Apartments, one visit and you'll discover why so many people have chosen Butterfly Grove Apartments for their home. Enjoy our beautiful Affordable Family Community. Visit Butterfly Grove Apartments today for a personal tour and discover for yourself. The Rocks is East Lansing's newest apartment community designed for Michigan State students. Each brand new apartment includes hardwood style flooring, granite countertops, stainless steel appliances, private bathrooms and much more! Sq. Ft. square foot home in a friendly community with stunning amenities. Move-in ready 2 bed and 2 bath units are available right now. A nice bright and sunny 1st floor with a picture window in the living room, sliders to the yard in the dining room. Hardwood floors throughout both 1st and 2nd levels. Kitchen has been renovated with granite counters and glass tile backsplash. Basement is partially finished with access to laundry facilities. Newer high efficiency furnace. Washer\/dryer hookups. Cats and some small dogs allowed with prior approval only.Butterfly Grove Apartments, one visit and you'll discover why so many people have chosen Butterfly Grove Apartments for their home. Enjoy our beautiful Affordable Family Community. Visit Butterfly Grove Apartments today for a personal tour and discover for yourself why we are one of New Jacksonville most desirable Affordable Family Communities. Please text me your phone number for quick response. Please text contact  show contact info","num_images":1.0,"lat":39.9375,"lng":-75.2637,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-14T14:18:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-incredible-amenities\/7483666267.html","post_id":7483666267,"result_date":"2022-05-14 14:15","title":"Incredible Amenities, Stylish Features, Lease Today","description":"Lease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nApartment Features\n* Granite Countertops\n* Wood-Like Floors\n* Extra Storage\n* Private Patio or Private Balcony (on select apartments)\n* Full sized Washer and Dryer in unit","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T14:11:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7483665866.html","post_id":7483665866,"result_date":"2022-05-14 14:14","title":"Schedule a Tour, Granite Countertops, Playground","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, entry closet, master suite, washer\/dryer, walk-in closets, and a patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Pet Salon\n* Billiards\n* Easy Freeway Access\n* Bark Park\n* Sun Deck\n* Minutes from Restaurants, Shopping, and Much More\n* EV Charging\n* Gaming Area\n* Playground\n* Swimming Pool\n* Fitness Studio","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['3BR \/ 2Ba', '1368ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-14T14:10:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-house-new\/7483639265.html","post_id":7483639265,"result_date":"2022-05-14 13:24","title":"Beautiful 3 Bedroom House, New","description":"Beautiful 3 bedroom, 2 bathroom house\n3 car parking\ndeck\nhardwood floors\nstainless steel kitchen\nlarge closets\nceiling fans\nCentral Air Conditioning\nmodern lighting\nwasher and dryer\ncats and small dogs ok\ndishwasher\n","num_images":10.0,"lat":39.914233,"lng":-75.171884,"attrs":"['3BR \/ 2Ba', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: yearly']","posted_date":"2022-05-14T13:20:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bedrooms-with\/7483618457.html","post_id":7483618457,"result_date":"2022-05-14 13:24","title":"**Gorgeous 2 Bedrooms with 1 full bathroom. Available for 7\/1 move in*","description":"Move into this gorgeous 2 Bedrooms with 1 full bathroom. Available for 7\/1 move in.\nThe apartment located in a quiet low traffic area with great neighbors, right next to a RAIL PARK for those nature lovers or joggers. The apartment is located within walking distance to both Thomas Jefferson Hospital, Fashion District Philadelphia, the Reading Terminal and many more city attractions! Just minutes from several forms of public transportation (Market Frankford Line, Broad Street Line, Septa bus)","num_images":8.0,"lat":39.957725,"lng":-75.155782,"attrs":"['2BR \/ 1Ba', '1025ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-14T12:42:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-on-site-management\/7483630232.html","post_id":7483630232,"result_date":"2022-05-14 13:08","title":"On-Site Management, Electronic Thermostat, Recycling","description":"Bedrooms: 1Bathrooms: 1Square Feet: 701Date Available: 2022-05-14Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Bike StorageParking Garage (Additional Fees)On-Site ManagementMicrowave24\/7 Front Desk AttendantHigh Speed InternetFOB Controlled AccessPackage ReceivingFitness Center w\/ Peloton BikesRooftop DeckWasher\/DryerRecyclingCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/dmaq3wwb\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '701ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-14T13:04:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-lease-today-close-to-shops-and\/7483614696.html","post_id":7483614696,"result_date":"2022-05-14 12:39","title":"Lease Today, Close to Shops and Dining, Pets Welcome","description":"Lease today at The Point at Pennbrook Station in Lansdale, PA. Come home to convenience. With a modern, open-plan kitchen and meticulous stainless steel appliances, making dinner is easier (and more exciting) than ever. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, walk-in closet, washer\/dryer,  and a private balcony!\nThe Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm\n[#9217670]","num_images":11.0,"lat":40.226234,"lng":-75.283466,"attrs":"['2BR \/ 2Ba', '1027ft2', 'available jul 23', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-14T12:35:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-salt-water-pool-with\/7483604032.html","post_id":7483604032,"result_date":"2022-05-14 12:19","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nYou will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Professionally Managed\n* Swimming Pool\n* Minutes from Restaurants, Shopping, and Much More\n* Bark Park\n* Pet Salon\n* Community Lounge\n* Putting Green\n* Fitness Studio\n* Sun Deck\n* Easy Freeway Access\n* TV Lounge\n* Yoga Lounge\n* Outdoor Grill Area\n* Bocce Ball\n[#9217784]","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T12:15:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-laundry-in-unit-lease\/7483603905.html","post_id":7483603905,"result_date":"2022-05-14 12:18","title":"Laundry in Unit, Lease Today, Convenient Location","description":"Looking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nCommunity Features\n* Outdoor Grill Area\n* Bark Park\n* TV Lounge\n* Swimming Pool\n* Bocce Ball\n* Putting Green\n* Community Lounge\n* Sun Deck\n* Minutes from Restaurants, Shopping, and Much More\n* Yoga Lounge\n* Pet Salon\n* Professionally Managed\n* Fitness Studio\n* Easy Freeway Access","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T12:14:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7483603696.html","post_id":7483603696,"result_date":"2022-05-14 12:18","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"Find yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two story two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, two patio\/balconies, and a loft with a closet upstairs!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nCommunity Features\n* Sun Deck\n* Minutes from Restaurants, Shopping, and Much More\n* Gaming Area\n* Pet Salon\n* Playground\n* Bark Park\n* Fitness Studio\n* Billiards\n* EV Charging\n* Easy Freeway Access\n* Swimming Pool\n[#9217814]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1376ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-14T12:14:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-microwave-high-speed\/7483602473.html","post_id":7483602473,"result_date":"2022-05-14 12:15","title":"Microwave, High Speed Internet, Recycling","description":"Bedrooms: 1Bathrooms: 1Square Feet: 701Date Available: 2022-05-14Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Package ReceivingBike StorageParking Garage (Additional Fees)Washer\/DryerHigh Speed Internet24\/7 Front Desk AttendantFitness Center w\/ Peloton BikesFOB Controlled AccessElectronic ThermostatWindow CoveringsRooftop DeckMicrowaveCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/vmlfapaz\/lvl-north\n","num_images":9.0,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '701ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-05-14T12:11:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7483600520.html","post_id":7483600520,"result_date":"2022-05-14 12:12","title":"1 Bedroom Apartment","description":"Apt 2\n1 BEDROOM APT\nWOOD FLOOR\nNEW KITCHEN\nNEW BATHROOM\nCLOSE TO SCHOOL CLOSE TO PARK\nLOCATION :5900 PINE ST 19143 (COBBS CREEK)","num_images":4.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T12:08:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7483599881.html","post_id":7483599881,"result_date":"2022-05-14 12:11","title":"1 Bedroom Apartment","description":"Apt 2\n1 BEDROOM APT\nWOOD FLOOR\nNEW KITCHEN\nNEW BATHROOM\nCLOSE TO SCHOOL CLOSE TO PARK\nLOCATION :5900 PINE ST 19143 (COBBS CREEK)","num_images":4.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T12:07:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7483599362.html","post_id":7483599362,"result_date":"2022-05-14 12:10","title":"1 Bedroom Apartment","description":"Apt 2\n1 BEDROOM APT\nWOOD FLOOR\nNEW KITCHEN\nNEW BATHROOM\nCLOSE TO SCHOOL CLOSE TO PARK\nLOCATION :5900 PINE ST 19143 (COBBS CREEK)","num_images":4.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T12:06:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7483599224.html","post_id":7483599224,"result_date":"2022-05-14 12:09","title":"Private Balcony, Quiet Community, Move In Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1363ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-05-14T12:05:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-higher-quality-of-living\/7483597415.html","post_id":7483597415,"result_date":"2022-05-14 12:06","title":"A Higher Quality of Living","description":"Chelsea floor plan — 847 sq. ft. — Starting Price $2,383 — Call to get on our waiting list!\nThis beautiful 1 bedroom\/1 bath apartment is spacious and comes with a breakfast bar area and plenty of counter space. It boasts hardwood LVT flooring and it comes with upgraded stainless steel the kitchen appliances, and a full size front loading washer and dryer. The living room area opens up to your own private balcony featuring stunning views of the Philadelphia skyline. The bedroom is also large with access the balcony, and has a large walk-in closet! The large bathroom features white subway tile. This apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":16.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '847ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-14T12:02:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-spacious-modern-living\/7483595595.html","post_id":7483595595,"result_date":"2022-05-14 12:03","title":"Spacious Modern Living","description":"Chelsea floor plan — 847 sq. ft. — Starting Price $2,383 — Call to get on our waiting list!\nThis beautiful 1 bedroom\/1 bath apartment is spacious and comes with a breakfast bar area and plenty of counter space. It boasts hardwood LVT flooring and it comes with upgraded stainless steel the kitchen appliances, and a full size front loading washer and dryer. The living room area opens up to your own private balcony featuring stunning views of the Philadelphia skyline. The bedroom is also large with access the balcony, and has a large walk-in closet! The large bathroom features white subway tile. This apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":16.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '847ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-05-14T11:59:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-with-private\/7483594133.html","post_id":7483594133,"result_date":"2022-05-14 12:00","title":"1 bed, 1 bath with PRIVATE backyard available in Washington Square","description":"1 bed, 1 bath with PRIVATE backyard available in Washington Square West. Available July 1. This unit has an open spacious design, hardwood floors, central air conditioning, and gas heat. The BRAND NEW kitchen features granite counters, breakfast bar, built in microwave, garbage disposal, new stainless steel refrigerator, new range\/oven. FREE USE OF SHARED LAUNDRY IN BASEMENT ONLY SHARED WITH 1 OTHER UNIT. Hot & cold water included in rent. Tenant pays gas & electric. NO dogs, cat OK. Walk everywhere to enjoy all the Center City offers, fine dining & entertainment, historic and cultural sites, museums, Avenue of the Arts. Just steps from Jefferson and Pennsylvania Hospitals, public transit, major highways & bridges, NJ PATCO High Speed Line. Easy commute to UPENN, Drexel U, HUP, CHOP. Two blocks to Broad Street Subway to T.U.. Requires first month rent, last month rent and security deposit up front at lease signing.\nCentral Air  Laundry in Building Parking available  Pets Allowed Hardwoodfloor Stainless Steel Appliances Granite counter tops\nContact Us For More Info","num_images":6.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '650ft2', 'available jul 1', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-05-14T11:56:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7483592557.html","post_id":7483592557,"result_date":"2022-05-14 11:56","title":"1 Bedroom Apartment","description":"1 Bedroom Apartment Apt. 2B\nCompletely New Construction\nNew Floors\nNew Kitchen\nNew Bathroom\nNew Appliances\nElevator in Building\nLaundry in Building\nClose to Schools, Hospital & Transportation\nNo Pets Allowed","num_images":6.0,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T11:52:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7483592044.html","post_id":7483592044,"result_date":"2022-05-14 11:55","title":"1 Bedroom Apartment","description":"1 Bedroom Apartment Apt. 2B\nCompletely New Construction\nNew Floors\nNew Kitchen\nNew Bathroom\nNew Appliances\nElevator in Building\nLaundry in Building\nClose to Schools, Hospital & Transportation\nNo Pets Allowed","num_images":6.0,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T11:51:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7483590944.html","post_id":7483590944,"result_date":"2022-05-14 11:53","title":"1 Bedroom Apartment","description":"1 Bedroom Apartment Apt. 2B\nCompletely New Construction\nNew Floors\nNew Kitchen\nNew Bathroom\nNew Appliances\nElevator in Building\nLaundry in Building\nClose to Schools, Hospital & Transportation\nNo Pets Allowed","num_images":6.0,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T11:49:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7483587332.html","post_id":7483587332,"result_date":"2022-05-14 11:45","title":"1 Bedroom Apartment","description":"1 Bedroom Apartment\nCompletely New Construction\nNew Floors\nNew Kitchen\nNew Bathroom\nNew Appliances\nElevator in Building\nLaundry in Building\nClose to Schools, Hospital & Transportation\nNo Pets Allowed","num_images":6.0,"lat":39.9811,"lng":-75.174,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T11:41:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7483586417.html","post_id":7483586417,"result_date":"2022-05-14 11:43","title":"1 Bedroom Apartment","description":"1 Bedroom Apartment\nCompletely New Construction\nNew Floors\nNew Kitchen\nNew Bathroom\nNew Appliances\nElevator in Building\nLaundry in Building\nClose to Schools, Hospital & Transportation\nNo Pets Allowed","num_images":6.0,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-05-14T11:39:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wow-and-wow-take-advantage\/7483578061.html","post_id":7483578061,"result_date":"2022-05-14 11:26","title":"Wow! and Wow! Take advantage of the past and the present","description":"Wow! and Wow! Take advantage of the past and the present in this quiet-streeted neighborhood cutie that is mere steps from everything the main drag of Fishtown has to offer! Cuddle up to coziness when you step into this sweet home that dates to 1894 but offers the most gorgeous, brand new kitchen. Imagine this charming home with wood floors throughout, as well as a lovely fireplace and bronze covered, original coal chute smack in the middle of your living room! There, you can relax in the charming room and take your meals on the living room side of the windowed kitchen, so that you can talk to the designated cook who is diligently cooking your meals in the beautifully modern kitchen. In case the weather cooperates, you can also take your meals in your very own enclosed patio, accessible through your kitchen. Upstairs, you have two roomy bedrooms, a hall closet and a good sized bathroom. Relax in the gorgeous claw-foot tun or take that quick shower in the the modern stall shower.\nLaundry in Building Parking available  Pets Allowed Hardwoodfloor Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', '960ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T11:22:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-your-bedroom-is-very-well\/7483577944.html","post_id":7483577944,"result_date":"2022-05-14 11:26","title":"Your bedroom is VERY WELL proportioned with BIG closets","description":"1700 Walnut! Just off RITTENHOUSE SQUARE!!! Great space, and value! All open living and dining area. Kitchen with terrific counter and cabinet SPACE. Your bedroom is VERY WELL proportioned with BIG closets. All tile bath is gracious, and a washer\/dryer is in your apartment!!! AND A BRAND NEW GYM in the building!!! Enjoy living in this elevator\/doorman building, with a walking score of 110! And minutes from some of PHILADELPHIA'S best CAFE'S, dining and entertainment, plus University of Pennsylvania and DREXEL UNIVERSITY!!!\nCentral Air Main Floor Laundry  gym available Pets Allowed\nContact Us For More Info","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '555ft2', 'available aug 8', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T11:22:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-old-city-bi-level\/7483577772.html","post_id":7483577772,"result_date":"2022-05-14 11:25","title":"Old City , Bi level Apartment with a full kitchen","description":"Old City , Bi level Apartment with a full kitchen , Open living room\/ dining\/kitchen with tile floor with a spiral staircase leading up to the spacious bedroom suite. Hardwood floors on second level, large closet and full bathroom with large shower. Includes private side yard. Ready for move in. Application available. $50 app fee. 3 months required (first, 2 months security deposit). Vacant and easy to show.\nCentral Air Main Floor Laundry Hardwoodfloor Pets Allowed Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-05-14T11:21:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rare-availability-on-this\/7483577706.html","post_id":7483577706,"result_date":"2022-05-14 11:25","title":"Rare availability on this beautiful boutique Wildey estate!","description":"Rare availability on this beautiful boutique Wildey estate! Specious 3 bed 2 bath with private rooftop with city skyline view! Perfect location to live! Block away from the subway and the Frankford corridor. Will be available on October 1st!(photos from another unit not the same layout. 2 of the bedrooms are in the basement level)\nCentral Air  Main Floor Laundry Parking available  Pets Allowed  Stainless Steel Appliances\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2Ba', '1900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-05-14T11:21:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-the-becker\/7483577598.html","post_id":7483577598,"result_date":"2022-05-14 11:25","title":"Welcome to the Becker Building everything you're looking for","description":"Welcome to the Becker Building! Located near groceries, shopping, dining and public transit this building has everything you're looking for! Building amenities include a bi-level roof, 24- hour gym, free hot beverages and atm conveniently located in the lobby. Many floorplans available. Parking availability changes daily and requires additional fee- please inquire if interested in parking. $45 flat fee for sewer and water. Tenants also pay gas and electric. *Photos are of model unit in the building. * Any lease term less than 12 months will be subject to premium pricing.\nMain Floor Laundry Parking available  Pets Allowed Stainless Steel Appliances gym available\nContact Us For More Info","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '680ft2', 'available jun 13', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-05-14T11:21:15-0400"}]