[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573934076.html","post_id":7573934076,"result_date":"Mon Jan 02 2023 02:25:28 GMT+0000 ","title":"Cozy 2 bedroom 2 bath apartment in Philadelphia, PA","description":"Cozy 2 bedroom 2 bath apartment in Philadelphia, PA. New paint and carpeting. New bathroom floor, sink vanity. and toilet. Washer\/dryer hook up in kitchen. Off street parking. Yard. Tenant required to maintain yard & snow removal with 2nd floor tenant. No pets\/animals. Rent $760 month. Includes water, sewer, and garbage. Heat is gas. Requires 1 month security + 1st month rent to move in. References. Background checks are conducted revealing history as well as prior evictions. Large eat in kitchen. bathroom. Wood floors (can select carpet instead if rented prior to Jan. 30 while property is being worked. Property being worked on but can still make appointments and will be ready for March 1st. Max two small dogs or two cats. Enjoy the deck overlooking the yard boasting a relaxing hot tub, too! Available Immediately.Se Renta Cuarto Grande con Propio Baño y Salida privada. Para hombre solo o Mujer sola. O pareja!! NO NIÑOS!!! Available Immediately.Se Renta Cuarto Grande con Propio Baño y Salida privada. Para hombre solo o Mujer sola. O pareja!! NO NIÑOS!!! Ser responsable con la renta y no tener visios! Tener trabajo y respetar la propiedad! Ask about our preferred employer program for several large employers like St Luke's Hospital, Burn's McDonald, KU Med Center, Children's Mercy Hospital, Research Hospital, Lockton, Black & Veach, UMKC, Hallmark, GM & More! Please text your mail address","num_images":3,"lat":40.0343,"lng":-75.1213,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-01T21:21:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573934038.html","post_id":7573934038,"result_date":"Mon Jan 02 2023 02:25:16 GMT+0000 ","title":"Beautiful 2 BR \/ 1 BA apartment in Philadelphia.","description":"Beautiful 2 BR \/ 1 BA apartment in Philadelphia. available Jan. 10 Large eat in kitchen. bathroom. Wood floors (can select carpet instead if rented prior to Jan. 10 while property is being worked. Property being worked on but can still make appointments and will be ready for Jan. 15. Max two small dogs or two cats. Income three times rent. $00 security. Fenced yard.This beautifully renovated whole house rental is close to all and ready for you to move right in! Featuring a sun drenched living area with soaring ceilings & skylights, Three bedroom, a Full bathroom, plus a great updated kitchen with stainless steel appliances and Quartz countertops! The basement offers a fantastic finished space with outside entrance. Enjoy the deck overlooking the yard boasting a relaxing hot tub, too! Available Immediately.Se Renta Cuarto Grande con Propio Baño y Salida privada. Para hombre solo o Mujer sola. O pareja!! * Beautifully Clean & Renovated House * Very Large 2 Bedroom, 2 Ensuite * Main Floor Has A Rare 1 Pc Bath * Walking Distance To Pacific Mall & Public Transit * Tenant Is Resposible For 60% Of Overall Utilities * Tenant Is Responsible For Snow Removal & Grass Cutting * No Pets & Non-Smoker Please * Text me number .","num_images":3,"lat":40.0343,"lng":-75.1213,"attrs":"['2BR \/ 1Ba', '1068ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T21:21:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573930288.html","post_id":7573930288,"result_date":"Mon Jan 02 2023 02:05:35 GMT+0000 ","title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nApartment Features\n* Private Patio or Private Balcony (on select apartments)\n* Stainless Steel Appliances\n* Kitchen Island\n* Garden Tub\n* Linen Closet\n* Walk-in Closet\n* Washer and Dryer in unit","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T21:01:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573930153.html","post_id":7573930153,"result_date":"Mon Jan 02 2023 02:05:01 GMT+0000 ","title":"Laundry in Unit, Central Location, Ideal Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1186ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T21:01:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573823239.html","post_id":7573823239,"result_date":"Sun Jan 01 2023 18:55:17 GMT+0000 ","title":"Apartment for Rent","description":"Amplious apartment for rent\n2nd floor\n","num_images":23,"lat":39.9579,"lng":-75.2681,"attrs":"['3BR \/ 1Ba', 'available now', 'apartment', 'no laundry on site', 'detached garage', 'rent period: monthly']","posted_date":"2023-01-01T13:51:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573791391.html","post_id":7573791391,"result_date":"Sun Jan 01 2023 18:45:57 GMT+0000 ","title":"BEAUTIFUL 2 BED \/ 2 BATH CONDO FLAT- READY NOW! THIS OPEN FLOOR PLAN!!","description":"**BEAUTIFUL 2 BED \/ 2 BATH CONDO FLAT- READY NOW! THIS OPEN FLOOR PLAN!!\nUpdated rental property in the sought after Summit House community - READY NOW! Beautiful 2 bedroom, 2 bath condo flat. This open floor plan features new floors through out, updated kitchen with stainless steel appliances and an oversized balcony access from the living room and the primary bedroom. This cozy and elegant condo was recently painted tastefully and has many upgrades such as recessed lighting , and new HVAC system ! The main floor laundry equipped with high efficiency washer and dryer is highly conveniently located beside the hallway full bathroom. The primary bedroom is spacious and features on-suite bathroom, access to the balcony and large closets. The secondary bedroom is also very spacious with oversized closet One year lease required, no smokers and Pets Yes. TV and some shelving to remain with lease. There is a full basement and owner has some furniture stored and covered with tarp in small portion . Tenant can use the rest of the area for tenants storage during lease.\n","num_images":5,"lat":39.964813,"lng":-75.537291,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'condo', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-01T11:59:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573820258.html","post_id":7573820258,"result_date":"Sun Jan 01 2023 18:44:31 GMT+0000 ","title":"Lease\/Rental Deals in University City - Schedule a showing today!","description":"Coming in early February is this stunning remodeled 1 bedroom 1 bath apartment!\nWell maintained clean apartment featuring a modern kitchen with stainless steel appliances. Nearby Upenn and Drexel Campuses.\nSchedule your showing today before this one is gone! Call or Text Ken  show contact info\nApplication\/credit check fee $55\nIf you are looking for apartments \/ homes to lease elsewhere in the Philadelphia area, please feel free to contact me to find the right home for you. Student housing also available (need to be co-signed by parent or guardian).","num_images":6,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'available feb 1', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-01-01T13:40:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573812934.html","post_id":7573812934,"result_date":"Sun Jan 01 2023 18:42:51 GMT+0000 ","title":"Legal one bedroom apartment","description":"Yes, a legal one bedroom, just steps to the amazing location in Philadelphia ! Quality of this home, with it's open great room, large, comfortable Master Suite, separate Den\/Office, spacious, family room with direct access to a patio\/deck with crystal clear hot tub! Large upper deck for those warm summer evening dinners, and a yard that is so easy to maintain. Full house generator for no winter or storm concerns! Can accommodate all your family and entertaining needs in one of Harwich's finest neighborhoods!","num_images":5,"lat":44.1589,"lng":-75.7099,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-01T13:14:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573810696.html","post_id":7573810696,"result_date":"Sun Jan 01 2023 18:11:24 GMT+0000 ","title":"Large Apartments near your favorite destinations in Northern Liberties","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Stunning Apartments in Northern Liberties 1 Brown will check off everything on your list of must-haves with stunning luxury apartments in the neighborhood of Northern Liberties. Take a look at the variety of floor plans and choose the perfect spot for your lifestyle. No matter which residence you choose, your home will boast a spacious layout with classic, sophisticated interior finishes.A variety of relaxing amenities await you, including a rooftop with scenic waterfront views and, a fitness center, and a heated resort style pool. Conveniently located in the heart of the Northern Liberties neighborhood of Philadelphia, you’ll be surrounded by historical sites as well as a wealth of restaurants, entertainment options, and shopping. Call Now:  show contact info\nx 157OR Text 157 to  show contact info\nto text us.Follow The Link Below:https:\/\/archcompanies.aptglance.com\/50481aThis is a 3 Bedroom, 2 Bath, Approximately 1439 Sq. Ft.Features - Stainless Steel Appliances  - Nest Thermostats  - Gourmet Eat-In Kitchens with Cherry Wood Cupboards  - 9 Ft Ceilings  - Largest Apartments in the Area  - Spa Shower System & Jacuzzi Tub  - Floor to Ceiling Windows  - Quartz Counter Tops  - Full Size Washer\/Dryer in unit  - Generous Closet Space  - Large Bathrooms Community Amenities - Amazing Views and Rooftop Lounge  - Spectacular Resort Style Pool Area  - Fully Outfitted Fitness Center  - Rooftop Walking Track & Dining Areas  - 24-Hour Concierge Service  - Dry Cleaning Service  - Spacious Highrise Living Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMResidences at One Brown 1 Brown Street, Philadelphia, PA, 19123 Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! L0L16roVrmre\n","num_images":16,"lat":39.962145,"lng":-75.137734,"attrs":"['3BR \/ 2Ba', '1439ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-01T13:07:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573804175.html","post_id":7573804175,"result_date":"Sun Jan 01 2023 18:10:55 GMT+0000 ","title":"* Tenant Is Resposible For 60% Of Overall Utilities * Philadelphia","description":"Nice 3 bedroom 2 bath apartment with sharp interior finishes and amenities, and many useful features and spaces. Our remodeled one bedroom floor plans are comfortable and carefully tuned to fit any lifestyle. Text me:::  show contact info\n. Our residents can take advantage of our wealth of onsite amenities, including our Resident Lounge, Fitness Center, Swimming Pool, and Grilling Spaces. Washer and Dryer hookups. 1st and last month rent as security deposit, no pets allowed. You can enjoy the community amenities like the rooftop patio overlooking the Plaza, 24-hour Precor equipped fitness center, and community lounge. Philadelphia, Luxury living and stunning views await you when you call . Fenced yard. This beautifully renovated whole house rental is close to all and ready for you to move right in! Featuring a sun drenched living area with soaring ceilings & skylights, Three bedroom, a Full bathroom, plus a great updated kitchen with stainless steel appliances and Quartz countertops! The basement offers a fantastic finished space with outside entrance. Enjoy the deck overlooking the yard boasting a relaxing hot tub, too! Available Immediately. Se Rental .* Beautifully Clean & Renovated House * Very Large 2 Bedroom, 2 Ensuite * Main Floor Has A Rare 1 Pc Bath * * Tenant Is Responsible For 60% Of Overall Utilities * Tenant Is Responsible For Snow Removal & Grass Cutting * Please * Text me:::  show contact info","num_images":4,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-01T12:44:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573793195.html","post_id":7573793195,"result_date":"Sun Jan 01 2023 17:52:56 GMT+0000 ","title":"NICE SECOND FLOOR LARGE 1 BED \/ 1 BATH APT IN DOWNTOWN WEST CHESTER!","description":"**NICE SECOND FLOOR LARGE 1 BED \/ 1 BATH APT IN DOWNTOWN WEST CHESTER!\nNice second floor large one bedroom apartment in downtown West Chester. New paint and all new flooring. Nice size living room (20x10). Separate dining area (12x7). Bedroom (14x10). Den or home office (10x9). walk to restaurants, night spots and bus station. One block to Justice Center and parking garage. This is not a student rental.\n","num_images":4,"lat":39.95909,"lng":-75.605791,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-01T12:05:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573785988.html","post_id":7573785988,"result_date":"Sun Jan 01 2023 17:51:24 GMT+0000 ","title":"🔥Johnstown Rent to Own Home For Sale🔥","description":"🔥Johnstown Rent to Own Home For Sale🔥\n125 Scheidinger St, Johnstown, PA 15906\nPoor Credit\/No Credit Doesn't Matter\nDown-payment & proof of income is your qualification to homeownership\n$3,999 down\n$739\/ mo for 30yrs\nCall\/text Mike at  show contact info\nfor more info, pics, or to schedule viewing\n3B\/1B\n1,286 sqft\nOff-Street Garage\nLot size: .30 Acres\nTaxes: $895\/yr\nThis 3 bedroom, 1 bath home also has a nice size backyard and deck to enjoy.   A little TLC and updating could make this home truly shine. The original house is the basement area which still has finished off space and it's own entrance as well.  Make your appointment today for your personal tour.\nWe cannot confirm the condition of the home, please do your own inspection\nClean title\nTaxes up to date\nLike my FB page here for other properties when I get more https:\/\/www.facebook.com\/pasellerfinancehomes & see more here https:\/\/5minvestments.managebuilding.com\/Resident\/public\/home\n","num_images":3,"lat":40.3522,"lng":-78.9383,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2023-01-01T11:39:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573784915.html","post_id":7573784915,"result_date":"Sun Jan 01 2023 16:39:05 GMT+0000 ","title":"Schedule a tour of your new waterfront home! Free Month! A Must See.","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card!  Welcome to Residences at One BrownCall Now -  show contact info\nx 156OR Text 156 to  show contact info\nto text our team directly.This is a 2 Bedroom, 2 Bath, Approximately 1262 Sq. Ft. 1 Brown will check off everything on your list of must-haves with stunning luxury apartments in the neighborhood of Northern Liberties. Take a look at the variety of floor plans and choose the perfect spot for your lifestyle. No matter which residence you choose, your home will boast a spacious layout with classic, sophisticated interior finishes.A variety of relaxing amenities await you, including a rooftop with scenic waterfront views and, a fitness center, and a heated resort style pool. Conveniently located in the heart of the Northern Liberties neighborhood of Philadelphia, you’ll be surrounded by historical sites as well as a wealth of restaurants, entertainment options, and shopping. Features: Nest Thermostats, Gourmet Eat-In Kitchens with Cherry Wood Cupboards, Generous Closet Space, Full Size Washer\/Dryer in unit, Quartz Counter Tops, Stainless Steel Appliances, 9 Ft Ceilings, Largest Apartments in the Area, Floor to Ceiling Windows, Large Bathrooms, Spa Shower System & Jacuzzi Tub  Community Amenities: Spacious Highrise Living, 24-Hour Concierge Service, Spectacular Resort Style Pool Area, Amazing Views and Rooftop Lounge, Rooftop Walking Track & Dining Areas, Fully Outfitted Fitness Center, Dry Cleaning Service Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Follow This Link for More Information:https:\/\/archcompanies.aptglance.com\/ku551L Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! kYlt2i9GoY\n","num_images":15,"lat":39.962145,"lng":-75.137734,"attrs":"['2BR \/ 2Ba', '1262ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-01T11:35:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573783724.html","post_id":7573783724,"result_date":"Sun Jan 01 2023 16:34:30 GMT+0000 ","title":"Magnificent view on tree lined street","description":"Rowhome:\nThis 2 bedroom, 1.5 bathroom beauty is perfect for a young couple or college roommates\n3400 Midvale was awarded 2nd place in Philadelphia’s most beautiful \/ green streets.\nGreat curb appeal, roomy and sunny. Includes the following\n• 2 bedrooms\n• 1.5 baths\n• Hardwood floors through out\n• Full bath has Jacuzzi tub, slate tile and heated floor\n• Kitchen with granite countertops, stainless steel appliances and heated floor\n• Radiator heat keeps you toasty in the winter, A\/C keeps you cool in the summer\n• Private patio in back (newly renovated)\n• Private drive in back\n• Large basement\n• Close to R6 and R8 and Philadelphia U.\n• Garage included for off street parking","num_images":21,"lat":40.023329,"lng":-75.179034,"attrs":"['2BR \/ 1.5Ba', '1100ft2', 'available now', 'air conditioning', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T11:30:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573775773.html","post_id":7573775773,"result_date":"Sun Jan 01 2023 16:02:53 GMT+0000 ","title":"4-5 bed house","description":"3-story furnished house in University City.  Small quiet street adjacent to campus. Private landlord.  Responsive.  Modest but comfortable.  Great for Drexel professionals or students. More photos provided upon request.","num_images":17,"lat":39.9597,"lng":-75.2024,"attrs":"['5BR \/ 2Ba', 'available feb 14', 'application fee details: Background check', 'furnished', 'house', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-01T10:58:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573769929.html","post_id":7573769929,"result_date":"Sun Jan 01 2023 15:35:39 GMT+0000 ","title":"Stunning studio, 1, 2, and 3-bedroom apartments. Upscale Amenities!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Residences at One Brown 1 Brown Street, Philadelphia, PA, 19123Want more info? See the link below:https:\/\/archcompanies.aptglance.com\/sbh436 Call Now:  show contact info\nx 155OR Text 155 to  show contact info\nto text our leasing team.Stunning Apartments in Northern LibertiesThis is a 1 Bedroom, 1 Bath, Approximately 690 Sq. Ft. 1 Brown will check off everything on your list of must-haves with stunning luxury apartments in the neighborhood of Northern Liberties. Take a look at the variety of floor plans and choose the perfect spot for your lifestyle. No matter which residence you choose, your home will boast a spacious layout with classic, sophisticated interior finishes.A variety of relaxing amenities await you, including a rooftop with scenic waterfront views and, a fitness center, and a heated resort style pool. Conveniently located in the heart of the Northern Liberties neighborhood of Philadelphia, you’ll be surrounded by historical sites as well as a wealth of restaurants, entertainment options, and shopping.Features - Full Size Washer\/Dryer in unit  - Spa Shower System & Jacuzzi Tub  - Stainless Steel Appliances  - Generous Closet Space  - Gourmet Eat-In Kitchens with Cherry Wood Cupboards  - Largest Apartments in the Area  - Floor to Ceiling Windows  - Large Bathrooms  - Quartz Counter Tops  - Nest Thermostats  - 9 Ft Ceilings Community Amenities - Spacious Highrise Living  - 24-Hour Concierge Service  - Dry Cleaning Service  - Rooftop Walking Track & Dining Areas  - Fully Outfitted Fitness Center  - Amazing Views and Rooftop Lounge  - Spectacular Resort Style Pool Area Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMPet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today!  Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! TQqkZ5uF\n","num_images":14,"lat":39.962145,"lng":-75.137734,"attrs":"['1BR \/ 1Ba', '690ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-01T10:31:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573765531.html","post_id":7573765531,"result_date":"Sun Jan 01 2023 15:18:27 GMT+0000 ","title":"2 Bedroom, 2 Bathroom, 1 Den","description":"Beautiful 2-floor apartment in the heart of midtown village with hardwood floors, 2 Bedrooms, 1 Den, and lots of closet space.","num_images":23,"lat":39.948882,"lng":-75.16055,"attrs":"['2BR \/ 2Ba', '1350ft2', 'available feb 6', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-01T10:10:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573765363.html","post_id":7573765363,"result_date":"Sun Jan 01 2023 15:13:55 GMT+0000 ","title":"Beautiful 2nd Floor One-Bedroom in University City","description":"Beautiful light-filled, airy, spacious one-bedroom second-floor apartment on a quiet tree-shaded street near 49th and Baltimore.  Well-maintained early 20th century building-- original hardwood floors, high ceilings and lots of character.  Basement storage area. Two minute walk to the trolley.  Close to the Baltimore Avenue restaurants and shops.  On-street parking.  Front porch, small back yard.  Free washer & dryer on premises.  Free WiFi.  Cats okay, dogs negotiable.  Amiable landlord.  Handyman on call.  Available February 1.","num_images":5,"lat":39.946959,"lng":-75.220991,"attrs":"['1BR \/ 1Ba', '600ft2', 'available feb 1', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-01T10:09:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573739447.html","post_id":7573739447,"result_date":"Sun Jan 01 2023 12:39:01 GMT+0000 ","title":"Spectacular 900-sqft Top-Floor unit(Avail NOW)","description":"1501 N 31ST STREET, PHILADELPHIA, PA 19121\nThis spectacular 900-sqft Top-Floor Penthouse Corner Unit includes one gated & covered assigned parking space with 24 hrs surveillance security. As soon as you step inside this unit, you will notice the beautiful wide plank hardwood floor throughout the entire unit. 10 ft ceilings with 8 ft floor to ceiling windows brings in natural sunlight to light up the rooms. High-end window treatments with remote control. The magnificent gourmet chef kitchen features oversized center island, gas cooking range, commercial vent hood, deep farm sink, quartz countertop, coffee\/bar area with a wine fridge. The open floor plan offers easy flows and the 178 sq ft Balcony outside the kitchen with wood deck expends the living space to outdoor! The primary bedroom has a large barn door with spacious custom built in walk-in closet shelves; the en suite bathroom showcases an oversized shower with tiled floor and walls. The primary bedroom also enjoys a private balcony for sitting area for the morning coffee. The other two bedrooms has a Jack-n-Jill full bathroom. Front loader washer & dryer. Don't forget the large roof top area offers an outdoor cooking, entertaining space, stunning city views, and a dog park. Bike and additional storage in the basement. The landlord pays for the gas, water, and condo fee. Tenant is responsible for all other utilities and renter insurance. Convenient location to major highways; close to trendy restaurants, stores, Fairmount Park, and center city.\nKitchen Features & Appliances\n*Dishwasher\n*Disposal\n*Stainless Steel Appliances\n*Island Kitchen\n*Kitchen\n*Microwave\n*Range\n*Refrigerator\nFloor Plan Details\n*Walk-In Closets\n*Furnished\n*Garden\n","num_images":4,"lat":39.979361,"lng":-75.185728,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T07:08:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573930039.html","post_id":7573930039,"result_date":"Mon Jan 02 2023 02:04:35 GMT+0000 ","title":"Fitness Center, Incredible Features, Central Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nBe the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '815ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T21:00:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573927743.html","post_id":7573927743,"result_date":"Mon Jan 02 2023 02:03:57 GMT+0000 ","title":"►GORGEOUS REMODELED HOME, SS APPLIANCES, HARDWOOD FLOORING, FRESH PAINT,","description":"NOTE: Feel free to contact me if this is not what you are looking for, I may have other properties to pass by you.\nCONTACT NUMBER:  show contact info\n5 BEDS\n1.5 BATH\n1,822 SQUARE FEET\nSpacious 5-bedroom home for lease in a convenient location, on a tree-lined block! This 3-story beauty is filled with natural light throughout, fresh paint and original details including lovely moldings and archways, grand stair banisters and gleaming hardwood floors. This property boasts a brick facade and nice sized front porch, leading to a vestibule with an additional interior door. The large living room with a decorative fireplace and coat closet leads to the formal dining room with a charming built-in. The renovated kitchen contains plenty of storage with ceiling height cabinets, stainless steel appliances and stylish subway tile. Just beyond the kitchen is a sizable mudroom, a powder room and back yard access. The second level consists of three generous bedrooms with plenty of windows and closets and a modern hall bathroom. The third floor has two additional bedrooms, a hall linen closet, and a birds eye view of the neighborhood. The unfinished basement is perfect for storage and has laundry and a workbench. Great location, a quick bike ride to University City, Drexel and University of Pennsylvania. Close to countless eateries, nightlife and great shopping. Steps to public transportation, the trolley and bus routes, making for a short commute to Center City and surrounding Counties. Close to Routes 76, 676, Kelly Drive and City Line Ave., near major thoroughfares, Girard and Lancaster Ave. Nearby points of interest include the Fairmont Section, Art Museum, Rodin Museum, Barnes Foundation, Belmont Plateau and the Mann Center...Numerous Parks, the School of the Future, Please Touch Museum, the Philadelphia Zoo and more!\nIf you'd like to know more information about this property, please send me a message.\nListed Courtesy, Compass RE,Cherryblossom Harrison\n","num_images":13,"lat":39.9877,"lng":-75.1554,"attrs":"['5BR \/ 1.5Ba', '1822ft2', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-01T20:48:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573917877.html","post_id":7573917877,"result_date":"Mon Jan 02 2023 01:03:50 GMT+0000 ","title":"$1500.1 BDR Studio APT W\/ Utilities included","description":"$1500\/ 1 Bedroom - 350 ft2 -One Bedroom Studio W\/Utilities included (Philadelphia) Furnished\n2nd floor studio apartment ,with all utilities included.New floors and kitchen .$1500.00 first, month, last month and security deposit required.please send an email expressing your interest ,why you are moving and a brief message about yourself, making this an excellent area for students or Grad student, available Now.\ninternet included.\nplease no pets, no smoking.","num_images":8,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '350ft2', '\\nsunday 2023-01-01\\n', 'air conditioning', 'furnished', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T19:59:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573915353.html","post_id":7573915353,"result_date":"Mon Jan 02 2023 00:52:05 GMT+0000 ","title":"$1700.1 BDR Studio APT W\/ Utilities included (Rittenhouse SQ)","description":"$1700\/ 1br - 400 ft2 -One Bedroom  Studio W\/Utilities included (Philadelphia) Furnished\n2nd floor studio apartment ,with all utilities included.New floors and kitchen .$1700.00 first, month, last month and security deposit required.please send an email expressing your interest ,why you are moving and a brief message about yourself, making this an excellent area for students or Grad student, available Now.\ninternet included.\nplease no pets, no smoking.","num_images":19,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '400ft2', 'available now', 'air conditioning', 'furnished', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-01T19:47:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573876099.html","post_id":7573876099,"result_date":"Sun Jan 01 2023 22:05:37 GMT+0000 ","title":"Large charming apartment","description":"Large, charming unfurnished 1-bedroom apartment on main floor of historic stone manor house.\nFull kitchen with inner building entryway, dining room with fireplace, sunny living room with outside entryway, full bathroom with tub\/shower, large bedroom with many windows and outside entry to deck, high ceilings throughout, tile floors in kitchen and bathroom and hardwood floors in all other rooms, ceiling fans in kitchen and three other large rooms, quiet building.\nLocated next to Washington Crossing PA, 3 miles north of easy access to I-295 (formerly I-95), short walk to Washington Crossing State Park and Delaware Canal State Park, and 1-mile walk to Delaware River and historic bridge to New Jersey.\nIncluded in rent: central A\/C and heat, water, sewer, and trash. Free laundry machines in building basement. No pet and no smoking policy. First and last months’ rent and security deposit required (total $4,500).","num_images":8,"lat":40.285026,"lng":-74.881439,"attrs":"['1BR \/ 1Ba', '850ft2', 'available jan 15', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T17:01:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573875052.html","post_id":7573875052,"result_date":"Sun Jan 01 2023 22:01:42 GMT+0000 ","title":"Fishtown\/temple VIC","description":"Brand new 3 story construction with upscale amenities including a roof top deck. Grand 4br, 3 full bath and 2 partial baths, chef's kitchen, finished basement, appliances and wine chiller.   Rental amount is 2850.  Please schedule showing.","num_images":4,"lat":39.978,"lng":-75.1459,"attrs":"['4BR \/ 4.5Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-01T16:57:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573872387.html","post_id":7573872387,"result_date":"Sun Jan 01 2023 21:58:28 GMT+0000 ","title":"@=T-w-o floors and easily $+ accessible t\/o everything!!!","description":"1 bedrooms and 1 bathroom with living room and kitchen. Two floors and easily accessible to everything. Available starting 20th January. Washer and Dryer hookups. 1st and last month rent as security deposit, no pets allowed. You can enjoy the community amenities like the rooftop patio overlooking the Hancock, 24-hour Precor equipped fitness center, Wellbeats digital trainer, community BBQ grills, and community lounge. For more details and quick reply, kindly send me your phone number.","num_images":3,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '790ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T16:47:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573854472.html","post_id":7573854472,"result_date":"Sun Jan 01 2023 21:03:47 GMT+0000 ","title":"This home in Paschall Ave, is move in ready !!!","description":"****NOW AVAILABLE***************\nFantastic East End Location. 3 bedroom 2 bath, great back yard.\nRent range $900-$900\nDeposit range $900-$900\nPet allowed restrictions may apply\nThis home is available to view and we are accepting application currently.\n**To view this home, we offer two options.\nYou are welcome to come to our office Monday through Friday to pick up a key between 9am and 6PM. You will need a $0 refundable key deposit (cash only) and we will copy your ID.\nWe are located at:\nWe Buy Real Estate\n6752 Paschall Ave, Philadelphia, PA, 19142\nshow contact info\n*You can also go directly to the property to view this home Monday through Sunday 9am to 6pm using their lockbox. But First, Please call Tenant and follow the prompts, to be pre-qualified, then schedule an appointment. The lockbox number is located on the box at the property.\nwww.rentusnow.com\n12. month lease terms\nConcord Cooperative, Come and See this unit on a corner lot, In this gated and well maintained community. Located minutes from the Airport, Shopping, Downtown and Marta, Must See. Monthly Carrying Charge is $900covers HVAC, hot water heater, roof, exterior, landscape, property taxes, liability insurance for the building, water, trash and common area. CALL:\nshow contact info\nThis house at New port Richey area ....3 bedroom 2 bathroom for rent $900a month .....This house very good for a small family ......close to many restaurant and bank ...close to highway 40 and drive to just 20 minutes drive to just 25 minutes drive to just 40 minutes ....if your family need this home ,please call me or text me :\nshow contact info\nWonderful 3 bed ranch on a double lot. Features a fenced in back yard with plenty of trees and privacy, large window in living room for loads of natural light, a freshly painted interior, and more! Kitchen cabinets have been redone and there is plenty of space in the garage and basement for storage. Short term lease is available.For more details Text::  show contact info\ni\n","num_images":10,"lat":40.013,"lng":-75.132,"attrs":"['3BR \/ 1Ba', '960ft2', 'available now', '\\nsunday 2023-01-01\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T15:41:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573842124.html","post_id":7573842124,"result_date":"Sun Jan 01 2023 20:58:58 GMT+0000 ","title":"2br-  completely renovated and beautiful 2 bed 1 bath home.(Shohola,","description":"completely renovated and beautiful 2 bed 1 bath home located in Shohola! Whether you are looking for a starter home or that vacation getaway in the mountains, this gem fits the bill. Renovated from top to bottom, this home has a new roof, new front and back decks, siding, windows and doors, custom hand laid real natural stone, a new lawn and brand new septic! On the inside, you will find brand new appliances, flooring, trim and paint, LED energy efficient lighting. Located in a quaint neighborhood close to hiking trails, public park, WRTA bus route, airport, and more!. Well Insulated Energy Star Package Home with Exterior 2x6 Walls Dual Pane windows and extra Insulation R value! A Pretty Place , Comfortable and Nice!  And yes an attached garage. Call Now:   to text our team directly.Want more info on this unit? Features - Tons of cabinets  - Washer & Dryer in select homes  - Exposed Beams  - Double-pane, energy efficient windows  - Pet-friendly  - Non-toxic finishes  - Energy Star-rated appliances and low flow fixtures  - Mix of studio, one- and two-bedroom apartments  - High efficiency LED lighting  - All appliances included Community Amenities - On-Site Maintenance and Management  - New Apartments, City Views, Rooftop Terrace, BBQ, Lounge, Brewery Tour, Trolley Rides,  - Pearl, Old Town,Waterfront, U of O, Coffee, Downtown, Entertainment, Brewery, Pizza, restaurants ,Bike,  - Voodoo doughnuts, Wine Tasting, Ground Control.  - Rooftop deck with expansive views of the City, Willamette River and Mt. Hood  - Modern fitness facilities with showers and locker rooms  - Lounge with outdoor terrace with grill  - Walking trails, Willamette River, Saturday Market, Burnside Bridge, Portland Sign, Old Town Water Tower,  - Locally sourced and recycled content materials  - Controlled-access bike parking as well as a bike maintenance station and bike wash Pet Policy Pets are Welcome Office Hours Monday-Friday: 10:00AM-5:00PM\nuZSu56gd","num_images":9,"lat":41.386366,"lng":-74.948543,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-01T14:57:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573857835.html","post_id":7573857835,"result_date":"Sun Jan 01 2023 20:58:17 GMT+0000 ","title":"Must See Riverfront Living, Views Galore and the Amenities to Match!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Residences at One Brown 1 Brown Street, Philadelphia, PA, 19123Want more information on this unit? See link (below):https:\/\/archcompanies.aptglance.com\/6tLd48 Call Now:  show contact info\nx 159OR Text 159 to  show contact info\nto contact our team.Stunning Apartments in Northern LibertiesThis is a 2 Bedroom, 2 Bath, Approximately 1262 Sq. Ft. 1 Brown will check off everything on your list of must-haves with stunning luxury apartments in the neighborhood of Northern Liberties. Take a look at the variety of floor plans and choose the perfect spot for your lifestyle. No matter which residence you choose, your home will boast a spacious layout with classic, sophisticated interior finishes.A variety of relaxing amenities await you, including a rooftop with scenic waterfront views and, a fitness center, and a heated resort style pool. Conveniently located in the heart of the Northern Liberties neighborhood of Philadelphia, you’ll be surrounded by historical sites as well as a wealth of restaurants, entertainment options, and shopping.Features - Full Size Washer\/Dryer in unit  - Generous Closet Space  - 9 Ft Ceilings  - Large Bathrooms  - Quartz Counter Tops  - Nest Thermostats  - Largest Apartments in the Area  - Spa Shower System & Jacuzzi Tub  - Stainless Steel Appliances  - Floor to Ceiling Windows  - Gourmet Eat-In Kitchens with Cherry Wood Cupboards Community Amenities - Spacious Highrise Living  - Rooftop Walking Track & Dining Areas  - Dry Cleaning Service  - Spectacular Resort Style Pool Area  - Fully Outfitted Fitness Center  - 24-Hour Concierge Service  - Amazing Views and Rooftop Lounge Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMPet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today!  Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! 0hKVjnG0\n","num_images":16,"lat":39.962145,"lng":-75.137734,"attrs":"['2BR \/ 2Ba', '1262ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-01T15:54:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573849158.html","post_id":7573849158,"result_date":"Sun Jan 01 2023 20:26:03 GMT+0000 ","title":"Quiet Manayunk 2 Bed 1 Bath with Parking","description":"2 Bedroom Apartment in Manayunk available March 1st, 2023. Renovations include\ncarpet, vinyl flooring, refrigerator, new paint, accent wall, Nest Smart Thermostat, new light fixtures, new washer and dryer. Apartment located within 5 minute walking distance to Ivy Ridge Train Station and 10 minute walking distance to Main Street in Manayunk.\nWasher & Dryer included in the apartment!\nTenant pays electric; Landlord pays water.\nPets okay (Nonrefundable $500\/pet)\nNo smoking in unit\n1 Off Street Parking Space Included\nPlenty of Street Parking Also Available\nFirst Floor Unit\nRental Application\n-Employment History\n-Landlord History\n-Authorization to pull credit report\n-Authorization to pull criminal history\nMove In\nAt Move In tenant pays landlord First Month's Rent, Last Month's Rent, and Security Deposit. $5,385 due at Move In.\nLease dureation 1 year\n","num_images":24,"lat":40.035764,"lng":-75.233924,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available mar 1', 'air conditioning', 'application fee details: $50\/person background check', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-01T15:22:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573840230.html","post_id":7573840230,"result_date":"Sun Jan 01 2023 20:05:50 GMT+0000 ","title":"Completely renovated, 3 bedroom 2 bath, 1st floor, large kitchen","description":"Completely renovated, 3 bedroom 2 bath, 1st floor, large kitchen, dining area, available February 1, 2023. Large eat in kitchen. bathroom. Wood floors (can select carpet instead if rented prior to Jan. 30 while property is being worked. Property being worked on but can still make appointments and will be ready for March 1st. Max two small dogs or two cats. Income three times rent. $500 security. Fenced yard., lots of closets, extra storage space in shed area in the yard, More pictures and videos available, first, last and security, good credit, $30 application and background check.  If you interested please contact:- evamery53𝐆𝐦𝐚𝐢𝐥com","num_images":5,"lat":39.9487,"lng":-75.1593,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-01T14:50:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573835622.html","post_id":7573835622,"result_date":"Sun Jan 01 2023 19:43:05 GMT+0000 ","title":"Electronic Thermostat, Refrigerator, Air Conditioner","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1005Date Available: 2023-01-01Address: 1201 Chestnut StreetJuxtaposing the building’s 1902 Renaissance Rival architecture with Midtown Village’s contemporary nightlife and hip markets, The Commonwealth weaves a seamless tapestry of historic elegance and the vibrant urban culture of Center City Philadelphia, PA. This restored mid-rise community blends classic design with contemporary, upscale finishes that have resulted in multiple awards from the Pennsylvania Apartment Association for presentation, maintenance and service. Amenities Include:MicrowaveCable ReadyModern Kitchen AppliancesEfficient AppliancesWasher\/DryerAir ConditionerStorage LockersSpacious 1 & 2 Bedroom ApartmentsBicycle StorageHardwood FloorsValet Dry-CleaningRefrigeratorCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/vvt5s4jg\/commonwealthPricing and availability are subject to change.\n","num_images":9,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '1005ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-01T14:34:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573834753.html","post_id":7573834753,"result_date":"Sun Jan 01 2023 19:35:14 GMT+0000 ","title":"Amazing Specials, Floor to Ceiling Windows with Stunning Views!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card!  Residences at One Brown 1 Brown Street, Philadelphia, PA, 19123Call Now -  show contact info\nx 158OR Text 158 to  show contact info\nto contact our leasing team.Interested in more information? Visit link below:https:\/\/archcompanies.aptglance.com\/8iix24 Stunning Apartments in Northern LibertiesThis is a 1 Bedroom, 1 Bath, Approximately 690 Sq. Ft. Residences at 1 Brown offers stunning and spacious studios, one, two, and three bedroom apartments with premium features designed to help you live your best life every day. Each unit has oversized bedrooms and enough living space for both a media center and kitchen table. You will thoroughly enjoy the soaking up the ample space to relax or host guests! Upscale kitchens with cherry wood cupboards are brimming with the latest appliances complemented by granite countertops and ample storage space. Nearby, you can enjoy a spa shower and Jacuzzi tub in your bathroom, take advantage of your personal washer and dryer, and set up a special place for your pets. As you come home to your 1 Brown apartment each day, you're stepping into a place of comfort, convenience and class. Call Today! Pet Policy Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMPhotos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! THnoa085\n","num_images":14,"lat":39.962145,"lng":-75.137734,"attrs":"['1BR \/ 1Ba', '690ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-01T14:31:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573825145.html","post_id":7573825145,"result_date":"Sun Jan 01 2023 19:10:17 GMT+0000 ","title":"Bicycle Storage, Hardwood Floors, Modern Kitchen Appliances","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1005Date Available: 2023-01-01Address: 1201 Chestnut StreetJuxtaposing the building’s 1902 Renaissance Rival architecture with Midtown Village’s contemporary nightlife and hip markets, The Commonwealth weaves a seamless tapestry of historic elegance and the vibrant urban culture of Center City Philadelphia, PA. This restored mid-rise community blends classic design with contemporary, upscale finishes that have resulted in multiple awards from the Pennsylvania Apartment Association for presentation, maintenance and service. Amenities Include:DishwasherExtra StorageRefrigeratorStorage LockersHardwood FloorsMicrowaveEfficient AppliancesElectronic ThermostatModern Kitchen AppliancesWasher\/DryerCable ReadyValet Dry-CleaningCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/x2u243r5\/commonwealthPricing and availability are subject to change.\n","num_images":9,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '1005ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-01T13:58:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7573823953.html","post_id":7573823953,"result_date":"Sun Jan 01 2023 18:57:56 GMT+0000 ","title":"House","description":"house for rent","num_images":13,"lat":39.938594,"lng":-75.290369,"attrs":"['3BR \/ 1.5Ba', 'available now', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-01-01T13:53:56-0500"}]