[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/darby-coming-soon-bed-bath-multiple\/7578935116.html","post_id":7578935116,"result_date":"Mon Jan 16 2023 01:31:12 GMT+0000 ","title":"Coming Soon - 1 Bed\/1 Bath, Multiple Units","description":"Multiple newly-rehabbed units in Darby will be available February 1 and March 1.  All are one bedroom\/one bathroom, new flooring, new paint, and upgrades to bathrooms and kitchens. Great location near trolley station. Section 8\/Housing Choice voucher holders welcome. Pre-screening potential applicants now - text (NO calls) to  show contact info\nif interested.","num_images":0.0,"lat":39.9176,"lng":-75.2696,"attrs":"['1BR \/ 1Ba', 'available feb 1', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T20:27:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bathroom\/7578930959.html","post_id":7578930959,"result_date":"Mon Jan 16 2023 01:14:04 GMT+0000 ","title":"2 Bedroom \/ 2 Bathroom Francisville Apartment","description":"This terrific 2 bedroom, 2 full bath Francisville condo features high quality design coupled with high efficiency, green features. This unique 2-story condo is a unit with lots of windows and plenty of natural light. It has its own private entrance and a rear outdoor space, perfect for morning coffee, as well as a private finished basement that is the perfect playroom, den or workout space. There are hardwood floors throughout. The first floor has an open floor plan with high ceilings, living room, dining and kitchen area with access to the enclosed patio and a full bath. The second level has two roomy bedrooms, a hall bath and a conveniently located washer & dryer. All appliances (Bosch) and HVAC system are high efficiency. Folsom is a quiet street with no thru traffic. Steps away from many parks, playgrounds, restaurants and stores.","num_images":11.0,"lat":39.968033,"lng":-75.166818,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available mar 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T20:10:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-university-city-huge-first\/7578928714.html","post_id":7578928714,"result_date":"Mon Jan 16 2023 01:05:25 GMT+0000 ","title":"University City Huge first floor Must See","description":"Very large first floor one bedroom with hardwood floors-dishwasher -washer dryer in building-Must See-Available Now-\nMUST HAVE GOOD CREDIT AND REFERENCES-Please call  show contact info\nDave\n","num_images":18.0,"lat":39.953366,"lng":-75.216132,"attrs":"['1BR \/ 1Ba', 'available jan 17', 'application fee details: $40', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T20:01:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apartment-available-in\/7578923776.html","post_id":7578923776,"result_date":"Mon Jan 16 2023 00:45:04 GMT+0000 ","title":"Apartment Available in Fishtown","description":"New apartment available in fishtown. In unit washer and dryer. Up to date appliances (fridge, oven, microwave, dishwasher). Apartment building has small fitness center, secure mailroom, and rooftop view of the city. Lease term would be for 12 months. Apartment building has a paid parking garage with limited spaces. Street parking is no issue.","num_images":16.0,"lat":39.980006,"lng":-75.132954,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T19:41:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-56th-and\/7578885536.html","post_id":7578885536,"result_date":"Sun Jan 15 2023 22:32:08 GMT+0000 ","title":"1 Bedroom apartment. 56th and Baltimore","description":"Basement Apartment with separate access from the street. 1 Bedroom, Kitchen and Full Bathroom. Near Public transportation and Shopping. Text  show contact info\n.","num_images":0.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', '650ft2', 'available now', 'application fee details: $35 Application Fee', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T17:28:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-900-2br-bedroom-2nd-floor\/7578862349.html","post_id":7578862349,"result_date":"Sun Jan 15 2023 21:35:05 GMT+0000 ","title":"$900 \/ 2br - $900 - 2 BEDROOM, 2ND FLOOR APARTMENT","description":"SENIORS or a COUPLE ARE ENCOURAGED TO APPLY -  show contact info\n- Mrs. Cain\nNOT SECTION 8 APPROVED\nI am looking for a mature and responsible tenant who is able to keep apartment nice and clean at all times.\nBeautiful clean, 2nd floor apartment in West Philly on a quite block near public transportation, laundry mat and shopping centers nearby. Must see, is in move in condition. Apartment includes eat-in kitchen, up dated flooring throughout, Stove and Refrigerator, 2 Bedrooms, with a closet, one of the bedrooms includes ceiling fan with light, Front room includes ceiling fan with light and closet, enclosed front porch area with new carpet and excellent security features to entrance.\nRent is $900.00 plus you pay electric and gas. One month Security Deposit of $900.00 and 1 month Rent to move in, a total of $1,800.00 cash. No animals allowed.\nSERIOUS INQUIRES ONLY TO APPLY\nTo apply the application fee is $25.00 (cash only, non-refundable).\nIf selected, we do a thorough background check including Landlord\/Tenant Evictions to determine applicant qualification. Must provide paystubs and any other income information.\nIf interested in viewing this apartment, please text Landlord Mr.\/Mrs. Cain at  show contact info","num_images":11.0,"lat":39.9448,"lng":-75.2288,"attrs":"['2BR \/ 1Ba', 'available jan 23', 'application fee details: $25.00 -nonrefundable', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T16:17:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2bd-2ba-apartment\/7578865402.html","post_id":7578865402,"result_date":"Sun Jan 15 2023 21:30:20 GMT+0000 ","title":"2BD 2BA apartment available for rent ! Great offer on the market","description":"The amenities you'll find at 2bd 2ba modern apartment are high-quality additions to the beautiful living space. The fully equipped kitchen has all the tools you need to prepare your favorite dishes, with a stove, a refrigerator, and a microwave!\nAssigned parking is available !\nIn this apartment you will feel right at home in this unique and fully equipped with an island-designed kitchen, spacious bedrooms, over-sized walk-in closets, and luxurious balconie. Contact me directly:  aptrents@newapat.me---\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n-\n-\n-\n----\n-\n-\n-\n-\n--------\n-\n-\n-\n-\n--------\n-\n-\n-\n-\n----3719 Tully Rd., Suite C\nModesto, CA 95350\n1650 sq. ft.\nOwned by Phoenix Family LP\n…comfortable with 5-Built in Office desks and cabinets\n4-desk areas in one location; 1-Glass Door Office for the Chief\n…ample amount of back hallway cabinets and shelving\n…large Reception area\n…Glass Housed Conference Room with an area that could be used as a Showroom\n…2-small tucked away cove areas where 2-small tables could fit\n…Kitchenette with Refrigerator, Dishwasher, Sink, Microwave, Restroom Area with Shower\n…Private Driveway Area to fit 1 & possibly 2-Vehicles\n…Slider Door by Kitchenette leads to Driveway and to Secluded Patio Areas\n…Parking for Clients too\nIncludes Us putting your Company Name on the Front Door to Your Office Suite\nWe are offering…\n12-Month Leases\n$2600 Monthly Rent\n$2600 Security Deposit if approved on credit\nMany Large warehouses Available in Oregon\nGreat for storage warehousing many offices and shipping docks\n77,000 sq’ most all buildings are 50 foot wide 20 feet high ceilings 4 foot stem walls property is located on 5 .14 acres of recently partitioned land. Located on the I-5 corridor, a 1-hour drive from Portland International Airport, in the heart of the Willamette Valley-- Oregon’s premier agricultural area.\nQuit 'tele-commuting' from home. Private single office $395. Historic Building, wood floors with Conference and meeting room available. handicap bathrooms, kitchen facilities, center lobby, security and video surveillance with ample parking and ease of access, includes utilities, parking and WiFi. (2) Larger office available @ $450\/mo. (3) downstairs office available 1\/1\/2023 $375\/mo.\nI have a shop Available now it’s an 1000 Sq Ft. facility in Ceres Ca. Equipped With Office & Bathroom.\nClean unit good for clean jobs, storage\nGreat location off Hwy 99 &Whitmore in Ceres Ca.\n2,000.00 Dollar Deposit Required.\n50.00 dollar monthly common area fee.\nAVAILABLE NOW: Prime front spot in small office complex. 915 square feet; large tiled entry\/ reception area, large private office with built-in cupboards and book cases. Co-ed restroom in suite, small room for break room or file room. New energy efficient central heat and AC. Monthly rent $1,235.00, plus $90.00 cams.\nProfessional Office suite, Corner Location, New Carpet & Fresh paint, UTILITIES PAID BY OWNER saving $195 per month. Light\/ Bright High Ceilings, Art Deco Single-Story Building. Location is Everything. This office has 2 large windows (Eye Level with natural light all day). Walking distance to Banks, Post office, Court House, Restaurants, Movie Theaters, Parks, and all Amenities of beautiful Downtown Modesto. Reasonably priced Considering Paid Utilities, good for one or two-person professional use. Few tenants have been here for more than twenty-five years. Suitable for CPA, Engineers, Architects, Consultants, Insurance, Medical Office, Photographers, Artist Studio, Designers, Real Estate, Law, General Office, etc. etc...\nIf SERIOUS, please call  show contact info\nBuilding 2,610 sqft plus yard space\nPrivate yard\n21ft roll gate\n2 large roll up doors\n200 amp service\nVery tall ceilings\nGreat storage space\nCan rent month to month\nAvailable now\nText Ken\nshow contact info\n3,400 SF, (2,600 SF Warehouse, 800 SF Interior Office), plus 1,000 SF fenced\/gated side yard with a 360 SF storage container. Roll-up door, public bathroom, private offices. Building is monitored 24\/7 with video cameras for enhanced security. Property is fenced and gated. Quick and easy access to Highway 99. Other tenants are long term and quiet.\nGreat space for Contractors, Auto Business, RV\/Boat\/Auto storage.\nAvailable Now.\nOffice building For Sale or lease. Asking lease amount is $4500 per month gross. 17 offices with large reception area. 3 bathrooms. Across the street from the library. 5 parking spaces at the back of the building. Building for sale at $650,000.\nStore front approximately 1200SF Plus usable basement 1000 sf.\nProfessional Office Space. Furnished. Several options. Ideal for Law offices, Attorneys, CPA, Insurance agencies, Billing companies, and any management company. Custom builds-in throughout the space. Modern design, recessed lighting. Large floor-to-ceiling windows in the conference room with lots of natural sunlight. Private elevator.\nCan rent 1, 2 or 3 fully furnished offices with or without reception. Leases start from $2,100. Ready to move in. Impress your clients. The rent does not go by a square footage since all amenities such at client's waiting area, grand conference room, supply closets, kitchen, workstation, etc on this floor are shared among tenant. The office is located in a modern office elevator building in the heart of Sheepshead Bay rd. Several municipal parking lots are right next to the office. Central HVAC, internet\/wifi ready. Busy area with many restaurants. No broker’s fee. Serious inquiries only.\nFully furnished office space for licensed NYS mental health practitioners.\nPrivate entrance, waiting room, restroom, high-speed Internet available.\nTwo offices available, 7 days\/week. Spaces filling up.\nThis is a one-of-a-kind space that is a temporary being used as an event space. The pictures do not serve this space justice.\nThere are no residential neighbors and therefore noise is not an issue.\nParking is available!\nLocation:\n- 203 Moore Street\n- East Williamsburg\/Bushwick\n- 4 blocks from Roberta's Pizza and right by the Morgan (L) train\nThe variety of both rooms and open space allows for a nice flow for any sort of corporate event, party, gallery or show! This is a flexible space that can be transformed to fit your creative vision.\nContact Alyssa for more information.\nRates very depending on the type of event, length of event, and needs.\nHello!\n.That´s what I have available for you:\n.Several MUSIC PRODUCTION \/ RECORDING SPACES available !\n.(Present Tenants in the building : Mastering studios, Composers, Sound designers, Recording pop.... .)\nSizes are from 110sf - 200sf.- 400 sf ( big 2 room studio)\nAC\/ Heat Split systems ! ( Quiet!)\nSingle spaces from (110 sf)\nand\n2 Recording studios:\nOne with a big live room and one with a small live room.\nwindow in-between the rooms, etc..\nquiet Split AC\/ Heat system, Skylights, 14 foot ceiling etc...\nExtra Storage spaces available too for $120\/ month\nNone of those (only) 10 spaces in the building are occupied by rehearsing bands.\nAlthough built soundproof, the entire floor is more a production\/ recording facility ( Jazz, electronic, rock, pop) with medium sound level, occupied by MATURE professionals.\nRent: starting at $ 750 + $ 100 utilities (Utilities include Heat, Gas, AC, Electricity, Water, basic WLAN, Cleaning, Garbage, Taxes ) = Total $ 850 \/ month for 110 sf.\nThe bigger spaces are more....\nNice Backyard !, Shared office kitchen and bathrooms, Bikes can be parked INSIDE in the secure backyard .\nBakery, Restaurants, Shops, Delis, ... all just around the corner\nGreenpoint ! a very save, relaxed and vibrant neighborhood.\nFREE basic WLAN everywhere,\n.\n.Big surveillance system, high security system, LIVE IN SUPERINTENDENT.\n.\n.Amazing community of professional and mature tenants in the building !\n.Famous and long-term tenants prove the quality of my buildings !\n.(Many tenants have been with me for over 15 years !)\n.\n.Serving the Music and Artist community since 1999 !\n.\n.\n.Thank you !\n.\n.Please send me an email\/ Phone number and I will get right back to you to organize the showing .....\n.\n.\n.SPACE ONLY, DOES NOT COME WITH THE EQUIPMENT THAT MIGHT BE SHOWN IN THE PICS.\n.( THAT IS THE PRESENT TENANT'S GEAR)\n.\n.\n.\n.Thank you !","num_images":8.0,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T16:26:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2711-25th-stphiladelphia\/7578851795.html","post_id":7578851795,"result_date":"Sun Jan 15 2023 21:23:00 GMT+0000 ","title":"2711 N 25th St,,,,Philadelphia, PA !!","description":"Cozy, 2 bed 2 bath apt for rent in  2711 N 25th St, Philadelphia, PA !! Available mid\/late Jan.: insulation, drywall. furnace, AC water heater, bath, kitchen, doors, floors, trim, lights, even outlets and switches! Washer\/dryer in unit. Rent covers lawn, sewer, and garbage. Must show income 1 times rent. Must pay for security\/credit report.cats or dogs Ok. Non-smoker. $880. It has an open kitchen\/dining area with a deck off the kitchen, large living room, dry basement for extra storage, and the yard allows ample off-street parking. The house does need some TLC, is well insulated, and has a newer roof.","num_images":4.0,"lat":39.996421,"lng":-75.172317,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T15:49:00-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-central-location-upgraded\/7578779689.html","post_id":7578779689,"result_date":"Sun Jan 15 2023 17:41:14 GMT+0000 ","title":"Central Location, Upgraded Finishes Available, Pet Park","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nThe Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!\nApartment Features\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Ceiling Fan\n* Private Patio or Private Balcony (on select apartments)\n* Garden Tub\n* Linen Closet\n* Breakfast Bar\n* Stainless Steel Appliances\n* Granite Countertops\n* Disposal\n* Full sized Washer and Dryer in unit\n* Window Coverings\n* Pre-wired for internet and cable\n* Roommate Friendly Floor Plan\n* Central Heat and Air\n* Walk-in Closet\n* Pantry\n* Lofty Vaulted Ceilings\n* High Efficiency Lighting Fixtures\n[#9557007]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1128ft2', 'available jan 23', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T12:37:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-laundry-in-unit-central\/7578778829.html","post_id":7578778829,"result_date":"Sun Jan 15 2023 17:39:00 GMT+0000 ","title":"Laundry in Unit, Central Location, Ideal Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1218ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T12:35:00-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-studio-in\/7578777352.html","post_id":7578777352,"result_date":"Sun Jan 15 2023 17:35:14 GMT+0000 ","title":"Newly Renovated Studio in Germantown","description":"Newly Renovated Studio in Germantown - Seeking qualified applicants to enjoy the luxuries of this newly renovated studio in Germantown. This unit features luxury vinyl plank flooring, ceramic tile in the bathroom, an efficient ductless central heating and cooling system, and other amenities. The tasteful design maximizes both space and utility. Minutes from public transportation, regional rails and highways, this unit provides access to most of the city with ease. Call or text Daryl @  show contact info\nto schedule a showing today. Serious inquiries only please.","num_images":4.0,"lat":40.0338,"lng":-75.1731,"attrs":"['0BR \/ 1Ba', '625ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T12:31:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-yoga-and-ballet-studio\/7578772801.html","post_id":7578772801,"result_date":"Sun Jan 15 2023 17:22:43 GMT+0000 ","title":"Yoga and Ballet Studio, Visit Your New Home, Leasing Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nThe Point at Glen Mills offers all of the amenities your looking for and some you didn't even know you wanted. Check out our two-story clubhouse-complete with flat screen TVs, a 24-hour fitness center and a pool table. Enjoy our on-site yoga studio or our outdoor putting green. Visit us today!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nCommunity Features\n* Yoga Lounge\n* Pet Salon\n* Bocce Ball\n* Community Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* TV Lounge\n* Putting Green\n* Professionally Managed\n* Outdoor Grill Area\n* Swimming Pool\n* Fitness Studio\n* Easy Freeway Access\n* Bark Park\n* Sun Deck","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-01-15T12:18:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/blooming-glen-convenient-location\/7578771950.html","post_id":7578771950,"result_date":"Sun Jan 15 2023 17:20:30 GMT+0000 ","title":"Convenient location, Scenic walking trails, Pickle Ball Courts","description":"Bedrooms: 2Bathrooms: 2.5Square Feet: 1863Date Available: 2023-01-15Address: One Applewood DriveHeritage Orchard Hill welcomes you to explore our 1-, 2-, and 3-bedroom Perkasie townhomes and schedule a tour to see everything our community has to offer. Enjoy beautiful apartment features, including 9-foot ceilings, a full-size in-unit washer\/dryer, a 3,300 sq. ft swimming pool, an on-site fitness center. Explore our photo gallery to see the contemporary, neutral decor and comfortable living spaces at Heritage Orchard Hill. Call  show contact info\nto speak to a leasing agent today and schedule a tour of your new home today or apply online!Learn more about all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.Our Leasing Office is ready to answer your questions about our luxury townhomes for rent in Perkasie, Pennsylvania. Whether you need extra space for remote working or virtual schooling, or just like to spend some time in a well-appointed townhome, we have the floor plans you are looking for. Reach out and let us show you how easy it is to move into our Bucks County townhomes today! Contact us today to schedule your self-guided or virtual tour! Amenities Include:Fitness center with high-tech sound system and televisionsConvenient location3,300 square foot swimming pool with adjacent baby poolCommunity parties and events scheduled throughout the yearPet friendly (pets stay free)1,800 square foot open-air deckMultiple shopping destinations just miles awayScenic walking trails4,700 square foot clubhouse available for private partiesPickle Ball CourtsTennisPet parkCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/4wvqosrm\/heritage-orchard-hill\n","num_images":8.0,"lat":40.3765,"lng":-75.2648,"attrs":"['2BR \/ 2.5Ba', '1863ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T12:16:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-quiet-private-suite-in\/7578771774.html","post_id":7578771774,"result_date":"Sun Jan 15 2023 17:20:05 GMT+0000 ","title":"♥ ♥ Quiet private Suite in charming house:  Wifi and Util. Incl! ♥","description":"Your own private suite with bathroom and partial kitchenette in artsy Lansdowne with utilities and on-site laundry included. Just a stone’s throw to Philly but in a quiet residential area. Please read CAREFULLY before contacting homeowner:\n• All Utilities and Wifi included\n• Furnished (Bed, kitchen table and modern upholstered chair are all less than 2 years old: They are not in the pictures...)\n• Up to 2 cats allowed. Me-ow! =)\n• Media-Elwyn train line (station 6 blocks away): 12 minute train ride to University City!\n• Several Bus Lines go through 1 block away\n• 3 blocks to Trolley Line @ Congress Ave stop (69th Street --- Media)\n• Ample parking right out front with $40\/year permit\n• Running track and tennis courts 1 block away\n• Laundry in basement included\n• SMOKE FREE home (only inquiries from NON-smokers, NON-Vape please)\n• Just 3-6 block walk to Downtown Lansdowne shopping: Camelia Coffee House, Vinyl Revival record store, Lansdowne Farmer’s Market, Jamey’s House of Music Jazz Club, Kia’s Cake and Coffee Shop, Dollar Store and more\n• $830\/month includes utilities\n• Great fit for Students, Flight attendants or pilots (14 minutes from PHL airport!), people saving to buy a house, someone separated or just starting over… or someone having a hard time finding a place that allows cats.\n• Available Jan 18 2023\nThis space is bigger than the pictures appear and very quiet. Homeowner is a quiet professional with cats. Home is kept neat and clean and is a No Drugs, No Loud Parties, No Drama zone.\nOne limitation: there is not an official kitchen in your private space. There’s a new Full sized fridge, Toaster Oven, Microwave, plug in burner, plug in griddle, some dishes and pots and pans (if needed: appliances can be moved if you have your own). It’s best for no-frills dining and not a good fit for those who like to bake or make elaborate meals.\nEntrance involves walking through the homeowner’s space and up to your 3rd floor. No private entrance but your third floor is completely private.\nCredit and Criminal background check required with application. Application fee $45.\nOne Year Agreement. Possible shorter 6 or 9 month agreement would be considered with a one time pre-payment for the professional cleaning fee of $150 to prepare for the next housemate.\nFirst month, Last month and security deposit ($600) due to move in: $2260\nONLY if you have read ALL of this and it sounds like a good fit please email to set up a quick phone pre-screen chat and then a showing.\nPlease answer the following via EMAIL:\n1) what date you're looking to move in\n2) confirm that you are OK with background check\n3) confirm that you're OK with phone interview before showing\n4) confirm that you understand the kitchen situation\n5) confirm that $2260 to move-in is something you can do\nIf your email doesn't at least include that info. it will not be answered. Before setting up phone interview I want to know that you have read this completely and are a person who is conscientious and pays attention to detail.\nThanks! Sara\n","num_images":12.0,"lat":39.9375,"lng":-75.2637,"attrs":"['1BR \/ 1Ba', 'available jan 18', 'air conditioning', 'cats are OK - purrr', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T12:16:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fitness-center-incredible\/7578766773.html","post_id":7578766773,"result_date":"Sun Jan 15 2023 17:07:24 GMT+0000 ","title":"Fitness Center, Incredible Features, Central Location","description":"Be the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nCommunity Features\n* TV Lounge\n* Yoga Lounge\n* Spa\n* Fitness Studio\n* Pet Salon\n* Outdoor Grill Area\n* Billiards\n* Sun Deck\n* Community Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access\n* Bark Park\n* Swimming Pool\n* Professionally Managed","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '733ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T12:03:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-3rd-floor-bed-bath-with\/7578760646.html","post_id":7578760646,"result_date":"Sun Jan 15 2023 16:50:02 GMT+0000 ","title":"3rd Floor 1 Bed, 1 Bath with Premiere Upgrades Available Feb. 23rd!","description":"The Gateway Apartments1515 Manley Rd West Chester, PA 19380Pricing: $1687 - $2435\/Month*Bedrooms: 1  Bathrooms: 1 Square Footage: 779 sq ft show contact info\nFeatures in this apartment home:● Air Conditioning & Heating● Alarm● Cable Ready● Den● Dining Room● Dishwasher● High Speed Internet Access● Refrigerator, Freezer, Ice Maker● Trash Compactor● Window Coverings● Built-In Computer Nook (select homes)● Built-In Microwave Oven● Disability Access (select homes)● Garden\/Spa Tub (select homes)● Gas Fire Place (select homes)● Kitchen Pantry● Mini Blinds On All Windows● Upgrade● Vaulted Ceiling (select homes)● Wooded View\/Pool View (select homes)About the community:  Offering a vibrant selection of living options, The Gateway Apartment Homes maintains the prime for luxury apartments in West Chester, PA. Our open and inviting floor plans are enhanced by a variety of exclusive features which define the unique lifestyle only found at our community. With a great location in the East Goshen Township, you will love calling our apartments your home.Please take our virtual tour\nhttps:\/\/my.matterport.com\/show\/?m=4RkQ1PobBkE&brand=0 Amenities at our property:● Business Center● Clubhouse● Fitness Center● Onsite Maintenance● Onsite Management● Package Service● Picnic and Grilling Area● Pool and Sundeck● Storage Space● Walking\/Biking Trails● Across From Wawa & Goshen Crossing Shopping Center● Beautifully Landscaped Grounds● Garages For Lease● Gated Entrances● Maintenance Free Lifestyle● Onsite Leasing Office● Relaxing Fire Pit● Resort-Style Pool With Sun Deck● Storage Units For Lease● Wi-Fi Access in Clubhouse and at PoolAdditional information:Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthPets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonWebsite: https:\/\/www.thegatewayapartments.com\/Phone:  show contact info\nProfessionally managed by Paradise Management, LLC *Prices are subject to change without notice All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY970F506CB0054A\n","num_images":22.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '779ft2', 'available feb 10', 'air conditioning', 'application fee details: 60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T11:46:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/very-nice-newer-home-located-on-bever\/7578750567.html","post_id":7578750567,"result_date":"Sun Jan 15 2023 16:47:59 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-call-for-details-clubhouse\/7578753731.html","post_id":7578753731,"result_date":"Sun Jan 15 2023 16:30:15 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-food-trucks-free-parking\/7578752613.html","post_id":7578752613,"result_date":"Sun Jan 15 2023 16:27:03 GMT+0000 ","title":"Food Trucks & FREE Parking in Manayunk?? Whaaaaaaaat?!  We have it!","description":"Thank you for your interest in The Glen at Shawmont Station Apartments.  Below is our current availability and pricing.  Below you will find information on each available unit as well as pre-recorded virtual tours.  If you’d like to apply to any of these units, you can do so at www.theglenphilly.com.  Information regarding amenities, utilities and pets are on the the website.\nThe Glen at Shawmont Station is proud to host various food trucks almost weekly on the property.  Today, January 15, 2023, we have our Algorithms Vegan Food Truck here from 12 p.m. - 6 p.m. come on out and grab some lunch with them and meet other residents who live here!\nThe application process is easy.\n1.\tLocate the apartment you want to rent on www.theglenphilly.com and hit “select”.\n2.\tComplete the application on all parts and submit with the $500.00 security deposit and $50.00 application fee.\n3.\tSend proof of income and photo ID to  show contact info\n.\n4.\tIf approved with good credit your deposit remains $500.00.  Approved conditionally the deposit is one month’s rent, the $500.00 initial deposit will go towards that and you would owe the balance at move in.  If denied, the deposit is refunded in check form.\n5.\tIf you decide our community is not right for you after applying, you have 72 hours from applying to cancel in writing (email) to receive your refund of the $500.00.  The deposit is not refundable after 72 hours if you cancel your application.\n6.\tYour gross monthly income (this is income before taxes) must equal three times the monthly rent to be approved.  Incomes are combined.\n7.\tTwenty-four hours before move-in, you would pay your admin\/city fees of $330.00, any pet fees if applicable and the first month’s rent.\nApt. 714:  $1,825.00\/month for 2\/4\/2023 - PINK FLOORPLAN IN POSTED PICTURES\nThis is a top floor 1 bedroom + den apartment.  This unit has hardwood flooring throughout the main areas with carpet in the bedroom.  Video link is of a comparable unit not the exact unit.\nVirtual Tour: https:\/\/youtu.be\/hbaMHGDt39k\nApt. 322 (no dogs or cats allowed in this unit):  $1,825.00\/month for 3\/1\/2023 RED FLOORPLAN IN POSTED PICTURES\nThis is a top floor 1 bedroom + den apartment.  This unit is fully carpeted throughout the apartment.  Video link is of a comparable unit not the exact unit.\nVideo Tour: https:\/\/youtu.be\/MTVX7cduQWA\nApt. 923: $2,025.00\/month for 3\/18\/2023  GREEN FLOORPLAN IN POSTED PICTURES\nThis is a first floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms.  This unit has an enclosed balcony.  Video link is of the same style but not the exact apartment.\nVideo Tour:  https:\/\/youtu.be\/hgFCYkNVF4U\nApt. 323 (no cats or dogs allowed in this unit):  $2,195.00 for 3\/18\/2023  PURPLE FLOORPLAN IN POSTED PICTURES\nThis is a first floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms, an interior set of stairs going down once you open your front door, and has an enclosed balcony and an amazing view in a quiet corner of the property. Video link is of the same style but not the exact apartment.\nVideo Tour:  https:\/\/youtu.be\/dFtGuNN8rOc\nApt. 618:  $2,045.00\/month for 3\/24\/2023  GREEN FLOORPLAN IN POSTED PICTURES\nThis is a top floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms.  This unit has an enclosed balcony.  This unit is located in our outdoor stairwell and will have several steps up to your front door.  Video link is of the exact unit.\nVideo Tour:  https:\/\/youtu.be\/cOTefus-yA8\n","num_images":7.0,"lat":40.044781,"lng":-75.246863,"attrs":"['2BR \/ 2Ba', 'available feb 15', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T11:23:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-free-parking-food-trucks\/7578751282.html","post_id":7578751282,"result_date":"Sun Jan 15 2023 16:23:04 GMT+0000 ","title":"FREE PARKING, FOOD TRUCKS & FULL SIZE W\/D IN UNIT!","description":"Thank you for your interest in The Glen at Shawmont Station Apartments.  Below is our current availability and pricing.  Below you will find information on each available unit as well as pre-recorded virtual tours.  If you’d like to apply to any of these units, you can do so at www.theglenphilly.com.  Information regarding amenities, utilities and pets are on the the website.\nThe Glen at Shawmont Station is proud to host various food trucks almost weekly on the property.  Today, January 15, 2023, we have our Algorithms Vegan Food Truck here from 12 p.m. - 6 p.m. come on out and grab some lunch with them and meet other residents who live here!\nThe application process is easy.\n1.\tLocate the apartment you want to rent on www.theglenphilly.com and hit “select”.\n2.\tComplete the application on all parts and submit with the $500.00 security deposit and $50.00 application fee.\n3.\tSend proof of income and photo ID to  show contact info\n.\n4.\tIf approved with good credit your deposit remains $500.00.  Approved conditionally the deposit is one month’s rent, the $500.00 initial deposit will go towards that and you would owe the balance at move in.  If denied, the deposit is refunded in check form.\n5.\tIf you decide our community is not right for you after applying, you have 72 hours from applying to cancel in writing (email) to receive your refund of the $500.00.  The deposit is not refundable after 72 hours if you cancel your application.\n6.\tYour gross monthly income (this is income before taxes) must equal three times the monthly rent to be approved.  Incomes are combined.\n7.\tTwenty-four hours before move-in, you would pay your admin\/city fees of $330.00, any pet fees if applicable and the first month’s rent.\nApt. 714:  $1,825.00\/month for 2\/4\/2023 - PINK FLOORPLAN IN POSTED PICTURES\nThis is a top floor 1 bedroom + den apartment.  This unit has hardwood flooring throughout the main areas with carpet in the bedroom.  Video link is of a comparable unit not the exact unit.\nVirtual Tour: https:\/\/youtu.be\/hbaMHGDt39k\nApt. 322 (no dogs or cats allowed in this unit):  $1,825.00\/month for 3\/1\/2023 RED FLOORPLAN IN POSTED PICTURES\nThis is a top floor 1 bedroom + den apartment.  This unit is fully carpeted throughout the apartment.  Video link is of a comparable unit not the exact unit.\nVideo Tour: https:\/\/youtu.be\/MTVX7cduQWA\nApt. 923: $2,025.00\/month for 3\/18\/2023  GREEN FLOORPLAN IN POSTED PICTURES\nThis is a first floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms.  This unit has an enclosed balcony.  Video link is of the same style but not the exact apartment.\nVideo Tour:  https:\/\/youtu.be\/hgFCYkNVF4U\nApt. 323 (no cats or dogs allowed in this unit):  $2,195.00 for 3\/18\/2023  PURPLE FLOORPLAN IN POSTED PICTURES\nThis is a first floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms, an interior set of stairs going down once you open your front door, and has an enclosed balcony and an amazing view in a quiet corner of the property. Video link is of the same style but not the exact apartment.\nVideo Tour:  https:\/\/youtu.be\/dFtGuNN8rOc\nApt. 618:  $2,045.00\/month for 3\/24\/2023  GREEN FLOORPLAN IN POSTED PICTURES\nThis is a top floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms.  This unit has an enclosed balcony.  This unit is located in our outdoor stairwell and will have several steps up to your front door.  Video link is of the exact unit.\nVideo Tour:  https:\/\/youtu.be\/cOTefus-yA8\n","num_images":7.0,"lat":40.04474,"lng":-75.246906,"attrs":"['2BR \/ 2Ba', 'available mar 1', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T11:19:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-free-parking-food-trucks\/7578750536.html","post_id":7578750536,"result_date":"Sun Jan 15 2023 16:20:53 GMT+0000 ","title":"FREE PARKING & FOOD TRUCKS WHAT MORE DO YOU NEED?","description":"Thank you for your interest in The Glen at Shawmont Station Apartments.  Below is our current availability and pricing.  Below you will find information on each available unit as well as pre-recorded virtual tours.  If you’d like to apply to any of these units, you can do so at www.theglenphilly.com.  Information regarding amenities, utilities and pets are on the the website.\nThe Glen at Shawmont Station is proud to host various food trucks almost weekly on the property.  Today, January 15, 2023, we have our Algorithms Vegan Food Truck here from 12 p.m. - 6 p.m. come on out and grab some lunch with them and meet other residents who live here!\nThe application process is easy.\n1.\tLocate the apartment you want to rent on www.theglenphilly.com and hit “select”.\n2.\tComplete the application on all parts and submit with the $500.00 security deposit and $50.00 application fee.\n3.\tSend proof of income and photo ID to  show contact info\n.\n4.\tIf approved with good credit your deposit remains $500.00.  Approved conditionally the deposit is one month’s rent, the $500.00 initial deposit will go towards that and you would owe the balance at move in.  If denied, the deposit is refunded in check form.\n5.\tIf you decide our community is not right for you after applying, you have 72 hours from applying to cancel in writing (email) to receive your refund of the $500.00.  The deposit is not refundable after 72 hours if you cancel your application.\n6.\tYour gross monthly income (this is income before taxes) must equal three times the monthly rent to be approved.  Incomes are combined.\n7.\tTwenty-four hours before move-in, you would pay your admin\/city fees of $330.00, any pet fees if applicable and the first month’s rent.\nApt. 714:  $1,825.00\/month for 2\/4\/2023 - PINK FLOORPLAN IN POSTED PICTURES\nThis is a top floor 1 bedroom + den apartment.  This unit has hardwood flooring throughout the main areas with carpet in the bedroom.  Video link is of a comparable unit not the exact unit.\nVirtual Tour: https:\/\/youtu.be\/hbaMHGDt39k\nApt. 322 (no dogs or cats allowed in this unit):  $1,825.00\/month for 3\/1\/2023 RED FLOORPLAN IN POSTED PICTURES\nThis is a top floor 1 bedroom + den apartment.  This unit is fully carpeted throughout the apartment.  Video link is of a comparable unit not the exact unit.\nVideo Tour: https:\/\/youtu.be\/MTVX7cduQWA\nApt. 923: $2,025.00\/month for 3\/18\/2023  GREEN FLOORPLAN IN POSTED PICTURES\nThis is a first floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms.  This unit has an enclosed balcony.  Video link is of the same style but not the exact apartment.\nVideo Tour:  https:\/\/youtu.be\/hgFCYkNVF4U\nApt. 323 (no cats or dogs allowed in this unit):  $2,195.00 for 3\/18\/2023  PURPLE FLOORPLAN IN POSTED PICTURES\nThis is a first floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms, an interior set of stairs going down once you open your front door, and has an enclosed balcony and an amazing view in a quiet corner of the property. Video link is of the same style but not the exact apartment.\nVideo Tour:  https:\/\/youtu.be\/dFtGuNN8rOc\nApt. 618:  $2,045.00\/month for 3\/24\/2023  GREEN FLOORPLAN IN POSTED PICTURES\nThis is a top floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms.  This unit has an enclosed balcony.  This unit is located in our outdoor stairwell and will have several steps up to your front door.  Video link is of the exact unit.\nVideo Tour:  https:\/\/youtu.be\/cOTefus-yA8\n","num_images":7.0,"lat":40.044814,"lng":-75.246992,"attrs":"['1BR \/ 1.5Ba', 'available feb 4', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T11:16:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-open-house-food-truck\/7578749803.html","post_id":7578749803,"result_date":"Sun Jan 15 2023 16:18:46 GMT+0000 ","title":"Open House & Food Truck Event Today!","description":"Thank you for your interest in The Glen at Shawmont Station Apartments.  Below is our current availability and pricing.  Below you will find information on each available unit as well as pre-recorded virtual tours.  If you’d like to apply to any of these units, you can do so at www.theglenphilly.com.  Information regarding amenities, utilities and pets are on the the website.\nThe Glen at Shawmont Station is proud to host various food trucks almost weekly on the property.  Today, January 15, 2023, we have our Algorithms Vegan Food Truck here from 12 p.m. - 6 p.m. come on out and grab some lunch with them and meet other residents who live here!\nThe application process is easy.\n1.\tLocate the apartment you want to rent on www.theglenphilly.com and hit “select”.\n2.\tComplete the application on all parts and submit with the $500.00 security deposit and $50.00 application fee.\n3.\tSend proof of income and photo ID to  show contact info\n.\n4.\tIf approved with good credit your deposit remains $500.00.  Approved conditionally the deposit is one month’s rent, the $500.00 initial deposit will go towards that and you would owe the balance at move in.  If denied, the deposit is refunded in check form.\n5.\tIf you decide our community is not right for you after applying, you have 72 hours from applying to cancel in writing (email) to receive your refund of the $500.00.  The deposit is not refundable after 72 hours if you cancel your application.\n6.\tYour gross monthly income (this is income before taxes) must equal three times the monthly rent to be approved.  Incomes are combined.\n7.\tTwenty-four hours before move-in, you would pay your admin\/city fees of $330.00, any pet fees if applicable and the first month’s rent.\nApt. 714:  $1,825.00\/month for 2\/4\/2023 - PINK FLOORPLAN IN POSTED PICTURES\nThis is a top floor 1 bedroom + den apartment.  This unit has hardwood flooring throughout the main areas with carpet in the bedroom.  Video link is of a comparable unit not the exact unit.\nVirtual Tour: https:\/\/youtu.be\/hbaMHGDt39k\nApt. 322 (no dogs or cats allowed in this unit):  $1,825.00\/month for 3\/1\/2023 RED FLOORPLAN IN POSTED PICTURES\nThis is a top floor 1 bedroom + den apartment.  This unit is fully carpeted throughout the apartment.  Video link is of a comparable unit not the exact unit.\nVideo Tour: https:\/\/youtu.be\/MTVX7cduQWA\nApt. 923: $2,025.00\/month for 3\/18\/2023  GREEN FLOORPLAN IN POSTED PICTURES\nThis is a first floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms.  This unit has an enclosed balcony.  Video link is of the same style but not the exact apartment.\nVideo Tour:  https:\/\/youtu.be\/hgFCYkNVF4U\nApt. 323 (no cats or dogs allowed in this unit):  $2,195.00 for 3\/18\/2023  PURPLE FLOORPLAN IN POSTED PICTURES\nThis is a first floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms, an interior set of stairs going down once you open your front door, and has an enclosed balcony and an amazing view in a quiet corner of the property. Video link is of the same style but not the exact apartment.\nVideo Tour:  https:\/\/youtu.be\/dFtGuNN8rOc\nApt. 618:  $2,045.00\/month for 3\/24\/2023  GREEN FLOORPLAN IN POSTED PICTURES\nThis is a top floor 2 bedroom 2 bathroom apartment.  This unit has hardwood floors throughout the main area with carpet in the bedrooms.  This unit has an enclosed balcony.  This unit is located in our outdoor stairwell and will have several steps up to your front door.  Video link is of the exact unit.\nVideo Tour:  https:\/\/youtu.be\/cOTefus-yA8\n","num_images":7.0,"lat":40.044797,"lng":-75.247099,"attrs":"['2BR \/ 2Ba', 'available feb 4', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T11:14:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-take-deep-breath-and-relax\/7578749442.html","post_id":7578749442,"result_date":"Sun Jan 15 2023 16:17:46 GMT+0000 ","title":"Take a Deep Breath and Relax Here at Park Lane!","description":"Apt. 2410 — Oxford floor plan — 1,203 sq. ft. — $3,460\nThis 4th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-15T11:13:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7578743118.html","post_id":7578743118,"result_date":"Sun Jan 15 2023 15:58:40 GMT+0000 ","title":"Spacious 1 bedroom Apartment For Philadelphia!!","description":"Spacious 1 bedroom Apartment For Philadelphia!! All brand new kitchen, $520 a month. includes water, garbage new kitchen, new bath, new dual pane windows, new doors, new flooring, to qualify need decent credit, and verifiable source of income 3 times the rent. minimum Deposit $520 absolutely no large dogs, must be clean house keeper!! Maximum occupancy 3. Do not apply if more, If more occupants later, tenancy will be immediately terminated!! Laundry across the street. send your number for appointment i will contact you soon. olivia74020gmailcom\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmber Lake is surrounded by mature trees, plush landscaping, picturesque views and is nestled in a quiet tranquil community that is only minutes from Uptown Charlotte. With a caring and committed on-site property management team, our community is the PERFECT place to come home to. Family Charming community minutes from Uptown. We are Now Offering Virtual Tours :)\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff\nApplication Requirements:\n(1.) Picture ID (2.) Social Security Card or W7 (3.) No Felonies or Drug Charges (4.) Proof of Income (5.) Min of 6 months of employment with a current employer (6.) Monthly income 2.5 X (NET) rent amount (7) Security Deposit\n* Application Fee: $1.00 per person 18 and over\n* Administration Fee: $50.00\n* Security Deposit: starts at $750.00 w\/ approved credit\n****Apply online www.amberlakeapts.com****\n****Online apps must submit, ID, SS, most recent paystubs and, payments are required**\nCheck and like us on Facebook: Amber Lake Apartments","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T10:54:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/blooming-glen-three-tot-lots-with\/7578742995.html","post_id":7578742995,"result_date":"Sun Jan 15 2023 15:58:19 GMT+0000 ","title":"Three tot lots with modern play equipment, Pickle Ball Courts, Tennis","description":"Bedrooms: 2Bathrooms: 2.5Square Feet: 1660Date Available: 2023-01-15Address: One Applewood DriveHeritage Orchard Hill welcomes you to explore our 1-, 2-, and 3-bedroom Perkasie townhomes and schedule a tour to see everything our community has to offer. Enjoy beautiful apartment features, including 9-foot ceilings, a full-size in-unit washer\/dryer, a 3,300 sq. ft swimming pool, an on-site fitness center. Explore our photo gallery to see the contemporary, neutral decor and comfortable living spaces at Heritage Orchard Hill. Call  show contact info\nto speak to a leasing agent today and schedule a tour of your new home today or apply online!Learn more about all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.Our Leasing Office is ready to answer your questions about our luxury townhomes for rent in Perkasie, Pennsylvania. Whether you need extra space for remote working or virtual schooling, or just like to spend some time in a well-appointed townhome, we have the floor plans you are looking for. Reach out and let us show you how easy it is to move into our Bucks County townhomes today! Contact us today to schedule your self-guided or virtual tour! Amenities Include:Pickle Ball CourtsCommunity parties and events scheduled throughout the yearPet friendly (pets stay free)Pet parkScenic walking trails3,300 square foot swimming pool with adjacent baby pool1,800 square foot open-air deckThree tot lots with modern play equipmentMultiple shopping destinations just miles awayFitness center with high-tech sound system and televisions4,700 square foot clubhouse available for private partiesConvenient locationCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/3isy6jbs\/heritage-orchard-hill\n","num_images":6.0,"lat":40.3765,"lng":-75.2648,"attrs":"['2BR \/ 2.5Ba', '1660ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T10:54:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-modern-fully\/7578741260.html","post_id":7578741260,"result_date":"Sun Jan 15 2023 15:52:41 GMT+0000 ","title":"Nice Modern fully renovated 2bd 2ba apartment Philadelphia","description":"The amenities you'll find at 2bd 2ba modern apartment are high-quality additions to the beautiful living space. The fully equipped kitchen has all the tools you need to prepare your favorite dishes, with a stove, a refrigerator, and a microwave!\nAssigned parking is available ! In this apartment you will feel right at home in this unique and fully equipped with an island-designed kitchen, spacious bedrooms, over-sized walk-in closets, and luxurious balconie.\nTEXT OR CALL : (8 5 6) 9 0 0 - 9 7 9 6\n---\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n- -\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n- -\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n- -\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n- -\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n--\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n--\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-3719 Tully Rd., Suite C Modesto, CA 95350 1650 sq. ft. Owned by Phoenix Family LP …comfortable with 5-Built in Office desks and cabinets 4-desk areas in one location; 1-Glass Door Office for the Chief …ample amount of back hallway cabinets and shelving …large Reception area …Glass Housed Conference Room with an area that could be used as a Showroom …2-small tucked away cove areas where 2-small tables could fit …Kitchenette with Refrigerator, Dishwasher, Sink, Microwave, Restroom Area with Shower …Private Driveway Area to fit 1 & possibly 2-Vehicles …Slider Door by Kitchenette leads to Driveway and to Secluded Patio Areas …Parking for Clients too Includes Us putting your Company Name on the Front Door to Your Office Suite We are offering… 12-Month Leases $2600 Monthly Rent $2600 Security Deposit if approved on credit Many Large warehouses Available in Oregon Great for storage warehousing many offices and shipping docks 77,000 sq’ most all buildings are 50 foot wide 20 feet high ceilings 4 foot stem walls property is located on 5 .14 acres of recently partitioned land. Located on the I-5 corridor, a 1-hour drive from Portland International Airport, in the heart of the Willamette Valley-- Oregon’s premier agricultural area. Quit 'tele-commuting' from home. Private single office $395. Historic Building, wood floors with Conference and meeting room available. handicap bathrooms, kitchen facilities, center lobby, security and video surveillance with ample parking and ease of access, includes utilities, parking and WiFi. (2) Larger office available @ $450\/mo. (3) downstairs office available 1\/1\/2023 $375\/mo. I have a shop Available now it’s an 1000 Sq Ft. facility in Ceres Ca. Equipped With Office & Bathroom. Clean unit good for clean jobs, storage Great location off Hwy 99 &Whitmore in Ceres Ca. 2,000.00 Dollar Deposit Required. 50.00 dollar monthly common area fee. AVAILABLE NOW: Prime front spot in small office complex. 915 square feet; large tiled entry\/ reception area, large private office with built-in cupboards and book cases. Co-ed restroom in suite, small room for break room or file room. New energy efficient central heat and AC. Monthly rent $1,235.00, plus $90.00 cams. Professional Office suite, Corner Location, New Carpet & Fresh paint, UTILITIES PAID BY OWNER saving $195 per month. Light\/ Bright High Ceilings, Art Deco Single-Story Building. Location is Everything. This office has 2 large windows (Eye Level with natural light all day). Walking distance to Banks, Post office, Court House, Restaurants, Movie Theaters, Parks, and all Amenities of beautiful Downtown Modesto. Reasonably priced Considering Paid Utilities, good for one or two-person professional use. Few tenants have been here for more than twenty-five years. Suitable for CPA, Engineers, Architects, Consultants, Insurance, Medical Office, Photographers, Artist Studio, Designers, Real Estate, Law, General Office, etc. etc... If SERIOUS,TEXT OR CALL : (8 5 6) 9 0 0 - 9 7 9 6 Building 2,610 sqft plus yard space Private yard 21ft roll gate 2 large roll up doors 200 amp service Very tall ceilings Great storage space Can rent month to month Available now TEXT OR CALL : (8 5 6) 9 0 0 - 9 7 9 6 3,400 SF, (2,600 SF Warehouse, 800 SF Interior Office), plus 1,000 SF fenced\/gated side yard with a 360 SF storage container. Roll-up door, public bathroom, private offices. Building is monitored 24\/7 with video cameras for enhanced security. Property is fenced and gated. Quick and easy access to Highway 99. Other tenants are long term and quiet. Great space for Contractors, Auto Business, RV\/Boat\/Auto storage. Available Now. Office building For Sale or lease. Asking lease amount is $4500 per month gross. 17 offices with large reception area. 3 bathrooms. Across the street from the library. 5 parking spaces at the back of the building. Building for sale at $650,000.\n","num_images":6.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T10:48:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom\/7578736557.html","post_id":7578736557,"result_date":"Sun Jan 15 2023 15:45:42 GMT+0000 ","title":"Renovated 1 bedroom available now at 4800 Brown st!","description":"Experience forward-thinking urban living.\n1, 2 & 3 bedroom luxury loft-style apartments located in an affordable up-and-coming district just north of University City make up this 34-unit complex. We offer thoughtful architecture and design creating a contemporary feel in an old factory setting. Elevator access, stainless steel appliances including a dishwasher and garbage disposal, a multi-camera security system, intercom system with remote door buzzer, on-site laundry, high ceilings, custom cabinetry with self-closing hardware, granite counters, kitchen pantry, exposed brick & concrete in many units, tile flooring, central heat & air, LED lighting, extra large commercial sized windows, large closets and large bright common hallways will be more than enough to make you want to come home!\nLive the uptown urban lifestyle you crave!\nAmenities:\n-Water $35.00 per month\n-Elevator\n-Assigned gated parking available for car and scooters ($150 per space, coming Summer 2021)\n-Multi-camera security system\n-Intercom system with electronic door opener\n-On-site laundry\n-Choice of Comcast or Verizon\n-Full-size stainless steel appliances\n-Bus line at corner\n-Garbage disposal\n-High ceilings\n-Large closets\n-Custom cabinetry with self closing cabinet doors & drawers\n-Sinks with magnetic retractable faucet hose\n-Granite counters\n-Pantries\n-Exposed ductwork, brick & concrete floors\/ceilings (in some units)\n-Central air and heat\nIn addition to monthly rent, tenant is responsible for their own electricity bill, a water fee of $35 & a liability insurance fee of $9.50\nCall Alena fro showing at  show contact info\nCity wide realty\n","num_images":0.0,"lat":39.966337,"lng":-75.216657,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T10:33:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ridley-park-bedroom-ridley-creek-great\/7578725521.html","post_id":7578725521,"result_date":"Sun Jan 15 2023 14:58:58 GMT+0000 ","title":"1 Bedroom Ridley Creek - Great Location & Loads of Storage","description":"One bedroom in beautiful restored Victorian building. Apartment features an enormous amount of storage. free onsite laundry, and a cute enclosed, small turret room which is great spot to relax with a cup of coffee. This outstanding location is just a few walkable blocks from beautiful Ridley Park Lake and a few minutes from shops, restaurants, train station, and Taylor Hospital. Apartment is on the 3rd floor.","num_images":6.0,"lat":39.876012,"lng":-75.330433,"attrs":"['1BR \/ 1Ba', 'available jan 27', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T09:54:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-move-in-right-before-the\/7578713498.html","post_id":7578713498,"result_date":"Sun Jan 15 2023 14:26:50 GMT+0000 ","title":"Move in right before the holidays!","description":"Move in right before the holidays! 2 Bedroom,1 bathroom home. Beautifully renovated located 1\/4 mile from Bagley neighborhood just off of Wyoming & 6 Mile. The property has been completely remodeled from top to bottom featuring quartz countertops, new kitchen remodel, with beautiful bathroom updates & polished tile work. The property has new floors, and freshly been painted. Some of the historic elements were left in the home - Such as the natural fireplace, and beautiful 100 year old stained glass entrance door. The home also has a newer ac, and newer furnace. The property also features a full partially finished basement.","num_images":4.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', '1000ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T09:05:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-top-floor-br-hw-wd\/7578702147.html","post_id":7578702147,"result_date":"Sun Jan 15 2023 14:12:31 GMT+0000 ","title":"Large Top Floor 3 BR w\/ HW, WD, Central AC Avail Now in Old City!!!","description":"Large Top Floor 3 Bedroom with Hardwood Floors throughout, Central Air, Dishwasher, Gas Cooking and Washer\/Dryer. Pictures don't do it justice. Apartment is a fourth floor walk up although there is a small elevator that can be operated by maintenance for move in and move out. Available Now on one of the Best Blocks in Old City!!","num_images":5.0,"lat":40.0897,"lng":-74.9781,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T08:03:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7578708423.html","post_id":7578708423,"result_date":"Sun Jan 15 2023 13:45:44 GMT+0000 ","title":"Spacious 1 bedroom Apartment For Philadelphia !!","description":"Spacious 1 bedroom Apartment For Philadelphia !! All brand new kitchen, $500 a month. includes water, garbage new kitchen, new bath, new dual pane windows, new doors, new flooring, to qualify need decent credit, and verifiable source of income 3 times the rent. minimum Deposit $500 absolutely no large dogs, must be clean house keeper!! Maximum occupancy 3. Do not apply if more, If more occupants later, tenancy will be immediately terminated!! Laundry across the street. send your number for appointment i will contact you soon.krysta7744gmailcom\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmber Lake is surrounded by mature trees, plush landscaping, picturesque views and is nestled in a quiet tranquil community that is only minutes from Uptown Charlotte. With a caring and committed on-site property management team, our community is the PERFECT place to come home to. Family Charming community minutes from Uptown. We are Now Offering Virtual Tours :)\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff\nApplication Requirements:\n(1.) Picture ID (2.) Social Security Card or W7 (3.) No Felonies or Drug Charges (4.) Proof of Income (5.) Min of 6 months of employment with a current employer (6.) Monthly income 2.5 X (NET) rent amount (7) Security Deposit\n* Application Fee: $1.00 per person 18 and over\n* Administration Fee: $50.00\n* Security Deposit: starts at $750.00 w\/ approved credit\n****Apply online www.amberlakeapts.com****\n****Online apps must submit, ID, SS, most recent paystubs and, payments are required**\nCheck and like us on Facebook: Amber Lake Apartments\n","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T08:41:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-where-luxury-meets\/7578704466.html","post_id":7578704466,"result_date":"Sun Jan 15 2023 13:22:51 GMT+0000 ","title":"Where Luxury Meets Convenience!!","description":"Available Now\nApt. 2510 — Oxford floor plan — 1,203 sq. ft. — $3,510\nThis 5th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-15T08:18:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-coming-soon-built-in-1998\/7578692955.html","post_id":7578692955,"result_date":"Sun Jan 15 2023 13:03:21 GMT+0000 ","title":"Coming Soon! Built in 1998 loft style apartment with private balcony","description":"1847 E Cornwall St, Philadelphia, PA 19134\nComing Soon! Built in 2001 loft style apartment in Philadelphia, PA. Enter the front door and check out the soaring ceilings in the massive living room. Chef's kitchen features a huge island with quartz waterfall countertops, s\/s appliances, and a separate butler's station. Master on the main features electric shades and a private deck, perfect for enjoying your morning coffee outdoors. Master bath has separate vanities, shower, and tub. Large deck off living room and kitchen is great for entertaining.\nThe property resides in very close proximity to Fishtown; Center City is a short train ride away!\nBus Route and Train Station are within just a couple blocks! Easy Access to I-95, I-76, and everything Lehigh Ave and Aramingo Ave have to offer including amazing restaurants, nightlife, and shopping.","num_images":5.0,"lat":39.99748,"lng":-75.109851,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T06:27:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-finally-ready-bed-single\/7578698072.html","post_id":7578698072,"result_date":"Sun Jan 15 2023 12:44:41 GMT+0000 ","title":"Finally-ready 2-bed single family rental apt with separate balcony","description":"1328 S 9TH STREET, PHILADELPHIA, PA 19147\nFinally-ready 2-bed single family rental apartment with separate balcony. This beautiful unit features an amazing rooftop deck*We are now touring and leasing luxury rentals in one of the most exciting new apartment buildings around. Situated in the vibrant Passyunk Square neighborhood, this address puts you near the area's famous eclectic eateries and shops. A short distance to Bella Vista and the Italian Market, Queen Village, and Center City. Easily commute to nearby highway exits. These new-construction units were designed to create luxurious, contemporary living spaces combined with industrial-style exteriors. The apartments' interiors are extremely bright with windows in every room, soaring high ceilings, and hardwood flooring throughout. Ultra-modern kitchens fitted with Quartz stone counters, custom cabinetry, and a full stainless-steel, high-end appliances package. As you step in and closely observe the interior, you will easily notice how high-quality materials were used throughout. From the beautiful kitchens to the lavish baths, hand-picked superior finishes were put in for you to enjoy and for guests to admire. This bi-level floor plan was uniquely designed with 2.5 baths and its own large private deck! All the apartments are equipped with every modern feature such as in-unit laundry, central air systems, LED lights, key less entry, and video intercom.*There is currently 1 parking spot available in the building's private garage for an additional monthly fee*24\/7 video monitored exterior and hallways. Bike storage area.","num_images":4.0,"lat":39.932559,"lng":-75.159259,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T07:30:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bed-room-house-for-rent\/7578694718.html","post_id":7578694718,"result_date":"Sun Jan 15 2023 11:57:04 GMT+0000 ","title":"One bed room house for rent","description":"One bed room house with big  back yard.\nRent is $850 utilities are not included.","num_images":0.0,"lat":40.001525,"lng":-75.104197,"attrs":"['1BR \/ 1Ba', 'application fee details: $25 application fee', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-01-15T06:53:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/king-of-prussia-bed-bath-furnished-near\/7578692292.html","post_id":7578692292,"result_date":"Sun Jan 15 2023 11:20:45 GMT+0000 ","title":"4 bed 3 bath furnished - near UM township bldg","description":"Why rent a small apartment for $1800 when you can get an entire beautiful home with stunning sun room in the heart of King of Prussia for $1900?\nOne car garage included.\nWon't last long! Available Feb 1 2023.","num_images":18.0,"lat":40.104807,"lng":-75.371129,"attrs":"['4BR \/ 3Ba', '2600ft2', 'available feb 1', 'air conditioning', 'furnished', 'house', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T06:16:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-1219-wilder-st\/7578691718.html","post_id":7578691718,"result_date":"Sun Jan 15 2023 11:11:31 GMT+0000 ","title":"Welcome to 1219 Wilder St!","description":"Welcome to 1219 Wilder St! Perfectly situated in the heart of Passyunk Square; 1 block from the reimagined Columbus Park\/Dog Park, 2 blocks from grocery, 3 blocks from some  of the best restaurants, cafes, bars and shops in the city and a short walk to the subway! You will love cozying up to a good book, enjoying family time or entertaining in this open and airy, sun drenched living room\/dining room, which flows past the gorgeous original staircase and into the bright, updated kitchen.\nAmber Lake is surrounded by mature trees, plush landscaping, picturesque views and is nestled in a quiet tranquil community that is only minutes from Uptown Charlotte. With a caring and committed on-site property management team, our community is the PERFECT place to come home to. Family Charming community minutes from Uptown. We are Now Offering Virtual Tours :)\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff\nApplication Requirements:\n(1.) Picture ID (2.) Social Security Card or W7 (3.) No Felonies or Drug Charges (4.) Proof of Income (5.) Min of 6 months of employment with a current employer (6.) Monthly income 2.5 X (NET) rent amount (7) Security Deposit\n* Application Fee: $1.00 per person 18 and over\n* Administration Fee: $50.00\n* Security Deposit: starts at $750.00 w\/ approved credit\n***Apply online www.amberlakeapts.com***\n***Online apps must submit, ID, SS, most recent paystubs and, payments are required*\nCheck and like us on Facebook: Amber Lake Apartments\n","num_images":1.0,"lat":39.931656,"lng":-75.164602,"attrs":"['3BR \/ 2Ba', 'application fee details: App fee $15.50 (per person) & Processing fee $99 (non refundable)', \"broker fee details: Discounted broker's fee\", 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d hookups', 'listed by: $15.50 application fee, $99 No administration fee', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T06:07:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-duplex-cute-bedroom1-bath\/7578688846.html","post_id":7578688846,"result_date":"Sun Jan 15 2023 10:07:23 GMT+0000 ","title":"Duplex & Cute 1 bedroom,1 bath in Philadelphia!!","description":"Duplex & Cute 1 bedroom,1 bath in Philadelphia!!. All New Including Fully Applienced kitchen including dishwasher. Dining area, 1 bedrooms with closets in each. Huge Living Room with beautiful bay window. Additional closet in kitchen. Bathroom has full tub\/shower. Plenty of off street parking. Application fee $30 for background and credit check is required! If you interested please contact:-  show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmber Lake is surrounded by mature trees, plush landscaping, picturesque views and is nestled in a quiet tranquil community that is only minutes from Uptown Charlotte. With a caring and committed on-site property management team, our community is the PERFECT place to come home to. Family Charming community minutes from Uptown. We are Now Offering Virtual Tours :)\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff\nApplication Requirements:\n(1.) Picture ID (2.) Social Security Card or W7 (3.) No Felonies or Drug Charges (4.) Proof of Income (5.) Min of 6 months of employment with a current employer (6.) Monthly income 2.5 X (NET) rent amount (7) Security Deposit\n* Application Fee: $1.00 per person 18 and over\n* Administration Fee: $50.00\n* Security Deposit: starts at $750.00 w\/ approved credit\n****Apply online www.amberlakeapts.com****\n****Online apps must submit, ID, SS, most recent paystubs and, payments are required**\nCheck and like us on Facebook: Amber Lake Apartments\n","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T05:03:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-very-nice-newer-home\/7578684596.html","post_id":7578684596,"result_date":"Sun Jan 15 2023 08:57:07 GMT+0000 ","title":"Very nice newer home located on Bever Ave and sits at the end of the r","description":"* 12 month lease minimum, $180\/month DISCOUNT for first 4 months with a 16 month lease * One month's rent deposit, must make 2.5-3x the rent, a bare minimum of 550 credit score, no evictions or felonies on record. Available March 1st, 2023.\nEnjoy this quiet setting yet within walking distance to the shops, bars and restaurants of Fountain Square! Just a couple miles from Mass Ave and Downtown Indy, this 3 bedroom, 3 bathroom townhome is in a duplex that has been renovated. It has off-street parking and laundry hookups in the basement. Small, medium, and large bedrooms upstairs with a full bathroom. Half bath off of kitchen, living and dining rooms downstairs. There is a small, shared, easily maintained fenced-in yard. Central AC and heating. Brand new furnace and water heater. Pets negotiable. Sip a drink on the covered front porch with a lovely view of Pleasant Run trail. Fountain Square Brewing is within sight from the front yard! This is an owner-managed rental. Your credit and background check will be required. Please provide current paystubs and a government issued photo ID in order to schedule a viewing (you can block out sensitive information, this is to avoid wasting anyone's time). Tours mostly available weekdays after 3pm or weekends. We look forward to meeting you!\n","num_images":4.0,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 3Ba', '1576ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T03:30:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fantastic-locationhermans\/7578849625.html","post_id":7578849625,"result_date":"Sun Jan 15 2023 21:16:03 GMT+0000 ","title":"Fantastic LOCATION!*Herman's Coffee at the Corner!*RENOVATED 2Br HOUSE","description":"** There are showings scheduled at this house:\n- MONDAY JANUARY 16 at 3:30 PM;\n- TUESDAY JANUARY 17 at 6:15 PM.\nInterested in stopping by? Please do!\nTo attend this showing, you must text  show contact info\nin advance to confirm. **\n* Interested in seeing this house, maybe even on short notice? Email us from this listing or (especially for short-notice requests) text or call  show contact info\n. *\nMove into this RENOVATED & UPGRADED 3-story, 2-bedroom vintage 19th-century traditional \"trinity\" townhouse. This historic, uniquely Philadelphia-style home features refinished ORIGINAL hardwood floors and ceramic tiled kitchen & bathroom. There's central air conditioning throughout the house and your own washing machine & dryer in the basement. Plus a private patio & 2nd floor deck!\n** Yes it's quirky... a vintage 1800s Philly \"trinity\" house, with a bohemian 1970s renovation. This means incredible original hardwood floors and handcrafted kitchen cabinets, among other distinguishing characteristics. The house is newly upgraded with central a\/c, a stainless steel dishwasher, Ikea modular shelving system over the refrigerator and gas stove, and more! **\n304 Sears Street\nQueen Village Adjacent \/ Pennsport, Philadelphia\nMonthly Rent: $1495\nUtilities: Gas, Electric & Water on your own meters.\nLease: 1 year lease required, then month-to-month w\/winter term.\nMove-in: 1st & last month + security.\nPets: Cat or small dog considered with pet addendum and deposit.\nLiving Room: Solid wood door opens into super-cozy living room with original refinished hardwood floors & small coat closet. Keep walking to. . .\nKitchen\/Patio: . . .w\/Mexican ceramic tile floor set against original (now non-functioning) small fireplace. Handcrafted original wood kitchen cabinets remain from a rustic 1970s renovation. Clean white tile kitchen countertop & stainless steel sink with new dishwasher. Gas stove, refrigerator w\/modular Ikea shelving. Your kitchen screen door allows summer breezes from the rear private patio to cool the house.\nBasement: Your own washer & dryer + storage space!\nSecond floor: Original circular wood stairs lead up to 2nd floor hall w\/original hardwood plank flooring. Full bathroom at the front of the house with ceramic tile, vanity & medicine cabinet. 2nd floor bedroom also has hardwood floor with sliding glass doors opening onto a south-facing exterior deck.\nThird floor: Climb another set of circular steps to the top floor, where you'll find a second bedroom w\/original hardwood floors and a super-high vaulted ceiling. There's another small room on the third floor, too -- great as a computer room, home office, extra large walk-in closet, etc.\nLocation: You're just a few blocks south of Washington Avenue, right off one of Queen Village's main North\/South thoroughfares, East Moyamensing Avenue. Herman's Coffee and gourmet market is just a few steps from your front door! Don't miss the Vietnamese, Chinese, Korean & Mexican restaurants, supermarkets & stores on Washington Blvd, Front Street to Broad Street. Right around the corner is the Italian restaurant, Caffe Valentino. Even closer is our neighborhood beer garden, Pennsport Beer Boutique and their sister sandwich shop, Jaxx Steaks. Prefer fried chicken and homemade donuts? Federal Donuts is just a few blocks away. It's a 10-minute walk to the historic Italian Market & Pat's & Geno's Cheesesteaks. Also walk to South Street's shopping & restaurants. Pennsport is the home to Philadelphia's Mummers; \"2\" Street, just 2 blocks east, hosts street parties throughout the year.\n","num_images":24.0,"lat":39.931393,"lng":-75.150014,"attrs":"['2BR \/ 1Ba', '1050ft2', 'available jan 20', '\\nmonday 2023-01-16\\n', '\\ntuesday 2023-01-17\\n', 'application fee details: $35\/adult application', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T15:42:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-super-cute-bedroom\/7578847724.html","post_id":7578847724,"result_date":"Sun Jan 15 2023 21:10:49 GMT+0000 ","title":"Super cute 2 bedroom apartment with private yard in Port Richmond","description":"Available for March 1 (possibly sooner) is this super charming newly renovated 2 bedroom bi-level apartment with a private entrance at street level. Enter into a spacious living \/ dining room, beyond you will find a smaller kitchen but with a good amount of storage and counter space. All new appliances, including a gas range and dishwasher. There will also be custom upper shelves in the kitchen above the counters. Basement has laundry with a brand new washer and dryer, the basement is not finished but is good for storage. On the 2nd floor there are 2 bedrooms (one large and 1 small) and a great bathroom with a window and built-in shelving for additional storage. Private concrete yard with breezeway which leads to the street and is great for storing trash toters\/setting out trash easily. Central air \/ gas heat. PLEASE NOTE THIS IS STILL UNDERGOING CONSTRUCTION AND THE PHOTOS ARE NOT GREAT \/ AND APPLIANCES AREN'T IN YET. WILL UPDATE PICS AS SOON AS POSSIBLE.\n3174 Richmond Street, in the very heart of Port Richmond. This has a private entrance around the back on Emery Street. There are 2 other residential units in the building and a commercial space with entrances on Richmond Street. The commercial space is currently being built out to be a massage studio.\nThis is an A-Frame Constructs project, the people behind Martha, Sally, The Lunar Inn, Tiny's bottle Shop, Zig-Zag BBQ, Pizza Shackamaxon, plus many design driven residential properties.\nLocated on the main strip of Port Richmond and within a block or 2 of Reanimator Coffee, Lunar Inn Bar\/Restaurant, Tiny's Bottle Shop, Launderette Records to name a few. Many other cool shops \/ restaurants are just a few blocks away and Tacconelli's Pizzeria and Somerset Splits are a 5-10 minute walk. Some great Polish dining and markets are just around the corner on Allegheny Avenue as well. 1 minute drive to the 95 on-ramp, 10 minute drive to center city, 5 minute drive to Fishtown. Richmond Street has recently undergone an amazing transformation, and soon the Girard Avenue trolley that currently completes it's route in Fishtown will be making stops along Richmond Street. We're pet friendly and manage our own properties. Feel free to email me with any questions and to schedule a showing.","num_images":6.0,"lat":39.982688,"lng":-75.101976,"attrs":"['2BR \/ 1Ba', 'available mar 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T15:37:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2202-venango-st-pa-new-2br\/7578851761.html","post_id":7578851761,"result_date":"Sun Jan 15 2023 21:09:54 GMT+0000 ","title":"2202 W Venango St *(PA)* NEW 2BR@!! FOR RENT: $850\/m*","description":"NEW 2 bedroom 2 bath in for rent in Albany, NY,. Available mid\/late Jan.: insulation, drywall. furnace, AC water heater, bath, kitchen, doors, floors, trim, lights, even outlets and switches! Washer\/dryer in unit. Rent covers lawn, sewer, and garbage. Must show income 1 times rent. Must pay for security\/credit report. Cats or dogs Ok. Non-smoker. $850. It has an open kitchen\/dining area with a deck off the kitchen, large living room, dry basement for extra storage, and the yard allows ample off-street parking. The house does need some TLC, is well insulated, and has a newer roof.","num_images":4.0,"lat":40.009341,"lng":-75.164609,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T15:48:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-1st-floor-upgraded-bed\/7578854671.html","post_id":7578854671,"result_date":"Sun Jan 15 2023 21:01:21 GMT+0000 ","title":"1st Floor Upgraded 1 Bed, 1 Bath! Easy Access to Apartment Home!","description":"Community Location: 1515 Manley Rd - West Chester, PA 19380 Rental Information: $1952 - $2779\/Month | 1 Bedroom 1 Bath | 842 sq ftLeasing Options:  3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthUpgraded ApartmentApartment Amenities:  ❖ Alarm❖ Cable Ready❖ Carpet❖ Den❖ Dining Room❖ Dishwasher❖ Refrigerator, Freezer, Ice Maker❖ Trash Compactor❖ Tub\/Shower❖ Window Coverings❖ Built-In Microwave Oven❖ Disability Access (select homes)❖ Frost-Free Refrigerator\/Ice Maker❖ Garden\/Spa Tub (select homes)❖ Gas Fire Place (select homes)❖ Large Windows❖ Private Entrance To Each Unit❖ Upgrade❖ Vaulted Ceiling (select homes)❖ Wooded View\/Pool View (select homes)Property Features: ❖ Business Center❖ Clubhouse❖ Fitness Center❖ Onsite Maintenance❖ Onsite Management❖ Package Service❖ Picnic and Grilling Area❖ Pool and Sundeck❖ Storage Space❖ Walking\/Biking Trails❖ Across From Wawa & Goshen Crossing Shopping Center❖ Beautifully Landscaped Grounds❖ Garages For Lease❖ Gated Entrances❖ Maintenance Free Lifestyle❖ Onsite Leasing Office❖ Relaxing Fire Pit❖ Resort-Style Pool With Sun Deck❖ Storage Units For Lease❖ Wi-Fi Access in Clubhouse and at Pool Description: Residents of our West Chester, PA apartments enjoy a spacious one or two bedroom floor plan which adds warmth and comfort to any lifestyle. The Gateway provides a number of lavish amenities, including a full kitchen, 9-foot ceilings, walk-in closets, and large windows. Our premier location is close to public transportation and the most prominent dining, shopping, and recreational venues in the area, making our community perfect for commuters all across Chester County. Schedule a tour of our West Chester community today and see why residents love coming home.Pets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonCall: The Gateway Apartments at  show contact info\nFacebook: https:\/\/www.facebook.com\/TheGatewayApartmentsAParadiseManagementCommunity\/ Website: https:\/\/www.thegatewayapartments.com\/All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY66333F8967D246\n","num_images":21.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '842ft2', 'available feb 23', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T15:57:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-sunny-new-refreshed\/7578847444.html","post_id":7578847444,"result_date":"Sun Jan 15 2023 20:40:34 GMT+0000 ","title":"Bright & Sunny New Refreshed 2 Bedroom Apartment","description":"Newly refreshed, bright & sunny, 2 bedroom, 1 bath apartment is conveniently located at the corner of Cranston & Ford Rd with new amenities including new kitchen flooring, new ceiling fans in bedrooms & kitchen eating area, and brand new central heating & cooling system with a new digital thermostat that is dedicated for this apartment. There is ample storage in this apartment including a pantry closet in the kitchen, two hallway closets, and closets in each bedroom.\nThe apartment has been freshly painted and the unit has a dedicated washer \/ dryer for the unit which is located in the basement. The kitchen includes a gas stove, refrigerator, and a garbage disposal. The unit includes a storage area in the basement, garage storage, and a dedicated parking spot in the rear of the building. The unit is located on the second floor which also includes a balcony.\nThe apartment is conveniently located within walking distance to several shopping centers and to public transportation. The dedicated parking spot at the rear of the building allows the tenant to quickly walk around the corner to enter the front door.\nTenant is responsible for electric and gas utilities. Landlord is responsible for water and maintenance. This is for a 1 year lease at a minimum and the monthly rent is $1,300. First, last, and security deposit required at time of lease signing.\nThere will be an open house next Saturday, 1\/21\/23 from 10 AM - 12 PM.\n","num_images":17.0,"lat":40.000026,"lng":-75.209695,"attrs":"['2BR \/ 1Ba', '800ft2', 'available now', '\\nsaturday 2023-01-21\\n', 'air conditioning', 'application fee details: Application fee for credit check.', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T15:36:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bi-level1-bedroom-bathroom\/7578841916.html","post_id":7578841916,"result_date":"Sun Jan 15 2023 20:25:45 GMT+0000 ","title":"Bi-level1 Bedroom 1 Bathroom Apartment In Graduate Hospital With Grea","description":"Amazing 1 bedroom, 1 bathroom apartment in Philadelphia. Amenities included: central air, central heat, dishwasher, hardwood floors, updated kitchen, updated bathroom, laundry in building, and yard. Utilities included: water. Is not pet friendly. Date Available: Mar 1st 2023. $1,600\/month rent.","num_images":8.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '1000ft2', 'available mar 1', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-01-15T15:21:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-point-breeze-townhome-with\/7578837575.html","post_id":7578837575,"result_date":"Sun Jan 15 2023 20:21:26 GMT+0000 ","title":"Point Breeze townhome with 2 beds, 1 bath,","description":"South Philadelphia West Property Address   2005 Mercy St  Philadelphia, PA 19145  Text\/call   show contact info\nPoint Breeze townhome with 2 beds, 1 bath, yard, and ample sized basement. Kitchen features granite and stainless countertops, plenty of shaker cabinets, glass tile backsplash and wood look vinyl floor. Upstairs you will find 3 spacious bedrooms with closet space and glistening hardwood flooring. Enjoy relaxing in the comfy cast iron tub in the retro styled bathroom. Large basement includes washer\/dryer and freshly painted walls and flooring. Great opportunity for additional room or can be used for plenty of storage. Within walking distance you can find many opportunities for food, shops, public parks, and public transportation.\t\t\t\t\t    Floor Plan Details  Name: Balcony  2 Bedrooms \/ 1 Bathrooms 780Sq. Ft. $850.00   Community Amenities  Game Room 24-hour Front Desk Residential Lounge Pet Free Community Lobby & Reception Area Convenience Store OnSite 24-Hour Emergency Maintenance Accepts Electronic Payment Outdoor Pool Sports Court Playground, Picnic Area with Grilling Stations Fitness Center Assigned Garage Parking On Site Maintenance On Site Management Close to Public Transportation  Property Contact\nADA ACCESSIBLE EQUAL HOUSING OPPORTUNITY\n","num_images":12.0,"lat":39.926052,"lng":-75.179222,"attrs":"['2BR \/ 1Ba', '780ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T15:10:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-putting-green-pet-spa\/7578836970.html","post_id":7578836970,"result_date":"Sun Jan 15 2023 20:12:54 GMT+0000 ","title":"Putting Green , Pet Spa, Clubhouse with Game Room","description":"Home is where the heart is, and here at The Point at Glen Mills, it's never been easier to love where you live. Contact us today to schedule your tour. You'll be glad you did!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with granite countertops, stainless steel appliances and a breakfast bar. this unit also features a large entry closet, full sized washer\/dryer, linen closets, and a private balcony. The bedrooms features walk-in closets, and ensuite bathrooms.\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1095ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-01-15T15:08:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-spacious-and-elegant-youve\/7578832980.html","post_id":7578832980,"result_date":"Sun Jan 15 2023 20:02:12 GMT+0000 ","title":"Spacious and elegant! You've found your ideal 2 bed \/ 2 bath!","description":"The Gateway ApartmentsVisit Our Community Today!1515 Manley Rd West Chester, PA 19380  show contact info\nConveniently located in prestigious Chester County, The Gateway offers unique one and two bedroom apartments with den options in a beautiful setting. Commbine the comforts of home with superior resident services and amenities such as our resort style pool, business center, fitness center, and walking trail.Bedrooms: 2 |  Bathrooms:  2  Square Footage: 1199 sq ft Rental Pricing: $2549 - $3132\/Month  Our Residents Enjoy:  ➢ Business Center➢ Clubhouse➢ Fitness Center➢ Onsite Maintenance➢ Onsite Management➢ Package Service➢ Picnic and Grilling Area➢ Pool and Sundeck➢ Storage Space➢ Walking\/Biking Trails➢ Across From Wawa & Goshen Crossing Shopping Center➢ Garages For Lease➢ Maintenance Free Lifestyle➢ Onsite Leasing Office➢ Pet-Friendly➢ Relaxing Fire Pit➢ Resort-Style Pool With Sun Deck➢ Storage Units For Lease➢ Three BBQ\/Picnic Areas➢ Wi-Fi Access in Clubhouse and at Pool This Unit Comes With: ➢ Air Conditioning & Heating➢ Carpet➢ Dining Room➢ Dishwasher➢ Garbage Disposal➢ High Speed Internet Access➢ Refrigerator, Freezer, Ice Maker➢ Trash Compactor➢ Tub\/Shower➢ Walk-In Closets➢ Built-In Computer Nook (select homes)➢ Frost-Free Refrigerator\/Ice Maker➢ Gas Fire Place (select homes)➢ Kitchen Pantry➢ Large Windows➢ Mini Blinds On All Windows➢ Private Entrance To Each Unit➢ Vaulted Ceiling (select homes)➢ Washer And Dryer In Each Apartment Home➢ Wired For High-Speed InternetWebsite: https:\/\/www.thegatewayapartments.com\/ Phone-Number:  show contact info\nPet-Policy: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonLease-Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthCall for Directions  All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYFC0F0603CBEC49\n","num_images":14.0,"lat":39.967056,"lng":-75.529129,"attrs":"['2BR \/ 2Ba', '1199ft2', 'available now', 'air conditioning', 'application fee details: 60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T14:58:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7578831384.html","post_id":7578831384,"result_date":"Sun Jan 15 2023 19:57:26 GMT+0000 ","title":"🏘️Spacious 1 bedroom Apartment for Philadelphia","description":"🏘️Spacious 1 bedroom Apartment for Philadelphia!! All brand new kitchen, $500 a month. includes water, garbage new kitchen, new bath, new dual pane windows, new doors, new flooring, to qualify need decent credit, and verifiable source of income 3 times the rent. minimum Deposit $550 absolutely no large dogs, must be clean house keeper!! Maximum occupancy 3. Do not apply if more, If more occupants later, tenancy will be immediately terminated!! Laundry across the street. send your number for appointment i will contact you soon. jessicaneff08gmailcom.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmber Lake is surrounded by mature trees, plush landscaping, picturesque views and is nestled in a quiet tranquil community that is only minutes from Uptown Charlotte. With a caring and committed on-site property management team, our community is the PERFECT place to come home to. Family Charming community minutes from Uptown. We are Now Offering Virtual Tours :)\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff\nApplication Requirements:\n(1.) Picture ID (2.) Social Security Card or W7 (3.) No Felonies or Drug Charges (4.) Proof of Income (5.) Min of 6 months of employment with a current employer (6.) Monthly income 2.5 X (NET) rent amount (7) Security Deposit\n* Application Fee: $1.00 per person 18 and over\n* Administration Fee: $50.00\n* Security Deposit: starts at $750.00 w\/ approved credit\n****Apply online www.amberlakeapts.com****\n****Online apps must submit, ID, SS, most recent paystubs and, payments are required**\nCheck and like us on Facebook: Amber Lake Apartments\n","num_images":3.0,"lat":39.9548,"lng":-75.1843,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T14:53:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-apartment\/7578829841.html","post_id":7578829841,"result_date":"Sun Jan 15 2023 19:53:07 GMT+0000 ","title":"🏘️ Spacious 1 bedroom Apartment for Philadelphia","description":"🏘️Spacious 1 bedroom Apartment for Philadelphia!! All brand new kitchen, $500 a month. includes water, garbage new kitchen, new bath, new dual pane windows, new doors, new flooring, to qualify need decent credit, and verifiable source of income 3 times the rent. minimum Deposit $550 absolutely no large dogs, must be clean house keeper!! Maximum occupancy 3. Do not apply if more, If more occupants later, tenancy will be immediately terminated!! Laundry across the street. send your number for appointment i will contact you soon. jessicaneff08gmailcom.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAmber Lake is surrounded by mature trees, plush landscaping, picturesque views and is nestled in a quiet tranquil community that is only minutes from Uptown Charlotte. With a caring and committed on-site property management team, our community is the PERFECT place to come home to. Family Charming community minutes from Uptown. We are Now Offering Virtual Tours :)\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff\nApplication Requirements:\n(1.) Picture ID (2.) Social Security Card or W7 (3.) No Felonies or Drug Charges (4.) Proof of Income (5.) Min of 6 months of employment with a current employer (6.) Monthly income 2.5 X (NET) rent amount (7) Security Deposit\n* Application Fee: $1.00 per person 18 and over\n* Administration Fee: $50.00\n* Security Deposit: starts at $750.00 w\/ approved credit\n****Apply online www.amberlakeapts.com****\n****Online apps must submit, ID, SS, most recent paystubs and, payments are required**\nCheck and like us on Facebook: Amber Lake Apartments\n","num_images":1.0,"lat":39.967,"lng":-75.177,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T14:49:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-port-richmond-house\/7578827858.html","post_id":7578827858,"result_date":"Sun Jan 15 2023 19:47:47 GMT+0000 ","title":"Port Richmond House","description":"Newly renovated two bedroom house. Off street parking .  Finished basement with laundry room and enclosed patio .  Lots of storage space.  New flooring and  freshly paint throughout house.  New granite countertops,  refrigerator and microwave.  Close to shopping, restaurants and recreation center.  Exit ramp to  I-95 , 76 and New Jersey bridges are minutes away.","num_images":11.0,"lat":39.989946,"lng":-75.097327,"attrs":"['2BR \/ 1.5Ba', '1200ft2', 'available feb 3', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T14:43:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-fairmount-1br-1ba\/7578827414.html","post_id":7578827414,"result_date":"Sun Jan 15 2023 19:46:39 GMT+0000 ","title":"Large Fairmount 1+BR \/ 1BA, Prime Location, Corner Unit","description":"Unfurnished 1+BR \/ 1BA apartment in prime Fairmount location available now!\nIncludes bonus space that can be used as office (or small 2nd BR). Open Kitchen \/ Living \/ Dining Room. Stacking washer \/ dryer.\nIdeal location Steps from Fairmount ave restaurants and bars. Walk or bike everywhere else. ~10 min to Art Museum, Rodin Museum, Eakins Oval, Whole Foods, Kelly Drive, etc.\n- $1,500 \/ Month + Electric + Cable \/ internet\n- Heat and Water Included\n- No Parking Included (street parking)\n- No Smoking\n- Available Now\nText Paul at  show contact info\nto schedule a showing.\n","num_images":22.0,"lat":39.967372,"lng":-75.177015,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T14:42:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-massive-bd-ba-attached\/7578819773.html","post_id":7578819773,"result_date":"Sun Jan 15 2023 19:45:08 GMT+0000 ","title":"Massive * 3 BD ! 2 BA - Attached Garage","description":"Kitchen fire leads to ALL NEW 3 bedroom 2 bath Davis. Available mid\/late Jan. About 940 square feet. NEW: insulation, drywall. furnace, AC water heater, bath, kitchen, doors, floors, trim, lights, even outlets and switches! Washer\/dryer in unit. Rent covers lawn, sewer, and garbage. Close to highways. PICS coming as remodel is completed. Must show income 1 times rent. Must pay for security\/credit report.cats or dogs Ok. Non-smoker. $1300 rent plus $1300 security deposit. It has an open kitchen\/dining area with a deck off the kitchen, large living room, dry basement for extra storage, and the yard allows ample off-street parking. The house does need some TLC, is well insulated, and has a newer roof.**If you are interested please respond  show contact info\nThanks","num_images":3.0,"lat":39.9523,"lng":-75.1638,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T14:22:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-two-bd-two-ba\/7578822924.html","post_id":7578822924,"result_date":"Sun Jan 15 2023 19:34:32 GMT+0000 ","title":"- Renovated Two BD Two BA apartment available - Modern","description":"Spacious layouts welcome you home, along with exceptional service and an ideal location for shopping and dining options. You will love the open-concept floorplan with fresh neutral paint throughout the interior and easy-care laminate flooring.\nThe living area opens to the bright kitchen.\nIn this apartment you will feel right at home in this unique and fully equipped with an island-designed kitchen, spacious bedrooms, over-sized walk-in closets, and luxurious balconie. Designed to create a welcoming atmosphere for you and your guestsContact me directly:  aptrents@qmailads.me---\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n-\n-\n-\n----\n-\n-\n-\n-\n----2017 WADE HAMPTON BLVD near Pine Knoll Drive\n-------------Shown by appointment only----call 7 3 2 --2 2 1-- 3 9 0 0\nSpace is presently occupied by very sucessful-- STATE of the ART --high-end SALON,\nwhich business can be purchased as a Turn key for as little as $21,000\nA Great opportunity for the right person.......take advantage of that offering while still available.\nIn the six years Salon has been there, location has been so successful they were able to buy their own building !\nBelow market rent $2250, perfect managable size1500sf, flexible lease terms, If interested target takeover Feb '23\nVery strong High Traffic Location next to CYCLE-GEAR, opposite WALMART at 2017 Wade Hampton Blvd\nOur virtual office solution at Merovan gives you the flexibility you need to conduct your business and best of all, it is easy and affordable! Having a virtual office with The Office Centers requires little start up and no long term commitment.  show contact info\n, or go to www.theofficecenters.com\nWe provide virtual packages to fit every need.\n$159\/Month Virtual Package Includes:\n- Access to copy\/scan\/print\/fax center\n- Business identity at our physical address at 1200 Woodruff Road, A-3\n- Use of building during normal business hours\n- Mailing address\/mail collection\n- 8 hours per month of conf. room or day office time\n- phone number with receptionist answering your calls in your company name\nCheck out our youtube video here: https:\/\/www.youtube.com\/watch?v=4-KCHlk395I\nOur business is a multi-purpose warehouse facility located in the heart of the city. The warehouse boasts 25,000 sq ft of total space, with 12,000 sq ft of open space. The warehouse is suitable for a wide range of activities, including work and storage.\nThe facility is equipped with a sprinkler system for fire safety, as well as three offices for meetings or private work. We also have two ground-level doors for easy access and a semitruck docking area for larger deliveries. Additionally, there are 20 parking spaces available on-site.\nOur warehouse facility is perfect for businesses looking for a flexible and versatile space to conduct their operations. Whether you need a place to manufacture goods, store inventory, or host events, we have the space and amenities to meet your needs. Contact us today to learn more about how we can help your business thrive.\nClose to I-85, 2,400 sq ft, heated and cooled, two large doors, two walkin doors, one bathroom. Gaffney, SC\ncall  show contact info\nand leave message for information.\n400sqft warehouse with bath room for rent in an industrial park with fence with coded access. Located near White Horse Rd. 200 amp power. Rent is $650 with $650 Deposit. NO AUTO REPAIR. Call Charles @  show contact info\n.\n2800 sqft warehouse for rent with bath room access. Property is fenced with electronic coded gate to limit access.\nNo auto mechanics shops. Location is only 2 miles from I85. Call Charles @ show contact info\n. Rent $1500 deposit $1500.\nBrick Office Building in Executive Office Park\nLocated 15 miles from downtown Greenville and 10 miles from I-85 Access\nImpressive exterior with renovated interior\nHigh ceilings and floor to ceiling windows allow plenty of natural light\nParking for 35 vehicles\nMonument Signage Available\nLarge conference room, multiple bathrooms, private offices, storage, coffee bar, etc.\nLease rate is NNN ($3.25\/SF)\nEmail today for floor-plans or to request a site tour.\nPrime Realty Commercial Division is proud to present the opportunity to pre-lease retail space in the quickly changing Poinsett Highway between Greenville and Travelers Rest, South Carolina. This concept development could house many concepts, brewery\/coffee shop, marketing office or retail space.\n1209 Poinsett Highway is 1,200 SF, with great road frontage. 1215 Poinsett Highway is located next door and boasts 3 different building units with 7,720 SF of space to develop. Traffic patterns provided by SCDOT show roughly 25,000+ daily vehicle traffic that pass on Poinsett Highway in this specific area.\nHIGHLIGHTS\n- 8,920 +\/- SF total\n- Multiple tenants welcome\n- Existing building\n- Soft renovations necessary once lease is secured\n- Ideal for brewery, food concept, retail location, coffee\/roastery\nAn opportunity to pre-lease street retail space on S Pleasantburg Drive near August Road. Room for 1 or 2 tenants based on needs. Would be ideal for dog boarding\/daycare, coffee shop, retail, office, or brewery concept. An adjoining lot is potentially available for use.\nThis location allows for convenient access to I-85 and I-385 and is minutes away from Downtown Greenville, SC. Traffic patterns provided by SCDOT show roughly 22,000+ daily vehicle traffic that pass on Pleasantburg in this specific area. *Photos included are renderings of the existing building after renovations. Soft renovations necessary once lease is secured.*\nTwo spaces available for lease in a popular strip center! Surrounding businesses include pet grooming, clothing boutique, real estate agency, beauty salon, home health care, and an event space. This property is located near the heart of Mauldin, SC and is close to several schools \/ after school centers, grocery stores, restaurants and other retail shoppings stores. Paved, onsite parking available.\nUnit J has been recently refreshed with a new bathroom and interior paint, and Unit F is getting the same upgrade. *Exterior photos are renderings of what the existing building will look like after renovations. Renovations currently in progress.\n3719 Tully Rd., Suite C\nModesto, CA 95350\n1650 sq. ft.\nOwned by Phoenix Family LP\n…comfortable with 5-Built in Office desks and cabinets\n4-desk areas in one location; 1-Glass Door Office for the Chief\n…ample amount of back hallway cabinets and shelving\n…large Reception area\n…Glass Housed Conference Room with an area that could be used as a Showroom\n…2-small tucked away cove areas where 2-small tables could fit\n…Kitchenette with Refrigerator, Dishwasher, Sink, Microwave, Restroom Area with Shower\n…Private Driveway Area to fit 1 & possibly 2-Vehicles\n…Slider Door by Kitchenette leads to Driveway and to Secluded Patio Areas\n…Parking for Clients too\nIncludes Us putting your Company Name on the Front Door to Your Office Suite\nWe are offering…\n12-Month Leases\n$2600 Monthly Rent\n$2600 Security Deposit if approved on credit\nMany Large warehouses Available in Oregon\nGreat for storage warehousing many offices and shipping docks\n77,000 sq’ most all buildings are 50 foot wide 20 feet high ceilings 4 foot stem walls property is located on 5 .14 acres of recently partitioned land. Located on the I-5 corridor, a 1-hour drive from Portland International Airport, in the heart of the Willamette Valley-- Oregon’s premier agricultural area.\nQuit 'tele-commuting' from home. Private single office $395. Historic Building, wood floors with Conference and meeting room available. handicap bathrooms, kitchen facilities, center lobby, security and video surveillance with ample parking and ease of access, includes utilities, parking and WiFi. (2) Larger office available @ $450\/mo. (3) downstairs office available 1\/1\/2023 $375\/mo.\nI have a shop Available now it’s an 1000 Sq Ft. facility in Ceres Ca. Equipped With Office & Bathroom.\nClean unit good for clean jobs, storage\nGreat location off Hwy 99 &Whitmore in Ceres Ca.\n2,000.00 Dollar Deposit Required.\n50.00 dollar monthly common area fee.\nAVAILABLE NOW: Prime front spot in small office complex. 915 square feet; large tiled entry\/ reception area, large private office with built-in cupboards and book cases. Co-ed restroom in suite, small room for break room or file room. New energy efficient central heat and AC. Monthly rent $1,235.00, plus $90.00 cams.\nProfessional Office suite, Corner Location, New Carpet & Fresh paint, UTILITIES PAID BY OWNER saving $195 per month. Light\/ Bright High Ceilings, Art Deco Single-Story Building. Location is Everything. This office has 2 large windows (Eye Level with natural light all day). Walking distance to Banks, Post office, Court House, Restaurants, Movie Theaters, Parks, and all Amenities of beautiful Downtown Modesto. Reasonably priced Considering Paid Utilities, good for one or two-person professional use. Few tenants have been here for more than twenty-five years. Suitable for CPA, Engineers, Architects, Consultants, Insurance, Medical Office, Photographers, Artist Studio, Designers, Real Estate, Law, General Office, etc. etc...\nIf SERIOUS, please call  show contact info\nBuilding 2,610 sqft plus yard space\nPrivate yard\n21ft roll gate\n2 large roll up doors\n200 amp service\nVery tall ceilings\nGreat storage space\nCan rent month to month\nAvailable now\nText Ken\nshow contact info\n3,400 SF, (2,600 SF Warehouse, 800 SF Interior Office), plus 1,000 SF fenced\/gated side yard with a 360 SF storage container. Roll-up door, public bathroom, private offices. Building is monitored 24\/7 with video cameras for enhanced security. Property is fenced and gated. Quick and easy access to Highway 99. Other tenants are long term and quiet.\nGreat space for Contractors, Auto Business, RV\/Boat\/Auto storage.\nAvailable Now.\nOffice building For Sale or lease. Asking lease amount is $4500 per month gross. 17 offices with large reception area. 3 bathrooms. Across the street from the library. 5 parking spaces at the back of the building. Building for sale at $650,000.","num_images":8.0,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T14:30:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-nicely-bed-bath-apt-for-rent\/7578821826.html","post_id":7578821826,"result_date":"Sun Jan 15 2023 19:31:31 GMT+0000 ","title":"NICELY ,1 bed 1 bath apt for rent Philadelphia, PA!!","description":"NICELY ,1 bed 1 bath apt for rent Philadelphia, PA!!!!,If you interested please contact.  show contact info\nWasher\/dryer in unit. Rent covers lawn, sewer, and garbage. Close to highways. PICS coming as remodel is completed. Must show income 1 times rent. Must pay for security\/credit report. cats or dogs Ok. Non-smoker. $789. It has an open kitchen\/dining area with a deck off the kitchen, large living room, dry basement for extra storage, and the yard allows ample off-street parking. The house does need some TLC, is well insulated, and has a newer roof.**If you are interested please text:-- If you interested please contact:  show contact info\nThanks\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff ,If you interested please contact:  show contact info","num_images":4.0,"lat":39.9375,"lng":-75.2637,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T14:27:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-bed-bath-apt-for\/7578820664.html","post_id":7578820664,"result_date":"Sun Jan 15 2023 19:28:23 GMT+0000 ","title":"Available , 2 bed 1 bath apt for rent in Philadelphia","description":"Available , 2 bed 1 bath apt for rent in Philadelphia!!!!,If you interested please contact:  show contact info\n. Available mid\/late Jan.: insulation, drywall. furnace, AC water heater, bath, kitchen, doors, floors, trim, lights, even outlets and switches! Washer\/dryer in unit. Rent covers lawn, sewer, and garbage. Close to highways. PICS coming as remodel is completed. Must show income 1 times rent. Must pay for security\/credit report. cats or dogs Ok. Non-smoker. $920. It has an open kitchen\/dining area with a deck off the kitchen, large living room, dry basement for extra storage, and the yard allows ample off-street parking. The house does need some TLC, is well insulated, and has a newer roof.**If you are interested please text:-- If you interested please contact:  show contact info\nThanks\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff ,If you interested please contact:  show contact info","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T14:24:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-bed-bath-apt-for-rent\/7578818387.html","post_id":7578818387,"result_date":"Sun Jan 15 2023 19:22:17 GMT+0000 ","title":"Cozy, 2 bed 2 bath apt for rent in Philadelphia!","description":"Cozy, 2 bed 2 bath apt for rent in Philadelphia!!!!,If you interested please contact:   show contact info\n. Available mid\/late Jan.: insulation, drywall. furnace, AC water heater, bath, kitchen, doors, floors, trim, lights, even outlets and switches! Washer\/dryer in unit. Rent covers lawn, sewer, and garbage. Close to highways. PICS coming as remodel is completed. Must show income 1 times rent. Must pay for security\/credit report.cats or dogs Ok. Non-smoker. $745. It has an open kitchen\/dining area with a deck off the kitchen, large living room, dry basement for extra storage, and the yard allows ample off-street parking. The house does need some TLC, is well insulated, and has a newer roof.**If you are interested please text:-- If you interested please contact:   show contact info\nThanks\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff ,If you interested please contact:   show contact info","num_images":3.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'detached garage', 'rent period: monthly']","posted_date":"2023-01-15T14:18:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-stainless-steel-appliances\/7578818021.html","post_id":7578818021,"result_date":"Sun Jan 15 2023 19:21:18 GMT+0000 ","title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-15T14:17:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-professionally-managed\/7578817623.html","post_id":7578817623,"result_date":"Sun Jan 15 2023 19:20:19 GMT+0000 ","title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nWhen you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nApartment Features\n* Linen Closet\n* Disposal\n* Stainless Steel Appliances\n* Central Heat and Air\n* Ceiling Fan\n* Walk-in Closet\n* Roommate Friendly Floor Plan\n* Lofty Vaulted Ceilings\n* Private Patio or Private Balcony (on select apartments)\n* Pantry\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Full sized Washer and Dryer in unit\n* Breakfast Bar\n* Pre-wired for internet and cable\n* Granite Countertops\n* High Efficiency Lighting Fixtures\n* Garden Tub\n* Window Coverings\nCommunity Features\n* Bike Racks\n* Gaming Area\n* Community Lounge\n* After-Hours Emergency Maintenance\n* Minutes from Restaurants, Shopping, and Much More\n* Dry Cleaning and Laundry Service\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Controlled Access\n* Outdoor Grill Area\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Community Kitchen\n* Credit Cards Accepted\n* Short or Long Term Lease Available\n* TV Lounge\n* Elevator\n* Garage Parking\n* Long Term Lease Available\n* Easy Freeway Access\n* Package Acceptance\n* EV Charging\n* Extra Storage\n* Pet Salon\n* Fitness Studio\n* WiFi Access\n* Playground\n* Bark Park\n* Movie Theatre\n* Non Smoking Community\n* Landscaped Courtyards\n* Swimming Pool\n* Renters Insurance is Required\n* Professionally Managed\n* Sun Deck\n* Billiards","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1075ft2', 'available jan 20', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T14:16:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/blooming-glen-pet-friendly-pets-stay\/7578812084.html","post_id":7578812084,"result_date":"Sun Jan 15 2023 19:06:17 GMT+0000 ","title":"Pet friendly (pets stay free), Pet park, Tennis","description":"Bedrooms: 3Bathrooms: 2.5Square Feet: 2645Date Available: 2023-01-15Address: One Applewood DriveHeritage Orchard Hill welcomes you to explore our 1-, 2-, and 3-bedroom Perkasie townhomes and schedule a tour to see everything our community has to offer. Enjoy beautiful apartment features, including 9-foot ceilings, a full-size in-unit washer\/dryer, a 3,300 sq. ft swimming pool, an on-site fitness center. Explore our photo gallery to see the contemporary, neutral decor and comfortable living spaces at Heritage Orchard Hill. Call  show contact info\nto speak to a leasing agent today and schedule a tour of your new home today or apply online!Learn more about all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.Our Leasing Office is ready to answer your questions about our luxury townhomes for rent in Perkasie, Pennsylvania. Whether you need extra space for remote working or virtual schooling, or just like to spend some time in a well-appointed townhome, we have the floor plans you are looking for. Reach out and let us show you how easy it is to move into our Bucks County townhomes today! Contact us today to schedule your self-guided or virtual tour! Amenities Include:Pet parkCommunity parties and events scheduled throughout the year4,700 square foot clubhouse available for private parties1,800 square foot open-air deckFitness center with high-tech sound system and televisionsPet friendly (pets stay free)Three tot lots with modern play equipment3,300 square foot swimming pool with adjacent baby poolScenic walking trailsTennisConvenient locationMultiple shopping destinations just miles awayCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/h3lcibbx\/heritage-orchard-hill\n","num_images":8.0,"lat":40.3765,"lng":-75.2648,"attrs":"['3BR \/ 2.5Ba', '2645ft2', 'available now', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T14:02:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-affordable-living\/7578806414.html","post_id":7578806414,"result_date":"Sun Jan 15 2023 18:50:59 GMT+0000 ","title":"Affordable living! Wonderful floor plans for every budget!","description":"This Beautiful home is surrounded by mature trees, plush landscaping, picturesque views and is nestled in a quiet tranquil community that is only minutes from Uptown . With a caring and committed on-site property management team, our community is the PERFECT place to come home to. Family Charming community minutes from Uptown. We are Now Offering Virtual Tours\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff\nApplication Requirements:\n(1.) Picture ID (2.) Social Security Card or W7 (3.) No Felonies or Drug Charges (4.) Proof of Income (5.) Min of 6 months of employment with a current employer (6.) Monthly income 2.5 X (NET) rent amount (7) Security Deposit\n* Application Fee: $50.00 18 and over\n* Administration Fee: $10.00\n* Security Deposit: starts at $500.00 w\/ approved credit\n****Apply online\n****Online apps must submit, ID, SS, most recent paystubs and, payments are required**\n","num_images":5.0,"lat":40.0369,"lng":-75.0664,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T13:46:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apply-now\/7578806131.html","post_id":7578806131,"result_date":"Sun Jan 15 2023 18:50:16 GMT+0000 ","title":"Apply Now !!!","description":"This Beautiful home is surrounded by mature trees, plush landscaping, picturesque views and is nestled in a quiet tranquil community that is only minutes from Uptown . With a caring and committed on-site property management team, our community is the PERFECT place to come home to. Family Charming community minutes from Uptown. We are Now Offering Virtual Tours\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff\nApplication Requirements:\n(1.) Picture ID (2.) Social Security Card or W7 (3.) No Felonies or Drug Charges (4.) Proof of Income (5.) Min of 6 months of employment with a current employer (6.) Monthly income 2.5 X (NET) rent amount (7) Security Deposit\n* Application Fee: $50.00 18 and over\n* Administration Fee: $10.00\n* Security Deposit: starts at $500.00 w\/ approved credit\n****Apply online\n****Online apps must submit, ID, SS, most recent paystubs and, payments are required**\n","num_images":1.0,"lat":40.0118,"lng":-75.1456,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-01-15T13:46:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-ideal-location-close-to\/7578803513.html","post_id":7578803513,"result_date":"Sun Jan 15 2023 18:43:30 GMT+0000 ","title":"Ideal location! Close to everything! 2 bed \/ 2 bath! 1178 Sqft!","description":"Community Location: 100 Cobblestone Dr - Coatesville, PA 19320 Rental Information: $1673 - $2238\/Month | 2 Bedroom 2 Bath | 1178 sq ftLeasing Options:  Variable show contact info\nApartment Amenities:  ➢ Built-In Microwave➢ Central Heat & Air Conditioning➢ Disability Access In Select Units➢ Dishwasher➢ Full-Size Washer & Dryer In Every Apartment➢ Mini Blinds On All Windows➢ Refrigerator\/Freezer With Ice Maker➢ Walk-In ClosetsProperty Features: ➢ Business Center➢ On-Site Leasing Office➢ Pet-Friendly➢ Private Garages In Select Units➢ 24-Hour Emergency Maintenance➢ Coffee Bar Clubhouse Kitchen➢ Resident Referral Bonuses Description: Our apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.\nComplete with a resort-style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Call: Millview Apartments at  show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":13.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available jan 27', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T13:39:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-come-home-to-millview\/7578802540.html","post_id":7578802540,"result_date":"Sun Jan 15 2023 18:40:57 GMT+0000 ","title":"Come home to Millview Apartments! 1 Bed \/ 1 Bath available!","description":"Millview Apartments 100 Cobblestone Dr Coatesville, PA 19320  show contact info\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Rental Size:  1 BR - 1 BA - 845 sq ft  Per Month: $1399 - $1910  Lease Length: Variable  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Features and Amenities: ◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral Bonuses. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . This Unit Comes With: ◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In Closets. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Call us for more information! --  show contact info\n-- Website: https:\/\/www.apartmentsincoatesvillepa.com\/Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  EQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'available jan 27', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T13:36:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-spacious-bedroom-at\/7578801878.html","post_id":7578801878,"result_date":"Sun Jan 15 2023 18:39:19 GMT+0000 ","title":"Spacious 2 Bedroom at Millview Apartments. Available Now!","description":"RENTAL INFO Rental Rates: $1646 - $2206\/monthLocation: 100 Cobblestone Dr Coatesville, PA 19320Unit for Rent: 2-BR 2-BA | Square Feet: 1018 sq ft | Lease Length: Variable show contact info\nPROPERTY AMENITIES❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral BonusesAPARTMENT AMENITIES❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In Closets  ADDITIONAL INFODescription: Nestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!Pet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. Website: https:\/\/www.apartmentsincoatesvillepa.com\/ Millview Apartments: show contact info\nEQUAL HOUSING OPPORTUNITY7252BEBBC7094AC\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1018ft2', 'available jan 27', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T13:35:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-renovated-two-bd\/7578797079.html","post_id":7578797079,"result_date":"Sun Jan 15 2023 18:37:02 GMT+0000 ","title":"Modern - Renovated Two BD Two BA apartment available","description":"This just-renovated and well appointed, cozy 2 bed\/2 bath apartment has everything you could want from a secluded space. Return after work to your luxury apartment that feels more like a home, with its spacious, open-concept design .\nAssigned parking is available !\nIs nicely accented by high ceilings, hardwood floors, and crown molding. Spacious apartment is complimented by a ton of natural light. Contact me directly:  aptrents@qmailads.me---\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n--\n-\n-\n---\n-\n-\n-\n-\n-\n----\n-\n-\n-\n-\n----\n-\n-\n-\n-\n--------\n-\n-\n-\n-\n--------\n-\n-\n-\n-\n----\n-\n-\n----\n-\n-\n----Move in condition Office on 149th Street by Owner. $1200\/ Month\nBetween Morris & 3rd Avenue.\nAppx. 500 Sq ft.\/2nd Fl. With Window facing 149th St. Call Owner for details  show contact info\n.\nNEW Coworking Space For Rent\nMEMBERSHIP INCLUDES\n24\/7 Access to a coworking desk\nMonth to Month\nFast Wifi\nFreshly Brewed Coffee\nUnlimited b\/w printing\nConference Room\nPhone Booths\nRooftop Lounge\nFitness Center\nCALL US:  show contact info\nAvenue of Opportunity\nSecure Your Place on a Hot Retail Block Today\"\nIdeal for: florist, dry cleaner, jeweler, nail salon, tailor\/alteration, barber shop, UPS\/mail center, shoe repair, fashion, pet grooming, optician, etc. All uses considered except food related.\nCompetitively Priced that includes heat!\nHigh Visibility: 20 ft of frontage, large windows and (2) awnings.\nExcellent Location: Busy thoroughfare with constant foot traffic due to an exciting and varied retail mix that is a magnet for consumers: (2) Restaurants, (2) Hair Salons, Brow Bar, Pet Store, and Locksmith. Also, near Local Park and NYU Langone Medical Complex.\nMurray Hill is rated as one of the best neighborhoods in New York City.\nLiving in Murray Hill offers residents a dense urban feel with lot of bars, restaurants, coffee shops, and parks. Many young professionals live in Murray Hill. The public schools in Murray Hill are above average.\nMurray Hill Demographics:\nPopulation: 27,480\nMedian Household Income: $145,843\nStore front approximately 1200SF Plus usable basement 1000 sf.\nProfessional Office Space. Furnished. Several options. Ideal for Law offices, Attorneys, CPA, Insurance agencies, Billing companies, and any management company. Custom builds-in throughout the space. Modern design, recessed lighting. Large floor-to-ceiling windows in the conference room with lots of natural sunlight. Private elevator.\nCan rent 1, 2 or 3 fully furnished offices with or without reception. Leases start from $2,100. Ready to move in. Impress your clients. The rent does not go by a square footage since all amenities such at client's waiting area, grand conference room, supply closets, kitchen, workstation, etc on this floor are shared among tenant. The office is located in a modern office elevator building in the heart of Sheepshead Bay rd. Several municipal parking lots are right next to the office. Central HVAC, internet\/wifi ready. Busy area with many restaurants. No broker’s fee. Serious inquiries only.\nFully furnished office space for licensed NYS mental health practitioners.\nPrivate entrance, waiting room, restroom, high-speed Internet available.\nTwo offices available, 7 days\/week. Spaces filling up.\nThis is a one-of-a-kind space that is a temporary being used as an event space. The pictures do not serve this space justice.\nThere are no residential neighbors and therefore noise is not an issue.\nParking is available!\nLocation:\n- 203 Moore Street\n- East Williamsburg\/Bushwick\n- 4 blocks from Roberta's Pizza and right by the Morgan (L) train\nThe variety of both rooms and open space allows for a nice flow for any sort of corporate event, party, gallery or show! This is a flexible space that can be transformed to fit your creative vision.\nContact Alyssa for more information.\nRates very depending on the type of event, length of event, and needs.\nHello!\n.That´s what I have available for you:\n.Several MUSIC PRODUCTION \/ RECORDING SPACES available !\n.(Present Tenants in the building : Mastering studios, Composers, Sound designers, Recording pop.... .)\nSizes are from 110sf - 200sf.- 400 sf ( big 2 room studio)\nAC\/ Heat Split systems ! ( Quiet!)\nSingle spaces from (110 sf)\nand\n2 Recording studios:\nOne with a big live room and one with a small live room.\nwindow in-between the rooms, etc..\nquiet Split AC\/ Heat system, Skylights, 14 foot ceiling etc...\nExtra Storage spaces available too for $120\/ month\nNone of those (only) 10 spaces in the building are occupied by rehearsing bands.\nAlthough built soundproof, the entire floor is more a production\/ recording facility ( Jazz, electronic, rock, pop) with medium sound level, occupied by MATURE professionals.\nRent: starting at $ 750 + $ 100 utilities (Utilities include Heat, Gas, AC, Electricity, Water, basic WLAN, Cleaning, Garbage, Taxes ) = Total $ 850 \/ month for 110 sf.\nThe bigger spaces are more....\nNice Backyard !, Shared office kitchen and bathrooms, Bikes can be parked INSIDE in the secure backyard .\nBakery, Restaurants, Shops, Delis, ... all just around the corner\nGreenpoint ! a very save, relaxed and vibrant neighborhood.\nFREE basic WLAN everywhere,\n.\n.Big surveillance system, high security system, LIVE IN SUPERINTENDENT.\n.\n.Amazing community of professional and mature tenants in the building !\n.Famous and long-term tenants prove the quality of my buildings !\n.(Many tenants have been with me for over 15 years !)\n.\n.Serving the Music and Artist community since 1999 !\n.\n.\n.Thank you !\n.\n.Please send me an email\/ Phone number and I will get right back to you to organize the showing .....\n.\n.\n.SPACE ONLY, DOES NOT COME WITH THE EQUIPMENT THAT MIGHT BE SHOWN IN THE PICS.\n.( THAT IS THE PRESENT TENANT'S GEAR)\n.\n.\n.\n.Thank you !","num_images":8.0,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T13:23:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-new-beginnings-here-at-park\/7578796116.html","post_id":7578796116,"result_date":"Sun Jan 15 2023 18:24:32 GMT+0000 ","title":"New Beginnings Here at Park Lane!!","description":"Balmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-01-15T13:20:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-on-quiet-block\/7578789071.html","post_id":7578789071,"result_date":"Sun Jan 15 2023 18:21:09 GMT+0000 ","title":"One-Bedroom on Quiet Block - N Philadelphia","description":"Fully-renovated 1 bedroom apartment immediately available on quiet block near Temple University & Temple's medical school complex (N 18th & W Tioga ST.) Includes brand-new: fridge, electric stove, cabinets, tub and toilet, built-in electric heating, flooring, windows, freshly painted walls and new granite countertops in the eat-in kitchen w\/pantry. Apartment has separate living room with tons of natural light through the day.\nCentrally located, steps away from bus stops (#2, #33, #60), less than 10-minute walk to Broad Street & Erie BSL stop, less than 5-minute drive to Highway 1\/Roosevelt Ave. Residents also have access to sunny south-facing porch and front garden, shared with the other two apartments in the building. Apartment is located on the third floor.\nLandlord pays for water, garbage, and sewer (included in rent.) Resident is responsible for electric and any wifi and\/or cable connections & fees. No pets. Initial lease term must be 6 months minimum (will do up to two years.) First month + last month + security deposit ($3,700 total) due at lease signing.\nOpen houses being scheduled now. In order to view the apartment, you must complete our screening form. HERE: https:\/\/forms.gle\/KWrQrRHTwDWX5fn19","num_images":10.0,"lat":40.006994,"lng":-75.158278,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T13:02:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-with-d-and-private\/7578793626.html","post_id":7578793626,"result_date":"Sun Jan 15 2023 18:18:09 GMT+0000 ","title":"1 bed with w\/d and private deck 5-15 month lease options available!","description":"Very large 1 bedroom apartment with PRIVATE deck in the heart of Society Hill! This second floor apartment greets you with a large open living\/dining area with access to the private deck, a wood burning fireplace and updated kitchen complete with stainless steel appliances and plenty of room to add your own island if you want. The high ceilings provide an open and airy feel with hardwood flooring throughout the apartment. There is also a large bedroom with windows facing out on to Spruce street along with another beautiful fireplace full bathroom. Laundry in unit and pets welcome for $25\/month. This apartment is just a block away from Acme, easy access in and out of the city through all major highways, close to Jefferson and Pennsylvania Hospital, Washington Square and so much more! $1925\/month for 12 month lease or longer, $2050 for 5\/6 months","num_images":7.0,"lat":39.945007,"lng":-75.148967,"attrs":"['1BR \/ 1Ba', '725ft2', 'available feb 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-01-15T13:14:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/blooming-glen-convenient-location-pet\/7578791813.html","post_id":7578791813,"result_date":"Sun Jan 15 2023 18:13:40 GMT+0000 ","title":"Convenient location, Pet park, Pickle Ball Courts","description":"Bedrooms: 3Bathrooms: 2.5Square Feet: 2002Date Available: 2023-01-15Address: One Applewood DriveHeritage Orchard Hill welcomes you to explore our 1-, 2-, and 3-bedroom Perkasie townhomes and schedule a tour to see everything our community has to offer. Enjoy beautiful apartment features, including 9-foot ceilings, a full-size in-unit washer\/dryer, a 3,300 sq. ft swimming pool, an on-site fitness center. Explore our photo gallery to see the contemporary, neutral decor and comfortable living spaces at Heritage Orchard Hill. Call  show contact info\nto speak to a leasing agent today and schedule a tour of your new home today or apply online!Learn more about all of our apartment communities in Bucks County, PA. At Heritage Property Management our top priority is our residents and finding you an apartment that feels like home.Our Leasing Office is ready to answer your questions about our luxury townhomes for rent in Perkasie, Pennsylvania. Whether you need extra space for remote working or virtual schooling, or just like to spend some time in a well-appointed townhome, we have the floor plans you are looking for. Reach out and let us show you how easy it is to move into our Bucks County townhomes today! Contact us today to schedule your self-guided or virtual tour! Amenities Include:Community parties and events scheduled throughout the yearTennisFitness center with high-tech sound system and televisionsPickle Ball Courts1,800 square foot open-air deckPet parkConvenient locationMultiple shopping destinations just miles awayScenic walking trails3,300 square foot swimming pool with adjacent baby pool4,700 square foot clubhouse available for private partiesThree tot lots with modern play equipmentCall:  show contact info\nFor more information, visit us at: https:\/\/heritagepropmgmt.com\/5flfxwjt\/heritage-orchard-hill\n","num_images":8.0,"lat":40.3765,"lng":-75.2648,"attrs":"['3BR \/ 2.5Ba', '2002ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T13:09:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-duplex-cute-bedroom2-bath-in\/7578783944.html","post_id":7578783944,"result_date":"Sun Jan 15 2023 17:57:32 GMT+0000 ","title":"Duplex & Cute 2 bedroom,2 bath in","description":"Duplex & Cute 2 bedroom,2 bath in . All New Including Fully  kitchen including dishwasher. Dining area, 2 bedrooms with closets in each. Huge Living Room with beautiful bay window. Additional closet in kitchen. Bathroom has full tub\/shower. Plenty of off street parking. Application fee $30 for background and credit check is required!\nOur features include:\n* Pool and Deck\n* Patios & Balconies w\/Storage\n* Efficient stove, refrigerator, and dishwasher\n* Spacious Walk-In Closets as well as Extra Closets\n* Washer \/ Dryer Connections in all units\n* Clothes Care Center\n* Wood Burning Fireplaces\n*Online Payments\n*24 Hour Emergency Maintenance Staff\nApplication Requirements:\n(1.) Picture ID (2.) No Felonies or Drug Charges (3.) Proof of Income(NET) rent amount\n","num_images":1.0,"lat":39.9375,"lng":-75.2637,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-01-15T12:48:32-0500"}]