[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-huge-home-unique-setting\/7459327448.html","post_id":7459327448,"result_date":"2022-03-17 08:52","title":"Huge home, Unique setting, covered patio!","description":"4 bedroom, 3 bath beautiful home that sits on a very unique setting, includes a very large finished basement that includes its own washer and dryer, including an all new patio fenced yard utilities paid $975\nshow contact info","num_images":0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 3Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T08:28:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rental\/7459618222.html","post_id":7459618222,"result_date":"2022-03-17 19:08","title":"Rental","description":"This 2-bedroom , 1 bath home is available for rent! This home has been updated throughout. Enter into the straight through living room-dining room combo complete with fresh paint, updated flooring, updated light fixtures and great natural light, that leads to a private fenced in yard, great for entertaining. upstairs you will find 2 bedrooms and the full bathroom. This house boast a full finished basement with added storage space, can also be used as a bonus room or a small bedroom, and a bar.\nDo not contact me with unsolicited services or offers.\n","num_images":20,"lat":40.021285,"lng":-75.127516,"attrs":"['2BR \/ 1Ba', '699ft2', 'available apr 1', '\\nsaturday 2022-03-26\\n', '\\nsunday 2022-03-27\\n', 'air conditioning', 'flooring: wood', 'apartment', 'w\/d hookups', 'no smoking', 'no parking', 'rent period: yearly']","posted_date":"2022-03-17T19:04:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-stunning\/7459380694.html","post_id":7459380694,"result_date":"2022-03-17 11:22","title":"NEWLY RENOVATED 🌟 STUNNING 2 BED 1 BATH","description":"Newly renovated apartments. Close to public transportation, parks, schools and medical centers. For inquiries and\/or interest in viewing a home, please contact our Management Office.","num_images":3,"lat":40.040351,"lng":-75.143245,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-03-17T10:53:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bensalem-apartment-style-furnished\/7459379597.html","post_id":7459379597,"result_date":"2022-03-17 10:54","title":"APARTMENT STYLE FURNISHED STUDIO","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryOn-Site Fitness FacilityFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 3216 Tillman Dr., Bensalem, PA 19020","num_images":3,"lat":40.116742,"lng":-74.960137,"attrs":"['0BR \/ 1Ba', 'available now', '\\nfriday 2022-03-18\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: other', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: weekly', 'wheelchair accessible']","posted_date":"2022-03-17T10:50:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gas-fireplace-spiral-stairs\/7459364922.html","post_id":7459364922,"result_date":"2022-03-17 10:34","title":"Gas fireplace! Spiral stairs!","description":"Housing Type: House\nBedrooms: 2\nBathrooms: 2\nLaundry: w\/d in unit\nParking: off-street parking\nFITLER SQUARE: 2 bedroom 2 bath, includes an elegant spiral staircase! Brand new  washer and dryer is provided in the completely finished basement that could make this a three bedroom if need be. Also has a large  fireplace in the master bedroom pets ok! $1050\nshow contact info","num_images":0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T10:18:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-splendidly-renovated\/7459388796.html","post_id":7459388796,"result_date":"2022-03-17 11:13","title":"This splendidly renovated warehouse in Franklin Square","description":"Just 1st month's rent and $500 security deposit to move-in!!! This splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. The Warehouse is located in a highly walkable area with access to all forms of public transportation. Amenities include secured entry and controlled building access, on-site parking (additional $150\/month), full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit in the building!\nCentral Air Main Floor Laundry Parking available Gym Available Pets Allowed\nContact Us For More Info","num_images":5,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '619ft2', 'available may 30', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking']","posted_date":"2022-03-17T11:09:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-victorian-home-with-built\/7459417396.html","post_id":7459417396,"result_date":"2022-03-17 12:28","title":"Victorian home with built in BBQ!","description":"Housing Type: House\nBedrooms: 3\nBathrooms: 2\nLaundry: w\/d in unit\nParking: off-street parking\nGRADUATE HOSPITAL : A Victorian Three bedroom and two bathroom plus a powder room. Includes a partially finished Basement, All new Yard, washer and dryer  $1125\nshow contact info","num_images":0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T12:05:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-quaint-apart-one-bedroom\/7459602508.html","post_id":7459602508,"result_date":"2022-03-17 18:47","title":"Quaint apart One bedroom One bath duplex apartment located in DELCO.","description":"One bedroom One bath duplex apartment located in DELCO.\nQuaint apartment available for rent. Carpeted flooring\nUTILITIES: Residents responsible for Electric and Gas -PECO in their name\nStreet parking\nAPPLICATION REQUIREMENTS:\nCredit: 600 to 649: First, Last and Security Deposit\nCredit: 650+ First and Security Deposit\nIncome: 3x Monthly Rent Income: (PROOF OF INCOME IS REQUIRED W\/ APPLICATION)\nNothing in collections. No prior evictions.\nLength of Lease: Minimum 1 year, prefer 2+\nSorry-Section 8 NOT Accepted per owner\nAdditional Monthly Fee: Rentwell Resident Package $25\n- Resident reward program for paying rent on time\n- online portal\n","num_images":4,"lat":39.9579,"lng":-75.2681,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-03-17T18:23:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-permitted-for-additional\/7459309625.html","post_id":7459309625,"result_date":"2022-03-17 06:36","title":"permitted for additional monthly fee","description":"Great studio available now at 501 N 35th street! Walking distance to Drexel - Affordable studio available now at 501 N 35th street. Hardwood floor. Window heat and AC. Pet friendly. $250 one time pet fee plus $25 pet rent. 1 year lease. $55 application fee. Security deposit, first and last month to move in. Must to have a good credit. Laundry room is in the building","num_images":7,"lat":39.962769,"lng":-75.192846,"attrs":"['1BR \/ 1Ba', '210ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking']","posted_date":"2022-03-17T06:20:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-budget-friendly-center\/7459320397.html","post_id":7459320397,"result_date":"2022-03-17 08:35","title":"Budget Friendly Center City, Nice Area","description":"Bedrooms: 4\nBathrooms: 2\nLaundry: w\/d in unit\nParking: attached garage\nCENTER CITY: 4  bedroom 2  bath end unit home! 2 story! Granite countertops within the kitchen, including an all new breakfast bar and newly installed dishwasher! All four bedrooms are large, and the master bedroom has a huge walk in closet $1250\nshow contact info","num_images":0,"lat":39.9513,"lng":-75.1741,"attrs":"['4BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T07:51:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-junior-one\/7459387995.html","post_id":7459387995,"result_date":"2022-03-17 11:11","title":"Renovated Junior one bedroom with an open kitchen","description":"Renovated Junior one bedroom with an open kitchen, granite counter bar, stainless steel appliances and window in kitchen. Tons of closets and a sunny western view. Rent includes all utilities. In addition to rent tenant to pay $65.24 per month for internet and cable. If interested listing agent will prepare lease. Photos are that of previous tenancy.\nCentral Air Granite counter tops  Stainless Steel Appliances Gym Available\nContact Us For More Info","num_images":6,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '656ft2', 'available jul 25', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-03-17T11:07:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-awesome-bedrooms-apt-patio\/7459638401.html","post_id":7459638401,"result_date":"2022-03-17 20:07","title":"Awesome 2 bedrooms apt w\/ patio","description":"Excellent condition and sunny in Filter square for this specific two bedrooms, one bath apartment.\nIt is around 1,000 ft of high ceiling apartment occupies the entire first floor in triplex.\nBeautiful it in kitchen anchors d\/w, disposal, Stainless steel appliance. Two large bedroom with full closets.\nTwo beautiful charming decorative fireplaces.\nCentral air and heating system.\nEnjoy huge patio.\nFirst, last and security deposit for move in.\nAvailable in June 1st.\nParking spot in the back for additional cost.","num_images":7,"lat":39.94623,"lng":-75.178264,"attrs":"['2BR \/ 1Ba', '1000ft2', 'cats are OK - purrr', 'flooring: wood', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T20:03:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-for-rent-for-1300\/7459424326.html","post_id":7459424326,"result_date":"2022-03-17 12:22","title":"House for rent for $1,300","description":"Beautiful property in a nice neighborhood for $1,300, For pha vouchers only.","num_images":1,"lat":40.0365,"lng":-75.1451,"attrs":"['4BR \/ 2Ba', '1440ft2', 'available mar 20', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: other', 'house', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-03-17T12:18:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-elegant-stone-home-at-top\/7459333094.html","post_id":7459333094,"result_date":"2022-03-17 08:55","title":"Elegant Stone Home at Top of Hill With Garden and Parking","description":"Please consider living in our sun-filled and convenient home! We are moving locally but uncertain if we will return to our classic Chestnut Hill twin, so are looking for tenants. We have spent several years fixing this gem up, with a brand new kitchen, new patio, new windows and a new heating and air conditioning system, along with other tasteful improvements.\nThe first floor open-plan living and dining room boasts tall ceilings and copious amounts of daylight. Our extremely functional and efficient kitchen is an equally pleasing space, also with plenty of natural light, and there is a tastefully designed pantry\/laundry room off the back of the kitchen. A powder room completes the first floor living space, while there is a large storage area before walking out to the back garden.\nThere are three bedrooms on the second floor, including a master bedroom with plenty of storage and a fireplace. Two moderate sized bedrooms are perfect for home offices or kids bedrooms. A full bathroom is located on this floor.\nThe fourth bedroom is on the third floor and has commanding views and tons of daylight. There is an adjacent 3\/4 bath, and down the hall is a walk-in closet (that we use as a small office space).\nOutdoors, there is a full street-side porch that faces southwest, and a small porch on the side of the house that faces southeast and overlooks a very large flagstone patio. New plantings abound and fencing frame the outdoor space which is perfect for entertaining or for kids play.\nOther details:\n- Basement is partially finished and offers plenty of storage.\n- New heating and air conditioning units are among the most efficient available, so heating and cooling bills are very manageable.\n- Offstreet parking for two cars.\n- Alarm\/Fire system available for hookup.\n- Utilities to be paid by tenant.\nOur home is best described as a sunny and light-filled, with a deep and wide (for its location) garden and patio area. Because of our location we also get unusually long views so you do not feel hemmed in by neighbors. We are a block from the Chestnut Hill West Station and a block from Germantown Avenue, so it is hard to get more convenient if you, like us, enjoy not getting in the car to do everything.\nWe are looking for tenants who appreciate living in an old home and will take care of it. We prefer no pets but would consider on a case-by-case basis a cat or small dog. We seek a one year lease.\nOur move-out date is a bit uncertain so we are exploring the level of interest. We anticipate being out by June 30 or possibly into July. We will update the listing with current photos in the coming days, but the included teaser photos are from when we purchased the home some years ago (decor and setup is very different now).\nIf you are interested, please tell us a little bit about yourself so that we can understand if this might be a good fit.\n","num_images":3,"lat":40.074661,"lng":-75.207752,"attrs":"['4BR \/ 2.5Ba', '2500ft2', 'available jul 1', 'air conditioning', 'flooring: wood', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: yearly']","posted_date":"2022-03-17T08:51:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-penthouse-unit-2nd-floor\/7459483660.html","post_id":7459483660,"result_date":"2022-03-17 14:14","title":"Penthouse Unit (w\/ 2nd floor loft) w\/ 20ft Ceilings and Exposed Brick","description":"Listing Description:\nGorgeous 1 bedroom unit ( available furnished or unfurnished) which with bonus loft that has been used before as 2nd bedroom or home office in old mill building with hardwood floors, granite counters.  Partial Water and Ben Franklin Bridge Views.   Just 1 block to the dog park and waterfront and steps to the best restaurants in the city. Located on top floor of boutique 16 unit building ( only 4 units per floor) which does have an elevator. The kitchen has ample granite counter space custom cherry cabinets and is equipped with stainless steel gas range, refrigerator, microwave and dishwasher. Unit has washer dryer. Subway located 1 block away. Parking not included (garage next door). We also have private offices available for lease on the ground floor starting at $495 a month.\nVirtual Tour: https:\/\/youtu.be\/qxD-VEmlccY\n","num_images":13,"lat":39.948278,"lng":-75.14332,"attrs":"['1BR \/ 1Ba', '900ft2', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'furnished', 'condo', 'w\/d in unit', 'no parking', 'rent period: yearly']","posted_date":"2022-03-17T14:10:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-and-bathroom\/7459607710.html","post_id":7459607710,"result_date":"2022-03-17 19:11","title":"1 bedroom and 1 bathroom apartment for rent april","description":"Spacious Beautiful and Tremendous 2 Bedroom Apartment\nwaiting for you! MOVE IN SPECIAL! - We will have avail\nable  2 bedroom and 2 bathroom apartment located in th\ne great Mid-Wilshire area. This beautiful, tremendous\nunfurnished unit is in a clean building which include\ns great counter tops, air conditioning for those hot C\nalifornia days as well as a stove to cook. Unit includ\nes ceiling fan, hardwood floors, assigned parking and\na laundry facility on site.\n","num_images":3,"lat":40.0178,"lng":-75.0895,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T18:37:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-bedroom-bath\/7459310202.html","post_id":7459310202,"result_date":"2022-03-17 06:47","title":"Beautifully 2 Bedroom 2 Bath Apartment -$800 \/ 2br - 1200 ft.","description":"A spacious living room with working wood-burning fireplace, new spotlights and a space for a dining table is great for entertaining. An open concept kitchen is completely renovated with stainless steel appliances, granite countertop and tiled backsplash. 2 newly renovated latest full bat\n2 Bed\/2 Bath available in a full-service building. Apartment features modern finishes. White oak flooring, oversize windows, open kitchen with stainless steel appliances.  show contact info\nApartment features:\n✔️ Custom Kitchen🍽️\n✔️ Stainless steel appliances✅\n✔️ Granite Counter-tops👌🏼\n✔️ Tiled bathrooms🚽🧻\n✔️ High ceilings🏠🔝\n✔️ Hardwood floors🏘️\n✔️ Tons of sunlight☀️🌞\n✔️ Decent Closet🚪👚👖\n✔️ Laundry Hook-ups👚👖\n✔️ Central A\/C ❄️❄️\n✔️ Secured Building🔐","num_images":10,"lat":39.9845,"lng":-75.2282,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: tile', 'apartment', 'w\/d in unit', 'valet parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-03-17T06:28:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apartment-for-rent\/7459449848.html","post_id":7459449848,"result_date":"2022-03-17 13:12","title":"apartment for rent","description":"Hi we have 2 bedrooms and 1 bedrooms arts for rent. Fully renovated, all new appliances.  2 bedrooms $1250  and one bedroom $1,000","num_images":0,"lat":39.9223,"lng":-75.2338,"attrs":"['2BR \/ 1Ba', 'available now', 'broker fee details: 1 month', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'off-street parking']","posted_date":"2022-03-17T13:05:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-studio-available-now\/7459651813.html","post_id":7459651813,"result_date":"2022-03-17 20:49","title":"Great studio available now at 3412 Spring garden!","description":"Cozy studio available now in university city area. Walking distance to Drexel university. Laundry room in the building. Window air conditioning. Hardwood floors. Tenants will be responsible only for electric. Security deposit, first and last month to move in. $55 application fee.\nRental Terms\nRent: $890\nApplication Fee: $55\nSecurity Deposit: $890\nAvailable now\nPet Policy\nCats allowed\nDogs allowed\nCall Alena for showing at  show contact info\nAlena Skorynina\nCity wide realty\n","num_images":12,"lat":39.9597,"lng":-75.2024,"attrs":"['0BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'laundry in bldg', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T20:45:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-awesome-bedroom-apt-patio\/7459489279.html","post_id":7459489279,"result_date":"2022-03-17 14:25","title":"Awesome 1 bedroom apt w\/ patio","description":"Recently renovated effeciency​ apartment in a lively location in East Passyunk Ave. Close to everything including all of the restaurant, Acme grocery store, bank, pharmacy is 5 minutes walk. Whole Foods is a 15 minutes walk.\nBeautiful Hardwood Floor, updated modern kitchen had dark wood cabinet, updated tile bath. Enjoy outdoor space.\nLaundry service around the corner. Very safe neighborhood.\nFirst, last and security deposit due at lease singing.\nTenant response for utilities.\nAvailable in June 1.\n","num_images":6,"lat":39.934213,"lng":-75.158425,"attrs":"['1BR \/ 1Ba', '450ft2', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'flooring: wood', 'apartment', 'no laundry on site', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T14:21:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-april-move-in-fabulous-1bd\/7459690715.html","post_id":7459690715,"result_date":"2022-03-17 23:37","title":"April Move in: Fabulous 1BD with Near Public Transportation","description":"Available early April:\nWelcome to 1004 S 7th St #2! This is a lovely 1 bedroom \/ 1 bathroom apartment ready for tenants! Fantastic features include hardwood floors and recessed lighting throughout, natural sunlight, and more! Enter into the unit with the kitchen on your left. Your kitchen boasts great vinyl flooring, cabinets above & below for storage, and bar seating available at the counter which is open to the living space. (Please note that the kitchen cabinets\/counter have been painted black & a new stainless steel stove was installed.) The common area is sizable and bright with a ceiling fan for year-round comfort. Mirrors along one wall elevate the space and offer an airy and open atmosphere. Spiral stairs lead you upstairs to the bedroom and bathroom. Your full bathroom features tile flooring, vanity, and a shower \/ tub combo. The bedroom area has two windows and a mini-split a\/c system. There is shared laundry available in the basement. Items that can remain: Microwave, stools, kitchen sink storage fixture. Space Heater is included. This great apartment is in an unbeatable location –  schedule your showing today!\nHardwood Floors\nNear Public Transportation\nLaundry In-Building\nNatural Light\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":18,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', 'available apr 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-03-17T23:33:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-massive-home-with\/7459456840.html","post_id":7459456840,"result_date":"2022-03-17 13:36","title":"6 bed 6 bath massive home with roofdeck! Walk to Temple U!","description":"1930 Berks St - 6 bedroom, 6 bathroom expansive & modern home just off Temple U Campus! Available August 1st!\nVIDEO TOUR COMING SOON!\nPhenomenally modern 6 bed 6 bath three story home situated in the heart of the Temple U vicinity is a brilliant way for you and your amigos to kick off the upcoming fall season! Enjoy all the amenities this spectacular home has inside including: central air\/heat, hardwood flooring, your own washer & dryer, 6 ridiculously spacious bedrooms with 6 bathrooms to match, an adorable back patio, spacious common areas, as well as, a jaw dropping roof deck - which showcases captivating sunsets, provocative skyline views, and of course the perfect backdrop for those insta opportunities. Stainless steel appliances including: an electric stove, microwave, dishwasher, and a fridge within the kitchen create a modern & functional setting brew up an extraordinary grilled cheese or gourmet top ramen cuisine.\nJust a short stroll to Temple University campus, this 6 bedroom apt is a victory for anyone looking for a fresh & strong start this coming Fall! The vibes are high this fall & off campus housing options never had so much drip. Take advantage of the conveniences nearby such as: SEPTA Cecil B Moore BSL stop & alt transpo bus lines, AMC Theaters, Mc Donalds, Fresh Grocer, Chik-fila, police station, convenience stores, bars, restaurants and soo much more!\nApartment features include:\nTremendous open floor plan\nHardwood flooring\nCentral air and heat\nWasher and Dryer\nFull size appliances\nScenic deck space\nRoof Deck\nDishwasher\n6 spacious bedrooms with 6 bathrooms\nand more!!!\nYou have the chance to win it all and it can be all yours this fall....lets get the ball moving & lock in the accolades right away!\n","num_images":14,"lat":39.982737,"lng":-75.165187,"attrs":"['6BR \/ 6Ba', 'available aug 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T13:19:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-marvelous-one-bedroom-with\/7459684948.html","post_id":7459684948,"result_date":"2022-03-17 23:06","title":"Marvelous One Bedroom with Easy Highway Access - Pets OK","description":"Available early April:\nWelcome to 2422 Frankford Ave #5! This luxurious 1 bedroom \/ 1 bathroom apartment is located on one of Philadelphia’s favorite streets and offers contemporary design, gorgeous finishes and fixtures, high ceilings and more! Enter into the open layout with a spacious and bright living and dining area. There is room here for different furniture set ups. The kitchen features granite countertops, and tons of cabinet space, a tile backsplash, and stainless steel appliances including a dishwasher, refrigerator, microwave, and oven\/stove. There is a stacked washer\/dryer in a closet by the kitchen for added convenience. The bedroom is towards the back of the apartment and offers two windows for fantastic light and a closet. Your bathroom is attached to the bedroom and boasts a full tub and great modern fixtures. Schedule your showing today!\nHardwood Floors\nStainless Steel Appliances\nCentral A\/C\nNear Public Transportation\nGranite Countertops\nLaundry In-Unit\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":13,"lat":39.9788,"lng":-75.1262,"attrs":"['1BR \/ 1Ba', '545ft2', 'available apr 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T23:02:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-home-with\/7459321355.html","post_id":7459321355,"result_date":"2022-03-17 08:20","title":"Renovated home with beautiful water views!","description":"One bedroom and one bathroom huge Renovated apartment with a gorgeous Water view! Has Ceiling fans fans in all rooms. Has completely refurbished hardwood flooring throughout $650\nshow contact info","num_images":0,"lat":39.9788,"lng":-75.1262,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T07:57:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-animal-lover-this-is-the\/7459574040.html","post_id":7459574040,"result_date":"2022-03-17 17:21","title":"Animal lover? This is the purrfect place for you! We are pet friendly!","description":"2 Bedroom  2 Bathroom | 1088 sq ft | $1614 - $2237\/Month Millview Apartments100 Cobblestone Dr Coatesville, PA 19320 show contact info\nDescription: Nestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect! Apartment Amenities:− Built-In Microwave− Central Heat & Air Conditioning− Disability Access In Select Units− Dishwasher− Full-Size Washer & Dryer In Every Apartment− Mini Blinds On All Windows− Refrigerator\/Freezer With Ice Maker− Walk-In ClosetsOur Residents Enjoy:− Business Center− On-Site Leasing Office− Pet-Friendly− Private Garages In Select Units− 24-Hour Emergency Maintenance− Coffee Bar Clubhouse Kitchen− Resident Referral BonusesAdditional Details:Deposit: CallTerms: VariablePets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":12,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'available mar 26', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-03-17T17:17:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedrooms-bathroom\/7459489019.html","post_id":7459489019,"result_date":"2022-03-17 15:11","title":"\"Spacious, 2 bedrooms, 2 bathroom Great Location\/renovated","description":"show contact info\nAvailable  2 bedrooms, 2 bathroom shopping, restaurants, and minutes from Downtown, SMU, and Old Town. , great closet space, separate utility room, private fenced patio. Gated community with pool, two reserved carport spaces. Completely Renovated Unit Available . 1st Floor. Beautiful natural light throughout, Central Heating and Cooling, recessed lighting, and much more. The building is secure and has off street parking. Storage locker in basement with\nshow contact info\nhook up for washer\/dryer..\n-$800 \/ 2br - 1200 ft.\n-Spacious 2 Bedrooms\n-apartment, newly renovated\n-Microwave\n-Air Conditioner\n-Patio\/Balcony\n-Cable\/Satellite Ready\n-Large Pantries & Walk-In Closets\n-Easy Access to\n-Dishwasher\n-Large Closets\n-W\/D Hookup\n-Refrigerator","num_images":11,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 2Ba', '1200ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: earthen', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-03-17T14:20:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom\/7459655102.html","post_id":7459655102,"result_date":"2022-03-17 21:01","title":"Renovated 2 bedroom available now at 241 S 49th street!","description":"Bright Apartment, Close Commute!\nWelcome to Croydon Hall, the best kept secret in Walnut Hill!\nFully renovated with amazing views and tons of light, each apartment features:\ngranite countertops, stainless steel appliances, spacious layouts, environmentally friendly PVC and tile flooring, heating\/AC, and bathrooms equipped with a rainfall shower head, tying everything together with sleek, modern finishes.\nOur Esteemed Building Features:\n- On-Site Management\n- 24 Hour Front Desk Attendant\n- Free Wi-Fi accessibility in common areas\n- Secured Entry! Electronic Fob Key Access\n- Elevators\n- Fully equipped Fitness center, open 24\/7\n- On-Site Laundry Room, open 24\/7\n- Lounge featuring a large flat screen TV with Cable & Netflix, cozy couches, dining tables, vintage video arcade cabinet, a dartboard, pool table, foosball, air hockey, & ping pong tables\n- Keurig coffee station and vending machines\n- Free Bicycle Storage and Free Air for bike tires\n- Conference Rooms\n- Playroom\n- Loading Zone\n- Enclosed Community Courtyard with a gazebo, fire pit and grill!\n- Optional On-Site Storage: $19.99\/mo\nWithin walking distance to Baltimore Ave, UPenn, Drexel, local shops, restaurants, and nightlife, and only half a block from the 42 Bus Line, 2 Blocks from the 21 Bus Line, and 6 Blocks from the Market-Frankford Line Station at 46th & Market, commuting from Croydon is easy!\nWe have limited availability, so call or e-mail today to schedule a viewing!\nView Available Apartments - copy our web address to your browser!\nhttp:\/\/www.croydonhallapts.com\/apply-now\nResidents are responsible for electric, which is sub-metered.\nWater, trash, sewer is paid by landlord.\nPricing and availability subject to change.\nAmenities\nOn-Site Management\nLaundry in Building\nWiFi in Common Areas\nResident Lounge with Cable and Netflix\nGame Room\n24 Hour Gym\nSecure Entry\nConference\/Study Room\nATM\nIndoor Bike Storage\nAdditional Storage Available\nVending Machines\nElevators\nBellman for Heavy Items\n9V Batteries Provided\nLightbulbs Provided\nSecure Outdoor Courtyards\nBellhop\nPool Table\nFoosball\nArcade Cabinet\nPing Pong Table\nDarts\nTwo Balconies with Stunning Views of the City\nPlayroom\nLoading Zone\nGazebo\nBarbecue Area\nFire pit\nRental Terms\nRent: $1,550\nApplication Fee: $50\nSecurity Deposit: $1,550\nAvailable Now\nPet Policy\nCats allowed\nSmall dogs allowed\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":16,"lat":39.955035,"lng":-75.219832,"attrs":"['2BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'laundry in bldg', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T20:57:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-furnished-studio-02-months\/7459344144.html","post_id":7459344144,"result_date":"2022-03-17 09:29","title":"Furnished Studio - 02 Months Minimum","description":"Furnished Studio - Only 2 Month Minimum!Take advantage of our special discounted rate! All utilities are included! show contact info\nwww.esa.com\/craigslistLooking for a place to call home for a couple months or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Furnished Studio - Only 2 Month Minimum!Take advantage of our special discounted rate! All utilities are included! show contact info\nwww.esa.com\/craigslistLooking for a place to call home for a couple months or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryPicnic & Grilling AreaIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 2 months?  We also have great nightly, weekly, and 30-night rates.  Call for details.Minimum 60-night length of stay required. Booking conditions apply, including a nonrefundable deposit. Rates and availability subject to change. Rate will vary by room type and stay dates. Rate not inclusive of taxes and fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 8880 Bartram Ave., Philadelphia, PA 19153    Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryPicnic & Grilling AreaIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 2 months?  We also have great nightly, weekly, and 30-night rates.  Call for details.Minimum 60-night length of stay required. Booking conditions apply, including a nonrefundable deposit. Rates and availability subject to change. Rate will vary by room type and stay dates. Rate not inclusive of taxes and fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 8880 Bartram Ave., Philadelphia, PA 19153","num_images":4,"lat":39.889516,"lng":-75.246169,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'attached garage', 'wheelchair accessible']","posted_date":"2022-03-17T09:25:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bed-bath-totally-renovated\/7459318369.html","post_id":7459318369,"result_date":"2022-03-17 08:00","title":"@+@+@2 bed, 1 bath, totally renovated apartment@+@+@","description":"Enter the building through a shared entryway and walk into your convenient second floor, 2 bed, 1 bath, totally renovated apartment! You'll immediately notice the soaring high ceilings, brand new engineered wood, spacious living and kitchen area and two generously sized bedrooms.\n- 12 Months lease\nPets:\n- Cats Allowed\n- Small Dogs Allowed - ( No Fee )\n- No smoking\nUtilities:\n- Other utilities - Hot Water Included\nRent $650.00\nDeposit $00.0\nIf you interested Please Call or text::(757) 500-935^3\n","num_images":4,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 1Ba', '950ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-03-17T07:37:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-updated-2bd\/7459665262.html","post_id":7459665262,"result_date":"2022-03-17 21:38","title":"Beautifully Updated 2BD Single Fam Home w. Garden & BSMNT","description":"Available early June:\nWelcome to 3048 Miller St! This lovely 2 bedroom \/ 1 bathroom single family home has a strong vintage feel with classic wallpaper patterns, antique lighting fixtures, and hardwood floors. The first floor welcomes you into a sunny living room with white striped wallpaper and a large coat closet by the front door. A huge window at the front floods the entire space with natural light – perfect for your plants! The living room flows into the dining room via an art-deco style archway and continues into the kitchen. The dining room features hardwood floors and a stunning brass chandelier. The kitchen is simply adorable offering delicate floral wallpaper, wooden cabinetry, a ceiling fan, and green, geometric patterned flooring. There is basement access through the kitchen for additional storage space and a full size washer and dryer. Upstairs, you’ll find two bedrooms and a full bathroom. Each bedroom has hardwood floors and ample closet space. The front bedroom is much larger and could comfortably fit a king or queen bed, plus bedroom furniture. The back bedroom would serve well as an office or TV room. The bathroom is tiled a lovely mint green with original, pristine fixtures and a full tub. The lovely backyard is divided into a partially covered patio with stone walkways and garden areas with neatly trimmed trees and room for lots more plants! This home is a MUST SEE, so schedule your showing today before it’s gone!\nBasement\nHardwood Floors\nPatio\/Yard\nGarden\nNear Public Transportation\nLaundry In-Unit\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":24,"lat":39.985009,"lng":-75.107838,"attrs":"['2BR \/ 1Ba', '960ft2', 'available jun 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T21:34:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spring-special-2nd-month\/7459320656.html","post_id":7459320656,"result_date":"2022-03-17 07:56","title":"🌷💵 SPRING SPECIAL - 2nd month FREE on this Stunning Furnished Space","description":"🌷SPRING SPECIAL - 2nd month FREE on a 12 month lease ($1557 net effective rent after discount)\n🛌 Move right in to this Fully Furnished and Accessorized 1 bedroom\n🧺 Laundry in unit\n✨Open concept floorplan\n🐕 Pet friendly\n🔆Great natural light\n✨ HW floors\n✨ 4-12 month lease option\n","num_images":6,"lat":39.95057,"lng":-75.174127,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T07:52:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-home-with-heated\/7459336508.html","post_id":7459336508,"result_date":"2022-03-17 09:47","title":"A Beautiful home with Heated flooring","description":"4 bedroom, a three bathroom (plus a powder room). Partially finished Basement with a new washer and dryer installed. Completely fenced in yard, stainless deck that gives gorgeous city views, Working gas fireplace inside the master bedroom $1500\nshow contact info","num_images":0,"lat":39.9474,"lng":-75.1473,"attrs":"['4BR \/ 3Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T09:03:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/conshohocken-large-15-car-garage-for\/7459458322.html","post_id":7459458322,"result_date":"2022-03-17 13:25","title":"Large 1.5 Car Garage For Rent","description":"Large 1.5 Car Garage For Rent\n$350.00\/Month - Available as early as April 1\n- Masonry Construction\n- Electric Garage Door Opener\n- Garage Door 10' Wide x 7' High\n- Room Width 12'\n- Ceiling Height 8'\n- Tenant responsible for electric (separately metered, very minimal amount per month)\n- Side Door Entrance\n- Large Loft Storage Space\n- 2 Large Overhead Lights\nADJACENT COVERED CAR PORT SPACE AVAILABLE FOR ADDITIONAL $50.00\/MONTH","num_images":1,"lat":40.077509,"lng":-75.305927,"attrs":"['0BR \/ splitBa', 'available apr 1', 'apartment', 'no laundry on site', 'detached garage']","posted_date":"2022-03-17T13:21:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-renovated-bedroom\/7459377844.html","post_id":7459377844,"result_date":"2022-03-17 10:51","title":"just renovated 1 bedroom apartment","description":"Sun filled +just renovated 1 bedroom apartment with HARDWOOD FLOORS throughout, and HUGE PRIVATE deck. Kitchen with granite counter tops, stainless steel appliances, and breakfast bar, all over looking an enormous living and dining area, with direct SOUTHERN exposure. All new tile and marble bath, with glass shower doors. Super large bedroom w\/ walk in closet. This Graduate Hospital location , has a walking score of 100 and ideal location to Penn and Chop, and just 5 minutes from Rittenhouse Square.\nCentral Air Pets Allowed Hardwoodfloors Stainless Steel Appliances Granite counter tops\nContact Us For More Info","num_images":6,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '800ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-03-17T10:47:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-stainless-steel-appliances\/7459340655.html","post_id":7459340655,"result_date":"2022-03-17 09:19","title":"Stainless Steel Appliances, Visit Us Today, Pet Spa","description":"Home is where the heart is, and here at The Point at Glen Mills, it's never been easier to love where you live. Contact us today to schedule your tour. You'll be glad you did!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nCommunity Features\n* Minutes from Restaurants, Shopping, and Much More\n* Bark Park\n* Professionally Managed\n* Bocce Ball\n* Yoga Lounge\n* Outdoor Grill Area\n* Fitness Studio\n* Putting Green\n* Community Lounge\n* Pet Salon\n* TV Lounge\n* Swimming Pool\n* Easy Freeway Access\n* Sun Deck","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T09:15:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-studio-available-now\/7459652882.html","post_id":7459652882,"result_date":"2022-03-17 20:53","title":"Great studio available now at 1931 Chestnut street!","description":"Great Studio unit in Prime Location. Close to Rittenhouse square.\nSmall studio unit available for rent. Hardwood floors, central air, Updated kitchen.\nVery close to UPENN, 30th street station, Center City Shops and Restaurants.\nGreat studio in Center city\/Rittenhouse square! The unit located on the second floor and features a beautiful hardwood floor and tiled tiled floor in the bathroom; full kitchen with stainless steel appliances; very high ceiling; spacious bathroom. The windows are facing the back of the building, so it is pretty quiet. Shared laundry and additional storage space in the basement. Pet friendly, $250 one time non-refundable pet fee. Secured entry.\nPerfect for Jefferson University, Drexel\/UPenn students. Extremely close to public transportation. Within 10 min walking to Suburban station, Market-Frankford line, which will take you in minutes to University city, Drexel, UPenn, West Philadelphia, Old city, Society Hill. The bus 9, 12, 21, 42 just on the corner. Do not miss it!\n1. First, Last and Security to move in ( three months up front )\n2. $55 application fee ( non refundable )\n3. Good credit ( no prior evictions, judgments or collections )\n4. Proof of income (co signer for students if needed )\n5. $250 non refundable pet fee plus $25 monthly pet rent.\nAlthough deemed accurate, this information is subject to change without prior notice.\nRental Terms\nRent: $1,150\nApplication Fee: $55\nSecurity Deposit: $1,150\nAvailable Now\nPet Policy\nCats allowed\nDogs allowed\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":7,"lat":39.951916,"lng":-75.172398,"attrs":"['0BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'laundry in bldg', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T20:49:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lease-purchase-option\/7459441940.html","post_id":7459441940,"result_date":"2022-03-17 12:55","title":"Lease Purchase Option - North Philadelphia","description":"Amazing lease purchase option opportunity in North Philadelphia located right at N 7th St and the Roosevelt Boulevard. Here presented to you is a beautifully maintained 3 bedroom 1.5 bath home with hardwood floors throughout and spacious bedrooms. This opportunity is perfect for someone who wants to transition from renting into home ownership. Reach out to hear more about this rent to own opportunity.","num_images":19,"lat":40.020615,"lng":-75.137679,"attrs":"['3BR \/ 1.5Ba', '1160ft2', 'available apr 22', 'flooring: wood', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T12:51:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-what-great-place-to-live-bd\/7459577581.html","post_id":7459577581,"result_date":"2022-03-17 17:29","title":"What a great place to live! 2 bd, 2 ba, 1018 sq ft. Come home today!","description":"Millview Apartments - A place to call home! Bed: 2 \/ Bath: 2  Sq. Footage: 1018 sq ft Rent: $1573 - $2184\/MonthTerms: Variable show contact info\nMillview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.Our Apartment Homes Feature:   ◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In Closets Our Residents Enjoy:  ◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral BonusesContact Info: show contact info\n100 Cobblestone Dr Coatesville, PA 19320 Website: https:\/\/www.apartmentsincoatesvillepa.com\/Mon - Fri: 9:00 AM - 6:00 PMSat - Sun: 10:00 AM - 5:00 PM Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. EQUAL HOUSING OPPORTUNITY7252BEBBC7094AC\n","num_images":12,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1018ft2', 'available mar 26', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-03-17T17:25:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wonderful-studio-with-all\/7459679702.html","post_id":7459679702,"result_date":"2022-03-17 22:40","title":"Wonderful Studio with ALL UTILITIES ARE INCLUDED  - FOR RENT","description":"Available Early June:\nWelcome to 1324 Locust St #1129! Located in historic Arts Condominium, this lovely studio \/ 1 bathroom unit is just steps from Broad Street’s Avenue of the Arts. ALL UTILITIES ARE INCLUDED in your rent, except for in-unit internet! There is free wi-fi in the lobby of the building. Unit #1129 offers modern features, hardwood floors, and two sizable windows for fantastic natural light. A ceiling fan provides year-round comfort. Your efficiency boasts wood cabinetry & stainless steel appliances. Head into the bathroom to view vintage floor tiling, tiled shower \/ tub combo, and medicine cabinet. Building amenities including a fitness center, laundry room, 24-hour desk attendant, hair salon and free internet in the lobby, common room with couches and meeting space, and much more right around every corner! Schedule your tour today!\nHardwood Floors\nStainless Steel Appliances\nNear Public Transportation\nAll Utilities Included\nSecure Entry\nElevator\nLaundry In-Building\nNatural Light\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":24,"lat":39.9487,"lng":-75.1593,"attrs":"['0BR \/ 1Ba', '321ft2', 'available jun 5', 'condo', 'laundry in bldg', 'no parking']","posted_date":"2022-03-17T22:36:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fantastic-trinity\/7459387162.html","post_id":7459387162,"result_date":"2022-03-17 11:10","title":"Fantastic Trinity Townhouse for rent in Washington Square West","description":"Fantastic Trinity Townhouse for rent in Washington Square West. Located on a quiet tucked away block off Juniper Street & Pine Street. This 954 square foot home has an open living room & kitchen on the first floor, the second floor has a bedroom and a bathroom, the third floor has a large bedroom. The basement has storage, utilities and a washer and dryer. A rear door goes to a common courtyard shared by neighbors. Walking distance to many theaters, restaurants and everything Center City has to offer. AKA-328 Butler Avenue. Applicants apply online through the National Tenant Network\nCentral Air Laundry in Building Pets Allowed\ncontact us for more info","num_images":6,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', '954ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-03-17T11:06:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/king-of-prussia-gorgeous-story-cottage\/7459324924.html","post_id":7459324924,"result_date":"2022-03-17 10:17","title":"Gorgeous 2 story Cottage with a wonderful Sun porch","description":"Housing Type: Cottage\/Cabin\nBedrooms: 1\nBathrooms: 1\nLaundry: w\/d in unit\nParking: attached garage\nKING OF PRUSSIA Gorgeous 1 Bedroom 1 bathroom 2 story Cottage with a wonderful Sun porch, Very unique, Large eat in kitchen, parking, Storage area, appliances, Hardwood floors,  Some utilities included in rent $800\nshow contact info","num_images":0,"lat":40.095512,"lng":-75.374622,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T08:16:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-the-edge-at-yardley-reserve\/7459515652.html","post_id":7459515652,"result_date":"2022-03-17 15:17","title":"The Edge at Yardley Reserve Now For Later","description":"Beautiful non- smoking private entrance community will be unrecognizable in 2022with amenities galore coming for you to enjoy! Beautiful outdoor spaces, fire pits, pool decks, grilling, lounge seating and so much more!\nWatch the club house be transformed to a state of the art entertainment center for residents to enjoy as an extension of their home!All of this and we haven't even mentioned the amazing apartment homes!\nBe the first to take advantage of new construction prices with quartz countertops, glass showers, deep tubs and beautiful hard surface flooring.\ndo NOT contact me with unsolicited services or offers\ndo NOT contact me with unsolicited services or offers\ndo NOT contact me with unsolicited services or offers","num_images":3,"lat":40.203849,"lng":-74.878794,"attrs":"['1BR \/ 1Ba', '1ft2', 'available jul 14', '\\nsaturday 2022-03-19\\n', '\\nmonday 2022-03-21\\n', '\\ntuesday 2022-03-22\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-03-17T15:13:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-all-new-renovations-bedroom\/7459405609.html","post_id":7459405609,"result_date":"2022-03-17 12:14","title":"All new renovations, 2 bedroom!","description":"Bedrooms: 2\nBathrooms: 2\nLaundry: w\/d in unit\nParking: off-street parking\nRED LION- Two bedroom and two bathroom gorgeous Home close to the park. Perfect for any and all families, with all new renovations, includes a brand new quartz kitchen.  $700\nshow contact info","num_images":0,"lat":40.0634,"lng":-74.999,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T11:43:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/mont-clare-2br-25-bath-luxurious-twin\/7459616799.html","post_id":7459616799,"result_date":"2022-03-17 19:05","title":"2BR 2.5 Bath, LUXURIOUS Twin 1245 SqFt","description":"CLEAN & BRIGHT!  Completely Renovated.  8 minute walk to all your favorite shops & restaurants!\nEach Bedroom has its own beautiful Private Bathroom with light tubes that let the sunshine in.  Tiled floors & showers, glass doors, and cozy bathroom heaters. Spacious bedrooms, newly carpeted, large closets, ceiling fans, extra storage, own thermostats, room darkening curtains, move in ready!\nAs you enter, drop your things off at the storage bench. Spacious 13' x 26' Living room. New plank flooring throughout the house.  Separate laundry room with side by side Washer\/Dryer and powder room located on 1st floor.  Cheerful oversized eat-in Kitchen has been fully renovated with top quality white cabinetry, granite countertops, wonderful tile backsplash, tons of storage with a nice pantry closet. All new, modern stainless steel appliances. Plenty of room to cook\/entertain with 8 foot island & 6 bar stools.  A Sliding glass door leads to a charming patio, where you can sit & dine with your guests out of the rain, while looking out into your private yard.  Cute garden shed and plenty of room for flowers or veggies if you like to garden.\nWarm and inviting, while having so many Modern Extras:  All windows have curtains, recessed lighting, accent walls and Central Air.  Storage space is incredible and features storage bins, shelving, and built in storage cabinets everywhere.\nBasement is DRY with extra shelving down steps for storage.\nOff Street parking for 3 cars.  Permit free street parking available for guests.\nAll Electric \/ Central Air  & Ceiling fans \/ Sun Tubes \/ W&D Included \/  Storage! \/ Covered Patio  \/  Shed \/  Fenced in Yard \/  3 car private parking \/ Fridge Door-In-Door, Microwave, disposal \/ Granite counters \/ Ceramic heaters \/  bathroom heaters \/ recessed lighting \/  Just Luxurious!\nEverything within walking distance of your front door. Cafes, shops, galleries and pubs in this downtown neighborhood.  Enjoy the farmers market, festivals, live music, Blobfest and nightlife without having to drive home.\nNO PETS, NO SMOKERS, NO VOUCHERS.\nTenant Pays: electric, water, sewer, trash, snow, cutting grass, weeds, and leaf removal.\n$35 Fee Non-Refundable with RentSpree.com for Credit\/Background\/Eviction Reports. Excellent Credit score 680+ & Proof of income required with application. No prior evictions.\nSecurity Deposit, First & Last month is required.  Non-refundable, 1st month rent due upon signing rental agreement. Last & Security Deposit due on move in. Private showings only\nPlease email:  include your name & phone number","num_images":15,"lat":40.139226,"lng":-75.512098,"attrs":"['2BR \/ 2.5Ba', '1246ft2', 'available apr 1', 'application fee details: $30 Covers App & Credit checks', 'flooring: wood', 'house', 'laundry in bldg', 'off-street parking', 'rent period: yearly']","posted_date":"2022-03-17T19:01:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/royersford-beautifully-upgraded-bedroom\/7459487674.html","post_id":7459487674,"result_date":"2022-03-17 14:21","title":"Beautifully Upgraded 1 Bedroom Ready for Move In!","description":"To schedule a tour\nWe now book our tour appointments online! Please call or text us at\nshow contact info\nto self-schedule from your phone! Book your appointment online today or anytime 24\/7!\nProperty Description\nOffering one, two and three  bedroom apartments with private entrances, these apartments more closely resemble private townhomes rather than an apartment rental community.  Easy access to Route 422, the main artery between Reading, Pottstown and King of Prussia.\nDetails\nAvailability date: March 18, 2022\nPets: Cats, Small Dogs (< 25lb), Large Dogs (> 25lb)\nPet notes: Our Pet Policy: $30\/month pet rent. $400 (Non-refundable pet fee) for “first pet” and $250 (Non-refundable pet fee) for the “second pet.” Maximum of 2 pets per apartment home. No pet deposit. Breed Restrictions Apply. No aggressive breeds shall be permitted.\nDeposit: $1,000.00\nLeasing options: 12+ months\nLeasing notes:\nApplication fee: $50 per adult\nAmenities\nIncluded in Utilities Cost: Water, Sewage, Garbage\nUtilities Cost: Varies by apartment size\nLaundry: In Unit\nParking type: Garage\nParking notes:\nAppliances: Dishwasher, Refrigerator, Microwave, Range\/Oven\nExterior: Balcony\/patio, Yard\nHeating\/cooling: Heat: forced air, Central AC, Ceiling fans\nWiring: Cable-ready, High-speed internet, Wired, Intercom system\nFacilities and Recreation: Shared pool, Fitness center, Clubhouse, Playground, Barbecue, Business center, Golf course\nSecurity and Access:\nViews:\nAdditional features: Hardwood floor, Tile floor, Granite countertop, Fireplace, Vaulted ceiling, Jacuzzi, Sauna, Hot tub \/ Spa, Non-Smoking Property\nOffered by:\nBotanica Cottages\nEqual Housing Opportunity","num_images":8,"lat":40.235417,"lng":-75.535466,"attrs":"['1BR \/ 1Ba', '714ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage']","posted_date":"2022-03-17T14:17:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-1735-oxford-st\/7459681861.html","post_id":7459681861,"result_date":"2022-03-17 22:51","title":"Welcome to 1735 W Oxford St with Great Natural Light - Must See","description":"Available early June | Landlord Requirements: Applicants to make 3x the monthly rent in verifiable net income, no landlord filings or evictions within the past 4 years, and must have a verifiable rental history.\nWelcome to 1735 W Oxford St #2F! This great studio \/ 1 bathroom apartment is one of 4 units in a truly magnificent building. This lovely space features remote control fans with dimming ability, hardwood floors, recessed lighting, fantastic natural light, and more! Enter into the large living area with a ceiling fan and big windows for maximum sunlight. There are two closets with some built-in shelves for ample storage space, and a large cut-out in the wall allows visibility to your kitchen. There is plenty of room for different furniture layouts. Kitchen features include granite countertops, white shaker cabinets above and below, and stainless steel appliances including dishwasher, gas range, built-in microwave, and refrigerator. Your full bathroom is accessible through the kitchen and offers tile flooring, a shower \/ tub combo, small window, and medicine cabinet. Shared coin operated washer and dryer available in the building. Schedule your showing today!\nBasement\nHardwood Floors\nStainless Steel Appliances\nNear Public Transportation\nLaundry In-Building\nDishwasher\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":16,"lat":39.9811,"lng":-75.174,"attrs":"['0BR \/ 1Ba', 'available jun 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-03-17T22:47:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedrooms-bathrooms-kitchen\/7459473043.html","post_id":7459473043,"result_date":"2022-03-17 14:11","title":"2 bedrooms 2 bathrooms , kitchen, completely renovated","description":"Newly renovated unit with fresh paint, brand new carpet in bedrooms, completely remodeled kitchen and master bath with white shaker cabinets, granite countertops, 2 bedrooms 2 bathrooms , kitchen, completely renovated with stainless steel appliances,2 newly renovated latest full bath Newly Remodeled ,  Freshly painted, new wooden floors throughout. Kitchen fully remodeled and freshly painted.  light fixtures and counter spaces\nlooking very clean and tidy and will take care of my property .  show contact info\nrenovated two bedroom\nApartment Amenities:\n❖ All Apartment with In-Unit Washer\/Dryer\n❖ included refrigerator\n❖ Bright Spacious  first Floor\n❖ Disability Access\n❖ Free WiFi Available\n❖ Close to  Mall\n❖ Easy Access to Maine\n❖ Flexible Lease Terms Available\n❖ Separate Dining Rooms In Select Apartments\n❖ Sustainable Apartment Plumbing Fixtures and HVAC Equipment\n❖ Easy Access to New Hampshire\n❖ Located Near Public Transportatio\n","num_images":9,"lat":39.9448,"lng":-75.2288,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: tile', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-03-17T13:49:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-bath-home\/7459381971.html","post_id":7459381971,"result_date":"2022-03-17 10:59","title":"Large 4 bedroom, 2 bath home for rent","description":"Large 4 bedroom, 2 bath home for rent in the heart of Fitler Square. Great location, huge backyard, washer dryer on premises.\nPets Allowed Main Floor Laundry\nContact Us For More Info","num_images":6,"lat":39.9379,"lng":-75.1794,"attrs":"['4BR \/ 2Ba', '1414ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking']","posted_date":"2022-03-17T10:55:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-after-hours-emergency\/7459607519.html","post_id":7459607519,"result_date":"2022-03-17 19:10","title":"After hours emergency maintenance","description":"After hours emergency maintenance","num_images":0,"lat":40.1267,"lng":-75.5272,"attrs":"['4BR \/ 2.5Ba', 'apartment', 'w\/d hookups', 'off-street parking']","posted_date":"2022-03-17T18:36:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enjoy-this-new\/7459408089.html","post_id":7459408089,"result_date":"2022-03-17 11:52","title":"Enjoy this new construction 1 bedroom apartment","description":"Available NOW! Views on Views! Enjoy this new construction 1 bedroom apartment on one of the highest floors of this building with stunning city views and lighting in Rittenhouse Square. This apartment is unique because it features large floor-to-ceiling windows and two french balconies (living room and bedroom). Additional amenities include an in-unit washer and dryer, smart lighting system, intercom security, hardwood floors, and brand-new stainless steel appliances. The building has multiple point security cameras, 3 rooftop decks accessible only to residents, elevator access, and two entrances.\nCentral Air Parking available Pets Allowed Main Floor Laundry Stainless Steel Appliances Hardwoodfloors\nContact Us For More Info","num_images":6,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '22706ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-03-17T11:48:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-townhouse-for-rentafford\/7459333676.html","post_id":7459333676,"result_date":"2022-03-17 09:12","title":"Townhouse for rent...afford you can make!!","description":"Beautiful bi-level townhouse in a corner building in Graduate Hospital. Hardwood floors throughout, brand new central air\/heat, washer\/dryer, a spacious living room, and 2 large bedrooms, each featuring large closets, and a full bathroom on the first floor. The 3rd bedroom - which has a full bathroom & extra large closet - is in the finished basement. Kitchen has stainless steel appliances, a dishwasher and granite counter tops. Located on a quiet block and extremely close to Center City, E. Passyunk, and South Street. Take a look for yourself! Also conveniently located in walking distance to Sprouts Supermarket and shopping at Lincoln Square.Text or email for viewing appointment zaleena063gm-il.c-m","num_images":9,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-03-17T08:53:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wondrous-bedroom-with\/7459688476.html","post_id":7459688476,"result_date":"2022-03-17 23:24","title":"Wondrous 2-Bedroom with Outdoor Space & Dishwasher - May!","description":"Available early May:\nWelcome to 238 W Girard Avenue #1! This fantastic 2 bedroom \/ 1 bathroom first floor unit features hardwood floors throughout, stainless steel appliances, in-unit laundry, private patio, and more! You enter the unit into the living area with incredible natural light from the 2 front windows. There is space for different living room and dining set ups, and the area flows directly into the kitchen. Cherry cabinets, marble countertops, tile backsplash, and stainless steel appliances including a dishwasher, microwave, oven\/stove, and refrigerator round out this stunning kitchen! Head down the hallway to the first bedroom, which is a little smaller and offers one window and closet. There is a washer\/dryer in the hallway as you continue to the full bathroom with tile flooring, vanity, medicine cabinet, and white subway tile shower\/tub. The primary bedroom is towards the back of the unit with one window and closet space. Don’t forget to check out your private patio – perfect for entertaining! Schedule a showing today!\nHardwood Floors\nStainless Steel Appliances\nPatio\/Yard\nNear Public Transportation\nLaundry In-Unit\nOutdoor Space\nDishwasher\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":22,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', 'available may 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T23:20:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fresh-fishtown-makeover\/7459321034.html","post_id":7459321034,"result_date":"2022-03-17 08:31","title":"Fresh Fishtown Makeover","description":"Bedrooms: 2\nBathrooms: 1.5\nLaundry: w\/d in unit\nParking: off-street\nFISHTOWN: 2  bedroom  1+ bathroom 2 story house, ceiling fans in all rooms, small driveway for off-the-street parking, yard pets ok $ 900\nshow contact info","num_images":0,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T07:55:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-luxury-new-construction-tour\/7459519155.html","post_id":7459519155,"result_date":"2022-03-17 15:24","title":"Luxury New Construction Tour Today and Save","description":"Beautiful non- smoking private entrance community will be unrecognizable in 2022with amenities galore coming for you to enjoy! Beautiful outdoor spaces, fire pits, pool decks, grilling, lounge seating and so much more!\nWatch the club house be transformed to a state of the art entertainment center for residents to enjoy as an extension of their home!All of this and we haven't even mentioned the amazing apartment homes!\nBe the first to take advantage of new construction prices with quartz countertops, glass showers, deep tubs and beautiful hard surface flooring.\ndo NOT contact me with unsolicited services or offers\ndo NOT contact me with unsolicited services or offers\ndo NOT contact me with unsolicited services or offers","num_images":10,"lat":40.203849,"lng":-74.878794,"attrs":"['3BR \/ 2Ba', 'available mar 31', '\\nfriday 2022-03-18\\n', '\\nsaturday 2022-03-19\\n', '\\nmonday 2022-03-21\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-03-17T15:20:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-rittenhouse-apt\/7459696010.html","post_id":7459696010,"result_date":"2022-03-18 00:10","title":"Spacious Rittenhouse Apt with Central Air and Free Storage Unit!","description":"The open layout, beautiful french doors, and gorgeous fireplace mantel help to create a truly comfortable living experience. Separate kitchen includes a dishwasher, garbage disposal and plenty of cabinet space. Apartment receives a ton of light from the huge floor to ceiling windows and the chic track lighting. The central air keeps the unit at an nice temperate, and the double pane windows help insulate the apartment in the winter. The 3 closets provide an abundance of storage space and the living room is equipped with a ceiling fan. Pristine hardwood floors flow throughout the unit.","num_images":4,"lat":39.947264,"lng":-75.176498,"attrs":"['1BR \/ 1Ba', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'laundry in bldg', 'street parking']","posted_date":"2022-03-18T00:06:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-leasing-special-well-known\/7459687114.html","post_id":7459687114,"result_date":"2022-03-17 23:17","title":"Leasing Special: Well Known 2BD Condo w. Sleek Interior","description":"Available early May | Leasing Special: $1,695\/month for a 14 month lease; or $1,725\/month for a 12 month lease.\nWelcome to 1102 N 4th St #C! This sunny 2 bedroom \/ 1 bathroom condo is on the third floor of a corner building, boasting a spacious interior with hardwood floors, great natural light, central a\/c, laundry in-unit, updated kitchen and bath, and even a private deck! Your entryway stairs open up into the main living\/dining space. This is the center of the unit with the kitchen and deck access on the western exposure with the bedrooms on the eastern side. There’s a skylight overhead which creates a bright and airy atmosphere, along with the sliding glass doors to your deck, and windows that wrap around two other walls. The kitchen has a full lineup of stainless steel appliances, granite countertops, and plenty of white cabinetry. A tile backsplash and recessed lighting complete the space, along with the laundry closet with stacked washer\/dryer for added convenience. Each bedroom is flooded with natural light, has hardwood floors, and ample closet space. The outdoor furniture is included in your lease, so you’re ready to start hosting right away! Schedule a tour now!\nHardwood Floors\nStainless Steel Appliances\nCentral A\/C\nNear Public Transportation\nCorner Unit\nGranite Countertops\nLaundry In-Unit\nSkylight\nOutdoor Space\nDishwasher\nDeck\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":20,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '687ft2', 'available may 5', 'condo', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T23:13:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-corner-bedroom-apt\/7459392321.html","post_id":7459392321,"result_date":"2022-03-17 11:20","title":"Corner 2 bedroom apt available now- in unit laundry","description":"Here at Westfield Apartments, we strive to make it a great place to live.\nOur monthly rent includes trash removal, snow removal, and water\/sewer!\nWe offer some great amenities such as on-site laundry facilities, 24-hour emergency maintenance, and private parking (Monthly Charge)!\nAll apartments have dishwasher, garbage disposal, and individual climate control! Our luxury Apartments come with in-unit laundry and wood plank flooring!\nWestfield is located directly off of City Line Avenue on Bryn Mawr Avenue, just minutes away from St Joseph’s University and Philadelphia College of Osteopathic Medicine. Transportation is a breeze with our prime location near the Wynnefield Avenue Station, a perfect location for an easy commute to work or school. We are in walking distance to the Bala R5 train station and SEPTA 40 bus line. This property is also surrounded by a variety of great neighborhoods.\nWant more information? Call  show contact info\nto schedule a tour!","num_images":6,"lat":39.991786,"lng":-75.226573,"attrs":"['2BR \/ 1Ba', '940ft2', 'available mar 23', '\\nthursday 2022-03-17\\n', '\\nfriday 2022-03-18\\n', '\\nsaturday 2022-03-19\\n', 'air conditioning', 'application fee details: $64 app fee per person', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T11:16:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gas-fireplace-bonus-office\/7459331452.html","post_id":7459331452,"result_date":"2022-03-17 09:09","title":"Gas fireplace, bonus office, huge back yard!","description":"Housing Type: House\nBedrooms: 3\nBathrooms: 2+\nLaundry: w\/d in unit\nParking: attached garage\nUNIVERSITY CITY: 3 bedroom 2+ bathroom, working gas fireplace, High ceilings with skylights in both living room and separate dining room, back yard, extra small room with built in bookshelves as office, pets $ 1000\nshow contact info","num_images":0,"lat":39.9597,"lng":-75.2024,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T08:44:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sure-to-impress-gorgeous\/7459664929.html","post_id":7459664929,"result_date":"2022-03-17 21:36","title":"Sure to Impress! Gorgeous 2BD with OFF-STREET PARKING","description":"Available early June:\nWelcome to 1717 Spruce St #3! This stunning bi-level 2 bedroom \/ 2 bathroom apartment is sure to impress! This unit is on the top two floors of the building and boasts high ceilings, hardwood floors, exposed brick, huge windows, an OUTDOOR SPACE, OFF-STREET PARKING, and a spacious floor plan with modern updates throughout. Your gorgeous kitchen has a lofted ceiling with an exposed brick accent wall, stainless steel appliances, and access to your private balcony! Your main hallway opens up into your sizable living room equipped with an incredible fireplace, antique molding, exposed beams, and room for a dining area. Head upstairs to a large hallway lined with detailed antique mirrors offering storage behind. Upstairs, you’ll love the original details of antique mirrors lining the hallway with storage behind. The primary bedroom is towards the front of this level featuring exposed beams along the ceiling and ample closet space. The full primary bathroom is luxurious with marble tiling, a large soaking tub, tiled shower stall with glass doors, and a dual vanity. This apartment includes a washer and dryer in-unit for ultimate convenience. Parking is available for additional $275\/month.  Schedule your showing today!\nHardwood Floors\nCentral A\/C\nExposed Brick\nNear Public Transportation\nBalcony\nLaundry In-Unit\nQuartz Countertops\nOutdoor Space\nDishwasher\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":24,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', 'available jun 5', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T21:32:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-restored-hardwood-flooring\/7459412115.html","post_id":7459412115,"result_date":"2022-03-17 12:27","title":"Restored hardwood flooring, finished basement, paver patio!","description":"Bedrooms: 3\nBathrooms: 2+\nLaundry: w\/d in unit\nParking: off-street parking\nGERMANTOWN: 3 Bedroom spacious home that’s perfect for everyone, including walk in closets in all three of these bedrooms. 2+ bath  2 Story houses with a raised deck that overlooks the whole city. Includes an inlaid Patio, Yard Hardwood Floors, includes a completely finished basement $950\nshow contact info","num_images":0,"lat":40.0338,"lng":-75.1731,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T11:55:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxurious-carpets\/7459357099.html","post_id":7459357099,"result_date":"2022-03-17 10:23","title":"Luxurious Carpets! Immaculate Six bedroom home!","description":"Housing Type: House\nBedrooms: 6\nBathrooms: 3.5\nLaundry: w\/d in unit\nParking: attached garage\nUNIVERSITY  CITY: 6  bedroom 3+ bathroom home, an immaculate home with gleaming walls, including a huge wall of windows, new carpet, air conditioning! Large kitchen $ 1250\nshow contact info","num_images":0,"lat":39.9597,"lng":-75.2024,"attrs":"['6BR \/ 3.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T09:59:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-elevator-efficient\/7459593968.html","post_id":7459593968,"result_date":"2022-03-17 18:07","title":"Elevator, Efficient Appliances, Historic Building","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1164Date Available: 2022-03-17Address: 631 N Broad StThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past. Amenities Include:Electronic ThermostatGas RangeOn-Site ManagementRecyclingHardwood FloorsExposed Brick & Spiral DuctworkPeloton RoomRoof DeckClementine's Stable CafeEnergy-efficient, gas-powered HVACEfficient AppliancesLatchOS technology lock systemCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/u6p5qzii\/stable-lofts\n","num_images":9,"lat":39.964408,"lng":-75.160971,"attrs":"['2BR \/ 2Ba', '1164ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T18:03:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-1bed-1bath\/7459381997.html","post_id":7459381997,"result_date":"2022-03-17 11:15","title":"NEWLY RENOVATED 1BED 1BATH  NEAR TEMPLE HOSPITAL AND UNIVERSITY. #","description":"Tioga Gardens is a beautifully landscaped property that boasts spacious apartments, great closet space, carpeting, A\/C, and refrigerator. Close to public transportation, broad street with center city easily accessible, Temple Hospital and University. Income restrictions apply.","num_images":4,"lat":39.955394,"lng":-75.171134,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'wheelchair accessible']","posted_date":"2022-03-17T10:55:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-secluded-home-on-tree\/7459376610.html","post_id":7459376610,"result_date":"2022-03-17 11:19","title":"Secluded home on tree-lined street with restored hardwood floors!","description":"Bedrooms: 2\nBathrooms: 2\nLaundry: w\/d in unit\nParking: off-street parking\nNORTHERN Liberties: 2 bedroom, 2 bath, beautiful Northern Liberties home, brand new beautiful place with new air conditioner, completely refurbished hardwood $925\nshow contact info","num_images":0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T10:44:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bathroom\/7459391689.html","post_id":7459391689,"result_date":"2022-03-17 11:19","title":"Beautiful 2 Bedroom 2 Bathroom Apartment Home with Washer and Dryer","description":"The home at 1902 is a 1,185 square foot Da Vinci two bedroom two bathroom apartment home in a building located on Rittenhouse Square! This home on the 19th floor has windows that face east for morning sunshine and afternoon shade and have a city view. The beautiful kitchen and bathrooms are definitely a must see! There is also abundant closet space for plenty of storage. Experience the convenience of having a combination washer and dryer inside your new home! Move into your new home immediately!\nThe Rittenhouse Claridge offers you the opportunity to live in Philadelphia’s most vibrant, walkable neighborhood. So close to stores and restaurants! Target, Giant, Trader Joe's, Sue's Produce Market, Rittenhouse Market, Spruce Food Market, and Di Bruno Bros. are grocery stores within walking distance! Shop at the retail stores of Rittenhouse Row such as Barnes & Noble, Anthropologie, Lagos, Tumi, Tiffany & Co., Lovesac, Athleta, lululemon, Indochino, Madewell, Shakespeare & Co., Paper Source, L'Occitane, Boyds, Banana Republic Factory, Sephora, and Nordstrom Rack. Nearby dining options include: Rouge, Parc, Barclay Prime, Pietro's Coal Oven Pizzeria, Devon Seafood Grill, a.bar, a.kitchen, Spice Finch, Via Locusta, The Love, Marathon Grill, Gran Caffe L'Aquila, and Alice Pizza. Sip a delicious coffee at La Colombe, Ultimo, Elixr, and Gran Caffe L'Aquila. Indulge in a beautiful French dessert at Miel Patisserie. Stroll across the park and then buy a loaf of artisanal bread from Metropolitan Bakery.\nCommunity Features:\n* 24\/7 8,000 square foot resident lounge with free wifi\n*  24\/7 top-of-the-line fitness center\n* Fitness\/yoga studio\n* Sauna\n* Package room\n* Bike storage\n* Pet-friendly building complete with a dog spa! Please note that certain restrictions apply.\n* Elevator building with 24\/7 front door attendant and concierge desk staff\n* Amazing roof deck with fantastic views\n* Laundry room on every floor\n* Large laundry facility on the 3rd floor\n* Attached parking garage! Please note that these parking spaces are not owned nor managed by community and the cost is separate.\nApartment Home Features:\n* Combination washer and dryer\n* Spacious closets\n* Large east-facing windows\n* City view\n* Wood floors\n* Renovated kitchen\n* White kitchen cabinets\n* Granite kitchen counters\n* Dishwasher\n* Disposal\n* Gas stove\n* Microwave\n* Marble bathrooms\n* Spacious home\n* All utilities included (except cable and internet)\nCall Jocelyn  show contact info\nx122 or Michelle at  show contact info\nx129 to schedule an appointment to tour. Please note that an appointment is required to tour at this time. Live virtual tours on FaceTime and in Zoom available!\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nVisit our website at rittenhouseclaridge.com for the most up-to-date availability!\nPrice posted is for the 22 month lease term.\n1-22 month lease terms available!\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24,"lat":39.949836,"lng":-75.170538,"attrs":"['2BR \/ 2Ba', '1185ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T11:15:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-private-entrance-solarium\/7459337250.html","post_id":7459337250,"result_date":"2022-03-17 09:24","title":"Private entrance. Solarium!","description":"Housing Type: Apartment\nBedrooms: 2\nBathrooms: 2\nLaundry: w\/d in unit\nParking: off-street\nROXBOROUGH: 2  bedroom 2 bathroom duplex, Includes gorgeous partially finished basement, fenced in yard with a built-in barbecue pit, private entrance at a solarium! $ 995\nshow contact info","num_images":0,"lat":40.0402,"lng":-75.2231,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T09:04:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-impressive-2bd-in-fishtown\/7459685992.html","post_id":7459685992,"result_date":"2022-03-17 23:11","title":"Impressive 2BD in Fishtown with Amazing Stylish Space - June!","description":"Available Early June:\nWelcome to 1416 Frankford Ave #201! This stunning 2 bedroom \/ 1 bathroom apartment is ready to welcome tenants into a fresh stylish space. Located in a fantastic building in the heart of Fishtown and offering the conveniences of secure key fob entry, a central courtyard, and access from both Frankford Avenue and Front street. Enter into the unit with hardwood floors and recessed lighting throughout. The open floor plan is spacious and bright and the exposed spiral ductwork adds a nice industrial feel to the contemporary unit. Your contemporary kitchen boasts gorgeous minimalistic wooden cabinetry with antique gold hardware and white subway tile backsplash. A full set of stainless steel appliances ensure that cooking is a breeze! There are two sizable bedrooms with windows for natural light, ample closet space, ceiling fans for extra comfort, and beautiful accent lighting for a touch of style. The bathroom offers a large frameless glass shower, tile flooring, and bright clean finishes. All units in the building have noise dampening windows that make it quiet and in-unit laundry. Schedule your tour today!\nHardwood Floors\nStainless Steel Appliances\nCentral A\/C\nNear Public Transportation\nSecure Entry\nLaundry In-Unit\nDishwasher\nCommon Outdoor Space\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":21,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 1Ba', '790ft2', 'available jun 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T23:07:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-life-just-got-better\/7459323215.html","post_id":7459323215,"result_date":"2022-03-17 08:11","title":"Life Just Got Better","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IP\/N5K0\n\nWallingford Estates Apartments offers a relaxing atmosphere that allows you a peaceful alternative to your hectic, daily schedule. No matter how stressful your day may be, the serene surroundings of our community will show you how enjoyable it is to come home. Located near major commuter highways just 10 minutes from Philadelphia, Wallingford Estates Apartments provides the right setting for today's lifestyle.\nHome Amenities\nContemporary Kitchens\nStainless-Steel Appliances In Select Homes\nFormica Countertops\nOversized Closets\nBalcony Or Patio\nCable Ready\nHigh Efficiency Gas Heat\nHigh Efficiency Hot Water Systems\nIndividually Controlled Heating\nHeat Included In Rent\nSpacious Room Sizes\nCommunity Amenities\nLaundry Rooms On Premises\nParcel Receiving\nWell-Kept Grounds\n24 Hour Emergency Maintenance\nSecurity Cameras On Premises\nOn-Site Parking\nPark-Like Setting\nPet Friendly Community With Some Restrictions\nPublic Transportation\nFax & Copier Services Available\nWallingford Estates Apartments Information\nAddress: 2701 Madison St, Chester PA, 19013\nPhone: show contact info\nWebsite: wallingfordestates.net\nApplication Fee: $35 (Note: Per Applicant)\nPet Fee: $125 - 175 (Note: Varies By Type Of Pet (15lb Limit For Dogs))\nOffice Hours\nMonday: By Appointment\nTuesday: By Appointment\nWednesday: By Appointment\nThursday: By Appointment\nFriday: By Appointment\nSaturday: Closed\nSunday: Closed\n","num_images":4,"lat":39.869901,"lng":-75.368013,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: Per Applicant', 'apartment', 'laundry on site', 'no smoking', 'off-street parking']","posted_date":"2022-03-17T08:07:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/drexel-hill-sunny-bedroom\/7459364826.html","post_id":7459364826,"result_date":"2022-03-17 10:21","title":"Sunny 1 bedroom","description":"New kitchen cabinets\nNew bathroom\nHardwood floor\nEverything is including except electric","num_images":0,"lat":39.96302,"lng":-75.305948,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking']","posted_date":"2022-03-17T10:17:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-cozy-apartment-private\/7459548806.html","post_id":7459548806,"result_date":"2022-03-17 16:26","title":"Cozy Apartment! Private Entrance, Free Parking, W\/D, Storage","description":"Hours of Operation;\nMonday-Friday 8:30 am-5:00 pm\nVirtual Tours, Facebook Tours and No Contact Tours Available by Appointment Only!\nThis offer can be withdrawn at any time without prior written notice. Qualified applicants only\nVisit your new apartment home by taking a self-guided tour with Andrea today! We also our offering virtual tours. Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday: 8:30 am-5:00 pm. Need to request another time for your personalized visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nApartment Features:\n-Air Conditioning\n-Kitchen Island\n-Walk-In Closet\n-Gas Range\n-Refrigerator\n-Washer\/Dryer\n-Tile Backsplash\n-Carpeting\n-Storage Available\n-Accent Walls Available\nPET FRIENDLY\nCommunity Features:\n-Off Street Parking\n-Garage Parking Available\n-BBQ Area\n-Private Courtyard\n-Walk to Train\n-Walk to Restaurants\n-Jogging Trail\n-Convenient Shopping\n-24 Hour Maintenance Service\n-Online Payments\n-Onsite Management\nCall:  show contact info\nand ask for Andrea!\nFor more information or to start your application, visit us at: yourmetropolitan.com\/rent-balacynwyd\nThe metropolitan bala cynwyd offers an apartment home for rent with a beautiful secluded courtyard setting, newly renovated, old-world charm. Located in Lower Merion Township along the Main Line, our apartment home community is walking distance shopping, restaurants, nightlife and theatres.\nConvenient to Routes- 76, 1, 30, 23, 476, Center City Philadelphia, PCOM, SJU, UPENN colleges. Lankenau, Bryn Mawr, UPENN and CHOP Hospitals. Convenient drive to Fairmount Park, Manayunk, Ardmore, Narberth and Wynnewood\nEqual Housing Opportunity","num_images":8,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1.5Ba', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: carpet', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: yearly']","posted_date":"2022-03-17T16:22:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-choice-awesome-2bd\/7459679046.html","post_id":7459679046,"result_date":"2022-03-17 22:37","title":"Great Choice! Awesome 2BD w. Luxurious Finishes - Must See","description":"Available early June:\nWelcome to 1339 N Marston St #2! This bi-level 2 bedroom \/ 2.5 bathroom features hardwood floors and recessed lighting throughout. Offering a gorgeous modern interior, outdoor space, and luxurious finishes, this unit is truly a renter’s dream! The living area is bright and spacious with large windows and access to your private patio. Built-in speakers provide surround sound for ultimate modern living. Your kitchen features marble counters, two-tone cabinetry, subway tile backsplash, and stainless steel appliances including dishwasher, built-in microwave, electric stovetop \/ oven, and double-door fridge with water dispenser. An island provides additional prep space and counter seating. A powder room behind the kitchen offers convenience for your guests. There are two sizable bedrooms with recessed lighting, speakers built-in to the ceilings, and walk-in closets that lead to your contemporary en suite full bathrooms. Schedule your tour today!\nHardwood Floors\nStainless Steel Appliances\nPatio\/Yard\nCentral A\/C\nNear Public Transportation\nFitness Center\nGranite Countertops\nSecure Entry\nLaundry In-Unit\nWalk-in Closet\nOutdoor Space\nDishwasher\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":14,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', 'available jun 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T22:33:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-temple-5-bed-bath-home\/7459474049.html","post_id":7459474049,"result_date":"2022-03-17 13:55","title":"Temple U 5 bed 3 bath home with HUGE rooms, W\/D & more!","description":"1623 Fontain St - 6 bedroom, 3 bathroom home with tons of great amenities!\nThis massive & modern 6 Bedroom 3 Bathroom luxury home, located just off of Temple U’s campus has a super awesome patio space, central air\/heat and tons of other great amenities–and it’s where you’ll want to call home this Fall. This fantastic gem of a home includes hardwood and tile flooring, tall ceilings, ceiling fans, exposed brick accent walls, tons of natural light and very spacious common spaces & bedrooms. Enjoy stainless steel appliances within the kitchen, as well as the convenience of a dishwasher, microwave, sleek granite counter tops, tons of cabinet and much more. Oh and the best part: your very own in unit Washer and Dryer!!\nPhenomenal location that is extremely close to Temple University campus for anyone looking for a very large 6 bedroom home with high end luxury amenities, right in the middle off all the off campus housing options. Located near Septa BSL & alternate transpo lines, AMC Theaters, Fresh Grocer, Chik-fila, police station, convenience stores, bars, restaurants and much more.\nHome features:\nHUGE common spaces\n6 Spacious bedrooms\nHardwood floors\nCentral air and heat\nWasher and Dryer\nFull size appliances\nLarge Patio Space\nThis is a winner of an home you do not want to miss out on for the coming year. Contact Bryan today to find out further information and schedule your appointment to take a look.\n","num_images":23,"lat":39.984504,"lng":-75.159955,"attrs":"['6BR \/ 3Ba', 'available aug 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T13:51:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studio-apartment\/7459338023.html","post_id":7459338023,"result_date":"2022-03-17 09:11","title":"Studio Apartment","description":"Studio Apartment\nCompletely New Construction\nNew Floors\nNew Kitchen\nNew Bathroom\nNew Appliances\nElevator in Building\nLaundry in Building\nClose to Schools, Hospital & Transportation\nNo Pets Allowed\nLocation: 5101 N. 12th Street, Unit 6C, 19141 (Logan)","num_images":3,"lat":40.0365,"lng":-75.1451,"attrs":"['0BR \/ 1Ba', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-03-17T09:07:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lease-to-own-pristine\/7459321702.html","post_id":7459321702,"result_date":"2022-03-17 08:22","title":"Lease to own! Pristine marble kitchen!","description":"3 bedroom, 2+ bath 2 story stately home that includes an elegant spiral staircase. Has beautiful new carpeting and freshly painted walls, Includes a covered front porch and a large Yard,  Pets! $975\nshow contact info","num_images":0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 2.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T07:59:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-stylish-features-washer-dryer\/7459374624.html","post_id":7459374624,"result_date":"2022-03-17 10:46","title":"Stylish Features, Washer Dryer in Unit, Carports","description":"The Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nThe Point at Pennbrook Station is ideally located close to some of the areas best shopping, restaurants, and entertainment options. Best of all, the Lansdale Line at nearby Pennbrook Station is just a short walk from your apartment, making travel incredibly convenient. Contact us today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, walk-inc lost, laundry room with washer\/dryer, and a private porch!\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com","num_images":12,"lat":40.226234,"lng":-75.283466,"attrs":"['1BR \/ 1Ba', '755ft2', 'available apr 9', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T10:40:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-resort-style-living-new\/7459522988.html","post_id":7459522988,"result_date":"2022-03-17 15:32","title":"Resort Style Living New Construction Multiple Floorplans","description":"Beautiful non- smoking private entrance community will be unrecognizable in 2022 with amenities galore coming for you to enjoy! Beautiful outdoor spaces, fire pits, pool decks, grilling, lounge seating and so much more!\nWatch the club house be transformed to a state of the art entertainment center for residents to enjoy as an extension of their home!All of this and we haven't even mentioned the amazing apartment homes!\nBe the first to take advantage of new construction prices with quartz countertops, glass showers, deep tubs and beautiful hard surface flooring.\ndo NOT contact me with unsolicited services or offers","num_images":17,"lat":40.203849,"lng":-74.878794,"attrs":"['1BR \/ 1Ba', 'available mar 25', '\\nsaturday 2022-03-19\\n', '\\nmonday 2022-03-21\\n', '\\nwednesday 2022-03-23\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking']","posted_date":"2022-03-17T15:28:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gas-fireplace-secluded\/7459375260.html","post_id":7459375260,"result_date":"2022-03-17 10:55","title":"Gas fireplace! Secluded immaculate home!","description":"Bedrooms: 3\nBathrooms: 2\nLaundry: w\/d in unit\nParking: off-street parking\nBELLA VISTA: 3 bedroom 2 bath 2 story just a few blocks away from the park! Includes a gigantic fireplace in an exposed brick wall, sits on a very large completely fenced in yard pets ok!  $1050\nshow contact info","num_images":0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T10:41:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-ready-to-occupy-incredible\/7459686736.html","post_id":7459686736,"result_date":"2022-03-17 23:15","title":"Ready to Occupy: Incredible 2BD with Great Views - Center City","description":"Available NOW:\nWelcome to 35 S 13th St #4! This beautiful 2 bedroom \/ 1 bathroom fourth floor apartment features great views, hardwood floors with wainscoting details, central A\/C, gas fireplace, ceiling fans, and so much more! Enter into the open floor plan with gorgeous exposed brick detailing and large windows. The kitchen along one wall offers space for an island or table, and features tile backsplash, wood cabinets above & below, modern hanging light fixtures, and a dishwasher, microwave, gas range, and refrigerator. The living area offers plenty of space for different furniture layouts and entertaining guests. Head into the first bedroom featuring two large windows, a closet with sliding doors, and room for a queen sized bed. Your full bathroom boasts tile flooring, a vanity with additional storage space, medicine cabinet, stacked washer and dryer, and a tiled tub. The second bedroom is larger with a closet, door to the fire escape, and windows along two walls for incredible sunlight! This great space won’t last long – schedule your tour today!\nHardwood Floors\nCentral A\/C\nNear Public Transportation\nLaundry In-Unit\nDishwasher\nNatural Light\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":17,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', 'available now', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T23:11:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-leasing-special-charming\/7459678122.html","post_id":7459678122,"result_date":"2022-03-17 22:33","title":"Leasing Special: Charming 2BD with Central A\/C& W\/D in Unit","description":"Available NOW | Leasing Special: $1,995\/month for a 12 month lease; or $1,950\/month for a 16 month lease\nWelcome to 1764 N Hope St #1A! Located on a quiet side street in the popular Olde Kensington area of Philadelphia. This fantastic 2 bedroom \/ 1.5 bathroom is a bi-level apartment featuring hardwood floors, recessed lighting, a balcony, contemporary design, stainless steel appliances, a spiral staircase, and bright natural light! You enter the unit into the living room with hardwood floors, tons of sunlight, and a lovely half bath for your convenience. Continue back through the open floor plan to the kitchen, which offers bar seating at the counter, cabinets above and below for storage, and stainless steel appliances including a fridge, dishwasher, gas oven\/stove range, and built-in overhead microwave. From the kitchen you can access your balcony – perfect for enjoying your morning cup of coffee! The spiral staircase takes you to the lower level where you will find two spacious bedrooms, each with ample closet space and more natural light. The sleek bathroom is accessible from the hall as well as directly from the main bedroom and boasts tile flooring, a shower\/tub combo with white subway tile, and a vanity with additional storage space underneath.  The building has a common roof deck where you can enjoy breathtaking views of the Philadelphia skyline and get to know your neighbors! This incredible space won’t last long – schedule a tour today!\nHardwood Floors\nStainless Steel Appliances\nCentral A\/C\nRooftop Deck\nNear Public Transportation\nGranite Countertops\nLaundry In-Unit\nElectronic Keyless Entry\nOutdoor Space\nDishwasher\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":23,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 1.5Ba', '926ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T22:29:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-after-hours-emergency\/7459590939.html","post_id":7459590939,"result_date":"2022-03-17 18:25","title":"After hours emergency maintenance","description":"After hours emergency maintenance","num_images":0,"lat":40.1267,"lng":-75.5272,"attrs":"['3BR \/ 2Ba', 'apartment', 'w\/d hookups', 'detached garage']","posted_date":"2022-03-17T17:56:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gas-fireplace-french-doors\/7459393243.html","post_id":7459393243,"result_date":"2022-03-17 12:01","title":"Gas fireplace! French doors!","description":"Bedrooms: 1\nBathrooms: 1\nLaundry: w\/d in unit\nParking: off-street parking\nBREWERYTOWN: 1 bedroom, 1 bath a fantastic 2nd floor apartment that looks brand new. Sits on a large fenced in yard and has a large deck that holds the private entrance, house apartment that’s been converted from a large building. Includes a gas fireplace utilities paid $725\nshow contact info","num_images":0,"lat":39.9811,"lng":-75.174,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T11:18:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-location-convenience\/7459542209.html","post_id":7459542209,"result_date":"2022-03-17 16:12","title":"Luxury, Location, Convenience!","description":"Bedrooms: 1Bathrooms: 1Square Feet: 566Date Available: 2022-03-17Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.Call:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/nmve2soz\/lincoln-square\n","num_images":1,"lat":39.939062,"lng":-75.166569,"attrs":"['1BR \/ 1Ba', '566ft2', 'available now', 'apartment', 'w\/d in unit', 'carport']","posted_date":"2022-03-17T16:08:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spring-special-2nd-month\/7459319269.html","post_id":7459319269,"result_date":"2022-03-17 07:47","title":"💵SPRING Special - 2nd month FREE. Fully Furnished Studio 💵","description":"FULLY FURNISHED and accessorized micro suite in the 💜 of Rittenhouse Square!\n🧺 Laundry In Building\n✨ Recessed lighting\n🍽 Fully Equipped kitchen with gas cooking, dishwasher, microwave & garbage disposal\n🧼 White tiled bathroom with soaking tub\n✨ Real HW floors throughout\n❄ AC in unit\n🐕 Pet Friendly\n🌳 Easy access to Rittenhouse Square Park, grocery, cafes and the best restaurants that Philly has to offer\n","num_images":7,"lat":39.948782,"lng":-75.176163,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T07:43:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-well-known-studio-condo\/7459664561.html","post_id":7459664561,"result_date":"2022-03-17 21:35","title":"Well Known Studio Condo with GYM & Corner Unit - Must See","description":"Available early June:\nWelcome to 1324 Locust St #712! This lovely studio \/ 1 bathroom condo is a corner unit with hardwood floors and bright natural light. ALL UTILITIES are included in the rent: heat, electricity, water and Cable TV (channels 1-100 + Free HBO). The only thing you would have to pay extra for is internet for your unit, but there is free wifi in the lobby of the building. Additional building amenities include 24\/7 front desk attendant, on-site management and maintenance staff, large laundry facilities, a business\/club room, and a gym on-site you would have access to 24\/7. Unit #712 offers 3 large windows for sunlight and a ceiling fan for year-round comfort. Your full bathroom boasts stunning subway tiling in the shower \/ tub combo and a medicine cabinet provides additional storage. An efficiency kitchen is available for added convenience – schedule your tour today!\nHardwood Floors\nStainless Steel Appliances\nNear Public Transportation\nCorner Unit\nFitness Center\nSecure Entry\nElevator\nLaundry In-Building\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":24,"lat":39.9487,"lng":-75.1593,"attrs":"['0BR \/ 1Ba', 'available jun 5', 'condo', 'laundry in bldg', 'no parking']","posted_date":"2022-03-17T21:31:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brewerytown-2br-for-rent\/7459505419.html","post_id":7459505419,"result_date":"2022-03-17 14:58","title":"Brewerytown 2BR for rent","description":"Brewerytown 2BR just listed! Across the street from Aldi and 1 block from fairmount park\/lemon hill. Schedule a visit!\nFor full description and how to apply:\nhttps:\/\/www.compass.com\/listing\/3045-baltz-street-philadelphia-pa-19121\/997208917131151033\/","num_images":3,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 1.5Ba', '1200ft2', 'available apr 1', 'dogs are OK - wooof', 'flooring: wood', 'apartment', 'w\/d in unit', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T14:53:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-breathtaking-3bd-unit\/7459686098.html","post_id":7459686098,"result_date":"2022-03-17 23:12","title":"Breathtaking 3BD Unit w. Private Roof Deck + Modern Kitchen","description":"Available early April:\nWelcome to 3965 Lancaster Ave #302! This stunning bi-level 3 bedroom \/ 2 bathroom unit features a private roof deck, recessed lighting throughout, and in-unit laundry, and central air conditioning. You enter the apartment into the common area with your modern kitchen towards the front and your living area at the back. The L-shaped kitchen features white shaker cabinets, white subway tile backsplash, and stainless steel appliances including electric stove, fridge, dishwasher and microwave. An island provides extra prep space, hanging light fixtures, and counter seating for added convenience. Your living area is spacious and bright, offering plenty of room for separate living room and dining room set ups. A small balcony is great for enjoying your morning cup of coffee, and the stairs to the right of the unit lead to the second level. Upstairs you can find 3 sizable bedrooms with windows and custom closets! There is laundry available in the hall and 2 modern bathrooms boasting tile flooring, and vanities. 1 bathroom has a lovely tiled shower stall and the other features a tiled tub. There is also access to a private roof deck – perfect for those warmer months! Schedule your showing today!\nStainless Steel Appliances\nCentral A\/C\nRooftop Deck\nNear Public Transportation\nLaundry In-Unit\nOutdoor Space\nDishwasher\nDeck\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":22,"lat":39.9597,"lng":-75.2024,"attrs":"['3BR \/ 2Ba', 'available apr 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T23:08:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-idea-studio-condo-with-all\/7459687718.html","post_id":7459687718,"result_date":"2022-03-17 23:20","title":"Idea Studio Condo with ALL UTILITIES ARE INCLUDED","description":"Available early June:\nWelcome to 1324 Locust St #1004! This fantastic studio \/ 1 bathroom unit is located in the historic Arts Condominium, just steps from Broad Street’s Avenue of the Arts. ALL UTILITIES ARE INCLUDED in your rent, except for in-unit internet! There is free wi-fi in the lobby of the building. Unit #1004 is a 10th floor corner unit featuring 3 windows, a ceiling fan for added comfort, and gorgeous hardwood floors. A closet provides ample storage space and an efficiency kitchen offers ultimate convenience. Your bathroom boasts a large window, a vanity with additional storage space, and a white subway tiled tub \/ shower combo. Building amenities including a fitness center, laundry room, 24-hour desk attendant, hair salon and free internet in the lobby, common room with couches and meeting space, and much more right around every corner! Schedule your tour today!\nHardwood Floors\nNear Public Transportation\nCorner Unit\nFitness Center\nSecure Entry\nLaundry In-Building\nNatural Light\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":24,"lat":39.9487,"lng":-75.1593,"attrs":"['0BR \/ 1Ba', 'available jun 5', 'condo', 'laundry in bldg', 'no parking']","posted_date":"2022-03-17T23:16:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-move-in-now-dedicated-1bd\/7459661865.html","post_id":7459661865,"result_date":"2022-03-17 21:24","title":"Move in Now: Dedicated 1BD w. Modern Finishes - Wissahickon","description":"Available NOW | Landlord Requirements: Applicants to make 3x the monthly rent in verifiable net income, no landlord filings or evictions within the past 4 years, and must have a verifiable rental history.\nWelcome to 5312 Ridge Ave, located in the heart of the Wissahickon neighborhood of Philadelphia! This stunning new construction offers contemporary finishes and spectacular amenities, including an enormous roof deck, covered parking garage, and elevator for your daily convenience. Unit #407 is a gorgeous 1 bedroom \/1 bathroom apartment with modern finishes and tons of natural light. All units have fresh white cabinets, white subway tile backsplash, quartz counters, and stainless steel appliances dishwasher, microwave, fridge, and oven\/stove combo in the kitchen. Sleek wood floors throughout with large windows for natural light along with recessed lighting. Units also have an in-unit washer\/dryer for added convenience! PTAC units in each room for utmost comfort! There’s plenty more to see, so schedule your showing of this beautiful unit today!\n* Note: Photos are samples from various units in the building. Exact layout and finishes may differ.\nHardwood Floors\nStainless Steel Appliances\nRooftop Deck\nOff-Street Parking\nElevator\nLaundry In-Unit\nElectronic Keyless Entry\nDishwasher\nCommon Outdoor Space\nNatural Light\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":24,"lat":40.0402,"lng":-75.2231,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T21:20:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-studio-apt\/7459401119.html","post_id":7459401119,"result_date":"2022-03-17 11:38","title":"Renovated studio apt available now - in unit laundry","description":"Ask about Unit 307!\nTotally redesigned!\nNewly renovated!\nWasher and dryer in apartment!\nCentral heat\/AC!\nBeautiful bathroom!\nPerfect location!!\n24 hours emergency maintenance!!\nPet Friendly!! Call for details\nExceptional staff- Ask for Jess\/John!\nChoose Westfield Apartments to be your new home!\nCall to schedule an onsite visit!\nMove in ASAP!! Ask about our special","num_images":7,"lat":39.991786,"lng":-75.226573,"attrs":"['0BR \/ 1Ba', '350ft2', 'available mar 21', '\\nthursday 2022-03-17\\n', '\\nfriday 2022-03-18\\n', '\\nsaturday 2022-03-19\\n', 'air conditioning', 'application fee details: $64 app fee per person', 'cats are OK - purrr', 'flooring: wood', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T11:34:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rent-to-own-this-beautiful\/7459322623.html","post_id":7459322623,"result_date":"2022-03-17 08:30","title":"Rent to own this beautiful Castor Gardens home with two-car garage","description":"3 bedroom, 2+ bath, an extremely elegant Castor Gardens, a beautiful place that has its own large rooftop deck. Also includes a two car garage 2 story place that has an extra small finished room overtop $875\nshow contact info","num_images":0,"lat":40.0596,"lng":-75.0818,"attrs":"['3BR \/ 2.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T08:03:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-terrific-location-cute\/7459684791.html","post_id":7459684791,"result_date":"2022-03-17 23:05","title":"Terrific Location! Cute 1BDRM with Private Roof Deck - April","description":"Available Early April:\nWelcome to 1452 N 4th St #3! This beautiful 1 bedroom \/ 1 bathroom apartment is ready to welcome you home with a private roof deck! Featuring hardwood floors, recessed lighting stainless steel appliances, and high end finishes throughout, you’ll love this great unit. Enter into the spacious living area with tons of natural light shining in from the windows. The straight-back floor plan leads you through the dining area into the kitchen which boasts gorgeous cabinetry above and below, tile backsplash, tons of counter space, and stainless steel appliances including a dishwasher, microwave, oven\/stove range, and a large fridge. Continue back to the full bathroom with great tiling, a vanity, and a standing shower with glass doors. Your nicely sized bedroom can be found at the back of the unit and offers incredible sunlight and a closet. You’ll have a private roof deck – perfect for entertaining! Schedule your showing today!\nHardwood Floors\nStainless Steel Appliances\nCentral A\/C\nRooftop Deck\nNear Public Transportation\nLaundry In-Unit\nDishwasher\nContact Info:\nJG Real Estate\n1140 Frankford Avenue\nPhiladelphia, PA 9125\n","num_images":22,"lat":39.978,"lng":-75.1459,"attrs":"['1BR \/ 1Ba', 'available apr 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T23:01:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-hurry-hurry-hurry-dressing-rm\/7459607223.html","post_id":7459607223,"result_date":"2022-03-17 18:39","title":"Hurry, Hurry, Hurry! Dressing Rm-New Kit-W\/D-AC-DW-Quartz-Gym-Storage","description":"Spring is in the air....\"Location, Location, Location\"...you can walk everywhere!\nSPECIAL-Security Deposit $500\nHUGE Dressing Room\/Closet and Washer and Dryer Under Large Breakfast Bar!\nFirst Floor: Secluded, Renovated Kitchen, Spacious Floor Plan, perfect studio does exist...perfect for YOU!\nThis elegant apartment home features a gourmet kitchen, quartz counters, huge breakfast bar and has designer wall and trim color. Visit to see our high-end appliances including a washer\/dryer, stainless-steel appliances, AC and dishwasher. Additional stylish features are lovely Moroccan archways, rich wood floors and a spacious floor plan!\nCall: show contact info\nfor a live, video or FaceTime tour!\nNEIGHBORHOOD\nTrain-\nShopping & Restaurants\nWalk to Playground, Basket Ball & Tennis Courts\nWalk to Narberth Library\nPet Friendly! 🐶 🐱\nLeasing Office Hours: M-F: 9 am-6 pm. Weekends available by appointment. Call: show contact info\nNarberth is the best of the Main Line! Living in your new apartment home offers a lifestyle unlike anywhere else. A quintessential town with peaceful-beautiful roads, parks, trails and play grounds. An array of international-specialty eateries, French bakery, boutiques, gift shops, book stores, vintage movie theatre, and super market with the best butcher in the Philly area. Either before or after your tour, plan an adventure to enjoy and exsperience the local delights, all unique to Narberth.\nAMENITIES\nGourmet Kitchenwith Quartz Counter\nWasher and Dryer in Apartment\nDishwasher\/ Microwave\nRefrigerator with Ice Maker\nAir Conditioning\nWindow Treatments\nUpgraded Bathroom\nWood Floors\nMoroccan Archways\nPet Friendly\nOnline Service Requests & Resident Portal\nProfessional On-Site Management\nProfessional On-Site Maintenance\n24 Hour Emergency Service\nFor more information, visit us at: https:\/\/www.yourmetropolitan.com\/find-an-apartment\/pennsylvania\/main-line\/narberth\/narberth-hall\/\nCALL:  show contact info","num_images":19,"lat":40.008585,"lng":-75.263901,"attrs":"['0BR \/ 1Ba', 'available apr 29', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T18:35:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-furnished\/7459383306.html","post_id":7459383306,"result_date":"2022-03-17 11:02","title":"🔆🔆Available - 6\/15 - Furnished & Accessorized 1BR 🔆🔆","description":"🔆AVAILABLE - 6\/15🔆\n🛌 Move right in to this Fully Furnished and Accessorized 1 bedroom\n🧺 Laundry in unit\n✨Open concept floorplan\n🐕 Pet friendly\n🔆Great natural light\n✨ HW floors\n✨ 4-12 month lease option\nSee better photos and SCHEDULE A SHOWING at:http:\/\/schedule-a-viewing.com\/lc\/4940def0b5No, it's not a hyperlink.  :-(  You still have to copy-and-paste this link into the address bar on your web browser.2017 Walnut St2017 Walnut St - 4F, Philadelphia, PA, 19103$1743 per monthAvailable June 15th1 bed, 1 full bathHistoric Brownstone located 1\/2 block to Rittenhouse Square Park, and the best dining and shopping that Philadelphia has to offer. Spacious floorplans with original hardwood flooring, 10ft ceilings, and oversized windows that flood the spaces with fantastic natural light.Threading salon on-site, Yoga & massage studio just across the street and a short walk to Vernick!                Cats AllowedOvenRangeResident Pays ElectricityResident Pays GasResident Pays WaterSmall Dogs AllowedWasher & DryerKitchen and Bath. Dishwasher. RefrigeratorContact Us:Watchtower Property CoJulie Foyle  show contact info\nSee better photos and SCHEDULE A SHOWING at:http:\/\/schedule-a-viewing.com\/lc\/4940def0b5","num_images":5,"lat":39.95057,"lng":-75.174127,"attrs":"['1BR \/ 1Ba', 'available jun 15', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: yearly']","posted_date":"2022-03-17T10:58:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-two-bedroom\/7459435437.html","post_id":7459435437,"result_date":"2022-03-17 13:37","title":"Spacious two bedroom apartment available in Philadelphia","description":"Check out this beautifully spacious two bedroom apartment in historic North Philadelphia. The high ceilings are so charming and complimented by the studio lighting. This space is newly renovated with a hidden dishwasher, smart refrigerator, washer and dryer, central air, smart locks, garbage disposal, and more! This space will not last long, come check it out today!Caught me at there - aliangelica11441gm>ilc>m","num_images":5,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'condo', 'w\/d in unit', 'no parking']","posted_date":"2022-03-17T12:38:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-after-hours-emergency\/7459578154.html","post_id":7459578154,"result_date":"2022-03-17 18:03","title":"After hours emergency maintenance","description":"After hours emergency maintenance","num_images":0,"lat":40.0606,"lng":-75.0471,"attrs":"['4BR \/ 2Ba', 'apartment', 'w\/d hookups', 'off-street parking']","posted_date":"2022-03-17T17:26:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-skylight-beautiful-home\/7459413603.html","post_id":7459413603,"result_date":"2022-03-17 12:21","title":"Skylight beautiful home!","description":"Housing Type: House\nBedrooms: 3\nBathrooms: 2\nLaundry: w\/d in unit\nParking: off-street parking\nBELLA VISTA 3 bedrooms and two bathrooms, a gorgeous home with new tubs and showers. 2 story home that includes a covered front porch! Includes a romantic working gas fireplace, a lovely yard pets ok! $1200\nshow contact info","num_images":0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking']","posted_date":"2022-03-17T11:58:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-immediate-move-in-for-bedroom\/7459318217.html","post_id":7459318217,"result_date":"2022-03-17 07:40","title":"Immediate Move In For 1 Bedroom \/ 1 Bathroom","description":"Schedule a Tour!\nBook an appointment online at 2tour.site\/3IL\/N499\n\nGreen Forest offers amazing amenities and large homes. See for yourself all of the exciting features that could be yours.\nHome Amenities\nContemporary kitchen\nFrost-free refrigerator\nFormica countertops\nStainless steel sinks\nWall-to-wall carpet\nNumerous closets\nOversized closets\nWindow treatments\nIndividually controlled heating\nCommunity Amenities\nLaundry facility\nFax & copier services available\nParcel receiving\nWell-kept grounds\nEmergency maintenance\nSecurity cameras on premises\nOn-site parking\nPark-like setting\nPet friendly - some restrictions apply\nGreen Forest Apartments Information\nAddress: 314 E 24th St, Chester PA, 19013\nPhone: show contact info\nWebsite: greenforestapt.com\nDeposit: (Note: One Month's Rent)\nApplication Fee: $35 (Note: per adult)\nPet Fee: $75 - 175 (Note: Varies with cat\/dog; non-refundable)\nOffice Hours\nMonday: 9:00AM - 3:00PM\nTuesday: 9:00AM - 3:00PM\nWednesday: 9:00AM - 3:00PM\nThursday: 9:00AM - 3:00PM\nFriday: 9:00AM - 3:00PM\nSaturday: Closed\nSunday: Closed\n","num_images":0,"lat":39.867294,"lng":-75.366091,"attrs":"['1BR \/ 1Ba', 'application fee details: $35 Note: per adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking']","posted_date":"2022-03-17T07:36:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-penthouse-unit-2nd-floor\/7459491295.html","post_id":7459491295,"result_date":"2022-03-17 14:29","title":"Penthouse Unit (w\/ 2nd floor loft) w\/ 20ft Ceilings and Exposed Brick","description":"Listing Description:\nGorgeous 1 bedroom unit which with bonus loft that has been used before as 2nd bedroom or home office in old mill building with hardwood floors, granite counters.  Partial Water and Ben Franklin Bridge Views.   Just 1 block to the dog park and waterfront and steps to the best restaurants in the city. Located on top floor of boutique 16 unit building ( only 4 units per floor) which does have an elevator. The kitchen has ample granite counter space custom cherry cabinets and is equipped with stainless steel gas range, refrigerator, microwave and dishwasher. Unit has washer dryer. Subway located 1 block away. Parking not included (garage next door). We also have private offices available for lease on the ground floor starting at $495 a month.\nPlease no texts.  Please call or email and leave your full name and your call will be promptly returned.","num_images":24,"lat":39.948278,"lng":-75.14332,"attrs":"['1BR \/ 1Ba', '900ft2', 'available may 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'flooring: wood', 'furnished', 'condo', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: yearly']","posted_date":"2022-03-17T14:25:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-redone-temple-home-marble\/7459354116.html","post_id":7459354116,"result_date":"2022-03-17 10:10","title":"Redone Temple home. Marble kitchen!","description":"Bedrooms: 2\nBathrooms: 2.5\nLaundry: w\/d in unit\nParking: attached garage\nTEMPLE: 2  bedroom 2+ bathroom redone beautiful home by the college! All new refurbished mahogany  floors, New gas heater and  central HVAC installed,  large kitchen $ 800\nshow contact info","num_images":0,"lat":40.0118,"lng":-75.1456,"attrs":"['2BR \/ 2.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage']","posted_date":"2022-03-17T09:52:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-mt-airy-place-bedrooms-are\/7459395453.html","post_id":7459395453,"result_date":"2022-03-17 11:27","title":"Mt. Airy Place 2 bedrooms are available","description":"Mt. Airy Place Apartments 1bedroom will be available now.\n2 bedroom available now call for details Rent: $1385\n1 bedroom available now call for details Rent: $1132 available mid- April\nMt. Airy Arms Apartments in Philadelphia feature beautifully landscaped grounds, spacious apartment homes with modern kitchens and bathrooms, hardwood floors and skylights in select units, and many different floor plans to choose from.\n* Modern kitchens and bathrooms\n* Fitness Room\n* Spacious Closets\n* Controlled Access Entry\n* Hardwood flooring in select apartments\n* Laundry Facilities on-site\n* Shopping Centers nearby\n* Free Trash Pickup\n*Cats Welcome\nMt. Airy Arms apartments are conveniently located within walking distance of shopping, golden corral restaurant buffet, wing stop etc. and public transportation in Mount Airy, rated one of the \"Best Big City Neighborhoods\" by MONEY Magazine.\nThis apartment will rent quickly, so call us to schedule an appointment and reserve this unit today:\n","num_images":9,"lat":40.0726,"lng":-75.1706,"attrs":"['2BR \/ 1Ba', '991ft2', 'available now', 'cats are OK - purrr', 'flooring: tile', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: yearly']","posted_date":"2022-03-17T11:23:17-0400"}]