[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559795477.html","post_id":7559795477,"result_date":"Mon Nov 21 2022 03:00:41 GMT+0000 ","title":"Grande at Riverview Conshohocken 2 BR 2 BA w\/ loft","description":"Unit will be available early January. Beautiful well-maintained top floor 2 bedroom, 2 bathroom condo with loft at the Grande at Riverview in Conshohocken.\n1,482 sq. ft. Keswick with loft model\n*would consider renting partially furnished for an additional fee and deposit*\nIncludes two parking spots in the garage underneath the building. You never have to worry about rain or snow!\nBeautiful kitchen features a breakfast bar, 42\" cherry cabinets, stainless steel appliances, 5 burner gas stove, large under-mount sink w\/ garbage disposal, Corian countertops, tile backsplash, hardwood floors, and pantry.\nThe living room has vaulted ceilings and sliding doors that lead to your own private balcony with a large storage closet.\nThe large master bedroom has two closets (one is a large walk-in). The master bath includes a double sink, tub, and separate stall shower with glass enclosure.\nThe second bedroom has two large closets and access to the other bathroom. The second bathroom has a tub shower combo with a glass enclosure, lots of shelves for storage, and access to the hallway. Note the walls are now a lighter blue gray color (will upload new photo soon).\nThe hallway includes a large closet with a high capacity front-loading washer and dryer (both less than one year old; newer than the ones in the photo), along with plenty of shelves for storage.\nThe large loft overlooks the living room and is a great space for a home office, guest room, or just lots of extra storage. It includes a ceiling fan and closet.\nUnit has gas heating and central A\/C. Tenant is responsible for cable\/internet\/phone and gas and electricity. Water is included in rent.\nThe Grande is a wonderful community that features a fitness center, courtyard with grills, outdoor swimming pool, and plenty of parking for guests. The Grande is a short walk from tons of restaurants, bars, and shopping in Conshohocken. The Schuylkill River Trail runs right behind the Grande, and the SEPTA Manayunk\/Norristown Line is just steps away. You have easy access to all major highways (76, 476, PA turnpike).\nNo smoking. No pets.","num_images":24,"lat":40.073009,"lng":-75.307827,"attrs":"['2BR \/ 2Ba', '1482ft2', 'available jan 10, 2023', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-20T21:55:15-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559791784.html","post_id":7559791784,"result_date":"Mon Nov 21 2022 03:00:01 GMT+0000 ","title":"beautiful home 3bedroom","description":"This beautiful home in East Mt. Airy is a gem. It's very well maintained interior with newer hardwood floors and first floor powder room put it at the top of your \"must see\" list","num_images":4,"lat":40.074233,"lng":-75.167352,"attrs":"['3BR \/ 2Ba', '1156ft2', 'available now', '\\nsunday 2022-11-20\\n', 'application fee details: 50', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T21:36:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559782464.html","post_id":7559782464,"result_date":"Mon Nov 21 2022 02:15:07 GMT+0000 ","title":"@@Looking Beautiful Renovated 2 bedroom Apartment! (Norristown. PA)","description":"@@Looking Beautiful 2 bedroom  1 bathroom apartment for rent in Norristown. PA. Beautiful newly renovated Victorian two story house with 2-bedrooms, two full baths, one on each floor, wood floors, two large living rooms, kitchen with dining room, laundry room, basement, storage room and two off street parking spaces (1,703 sq. ft.). House is within walking distance of downtown Norristown. This apartment very close to Suburban Community Hospital. Property includes a large back yard. All utilities (gas, electric, trash, cable & internet) and snow removal are the responsibility of the tenant. pets  ok  or smoking please, max 6 occupants.\nIf you are interest please contract and  give your number Thomas  will call you.\nThank You.","num_images":4,"lat":40.1245,"lng":-75.3304,"attrs":"['2BR \/ 1Ba', 'application fee details: $50 lease processing fee', 'broker fee details: NO Broker Fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', \"listed by: Pre-War Realty ONe MONTH's RENT!!\", 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T20:51:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559760922.html","post_id":7559760922,"result_date":"Mon Nov 21 2022 01:59:27 GMT+0000 ","title":"Lovely bi-level apartment becoming available Now","description":"Lovely bi-level apartment becoming available Now\nLocated at 239 Fairmount Ave (#1) in the highly desirable Northern Liberties section of Philadelphia, we have a lovely bi-level apartment becoming available now. The apartment features one large bedroom and one full bathroom. There are hardwood floors on the main level and tiled floors on the lower level and bathroom. The kitchen has plenty of counter\/cabinet space and is equipped with an electric stove, refrigerator, and dishwasher. The apartment has a lot of character and there is ample space to get creative and really make the place your own. Plenty of closet space. For your convenience, there is a washer\/dryer in the unit. Pets are negotiable. Public transportation is easily assessable. Just a short stroll to Piazza at Schmidt's, bars, restaurants, CVS, Riteaid, etc etc.\nCentral A\/C\nMain Floor Laundry, washer\/dryer in the unit\nPlease contact us for further information\n","num_images":10,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1878ft2', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-20T19:22:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559763487.html","post_id":7559763487,"result_date":"Mon Nov 21 2022 00:47:18 GMT+0000 ","title":"De: $500.00 before move in. One bedroom Apartment for rent","description":"Looking for a responsible single person to occupy this one bedroom Apartment (bottom flat) in a quiet neighborhood, fully furnished, comprising of living room, dining area, single bathroom, adequate kitchen space, off street parking and an easy walk to and from the George Crothers Memorial School.\nAll inclusive of water, heat, electricity, basic cable, sewerage and curbside trash pick up.\nNo laundry, no pets and no smoking(no exceptions).\n*1st, last and a safety deposit of $500.00 before move in.\n","num_images":4,"lat":39.8967,"lng":-75.3474,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'application fee details: $50 non-refundable application fee per applicant 18 yrs and older', 'broker fee details: 1\/2 Month', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-20T19:32:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559764776.html","post_id":7559764776,"result_date":"Mon Nov 21 2022 00:41:08 GMT+0000 ","title":"Apartment for Rent","description":"One bedroom apartment.  Freshly painted.  Granite countertops in kitchen and bath.  New flooring .  Laundry room with washer and dryer.  Close to corridors to Frankford Arts.  Walking distance to galleries, restaurants, cafes, bars, shops, fitness centers, Rivers Casino and parks.  Public transportation is near by.  Five minute drive to I-95, 676 and Ben Franklin Bridge.","num_images":20,"lat":39.970189,"lng":-75.130452,"attrs":"['1BR \/ 1Ba', '875ft2', 'available nov 22', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-20T19:37:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559762012.html","post_id":7559762012,"result_date":"Mon Nov 21 2022 00:30:30 GMT+0000 ","title":"2 Bedroom, move in today","description":"Downtown Pitman, 2 large Bedrooms, New Bathroom top to bottom, kitchen, dining room, living room, laundry room with full size washer and dryer. Off street parking. Central air conditioning.\nAsking $1675.00 a month and security deposit of one and a half months rent of $2500.00. Call Lee to see at  show contact info\n, no pets and no smokers please. Tenant pays gas heat and electric.\n","num_images":7,"lat":39.7312,"lng":-75.1297,"attrs":"['2BR \/ 1Ba', 'available now', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T19:26:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559649383.html","post_id":7559649383,"result_date":"Sun Nov 20 2022 18:56:15 GMT+0000 ","title":"Newly renovated 2 bedroom apartment for rent in Philadelphia","description":"ey words: Furnished rentals, Furnished Apartments, Furnished Homes, Corporate housing, Executive housing, Richland furnished rentals, Kennewick furnished rentals, Philadelphia City Furnished rentals, short term lease, extended stay, month to month lease, monthly lease, Hotel alternative, Philadelphia City Furnished Homes, yard, pet friendly, Sauna, Jacuzzi, Pool, Gym, Dog park, Washer and dryer, Private entry, private parking, Home suites, rent my home, wheelchair accessible.\nIf you are interested, Please contact Thank you  show contact info","num_images":4,"lat":35.6781,"lng":-84.4312,"attrs":"['2BR \/ 2Ba', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T13:52:15-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559616386.html","post_id":7559616386,"result_date":"Sun Nov 20 2022 18:32:07 GMT+0000 ","title":"Amazing!! Pet Friendly Amazing 2br 1ba Apartment for rent!!","description":"RENTAL FEATURES\n- Two Bedrooms, w\/closets\n- Full Bathroom, tiled, sink, shower, tub, toilet, medicine cabinet\n- Living Room, w\/ built in shelving\n- Dining Room, w\/ chandelier, linen closet, built in buffet w\/cupboards, drawers & mirror\n- Sun Room, w\/large coat closet\n- Kitchen, dishwasher, microwave, stove\/oven, sink, refrigerator, drawers, cupboards, cabinets, & shelves\n- Hardwood Flooring\n- Onsite Storage Unit, included w\/ rent\n- Laundry Facilities, washer and dryer onsite\n- Off-Street Parking Spaces, parking lot located onsite behind building, 1 space FREE w\/rent\n- To schedule a showing please text me (Thomas): (302) 564-9 4 5 5\n","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T12:27:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559639589.html","post_id":7559639589,"result_date":"Sun Nov 20 2022 18:31:23 GMT+0000 ","title":"Beautiful fully furnished rentals w\/amenities in philadelphia","description":"STUNNING 2 BEDROOM\/2 BATHROOM CONDO IN DESIRABLE PINEY ORCHARD! This MOVE IN READY unit has wood floors in the main living area, a completely RENOVATED KITCHEN with custom floor to ceiling cabinets, granite countertops, breakfast bar & double oven. The large master bedroom is complete with a private en suite & HUGE walk in closet. Condo fee includes trash, water & use of all the wonderful amenities Piney Orchard has to offer. Indoor\/outdoor pool(s), walking trails, community center, gym, tot lots, nature preserve—The list goes on! Unit is in walking distance to Piney Orchard Elementary, Community Center (with gym, indoor\/outdoor pool) & shopping center. In close proximity to BWI, NSA\/Fort Meade, all major highways & PLENTY of shopping\/dining. Key words: Furnished rentals, Furnished Apartments, Furnished Homes, Corporate housing, Executive housing, Richland furnished rentals, Kennewick furnished rentals, Tri City Furnished rentals, short term lease, extended stay, month to month lease, monthly lease, Hotel alternative, Tri City Furnished Homes, yard, pet friendly, Sauna, Jacuzzi, Pool, Gym, Dog park, Washer and dryer, Private entry, private parking, Home suites, rent my home, wheelchair accessible. If you are interested, please>>>>Text \/ Call: - show contact info\nWonderful 2 bed, 2 bath condo in sought after Johns Hopkins Homewood! New carpet throughout, freshly painted, upgraded bathrooms and lots of natural light. The Geneva offers a beautiful historical preservation just steps from the university and within walking distance to the Baltimore Museum of Art plus the shops and restaurants in Charles Village. The private entrance off the side of the building provides quick and easy access to this spacious unit. When you step inside you will be amazed at the size of the living room and kitchen - both are very large! Kitchen can accommodate a table easily. Access to the main hallway is through one of the bedrooms which provides an interior path to the laundry area. There is a lovely shared garden space on the opposite side of the building. Please Note: No Undergraduate Students may rent per condo rules and regulations and all leases must be pre-approved by Condo Board. If you are interested, please>>>>Text \/ Call:- show contact info","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T13:27:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559638023.html","post_id":7559638023,"result_date":"Sun Nov 20 2022 18:27:16 GMT+0000 ","title":"Fitness Center, Incredible Features, Central Location","description":"Be the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '733ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T13:23:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559637770.html","post_id":7559637770,"result_date":"Sun Nov 20 2022 18:26:37 GMT+0000 ","title":"Laundry in Unit, Central Location, Ideal Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1110ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-20T13:22:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559637757.html","post_id":7559637757,"result_date":"Sun Nov 20 2022 18:26:35 GMT+0000 ","title":"Yoga and Ballet Studio, Visit Your New Home, Leasing Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills offers all of the amenities your looking for and some you didn't even know you wanted. Check out our two-story clubhouse-complete with flat screen TVs, a 24-hour fitness center and a pool table. Enjoy our on-site yoga studio or our outdoor putting green. Visit us today!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Granite Countertops\n* Full sized Washer and Dryer in unit\n* Extra Storage\n* Wood-Like Floors\n* Private Patio or Private Balcony (on select apartments)","num_images":18,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-20T13:22:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559635236.html","post_id":7559635236,"result_date":"Sun Nov 20 2022 18:20:07 GMT+0000 ","title":"$1,600 \/ 3br - $1600\/Charming 1130 sq. ft. Pennsport 3BR, 1BA (Philade","description":"$1600\/Charming 1130 sq. ft. Pennsport 3BR, 1BA. Totally renovated in 2010: windows, fixtures, plumbing, carpet, facade, paint, basement waterproofing, and tiled kitchen and bath. Full interior painting and new roof in 2021. New gas furnace, washer\/dryer, dishwasher and basement scrub sink in 2011. Ample street parking, close to shopping, I-95, beautiful Dickinson Square Park, and vibrant Moyamensing Avenue. $1600\/mo. with first, last, security required. Tenant pays all utilities. Available 11\/15.","num_images":17,"lat":39.925113,"lng":-75.152846,"attrs":"['3BR \/ 1Ba', '1130ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-20T13:16:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559633228.html","post_id":7559633228,"result_date":"Sun Nov 20 2022 18:15:01 GMT+0000 ","title":"Live the Lifestyle You Deserve!","description":"Available: 11\/30\/22\nAscott floor plan — 1,230 sq. ft. — $3,275\nThis corner-unit apartment has so much to offer! Our brand-new construction includes quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This Ascott also features spacious walk-in closets with custom shelving. This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1230ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-20T13:11:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559629661.html","post_id":7559629661,"result_date":"Sun Nov 20 2022 18:05:44 GMT+0000 ","title":"$1,900 \/ 3br - 1130ft2 - Charming 1130 sq. ft. Pennsport 3BR, 2BA $190","description":"Charming 1130 sq. ft. Pennsport 3BR, 2BA. Full interior painting in Sept 2022. Off street parking with driveway and remote entry. Yard with cherry tree. Ample street parking, close to shopping, I-95, beautiful Dickinson Square Park, and vibrant 2nd St and Moyamensing Avenue. $1900\/mo. with first, last, security required. Tenant pays all utilities. Available now.","num_images":23,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2Ba', '1130ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T13:01:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559621809.html","post_id":7559621809,"result_date":"Sun Nov 20 2022 17:44:53 GMT+0000 ","title":"Central Location, Upgraded Finishes Available, Pet Park","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nThe Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Linen Closet\n* Private Patio or Private Balcony (on select apartments)\n* Full sized Washer and Dryer in unit\n* Breakfast Bar\n* Stainless Steel Appliances\n* Roommate Friendly Floor Plan\n* Walk-in Closet\n* Granite Countertops\n* High Efficiency Lighting Fixtures\n* Pantry\n* Pre-wired for internet and cable\n* Central Heat and Air\n* Garden Tub\n* Ceiling Fan\n* Disposal\n* Window Coverings\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Lofty Vaulted Ceilings\n[#9488538]","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1210ft2', 'available nov 27', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T12:40:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559621394.html","post_id":7559621394,"result_date":"Sun Nov 20 2022 17:43:52 GMT+0000 ","title":"Incredible Features, Resort Style Pool, Upgraded Finishes Available","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester is the perfect location for your new home. Explore our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, Den, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available nov 27', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T12:39:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559606429.html","post_id":7559606429,"result_date":"Sun Nov 20 2022 17:12:21 GMT+0000 ","title":"New Beginnings Here at Park Lane!!","description":"Available: 11\/30\/22\nBalmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-20T12:02:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559607530.html","post_id":7559607530,"result_date":"Sun Nov 20 2022 17:09:01 GMT+0000 ","title":"Spacious Two-bedroom, Two-baths apartment","description":"Key words: Furnished rentals, Furnished Apartments, Furnished Homes, Corporate housing, Executive housing, Richland furnished rentals, Kennewick furnished rentals, Tri City Furnished rentals, short term lease, extended stay, month to month lease, monthly lease, Hotel alternative, Tri City Furnished Homes, yard, pet friendly, Sauna, Jacuzzi, Pool, Gym, Dog park, Washer and dryer, Private entry, private parking, Home suites, rent my home, wheelchair accessible. Please Text for appointment to view. show contact info","num_images":4,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T12:05:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559605030.html","post_id":7559605030,"result_date":"Sun Nov 20 2022 17:02:45 GMT+0000 ","title":"**Fantastic Location, Fresh Paint, New Appliances, All Wooden Floors*","description":"Key words: Furnished rentals, Furnished Apartments, Furnished Homes, Corporate housing, Executive housing, Richland furnished rentals, Kennewick furnished rentals, Tri City Furnished rentals, short term lease, extended stay, month to month lease, monthly lease, Hotel alternative, Tri City Furnished Homes, yard, pet friendly, Sauna, Jacuzzi, Pool, Gym, Dog park, Washer and dryer, Private entry, private parking, Home suites, rent my home, wheelchair accessible.\nIf you are interested, Please contact Thank you.( 7 1 6 ) 3 0 3 3 7 5 3\n","num_images":7,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T11:58:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559600912.html","post_id":7559600912,"result_date":"Sun Nov 20 2022 16:51:24 GMT+0000 ","title":"Beautiful fully furnished rentals w\/amenities","description":"Key words: Furnished rentals, Furnished Apartments, Furnished Homes, Corporate housing, Executive housing, Richland furnished rentals, Kennewick furnished rentals, Tri City Furnished rentals, short term lease, extended stay, month to month lease, monthly lease, Hotel alternative, Tri City Furnished Homes, yard, pet friendly, Sauna, Jacuzzi, Pool, Gym, Dog park, Washer and dryer, Private entry, private parking, Home suites, rent my home, wheelchair accessible.\nIf you are interested, Please contact Thank you  show contact info\n.\n29 Duncannon Ave,\nDwontown 29401\n","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T11:47:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559596058.html","post_id":7559596058,"result_date":"Sun Nov 20 2022 16:37:42 GMT+0000 ","title":"Call for Details, Clubhouse with Game Room, Visit Your New Home","description":"Prepare to fall in love with The Point at Glen Mills! Kick back in our community lounge. Watch your furry friend frolic with his furry friends in our dog park. Challenge your friends to a game of golf on our outdoor putting green. Life is good at The Point at Glen Mills. Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-20T11:33:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559578952.html","post_id":7559578952,"result_date":"Sun Nov 20 2022 16:14:11 GMT+0000 ","title":"Beautiful 2bedroom and 2.5 bath home","description":"Now is your opportunity to live in one of Bucks Country newest communities, situated right along the water! Welcome to Waterside - Bensalems new townhome community comprised of custom, new construction properties, one of which is now ready to rent! Unit 140A at Gaslight Alley is a lovely two bedroom, two and a half bathroom,\nPlease Text Message: show contact info","num_images":4,"lat":40.1109,"lng":-74.9378,"attrs":"['2BR \/ 2.5Ba', '1416ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T10:44:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559570885.html","post_id":7559570885,"result_date":"Sun Nov 20 2022 16:00:53 GMT+0000 ","title":"~~This is a 3 bedrooms, 2 bath house for rent.!!","description":"This is a 3 bedrooms, 2 bath house for rent. Tiles on first floor and laminated flooring thru out 2nd floor. Newly painted. Nice block very close to shops on Oregon Ave. Close to Live! Casino and all the sport stadiums. Must have 680 plus credit and 3 months to move in.\nContact No;   show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nHome Amenities:\n• Wood-Style Plank Flooring\n• Granite Countertops\n• Flat-Panel Cabinets\n• Stainless Steel Appliances\n• Walk-in Closets\n• Washer and Dryer Hookups\n• Attached Garages\n• Patios or Balconies\nExterior Advantages:\n• Nearby to Numerous Parks, the Missouri River and a Connected Trail System\n• Friendly Community\n. Pet free house\n• Smoke-Free Community\nCommunity Amenities:\n• Professionally Managed with 24-Hour Maintenance\n• Great Highway Access\n• Close to Shopping and Dining\n• Pool & Sundeck**\n• One of the Region’s Highest Rated School Districts\n• Lawn Services\n• Fitness Center**\n• Doorstep Trash & Recycling Collection Services\n*Available on certain units\n** To be completed by end of year\n\n","num_images":1,"lat":39.9207,"lng":-75.1595,"attrs":"['3BR \/ 2Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T10:20:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559572833.html","post_id":7559572833,"result_date":"Sun Nov 20 2022 15:54:29 GMT+0000 ","title":"Streamlined unit 302 at Frankford Avenue@@","description":"Say hello to bright and streamlined unit 302 at Frankford Avenue. With an open, entry floor plan this is the quintessential social gathering spot where you can entertain and prepare at the same time. The modern finished kitchen that includes stainless appliances and a natural stone topped island, opens up beautifully to the living space with a bonus powder room for convenience.Upstairs you'll find 2 nicely sized bedrooms, 2 beautifully appointed baths and center hall laundry.\nContact No;   show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nHome Amenities:\n• Wood-Style Plank Flooring\n• Granite Countertops\n• Flat-Panel Cabinets\n• Stainless Steel Appliances\n• Walk-in Closets\n• Washer and Dryer Hookups\n• Attached Garages\n• Patios or Balconies\nExterior Advantages:\n• Nearby to Numerous Parks, the Missouri River and a Connected Trail System\n• Friendly Community\n. Pet free house\n• Smoke-Free Community\nCommunity Amenities:\n• Professionally Managed with 24-Hour Maintenance\n• Great Highway Access\n• Close to Shopping and Dining\n• Pool & Sundeck**\n• One of the Region’s Highest Rated School Districts\n• Lawn Services\n• Fitness Center**\n• Doorstep Trash & Recycling Collection Services\n*Available on certain units\n** To be completed by end of year\n\n","num_images":3,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 3Ba', '1273ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T10:26:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559578728.html","post_id":7559578728,"result_date":"Sun Nov 20 2022 15:47:30 GMT+0000 ","title":"Available for immediate move-in! Tour this 1 bed, 1 bath today!","description":"The Gateway Apartments1515 Manley Rd West Chester, PA 19380Pricing: $1780 - $2495\/Month*Bedrooms: 1  Bathrooms: 1 Square Footage: 779 sq ft show contact info\nFeatures in this apartment home:✓ Air Conditioning & Heating✓ Alarm✓ Cable Ready✓ Den✓ Dining Room✓ High Speed Internet Access✓ Refrigerator, Freezer, Ice Maker✓ Trash Compactor✓ Walk-In Closets✓ Window Coverings✓ Built-In Computer Nook (select homes)✓ Built-In Microwave Oven✓ Disability Access (select homes)✓ Garden\/Spa Tub (select homes)✓ Gas Fire Place (select homes)✓ Mini Blinds On All Windows✓ Upgrade✓ Vaulted Ceiling (select homes)✓ Wired For High-Speed Internet✓ Wooded View\/Pool View (select homes)About the community:  Exclusive features, including a resort-style pool with a sun deck and a 24-hour fitness center, are what make us the best apartment homes in the West Chester, PA area. Whether you want to spend a tranquil afternoon enjoying our beautiful landscapes or invite people over for a social function in our clubhouse, our community has something to offer everyone. Secure gated entrances and 24-hour maintenance provide the residents of our pet-friendly apartments with peace of mind. If you are searching for luxury West Chester apartment homes or are simply looking to relocate to the East Goshen Township area, come tour our wonderful apartments. Offering the best apartments in the area, we will help you feel right at home. Whatever you desire in life, find it at The Gateway Apartments.Please take our virtual tour\nhttps:\/\/my.matterport.com\/show\/?m=4RkQ1PobBkE&brand=0 Amenities at our property:✓ Business Center✓ Clubhouse✓ Fitness Center✓ Onsite Maintenance✓ Onsite Management✓ Package Service✓ Picnic and Grilling Area✓ Pool and Sundeck✓ Storage Space✓ Walking\/Biking Trails✓ Across From Wawa & Goshen Crossing Shopping Center✓ Beautifully Landscaped Grounds✓ Garages For Lease✓ Gated Entrances✓ Maintenance Free Lifestyle✓ Pet-Friendly✓ Relaxing Fire Pit✓ Resort-Style Pool With Sun Deck✓ Three BBQ\/Picnic Areas✓ Wi-Fi Access in Clubhouse and at PoolAdditional information:Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-MonthPets: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonWebsite: https:\/\/www.thegatewayapartments.com\/Phone:  show contact info\nProfessionally managed by Paradise Management, LLC *Prices are subject to change without notice All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY970F506CB0054A\n","num_images":15,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '779ft2', 'available now', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T10:43:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559570187.html","post_id":7559570187,"result_date":"Sun Nov 20 2022 15:44:46 GMT+0000 ","title":"!!Beautiful Apartment!!","description":"Conveniently located apartment close to Temple nice views of the Campus and recently updated units available\nContact No;   show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nHome Amenities:\n• Wood-Style Plank Flooring\n• Granite Countertops\n• Flat-Panel Cabinets\n• Stainless Steel Appliances\n• Walk-in Closets\n• Washer and Dryer Hookups\n• Attached Garages\n• Patios or Balconies\nExterior Advantages:\n• Nearby to Numerous Parks, the Missouri River and a Connected Trail System\n• Friendly Community\n. Pet free house\n• Smoke-Free Community\nCommunity Amenities:\n• Professionally Managed with 24-Hour Maintenance\n• Great Highway Access\n• Close to Shopping and Dining\n• Pool & Sundeck**\n• One of the Region’s Highest Rated School Districts\n• Lawn Services\n• Fitness Center**\n• Doorstep Trash & Recycling Collection Services\n*Available on certain units\n** To be completed by end of year\n\n","num_images":3,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 1Ba', '2262ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T10:18:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559571997.html","post_id":7559571997,"result_date":"Sun Nov 20 2022 15:36:07 GMT+0000 ","title":"Welcome home to 3209 Wharton St","description":"Welcome home to 3209 Wharton St, your South Philly oasis! This newly renovated home has tons of natural light, open living space with recessed lighting, gourmet kitchen with modern stainless steel appliances, three spacious bedrooms and a basement for plenty of storage. Conveniently located near public transit and within close proximity to local amenities such as the beautiful Wharton Square, Dock Street Brewery, Schuylkill River Trail, Graduate Hospital shops and restaurants\nContact No;   show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nHome Amenities:\n• Wood-Style Plank Flooring\n• Granite Countertops\n• Flat-Panel Cabinets\n• Stainless Steel Appliances\n• Walk-in Closets\n• Washer and Dryer Hookups\n• Attached Garages\n• Patios or Balconies\nExterior Advantages:\n• Nearby to Numerous Parks, the Missouri River and a Connected Trail System\n• Friendly Community\n. Pet free house\n• Smoke-Free Community\nCommunity Amenities:\n• Professionally Managed with 24-Hour Maintenance\n• Great Highway Access\n• Close to Shopping and Dining\n• Pool & Sundeck**\n• One of the Region’s Highest Rated School Districts\n• Lawn Services\n• Fitness Center**\n• Doorstep Trash & Recycling Collection Services\n*Available on certain units\n** To be completed by end of year\n\n","num_images":4,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 1Ba', '1176ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T10:24:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559573677.html","post_id":7559573677,"result_date":"Sun Nov 20 2022 15:32:58 GMT+0000 ","title":"Beautiful 4 Bedroom Townhome in Old Kensington","description":"Recently updated with new floors and paint, this 4 bedroom, 1 bath is corner situated, 3 story, 17 feet wide, and offers over 1,800 square feet of living space, includes a private yard.\nThe 2nd floor has 2 bedrooms and a large hall bath. The front bedroom has a has a double wide built in closet and the middle bedroom has a large built in closet as well. The 3rd floor includes 2 equally spacious bedrooms. The front bedroom has a double wide wardrobe with glass slider doors that have built-in led lights.\nThe luxury of having so many rooms at your disposal creates an opportunity to craft a living space that fits your needs such as a home office, guest rooms, a studio, a den, study, etc.\nThe basement level is absolutely huge with more than 6 feet of head room and a speckled painted floor It has a laundry area and endless storage options.\nThe location is a walkers paradise as well since it is in close proximity to a variety of restaurants, cafes, shopping, and social spots in Old Kensington, Fishtown, and Northern Liberties such as Helm, Luna Cafe, Reanimator, Hook & Master, Front St Cafe, Laser Wolf, Streetside, etc. Nearby parks such as Cruz Playground, Benson Park, Hancock Playground, Liberty Lands Park.\n$35 Application Fee\nFirst, Last, and Security Deposit Due at Signing\nTenant Pays Utilities\nPets Negotiable\nRenter is responsible for utilities. First, last, and security due at signing.\n","num_images":23,"lat":39.9731,"lng":-75.143491,"attrs":"['4BR \/ 1Ba', 'available jan 15, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-20T10:28:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559546291.html","post_id":7559546291,"result_date":"Sun Nov 20 2022 15:00:48 GMT+0000 ","title":"Great Quality Balcony Easy-Lifestyle 2-bed apt*Move-In Ready!","description":"Hamilton St\nImmaculately Maintained and Move-In Ready! Great Quality Balcony Easy-Lifestyle 2-bed apartment in Philadelphia, PA. Large bonus room, hardwood flooring, central vacuum system, natural gas log fireplace, double hung vinyl tilt-in windows, all kitchen appliances included, large laundry room, plenty of closets and good storage space, metal roof and so much more! Fabulous curb-appeal with beautiful landscaping, level 1\/2 acre lot, tree-lined backyard, front and back covered porches, 2 car garage. Only 1 block away from the Bus Stop! 1 block away from Drexel Park, 10min walk from Drexel Gym, and less than 1 mile away from UPenn Library and University of Wharton! This apartment is located on a really cozy and quite street of Hamilton and it is quick to get to any location within University of Drexel or UPenn.\nPrivate Balcony\/Patio\nLocated Near Shopping and Restaurants\nNew Fitness Center and Club Room\nWade-In Pool and Sundeck\nSpacious Closets\nAddress: 3215 Hamilton St","num_images":1,"lat":39.962332,"lng":-75.189802,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T08:55:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559537035.html","post_id":7559537035,"result_date":"Sun Nov 20 2022 13:44:46 GMT+0000 ","title":"A Great Place To Have Wonderful Times And make new Friends","description":"A rare find! Easy living in Hersheys Mill, cute one bedroom unit in friendly Ashton Village, Low Association Dues INCLUDES. .. .. water, sewer, security, cable, outside maintenance, snow removal to your door, and all the amenities that come with Hersheys Mill. Nice home with an open concept Living Room Dining room with a fireplace, and a dining area slider with a key lock to a to a covered deck for easy access. . It has a huge master bedroom with slider to a private patio. A great place to have wonderful times and make new friends. Hersheys Mill has something for everyone. Walking Trails, Bocce, shuffle board, outdoor pool, library, horseshoes, pickle ball, ping pong, billiards, gardening plots, bridge, quilting, memberships are open to its golf course and social membership to it's on site restaurant. Their are other clubs too many to mention but range from exercise, sewing, book clubs, bowling , not to mention the state of the art Wood Shop.","num_images":10,"lat":40.010076,"lng":-75.550586,"attrs":"['1BR \/ 1Ba', '907ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-20T08:09:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559531817.html","post_id":7559531817,"result_date":"Sun Nov 20 2022 13:00:37 GMT+0000 ","title":"Where Luxury Meets Convenience!!","description":"Available: 11\/20\/22\nApt. 2510 — Oxford floor plan — 1,203 sq. ft. — $3,510\nThis 5th floor 2 bedroom\/2 bathroom apartment has much to offer! It comes with hardwood LVT flooring, central heat and air, a washer and dryer, and upgraded stainless steel appliances! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive dining room is perfect for hosting! This gorgeous apartment is within close proximity to our clubhouse— featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-20T07:34:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559514022.html","post_id":7559514022,"result_date":"Sun Nov 20 2022 08:10:05 GMT+0000 ","title":"Succulent 3Bd for rent","description":"3 bedroom, 1 bath ranch home in desirable Upper Moreland Schools. Home has been updated in the past few years. Kitchen has granite counters, stainless steel appliances, new backsplash. Bathroom remodeled recently and home has new flooring and paint.  New Daikin outside A\/C unit with heat pump was installed in 2021.  Home sits on 1\/3 acre, nice curb appeal, good sized shed next to home and open space across the street. Great location to all major highways, restaurants and shopping. See list of updates attached to seller's disclosure. Looking for a cash offer with a quick settlement. Hurricane Ida in Sep 21 washed out right side of basement wall. Flood damage to mechanical systems in basement.","num_images":8,"lat":40.1785,"lng":-75.1072,"attrs":"['3BR \/ 1Ba', '1200ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-11-20T02:40:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559506942.html","post_id":7559506942,"result_date":"Sun Nov 20 2022 06:26:43 GMT+0000 ","title":"Beautiful well maintained 5-bedroom 2 bath, Row Townhouse for rent","description":"WELCOME HOME! This beautiful well maintained 5-bedroom, 2 full bath, Row home. This home is located near many great schools such as LaSalle University, Penn Charter School, and Germantown Friends School. Walking up to the front door, you will see an enclosed front patio, perfect for a Garden and some relaxing.  Upon entering the front door, you are greeted with an open straight-through floorplan. This spacious open-flow floor plan features a NEW updated kitchen, NEW appliances, NEW carpets, and NEW remodeled bathrooms on the 1st and 2nd Floor. On your way to the kitchen, you will notice beautiful white cabinets, white tile backsplash, Granite countertops, and new stainless-steel appliances.  PLUS! Laundry room at the back of the house. Followed up with a full Bathroom. Along with Having Two staircases to get to the second floor you also have Cable Railings throughout the house as well. Not to Mention Recess lighting throughout. The second floor has 3 Nice sized bedrooms and a full bathroom with a white tub\/shower and new vanity. Proceeding to the 3rd floor there are 2 neatly laid out bedrooms with another closet Nicely laid out in the hallway. NEW HVAC throughout. Fully fenced in yard area. The basement is great for storage Giving you ample amount of space for all your storage.  A rear yard that will provide the perfect outdoor space for BBQ-ING in the summer. There are laundry hookups and space for a home-office. Come see this gem now, before it is scooped up! Seller is offering a 1 year home warranty as well!Email me with your cell number for fastest response.","num_images":5,"lat":40.0338,"lng":-75.1731,"attrs":"['5BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'furnished', 'townhouse', 'laundry in bldg', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-20T00:58:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559508656.html","post_id":7559508656,"result_date":"Sun Nov 20 2022 06:24:21 GMT+0000 ","title":"Luxury duplex two bedroom No pets","description":"Two bedroom luxury duplex, Meadowbrook Lane. Available immediately no pets 15\/1600 per month","num_images":3,"lat":39.8739,"lng":-75.3792,"attrs":"['2BR \/ 1Ba', '1000ft2', 'air conditioning', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T01:20:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559501131.html","post_id":7559501131,"result_date":"Sun Nov 20 2022 05:05:14 GMT+0000 ","title":"Bi Level 2 bedroom","description":"Bi-level apartment in the heart of Northern Liberties.  The first floor consist of a living room, kitchen, full bath and nice size bedroom. The second floor has a large bonus room\/bedroom.\nUNIT AMENITIES\nDishwasher, Laundry room \/ hookups\n","num_images":24,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '700ft2', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-20T00:01:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559744819.html","post_id":7559744819,"result_date":"Sun Nov 20 2022 23:27:51 GMT+0000 ","title":"private room shared bathroom","description":"Text  show contact info\n$1,000 to move in\n$600 per month\nMust be ID ready and financially ready to move","num_images":0,"lat":40.1913,"lng":-75.4373,"attrs":"['1BR \/ sharedBa', 'available now', 'air conditioning', 'furnished', 'house', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T18:23:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559738073.html","post_id":7559738073,"result_date":"Sun Nov 20 2022 23:14:05 GMT+0000 ","title":"**Refurbished hardwood floors - gorgeous 4 story 2 bed apartment**","description":"This gorgeous 4 story building nestled in the peaceful Clark Park area has large oversized units that have been completely renovated. Each unit has a brand new kitchen, sky high ceilings, and refurbished hardwood floors. The building has an elevator, free laundry on each floor and a large roof deck. For more info or to schedule a showing contact—--  (731) 327-64-38","num_images":5,"lat":39.94861,"lng":-75.217121,"attrs":"['2BR \/ 1Ba', '900ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-20T18:01:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559738219.html","post_id":7559738219,"result_date":"Sun Nov 20 2022 23:11:32 GMT+0000 ","title":"-Stainless Steel Appliances, 1 bed apartment access gym, indoor pool","description":"-Stainless Steel Appliances\n-Granite Counter Tops\n-Hard Wood Flooring\n- Central Heating\/Air\n-Washer\/Dryer in Unit\n-Huge Loft-Like Windows\n-Plenty of Closet Space\n- Great Views of Philadelphia\n-Secured Access\n-Cardio Center\n-Free Wi-Fi Lounge\n-Roof Deck\n-Off-street Parking Available\nResidents also have access to the full size gym, indoor pool, and outdoor roof deck at our sister property, Lofts 640, across the street. (406)720-12-04\n","num_images":5,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '622ft2', 'available jan 1, 2023', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T18:01:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559702703.html","post_id":7559702703,"result_date":"Sun Nov 20 2022 21:27:44 GMT+0000 ","title":"Apartment for rent","description":"2 bedroom apartment for rent Is bathroom and a big living room For more information contact me directly Is available anytime  show contact info\nDeposit at least 3 months 1st last and security","num_images":0,"lat":39.9612,"lng":-75.2303,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-20T16:12:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559672655.html","post_id":7559672655,"result_date":"Sun Nov 20 2022 20:59:07 GMT+0000 ","title":"Private Ranch Style Home 3Bedroom + 2 Bonus Room \/3 Bathroom. in","description":"3Bedroom + 2 Bonus Room \/3 Bathroom. Bonus Room is Separate Office Space & Mud Room - Office Space could be used as 4th bedroom. 2800+\/- Sq Foot Private Ranch Style Home. Home has a Pool, 2 car garage, RV parking, fireplace, granite countertops, hardwood floors in living space, carpet in bedrooms, tile master bath with a separate stand-up shower and sunk in tub, master walk in closet, ceiling fans, mirror closet doors, in door laundry, mud room, and separate office space. Home rental includes all appliances except washer and dryer. Some of the home furniture is available for purchase. Pets considered. $950 per month.If you are interested text me;  show contact info","num_images":8,"lat":40.0018,"lng":-75.1179,"attrs":"['3BR \/ 3Ba', '2800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T14:53:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559672642.html","post_id":7559672642,"result_date":"Sun Nov 20 2022 20:38:05 GMT+0000 ","title":"Private Ranch Style Home 3Bedroom + 2 Bonus Room \/3 Bathroom. in","description":"3Bedroom + 2 Bonus Room \/3 Bathroom. Bonus Room is Separate Office Space & Mud Room - Office Space could be used as 4th bedroom. 2800+\/- Sq Foot Private Ranch Style Home. Home has a Pool, 2 car garage, RV parking, fireplace, granite countertops, hardwood floors in living space, carpet in bedrooms, tile master bath with a separate stand-up shower and sunk in tub, master walk in closet, ceiling fans, mirror closet doors, in door laundry, mud room, and separate office space. Home rental includes all appliances except washer and dryer. Some of the home furniture is available for purchase. Pets considered. $950 per month.If you are interested text me;  show contact info","num_images":8,"lat":40.0018,"lng":-75.1179,"attrs":"['3BR \/ 3Ba', '2800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T14:53:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559688007.html","post_id":7559688007,"result_date":"Sun Nov 20 2022 20:37:07 GMT+0000 ","title":"18xxn Olive St","description":"Beautiful two bedroom house in the Fairmount\/Art Museum neighborhood of Philadelphia! The house features a finished basement, recessed and dimming lights are throughout the house along with beautiful hardwood floors, ceiling fans, brand new heater, central air, and a small back yard with back door and street access! The house is located within walking distance of tons of great bars & restaurants!\nMove in ready. Need application fee $50, 1st, last & security to move in.  Proof of income, no evictions.\n","num_images":8,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 1Ba', '1100ft2', 'available now', 'cats are OK - purrr', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T15:33:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559684590.html","post_id":7559684590,"result_date":"Sun Nov 20 2022 20:36:58 GMT+0000 ","title":"Spacious units!","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:State-of-the-art fitness center overlooking the Manayunk canal9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardMarble master baths, some with deep linen storage48-hour Maintenance CommitmentBocce ball fieldOnline Payments AvailableHuge walk-in closets with ample storageFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingBark parkJogging trail right outside your doorPet-friendly livingAlexa or Google Home Capable in all ApartmentsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/oh7c7bip\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-20T15:23:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559672666.html","post_id":7559672666,"result_date":"Sun Nov 20 2022 20:36:09 GMT+0000 ","title":"Private Ranch Style Home 3Bedroom + 2 Bonus Room \/3 Bathroom. in","description":"3Bedroom + 2 Bonus Room \/3 Bathroom. Bonus Room is Separate Office Space & Mud Room - Office Space could be used as 4th bedroom. 2800+\/- Sq Foot Private Ranch Style Home. Home has a Pool, 2 car garage, RV parking, fireplace, granite countertops, hardwood floors in living space, carpet in bedrooms, tile master bath with a separate stand-up shower and sunk in tub, master walk in closet, ceiling fans, mirror closet doors, in door laundry, mud room, and separate office space. Home rental includes all appliances except washer and dryer. Some of the home furniture is available for purchase. Pets considered. $950 per month.If you are interested text me;  show contact info","num_images":8,"lat":40.0018,"lng":-75.1179,"attrs":"['3BR \/ 3Ba', '2800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T14:53:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559677071.html","post_id":7559677071,"result_date":"Sun Nov 20 2022 20:32:26 GMT+0000 ","title":"Online Payments Available, On-site bike storage, Bocce ball field","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Online Payments AvailableOn-site bike storageBocce ball fieldUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingState-of-the-art fitness center overlooking the Manayunk canal9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardMarble master baths, some with deep linen storagePet-friendly livingUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densBark parkHuge walk-in closets with ample storageBBQ and deck areaCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/6lglvepl\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1364ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-20T15:04:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559672228.html","post_id":7559672228,"result_date":"Sun Nov 20 2022 20:14:57 GMT+0000 ","title":"Bright, West-facing, 2, 375 sqft, 3bed\/2.5bath paired home","description":"Bright, West-facing, 2, 375 sqft, 3bed\/2.5bath paired home in Philadelphia Bluff Lake, just a few blocks away from Eastbridge Town Center, Isabella Bird Community School and the Bluff Lake Nature Center! Located in a charming courtyard, this home features warm hardwood floors, elegant crown molding, open concept living, owned solar, and an unfinished basement to add your own personal touch. The main floor includes site-finished hardwood floors, an open concept living space with gas fireplace that flows into the dining room with access to the yard via sliding glass door, and an inviting kitchen; perfect for entertaining! The kitchen includes quartz counters, SS appliances, gas range with double ovens, soft close drawers, and pantry. A powder room and access to the basement and garage are also located off the main level. Upstairs, the airy loft includes hardwood floors, crown molding and a bonus space for a home library or office. The spacious primary bedroom includes a built-in coffee bar, large WIC and a bathroom ensuite with dual sinks, tile floor and glass enclosed shower. Two additional bedrooms with west facing views, a laundry room, as well as a full bath with soaking tub\/shower combo complete the second floor. The side yard has a poured concrete patio, raised garden bed and pergola. The drywalled garage offers great storage space with exterior access to the yard. Owned solar from Namaste, so no electric bills monthly! Short walk to F-15 pool and Stanley Marketplace. Access to miles of biking and running trails right outside your door!","num_images":5,"lat":40.0402,"lng":-75.2231,"attrs":"['3BR \/ 2.5Ba', 'application fee details: $25 App fee per adult', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-11-20T14:51:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559672050.html","post_id":7559672050,"result_date":"Sun Nov 20 2022 19:55:28 GMT+0000 ","title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nWhen you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nApartment Features\n* Pantry\n* Stainless Steel Appliances\n* Garden Tub\n* Lofty Vaulted Ceilings\n* Disposal\n* Pre-wired for internet and cable\n* Linen Closet\n* Breakfast Bar\n* High Efficiency Lighting Fixtures\n* Central Heat and Air\n* Granite Countertops\n* Roommate Friendly Floor Plan\n* Private Patio or Private Balcony (on select apartments)\n* Window Coverings\n* Walk-in Closet\n* Full sized Washer and Dryer in unit\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Ceiling Fan\nCommunity Features\n* WiFi Access\n* Movie Theatre\n* Bike Racks\n* Non Smoking Community\n* Elevator\n* Minutes from Restaurants, Shopping, and Much More\n* After-Hours Emergency Maintenance\n* Swimming Pool\n* Fitness Studio\n* Community Kitchen\n* EV Charging\n* Dry Cleaning and Laundry Service\n* Renters Insurance is Required\n* Garage Parking\n* TV Lounge\n* Credit Cards Accepted\n* Outdoor Grill Area\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Professionally Managed\n* Billiards\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Gaming Area\n* Extra Storage\n* Short or Long Term Lease Available\n* Sun Deck\n* Playground\n* Easy Freeway Access\n* Long Term Lease Available\n* Pet Salon\n* Landscaped Courtyards\n* Community Lounge\n* Bark Park\n* Package Acceptance\n* Controlled Access","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1190ft2', 'available nov 27', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-20T14:51:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559664483.html","post_id":7559664483,"result_date":"Sun Nov 20 2022 19:47:26 GMT+0000 ","title":"Modern Townhome with 2Beds 1Bath","description":"Situated in the Mill Creek neighborhood, of West Philadelphia, this modern home offers 2 bedrooms & 1 bathroom. As you enter the home, you will be pleased with your open concept floor plan. There is a spacious living room, a space that your furniture will comfortably fit. The formal dining room is a great room for entertaining your family and friends. You will adore the beautiful hardwood floors. Kitchen is fully equipped with cabinetry, range, & refrigerator. Access to exterior yard from the kitchen. You will be pleased with the natural sunlight throughout this home.The Rent: $1150\/month.Also Includes:  laundry in bldg, street parking.","num_images":4,"lat":40.4679,"lng":-77.8967,"attrs":"['2BR \/ 1Ba', '868ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-20T14:31:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559661523.html","post_id":7559661523,"result_date":"Sun Nov 20 2022 19:40:31 GMT+0000 ","title":"Online Payments Available, Bark park","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Bocce ball fieldGame Room with Billiards Table, Shuffle Board, and more9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardOn-site bike storageUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsMarble master baths, some with deep linen storageOnline Payments Available48-hour Maintenance CommitmentAlexa or Google Home Capable in all ApartmentsState-of-the-art fitness center overlooking the Manayunk canalUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingPet-friendly livingCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/pye24fzg\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-20T14:23:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559661213.html","post_id":7559661213,"result_date":"Sun Nov 20 2022 19:26:42 GMT+0000 ","title":"Temple Medical Nursing School and Hospital Area","description":"3 bedroom row house-\nlarge full basement\nback yard and front porch\ngood neighborhood\nConvenient 5 block walk from Temple Medical Sciences Center\nCall - -  show contact info\n- - to discuss - -\n","num_images":8,"lat":40.008135,"lng":-75.12906,"attrs":"['3BR \/ 1Ba', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-20T14:22:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559655362.html","post_id":7559655362,"result_date":"Sun Nov 20 2022 19:23:20 GMT+0000 ","title":"Pet-friendly living, BBQ and deck area","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:48-hour Maintenance CommitmentOn-site bike storageGame Room with Billiards Table, Shuffle Board, and moreState-of-the-art fitness center overlooking the Manayunk canalOnline Payments AvailableBBQ and deck areaBark parkMarble master baths, some with deep linen storageUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingJogging trail right outside your doorUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/j3hs273x\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-20T14:07:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559653204.html","post_id":7559653204,"result_date":"Sun Nov 20 2022 19:17:06 GMT+0000 ","title":"Cute & Affordable Spruce St. Studio $915","description":"Adorable studio apartment in Philadelphia's best neighborhood at an excellent price! Act fast, you won't find a better deal. For rent (available immediately) is a studio apartment with a small kitchen, bathroom and ample closet space. This is a lease takeover beginning immediately through 3\/31\/23. As such, at the end of March you have the option of resigning for a year or moving out. The rent is only $915\/month and INCLUDES HEAT & HOT WATER! There is laundry in the basement. This is a third floor rear apartment that gets sun and has trees\/ivy outside the windows. It is quiet, safe,private and feels like you are up in a treehouse. It is a perfect starter apartment or student rental. I am moving into a larger space with parking, otherwise I wouldn't let it go.\nEmail with questions\/to come by and see the place. This gem won't last.\n","num_images":7,"lat":39.94861,"lng":-75.177843,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2022-11-20T14:02:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559656639.html","post_id":7559656639,"result_date":"Sun Nov 20 2022 19:14:43 GMT+0000 ","title":"Spacious & Bright, 2 Bedroom 2 Bathroom apartment in Philadelphia","description":"Spacious & Bright, 2 Bedroom 2 Bathroom apartment in Philadelphia. Furnished rentals, Furnished Apartments, Furnished Homes, Corporate housing, Executive housing, Richland furnished rentals, Kennewick furnished rentals, Tri City Furnished rentals, short term lease, extended stay, month to month lease, monthly lease, Hotel alternative, Tri City Furnished Homes, yard, pet friendly, Sauna, Jacuzzi, Pool, Gym, Dog park, Washer and dryer, Private entry, private parking, Home suites, rent my home, wheelchair accessible. For more information and to arrange a showing please text :  show contact info\n.","num_images":4,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T14:10:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559651848.html","post_id":7559651848,"result_date":"Sun Nov 20 2022 19:13:39 GMT+0000 ","title":"Move In Ready, in the award winning Upper Dublin School District!","description":"Move In Ready, in the award winning Upper Dublin School District! Hardwood floors and stairs have been refinished throughout, all rooms newly painted with neutral tones. Newer roof, siding and HVAC, Whole House Generator. Traditional colonial with formal dining room and living room. Eat in kitchen has a sweet bay window and is adjacent to the family room with a brick fire place. Sliders lead from the family room to the back patio and private backyard. A perfect place for morning coffee or to unwind at the end of the day! A large first floor laundry room is adjacent to the kitchen and leads out to the two car garage. A first floor powder room completes this level. Primary suite, three additional bedrooms and a Full Bathroom complete the upper level. The full basement is unfinished and has ample room for storage! Located in close proximity to Upper Dublin High School and major routes including PA Turnpike, 476, 63, 309, Fort Washington and Ambler Train Stations, Temple University Ambler Campus, Lifetime Fitness and historic downtown Ambler with its terrific restaurants and theater. Take a short walk to Mondauk Park and find a walking trail along with soccer and baseball fields. This wonderful family home, in the top rated Upper Dublin School District, is located in a coveted neighborhood enhanced with sidewalks and mature trees.","num_images":0,"lat":39.9523,"lng":-75.1638,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T13:58:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559655534.html","post_id":7559655534,"result_date":"Sun Nov 20 2022 19:11:46 GMT+0000 ","title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-20T14:07:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559655475.html","post_id":7559655475,"result_date":"Sun Nov 20 2022 19:11:37 GMT+0000 ","title":"Putting Green , Pet Spa, Clubhouse with Game Room","description":"The Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nHome is where the heart is, and here at The Point at Glen Mills, it's never been easier to love where you live. Contact us today to schedule your tour. You'll be glad you did!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with granite countertops, stainless steel appliances and a breakfast bar. this unit also features a large entry closet, full sized washer\/dryer, linen closets, and a private balcony. The bedrooms features walk-in closets, and ensuite bathrooms.\nCommunity Features\n* TV Lounge\n* Sun Deck\n* Swimming Pool\n* Fitness Studio\n* Pet Salon\n* Professionally Managed\n* Community Lounge\n* Outdoor Grill Area\n* Easy Freeway Access\n* Bocce Ball\n* Yoga Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Bark Park\n* Putting Green","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1095ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-20T14:07:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559653923.html","post_id":7559653923,"result_date":"Sun Nov 20 2022 19:07:46 GMT+0000 ","title":"Newly renovated 2 bedroom apartment for rent in Philadelphia,","description":"Key words: Furnished rentals, Furnished Apartments, Furnished Homes, Corporate housing, Executive housing, Richland furnished rentals, Kennewick furnished rentals, Tri City Furnished rentals, short term lease, extended stay, month to month lease, monthly lease, Hotel alternative, Tri City Furnished Homes, yard, pet friendly, Sauna, Jacuzzi, Pool, Gym, Dog park, Washer and dryer, Private entry, private parking, Home suites, rent my home, wheelchair accessible.\nIf you are interested, Please contact Thank you  show contact info","num_images":3,"lat":39.9523,"lng":-75.1638,"attrs":"['2BR \/ 1Ba', 'available now', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T14:03:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559648942.html","post_id":7559648942,"result_date":"Sun Nov 20 2022 19:06:09 GMT+0000 ","title":"Bocce ball field, Online Payments Available, Pet-friendly living","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Upgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densMarble master baths, some with deep linen storageBBQ and deck areaBocce ball fieldFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingState-of-the-art fitness center overlooking the Manayunk canalGame Room with Billiards Table, Shuffle Board, and morePet-friendly livingUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingOn-site bike storage9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardAlexa or Google Home Capable in all ApartmentsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/cxbqaron\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-20T13:51:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559646554.html","post_id":7559646554,"result_date":"Sun Nov 20 2022 19:02:11 GMT+0000 ","title":"2 bedroom 1 bathroom in Philadelphia available now.","description":"2 bedroom 1 bathroom in Philadelphia available now. - Kitchen with New Cabinets - Electric Stove with Microwave above the stove - Updated Paint throughout - Recently Refinished Hardwood floors - No Dogs - No Smoking Requirements: Security Deposit + 1st months rent due at signing 1 years Lease Required $40 Background and Credit Check that you pay for, this $40 fee will come off the first's month rent. The 2nd floor apartment boast a Living-room, EIK, 3 bedrooms, one of which is a primary with a full bath , 1 additional bath & a small deck off the kitchen with stairs leading to the backyard. The home has 3 separate gas & electric meters & also 3 separate boilers\/furnaces. Extremely close to NYC transportation, buses, restaurants , shopping & more !Text to book appointments for showings, this won't last long","num_images":1,"lat":40.7195,"lng":-76.1158,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-20T13:45:11-0500"}]