[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1506-59th-st\/7498386276.html","post_id":7498386276,"result_date":"2022-06-18 23:36","title":"1506 N 59th St,","description":"The second floor offers new carpet, a sizable front bedroom with its own luxurious bath, two additional bedrooms with plenty of sunlight and closet space, and a shared hall bath. bathroom feature updated tiles and brand new vanities, tub, and fixtures. The finished basement offers laminated tile high ceiling. Other key features include brand new efficient water heater, central air HVAC system, and 100amp electrical system, new plumbing system.","num_images":9,"lat":39.9772,"lng":-75.2545,"attrs":"['3BR \/ 1Ba', 'available jun 21', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T23:24:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-great-neighborhood\/7498368042.html","post_id":7498368042,"result_date":"2022-06-18 21:51","title":"2 bedroom great neighborhood\/ hard wood floors","description":"Great neighborhood  in South Philly in owner occupied building. High ceilings, all hard wood\/tile floors.  Bright and sunny w\/ Big windows facing south and west.\n2 entrances.\nCentral air.  Partial exposed brick walls.  Big eat in kitchen, dishwasher, washer\/dryer.  Finished basement with 2 rooms.  Big living room with loft bedroom.  Bonus finished basement with 2 extra rooms could be 3rd bedroom and extra office space.\nClose to Italian market\/target\/walmart\/ikea\/Pat’s steaks\/Passyunk square restaurants, new Food Giant .\nAvailable June 24.\n","num_images":14,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '1400ft2', 'available jun 24', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T21:47:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/willow-grove-willow-grove-pa\/7498361983.html","post_id":7498361983,"result_date":"2022-06-18 21:22","title":"willow grove , pa","description":"2 bedroom 1st floor new carpets fresh paint off street parking , bus stop on property , available now , close to turnpike ,\ncredit check only $15   call Dave   show contact info","num_images":0,"lat":40.150144,"lng":-75.115328,"attrs":"['2BR \/ 1Ba', '800ft2', 'available jun 20', 'air conditioning', 'application fee details: $15', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T21:18:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/willow-grove-499-lincoln-ave\/7498359812.html","post_id":7498359812,"result_date":"2022-06-18 21:13","title":"499 lincoln ave","description":"2 bedroom 1st floor new carpet fresh paint , off street parking  bus stop on property great location , not from from turnpike available now .  credit check only $15   call dave   show contact info","num_images":0,"lat":40.150177,"lng":-75.115371,"attrs":"['2BR \/ 1Ba', '800ft2', 'available jun 20', 'air conditioning', 'application fee details: $15', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T21:09:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-townhouse-for-rent\/7498344773.html","post_id":7498344773,"result_date":"2022-06-18 20:17","title":"Townhouse for rent","description":"This is 7 year old twin style home! Neighborhood Charm with In-Town Convenience! Upgrades Galore! Perfect Condition! Oversized Deck! Two Car Garage! Enter side entrance to foyer with door to attached two car garage with opener. First floor family room with sliders to lower deck, as well as utility closet and extra storage. Steps lead to open floor plan second floor with dark wood-like floors, an abundance of windows and brightness and double sided gas fireplace. Gorgeous kitchen with white cabinets, granite countertops, oversized island with pendant lights and stainless steel appliances. Lovely breakfast area with sliders to oversized deck, awesome for outdoor entertaining. Second floor has large living and dining area as well as powder room. Steps lead to third floor with 3 bedrooms. Main bedroom has cathedral ceiling, high hats, large walk-in closet and large main bath with oversized tiled shower, two vanities and tiled floor as well as vaulted ceiling. Two other bedrooms are nice sized with great closet space. All bedrooms have ceiling fans. Hall bath has tile floor and tub. Bonus second floor laundry room. This home has it all! Beautifully decorated, extremely bright, two car garage, gas cooking, gas fireplace, fantastic location, close to downtown Lansdale.","num_images":14,"lat":40.241324,"lng":-75.276432,"attrs":"['3BR \/ 2.5Ba', '2049ft2', 'available aug 1', 'air conditioning', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T20:13:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-walk-in-closets-large\/7498334417.html","post_id":7498334417,"result_date":"2022-06-18 19:43","title":"Walk in Closets, Large Windows, Grand Roof Deck, Golf Simulator","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1050Date Available: 2022-08-27Address: 1000 South Broad Street\nExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/yndc62ak\/lincoln-square\n","num_images":0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '1050ft2', 'available aug 27', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-06-18T19:39:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-very-spacious-2bedroom\/7498300599.html","post_id":7498300599,"result_date":"2022-06-18 18:00","title":"Very spacious 2bedroom 1bathroom ready for rent","description":"Enter into a spacious living area that seamlessly connects to a galley kitchen with granite counters and cherry cabinetry. In the back large bedrooms that have huge closets and big windows can be found. This 2 bed 1 bath rental is available starting 2021-08-19. Do not miss your chance to rent this unit, schedule a viewing today! Tenant pays all utilities except: Trash Lease Term: 12 months. Pet Policy: Pets OK with Deposit. Amenities: Listing photos may be example photos\nkindly text\/call in below description to make an appointment to see the cutest place on the block!! We look forward to meeting you.\nCall\/Text : +  show contact info","num_images":13,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 1Ba', '910ft2', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T17:56:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-well-kept-passyunk-square\/7498294259.html","post_id":7498294259,"result_date":"2022-06-18 17:55","title":"Well-kept Passyunk Square 2nd Fl 2 Bed Apt w\/ C\/A, D\/W, and more!","description":"Well-Maintained Passyunk Square 2nd Fl. 2 Bed., 1 Bath Apt! Walk-in and find a private entryway to the second floor, enter into the nice-sized living room\/dining room combo with tile floors, nice amount of cabinet and counter top space with Gas range, dishwasher, and refrigerator included! Down the hallway, you will find a 3-piece ceramic tile bathroom. ***W\/D is owned by tenants and they are willing to sell it to next tenants*** Finally, you will find two nice-sized bedrooms with closets and hardwood floors. Great location! Half a block from the Broad St. subway and all the fabulous restaurants and shops that E. Passyunk Ave. has to offer! Central Air and Heat!! Tenant pays gas, electric, cable\/internet. Cold water\/sewer included. 1st, last and security deposit due at lease signing. 1 year lease min. $75 non refundable application fee, two paystubs\/or some income verification and photo ID with application. For gross monthly income, we look for 3x the rent . We run a credit, criminal and eviction check. Cats and small dogs below 30 lbs. OK with non-refundable one time pet fee. Available July 1, 2022! Contact Mike Giordano at  show contact info\n!","num_images":12,"lat":39.929065,"lng":-75.167078,"attrs":"['2BR \/ 1Ba', '800ft2', 'available jul 1', 'air conditioning', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T17:39:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-bi-level-bed-bath\/7498297894.html","post_id":7498297894,"result_date":"2022-06-18 17:52","title":"Modern Bi-Level 3 Bed 2 Bath Passyunk Square Apt! W\/D! D\/W! Come see!!","description":"Modern Bi-Level (2nd and 3rd Fls.) 3 Bedroom, 2 Bath Passyunk Square Apt.! Located in Philadelphia's Hottest Neighborhood...Passyunk Square! 2nd Fl. consists of a beautiful living room\/dining room combo - large eat-in kitchen with stainless steel appliances - electric range, refrigerator, and dishwasher; and huge living room space with H\/W floors. Beautiful 3-piece tile bathroom with W\/D and nice-sized bedroom. 3rd fl. consists of 2 bedrooms with wall-wall carpeting. Both are nice sizes with good closet space. Additional open family room space with closets as well on the 3rd Fl. Gorgeous 3-piece ceramic tile bathroom with original claw foot tub! Tenant pays gas, electric, part of cold water\/sewer bill and cable\/internet. Come see! Cats or Dogs under 30 lbs. are ok with a non-refundable pet fee. 1st, last and security deposit at lease signing. 1 year lease min. $75 non refundable application fee - two paystubs\/some income verification and photo ID. We run a credit, criminal, and eviction check. For gross monthly income, we look for 3x the rent. Available August 1, 2022. Tenant to supply their own AC units. Contact Mike Giordano for more info at  show contact info\n!","num_images":12,"lat":39.928213,"lng":-75.160647,"attrs":"['3BR \/ 2Ba', '1500ft2', 'available aug 1', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T17:48:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2bedroom-bath-super-cool\/7498294783.html","post_id":7498294783,"result_date":"2022-06-18 17:44","title":"2Bedroom\/ 1 Bath Super cool apartment in a excellent location Philadel","description":"2Bedroom\/ 1 Bath Super cool apartment in a excellent location Philadelphia! The home features fresh paint and new wood laminate flooring. The kitchen includes wood cabinets with new granite counters, a new electric stove\/oven, and refrigerator. The bedroom includes a large closet.If you're interested or would like to know more from either one of us please feel free to reach out to me.For rapid response, Please Text me here:-  show contact info\nThe room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in City and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. Application fee $25 only! I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. Beautiful hardwood floors, a patio or balcony, high ceilings, window coverings, and plush carpeting. On the outside, our community is equally inviting, with a sparkling pool and sundeck waiting to cool you off on sweltering days. I would prefer furnished if possible. Im looking to pay around $740.00 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. CREDIT WILL BE CHECKED!! The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage.Most of our time would be spent commuting and\/or attending work and\/or school. We are super quiet, clean, simple, and drama free, just looking to live with quiet, nice folk, looking for about $740 \/month.This is loaded with character. For rapid response, Please Text me here:-  show contact info","num_images":3,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T17:40:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-2nd-fl-bed-queen\/7498291524.html","post_id":7498291524,"result_date":"2022-06-18 17:35","title":"Modern 2nd Fl 2 Bed Queen Village Apt. w\/ W\/D, C\/A, and so much more!!","description":"Modern and Newer 2nd Fl. 2 Bedroom, 1 Bath Apartment in the desirable Queen Village Neighborhood! Right off of South St.! This apartment has recently been totally renovated! Walk into a huge living room with all hardwood flooring; newer kitchen with all beautiful appliances - range, refrigerator, and dishwasher! W\/D in closet in kitchen. Nice amount of cabinet and counter top space! Central Air and Heat! Featuring two nice-sized bedrooms with newer carpets and lots of closet space. Modern 3-piece ceramic tile bathroom with a beautiful tiled shower. Cats and dogs are OK with an additional month for security. Available August 1, 2022. 1st, last, and one month security deposit due at signing. Minimum 1 year lease. Prospective Tenants must complete a $75  non refundable application fee with two paystubs\/some income verification and photo ID - we run a credit, criminal and eviction check. For gross monthly income, we look for 3x the rent. Tenant pays gas, electric, and cable\/internet. Cold water\/sewer included. Contact Mike Giordano at  show contact info\n!","num_images":22,"lat":39.941242,"lng":-75.147643,"attrs":"['2BR \/ 1Ba', '1500ft2', 'available aug 1', 'air conditioning', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T17:31:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-1st-fl-bed-passyunk\/7498288221.html","post_id":7498288221,"result_date":"2022-06-18 17:27","title":"Modern 1st Fl 1 Bed Passyunk Square Apt! W\/D! C\/A! Yard! Come see this","description":"Modern 1st Fl. 1 Bedroom 1 Bath Passyunk Apt. with H\/W floors, W\/D, C\/A! Great size! Large Living Room\/Dining Room\/Kitchen combination with hardwood floors, kitchen has tile floors, granite countertops, tile backsplash and is great for entertaining with appliances including gas rang, microwave, dishwasher and refrigerator.. Nice-sized bedroom with closet space and hardwood floors. Modern 3-piece bathroom! Private rear yard! Nice windows with lots of natural light! Access to the unfinished basement with W\/D! Central Air and Heat! Cats and small quiet dogs (less than 25 lbs.) are OK with a one-time non-refundable pet fee. First, last, and security deposit required at lease signing. 1 year lease minimum. Applicant must first fill out an application with two recent pay stubs\/some income verification, copy of photo ID, and $75 non refundable application fee. Tenant is subject to credit check, criminal and eviction check. For gross monthly income ,we look for 3x the rent. Available asap! Tenant pays gas, electric, and cable\/internet. Landlord pays cold water\/sewer. For showings, please call\/text Mike Giordano at  show contact info\n!","num_images":12,"lat":39.926136,"lng":-75.163968,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'air conditioning', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T17:23:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-24-hour-fitness-center\/7498287425.html","post_id":7498287425,"result_date":"2022-06-18 17:25","title":"24 Hour Fitness Center, Outdoor Cinema, Free Wifi Lounge, Parking","description":"Bedrooms: 0Bathrooms: 1Square Feet: 394Date Available: 2022-07-16Address: 1000 South Broad Street\nExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/fbfmhgvg\/lincoln-square\n","num_images":1,"lat":39.9379,"lng":-75.1794,"attrs":"['0BR \/ 1Ba', '394ft2', 'available jul 16', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-06-18T17:21:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-comfortable-living\/7498281635.html","post_id":7498281635,"result_date":"2022-06-18 17:10","title":"Comfortable living. Conveniently located, spacious 1 bed 1 bath!","description":"Welcome to Millview Apartments!100 Cobblestone Dr Coatesville, PA 19320Rental Size: 1 BR - 1 BA - 771 sq ft | Per Month: $1547 - $2042 | Lease Length: Variable show contact info\nMillview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.  Our community features:   ◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral Bonuses  Our unit features: ◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In Closets   Contact us for more information! --  show contact info\n--Our Pet-Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Website: https:\/\/www.apartmentsincoatesvillepa.com\/Property Management: Paradise Management, LLCEQUAL HOUSING OPPORTUNITY27A7057C58A14CE\n","num_images":14,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '771ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T17:06:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-large-2br-2ba-private\/7498280313.html","post_id":7498280313,"result_date":"2022-06-18 17:06","title":"Large 2br 2ba W\/Private Balcony! Pet Friendly! W&D in Unit!","description":"2 Bedroom  2 Bathroom | 1178 sq ft | $1753 - $2354\/Month Millview Apartments100 Cobblestone Dr Coatesville, PA 19320 show contact info\nDescription: Complete with a soothing sauna, dry-cleaning pick-up and delivery, a resort style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today. Apartment Amenities:❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In ClosetsOur Residents Enjoy:❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral BonusesAdditional Details:Deposit: CallTerms: VariablePets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":14,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T17:02:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-lots-of-living-room-space\/7498278252.html","post_id":7498278252,"result_date":"2022-06-18 17:01","title":"Lots of Living Room Space In this 1BR 1BA! Pet Friendly! Pool Open!","description":"Millview ApartmentsLocated at: 100 Cobblestone Dr Coatesville, PA 19320Featured unit: 1 bed | 1 bath | 845 sq ft Prices start at: $1643 - $2157\/month Call Today!  show contact info\nTHE BEST APARTMENTS IN COATESVILLE, PA\nIf you're looking for the best apartments in Chester County, look no further than Millview Apartment Homes. Our world-class amenities, including a resort-worthy swimming pool, sauna, and clubhouse are better than any in the Coatesville area. Our professional leasing staff is eager to welcome you home to a carefree lifestyle. Please schedule a tour and come home to the best Coatesville, PA apartments.Wonderful Amenities!❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral BonusesApartment Features!❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In Closets  show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.EQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":14,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T16:57:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-comfortable-convenient\/7498273259.html","post_id":7498273259,"result_date":"2022-06-18 16:49","title":"Comfortable Convenient Luxury!","description":"Bedrooms: 0Bathrooms: 1Square Feet: 380Date Available: 2022-06-18Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.Call:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/5mo752bi\/lincoln-square\n","num_images":1,"lat":39.9379,"lng":-75.1794,"attrs":"['0BR \/ 1Ba', '380ft2', 'available now', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-06-18T16:45:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-well-kept-2nd-fl-bed-queen\/7498270004.html","post_id":7498270004,"result_date":"2022-06-18 16:41","title":"Well-Kept 2nd Fl 2 Bed Queen Village Apt! W\/D! Gorgeous Bath! Come see","description":"Well-maintained 2nd Fl. 2 Bedroom, 1 Bath Queen Village Apartment with large living room space; eat-in kitchen with nice amount of cabinet space and W\/D; beautiful brand new modern 3 piece ceramic tile bathroom and 2 nice-sized bedrooms with closets. Come see! Tenants to supply their own AC UNITs. Cats or Small dogs under 25 lbs. are ok with non-refundable pet fee. Available August 1, 2022! Tenant pays gas, electric, cable\/internet and flat amount towards the cold water bill! 1 year lease minimum. 1st, last and security required at lease signing. $75 non refundable application fee with two paystubs\/some income verification and photo ID. We run a credit, criminal, and eviction check. For gross monthly income, we look for 3x the rent. Come see! Please Contact Mike Giordano for more info at  show contact info\n!","num_images":14,"lat":39.939888,"lng":-75.14794,"attrs":"['2BR \/ 1Ba', '800ft2', 'available aug 1', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T16:37:20-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-wow-bedroom-and-bathroom\/7498330231.html","post_id":7498330231,"result_date":"2022-06-18 19:29","title":"WOW -1 bedroom and 1 bathroom boutique House Allentown","description":"WOW -1 bedroom and 1 bathroom boutique House Allentown. -Enjoy super low energy bills This beautiful three bedroom Fulton Hill home on a corner lot is available now!!, all new windows with granite window sills, hardwood cherry floors throughout, updated kitchen with granite, new cabinets and stainless steel appliances, upgraded bathroom with new vanity, new toilet and tiled shower\/tub combo; inside laundry with washer and dryer included.The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $550 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 25 year old Latino partnered with a 26 year old latino. We are a gay couple, family oriented, clean, busy college students, and full time workers. Most of our time would be spent commuting and\/or attending work and\/or school. We are super quiet, clean, simple, and drama free, just looking to live with quiet, nice folk, looking for about $550\/month. If you're interested or would like to know more from either one of us please feel free to reach out to me.\nIf you are interested please send me your number.\n","num_images":4,"lat":40.5891,"lng":-75.4645,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T19:25:24-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-great-home-bed-bath-available\/7498329484.html","post_id":7498329484,"result_date":"2022-06-18 19:26","title":"Great home 1 Bed\/ 1 Bath Available! in a great location Allentown!","description":"Great home 1 Bed\/ 1 Bath Available! in a great location Allentown! The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage.Most of our time would be spent commuting and\/or attending work and\/or school. We are super quiet, clean, simple, and drama free, just looking to live with quiet, nice folk, looking for about $550 \/month.This is loaded with character. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in City and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. Beautiful hardwood floors, a patio or balcony, high ceilings, window coverings, and plush carpeting. On the outside, our community is equally inviting, with a sparkling pool and sundeck waiting to cool you off on sweltering days. I would prefer furnished if possible. Im looking to pay around $550 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. We are a couple, family oriented, clean, busy college students, and full time workers. The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. If you're interested or would like to know more from either one of us please feel free to reach out to me.\nIf you are interested please send me your number.\n","num_images":11,"lat":40.5891,"lng":-75.4645,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T19:22:49-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-beautiful-bedroom-bathroom\/7498321328.html","post_id":7498321328,"result_date":"2022-06-18 19:13","title":"*-*Beautiful 2 Bedroom\/ 2 Bathroom Available Now in Central NJ*-*","description":"Modern and bright 2 bedroom apartment, newly renovated, The home offers a private entry, living room and dining room with hardwood floors, Kitchen and 1\/2 Bath complete the first floor. The second floor offers 2 bedrooms, full bath with tub, closets. The basement is finished for great extra recreation space, with storage, laundry room and utilities and Room for Office and or a Gym. Patio for a Barbeque and a spacious backyard. Roof & Siding 2014, HW Heater 2019. Im off Tues-Thursday every week. So I would only be home 3 days a week. all new vinyl flooring throughout, new paint throughout, very large living room with extra large closet, large windows and plenty of sunlight, good size bedroom and bathroom, walk-out basement unit, in-building washer\/dryer and additional storage room. FOR MORE INFORMATION on this property, please visit the Mail:______________Deanalewis988gmail_com____________","num_images":4,"lat":40.2377,"lng":-74.7821,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-06-18T18:57:40-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-3rd-flr-desirable-location\/7498317365.html","post_id":7498317365,"result_date":"2022-06-18 19:03","title":"3rd Flr \/- DESIRABLE LOCATION! Available August 1st - 2BD\/2BA Rental !","description":"DESIRABLE LOCATION! Available August 1st. Don't miss out on this modern 2 bedroom, 2 bath unit located in Lancaster. Marks parish neighborhood. This unit is ideally situated for in-town and suburban commutes with a balanced blend of residential life and city amenities. Enjoy a nice leisure walk to Adams Village and\/or Peabody Square surrounded by various shops, restaurants and other area amenities. Take a bike ride along the Boston Harbor walk to Castle Island, Carson Beach is just 2.5 miles away or a stroll thru Pope John Paul Park. Unit features master bedroom w\/stand-up shower, central heat\/AC, EIK with SS appliances, hardwood floors throughout and in-unit washer\/dryer. Unit is located on the 3rd floor in a well maintained 3 family owner-occupied residence. Use the following link to apply now:","num_images":4,"lat":40.0091,"lng":-76.3671,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T18:45:12-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/nazareth-twin-house-for-rent\/7498318441.html","post_id":7498318441,"result_date":"2022-06-18 18:52","title":"TWIN HOUSE FOR RENT","description":"Twin home for rent. New carpet and paint. Large basement with washer and dryer hook-up. Garage and off street parking. Back yard with a patio. New fridge. Trash and sewage included. Eat-in kitchen.  Walk to downtown Nazareth. Quiet street. Nazareth School District. Two months rent deposit. No pets and no smokers. Require completed application, credit and background check.  Serious inquiries only.","num_images":8,"lat":40.745,"lng":-75.3199,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available jun 27', 'duplex', 'w\/d hookups', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T18:48:25-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/seaford-completely-renovated-bed-bath\/7498292091.html","post_id":7498292091,"result_date":"2022-06-18 18:17","title":"Completely renovated 3 bed\/2 bath Downtown Seaford at RT 13, ~","description":"Welcome to your new home, a completely renovated 3 bedroom, 2 bath beauty sitting on just under 5 acres! Just minutes from the shops, restaurants, art and riverwalk of Downtown Seaford at RT 13, yet out in the country, where it's quiet and tranquil. As you open the front door, you are greeted by an open concept with beautiful tile floors and modern recessed lighting. The living room opens up to the kitchen that features modern high-end countertops, a sunk in sink, stainless steel appliances and more!","num_images":0,"lat":38.6404,"lng":-75.6041,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T17:33:24-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-welcome-to-your-new-home\/7498284217.html","post_id":7498284217,"result_date":"2022-06-18 17:22","title":"Welcome to your new home!","description":"Welcome to your new home! As you step inside this home you will find a large updated kitchen with plenty of cabinet space and granite counter tops, 2 updated bathrooms, recessed lighting, and a new egress window in the basement!! With this added egress window this basement offers approximately 1100 sq ft of potential additional living space ready for you to finish as you wish, or offers plenty of storage space. This home has a lot of charm with chair rail and picture frame molding throughout the living area.\nText \/call  show contact info\nfor more information to schedule move in date..","num_images":5,"lat":39.6102,"lng":-75.6747,"attrs":"['2BR \/ 2Ba', '1125ft2', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T17:12:48-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-furnished-all-utilities\/7498249651.html","post_id":7498249651,"result_date":"2022-06-18 17:01","title":"FURNISHED ALL UTILITIES 2 bedroom 2 bath..","description":"Relax, dolphin watch, and enjoy beautiful intracoastal and creek views , in this new to the market, all inclusive furnished 2 bedroom 2 bath 1400 sq ft single family home. Conveniently located, minutes away from Mayfaire and Porters Neck and Wrightsville beach this home is now being offered for lease for August 1 occupancy.\nBring your kayaks, paddleboards. This property has access to beautiful Pages Creek.\nCovered carport , 1 car garage , storage room, washer\/dryer, high-speed internet and all utilities are included.\nContact for details. show contact info\n.","num_images":6,"lat":39.7647,"lng":-75.5069,"attrs":"['2BR \/ 2Ba', '1400ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T15:51:04-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-spacious-3bedroom-house-in-west\/7498266556.html","post_id":7498266556,"result_date":"2022-06-18 16:52","title":"Spacious 3Bedroom House in West Trenton","description":"This spacious 3 bed, 2 bath home has so much to offer and will not disappoint. Located in the desirable West Trenton section of Ewing and steps away from the Trenton Country Club.   Hardwood floors throughout most of the home, open floor plan, spacious living room and formal dining room. The completely renovated kitchen features upgraded cabinets, stainless steel stove, custom backsplash and gorgeous  counters.  Plenty of room for sharing and preparing meals with family and friends.  There is also an over sized Family room area off the back that leads to the fully fenced backyard area.  Upstairs you will find 3 nice sized bedrooms and full updated sparkling bathroom.  There’s also a convenient half bath. You’ll LOVE the open and bright screened in porch. The basement offers an extra storage area, playroom, gym area or whatever who want.  All this and an attached garage.  The yard offers green space and room for a garden. Trex deck. Newer windows. Newer Furnace\/AC. Newer roof (2018) Whole house generator. Concrete driveway. Security  Ideally located close to major highways, TCNJ , shopping, parks and restaurants.","num_images":10,"lat":40.250505,"lng":-74.807028,"attrs":"['3BR \/ 2Ba', '1312ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T16:29:15-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-lovely-family-3br\/7498238719.html","post_id":7498238719,"result_date":"2022-06-18 16:47","title":"Lovely family 3br","description":"Great townhouse for students and families alike! Central air, large and open living\/dining room areas. 3 full bedrooms and updated bath upstairs. New granite countertops in kitchen! Spare room, washer dryer, and garage storage in basement as well as access to paved parking out back! Just a 10 minute walk from campus, and short drive to I-95.","num_images":9,"lat":39.7011,"lng":-75.7375,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-06-18T15:26:51-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/south-river-luxury-apartments-pool-gym\/7498226020.html","post_id":7498226020,"result_date":"2022-06-18 16:18","title":"Luxury Apartments Pool, Gym and More","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21,"lat":40.457525,"lng":-74.394361,"attrs":"['1BR \/ 1Ba', '1023ft2', 'available now', '\\nmonday 2022-06-20\\n', '\\ntuesday 2022-06-21\\n', '\\nwednesday 2022-06-22\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T14:59:48-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-your-pets-are-like-family-here\/7498257491.html","post_id":7498257491,"result_date":"2022-06-18 16:11","title":"Your Pets are like Family Here! We love dogs and cats! 2 Bed, 2 Bath","description":"The Apartments at Pike Creek Leasing Office:  100 Red Fox Lane Newark, DE 19711 show contact info\nTake a look at what The Apartments at Pike Creek has to offer! Unique apartment homes in a serene setting in the woods. Here at Apartments at Pike Creek, everything comes together...convenient location, extraordinary architecture, cozy fireplaces, spacious kitchens, and private patios or balconies with exquisite natural or pool views. Enjoy our sand volleyball court, lighted tennis court, and our resort-style swimming pool. Whatever your passion, you will find your life here at the Apartments at Pike Creek.Rental Information: 2 Bedroom \/ 2 Bathroom \/ 1000 sq ft \/ $1948 - $2030\/Month  Lease Terms: VariableApartment Amenities:➢ Balcony➢ Dishwasher➢ Fireplace➢ Garbage Disposal➢ Mini Blinds on all Windows➢ New\/Renovated Interior➢ Oversized Closets➢ Refrigerator, Microwave, Range and Oven➢ Some Paid Utilities➢ Stainless Steel AppliancesAdditional Information:➢ 24 Hour Availability➢ Car Care Center➢ Clubhouse➢ Coffee Bar➢ Dogs & Cats Welcome➢ Emergency Maintenance➢ Grill➢ On Site Maintenance➢ Package Acceptance➢ Swimming Pool➢ Christina School District➢ Covered Parking Available➢ Electronic Rental Payments and Service Requests➢ Fireplace & Wireless Internet Access➢ Fitness Center w\/Cardio Machines and Free Weights➢ Maintenance Free Lifestyle➢ Monthly Social Events➢ On-site Leasing Office➢ Property Manager on Site➢ Public Transportation Leasing Hours: Mon - Fri: 8:30 AM - 5:30 PM show contact info\nPet Policy: We allow cats and dogs with no weight limit on the first floor and weighing a maximum of 35 lbs. full grown on all other floors. Breed restrictions apply. Pet deposit is equal to one month's rent. Website: https:\/\/www.apartmentsatpikecreek.com  Management Company: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITY843DA39B59114EAE\n","num_images":23,"lat":39.7011,"lng":-75.7375,"attrs":"['2BR \/ 2Ba', '1000ft2', 'available aug 16', 'air conditioning', 'application fee details: $50 non-refundable application fee per applicant 18 yrs and older', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-06-18T16:07:51-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/south-river-luxury-apartments-pool-gym\/7498226221.html","post_id":7498226221,"result_date":"2022-06-18 16:08","title":"Luxury Apartments Pool, Gym and More","description":"Contact info:\nKensington Place | Edgewood Properties |  show contact info\nKENSINGTON PLACE\n527 Old Bridge Turnpike, East Brunswick,NJ 08816>\nshow contact info\nwww.KensingtonPlace.com\nKEY FEATURES\n1,2 &3 Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nGranite countertops\n… AND MORE!\nDESCRIPTION\nKensington Place, situated off of Route 18 in East Brunswick, presents a fabulous location offering the ultimate in commuting convenience, shopping and dining experiences, and so much more! These magnificent 1, 2 and 3-bedroom rental apartments are designed to complement your lifestyle, featuring private master bedroom, walk-in closets, upscale appliances, granite countertops and so much more!\nKensington's state-of-the-art clubhouse offers outstanding amenities for residents of this community: Sunday continental breakfast, swimming pool with cabanas, business center, 24-hour fitness center, and a game room with billiards. Come see why everybody is calling Kensington Place home!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/Kensingtonplace.com\nContact info:\nKensington Place\nEdgewood Properties\nshow contact info\n","num_images":21,"lat":40.457525,"lng":-74.394361,"attrs":"['1BR \/ 1Ba', '921ft2', 'available now', '\\nsunday 2022-06-19\\n', '\\nmonday 2022-06-20\\n', '\\ntuesday 2022-06-21\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T15:00:13-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/south-harrison-township-rare-find\/7498250108.html","post_id":7498250108,"result_date":"2022-06-18 15:56","title":"Rare Find","description":"Location,Location Location!!!\nVery Desirable Area!\nHistoric District\nWalk to stores, restaurants, shopping\nOne Bedroom Apt on the Second Floor\nOn Site Parking\nLaundry on Site\nGetting freshly painted\nLimited pics right now.","num_images":5,"lat":39.732554,"lng":-75.224054,"attrs":"['1BR \/ 1Ba', 'available jul 10', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T15:52:04-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/cologne-house-in-galloway\/7498244716.html","post_id":7498244716,"result_date":"2022-06-18 15:44","title":"House in Galloway","description":"Two bedroom house on wooded lot\nDeck, Fenced Yard\nCentral Air, New Propane gas heater\nwell & Septic\nPositive Rental History & 650 Credit Score required\nNo pets or Smoking Permitted\n*1 1\/2 month security deposit and first month rent due upon signing\nFOR MORE INFORMATION, PLEASE CALL Bill AT CENTURY21 FRICK REALTORS cell  show contact info\nThis information is deemed reliable, but not guaranteed","num_images":12,"lat":39.514874,"lng":-74.632874,"attrs":"['2BR \/ 1.5Ba', 'available jul 1', 'air conditioning', 'application fee details: $30 application fee per adult', 'house', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T15:40:07-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-music-room-pantry-closet-grills\/7498242903.html","post_id":7498242903,"result_date":"2022-06-18 15:39","title":"Music Room, Pantry Closet, Grills","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Hotel Style Card Access Security Lock at Apartment EntrySpacious 1 BR, 2BR & 2 BR-plus Loft Apartments 1-2 ½ BathsConference CenterSpacious 9’ Ceilings with Open-Concept Floor PlansCatering KitchenTop Floor Lofts with Vaulted Ceilings and SkylightsParking GaragePool ShowerFire PitGame RoomPoolOutdoor SeatingCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/ynkonalm\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10,"lat":40.5716,"lng":-74.3167,"attrs":"['1BR \/ 1Ba', '676ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-06-18T15:35:59-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/delanco-1x1-apartment-with-access-to\/7498216504.html","post_id":7498216504,"result_date":"2022-06-18 14:43","title":"1x1 Apartment with Access to a Saltwater Pool","description":"SDK Tenby Chase Apartments  CALL US TODAY!  show contact info\nx410  1  bedroom 1 bath 937Sq.Ft.  $1,910 - $2,648\/mo  * Unit U289 - Available 08\/13\/22  Welcome Home to SDK Tenby Chase in Delran NJ  At Tenby Chase, you can rent apartments in a one-bedroom, one-bathroom floor plan with full-size washers and dryers. Apartments in this layout have sunk-in living rooms with wood-burning fireplaces, kitchens with walk-in pantries, and separate dining areas. This pet-friendly community has a park-like setting with a saltwater pool, a tennis court, and a clubhouse lounge. Call today.  FLOORPLAN\/UNIT AMENITIES:  * Carpeted Floors  * Window Treatments  * Individual Apartment Entrances  * Full-size washer\/dryer  * Large Closets  * Spacious Floor Plans  * Fully Equipped Kitchen  * Dishwasher  * Central Heating & Air Conditio  * Dining Area  PROPERTY AMENITIES:  * Regular-sized pool  * Beautiful Park Like Setting  * Pet Friendly  * Tennis Court  * Laundry  * Well maintained grounds  * Good guest parking  * Online Resident Services  * Close to Major Highways  * On-site Maintenance  * On-site Management  * Professionally Landscaped Cour  * Off-street Parking  * Close to Dining, Shopping & En  * Park Like Setting  * Fitness Center  * Clubhouse MANAGED BY: SDK Apartments CALL US TODAY! show contact info\nx410 Address: 193 Tenby Chase Dr Delran, NJ 08075 Equal Housing Opportunity\n","num_images":0,"lat":40.008697,"lng":-74.962943,"attrs":"['1BR \/ 1Ba', '937ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T14:39:49-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-cozy-bed-and-bath-house\/7498213991.html","post_id":7498213991,"result_date":"2022-06-18 14:38","title":"COZY -3 bed  and -3 bath  House ReNovaTed !","description":"COZY -3 bedroom and 3 bathroom boutique House Allentown . -Enjoy super low energy bills This beautiful three bedroom Fulton Hill home on a corner lot is available now!!, all new windows with granite window sills, hardwood cherry floors throughout, updated kitchen with granite, new cabinets and stainless steel appliances, upgraded bathroom with new vanity, new toilet and tiled shower\/tub combo; inside laundry with washer and dryer included. IF YOU ARE INTERESTED, CONTACT ME NOW FOR VIEW AND MORE INFO.  show contact info\nLUXURY-3 bedroom and 3 bathroom boutique House. -Enjoy super low energy billsLUXURY-3 bedroom and 3 bathroom boutique House. -Enjoy super low energy bills\n:::\n:::\n:::\n:::\nINCREDIBLE views. Laundry mat no more! Each unit also includes a washer and dryer. Building amenities include an indoor gym, a service elevator, and a roof deck featuring a dog park, a yoga area, a covered and uncovered lounge area, and amazing city views.The SURROUNDING East Kensington neighborhood is in the hottest neighborhood in the city with nearby green spaces like Norris Square Park and Palmer Park. There are many local restaurants, bars, and coffee shops such as Forin Cafe, Soup Kitchen, Martha, Philadelphia Brewing Company, Evil Genius Brewing, LMNO, International Bar, Suraya and Philly Style Bagels, just to name a few. 171 Berks Street has great proximity to public transportation; it's just a few blocks from the Berks train station and the Temple University bus route The bedroom is located downstairs with its own restroom. Rental Prices: (includes everything) Month to month: $500 a month Deposit: Rental Rrice Includes: All utilities High speed internet Cable TV Washer and Dryer Full size refrigerator Access to full kitchen Professional cleaning service Many other amenities - Includes utilities and unlimited internet usage, double size bed - $500 \/month on a yearly lease - For post-secondary students or recent graduates only - 10 minutes walk to UC campus, Building or C-train station\/major bus terminal. Registered free street parking is available for the first two vehicles - Sorry, we cannot accommodate smoking\/vaping\/firearms\/weapons or pets. - with desired viewing time, full name, email address and daytime contact number to set up a viewing appt. Please Tex","num_images":4,"lat":40.6018,"lng":-75.5225,"attrs":"['3BR \/ 3Ba', '1296ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T14:34:22-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/spotswood-east-brunswick-2bd-2ba-condo\/7498211055.html","post_id":7498211055,"result_date":"2022-06-18 14:32","title":"East Brunswick 2bd\/2ba condo","description":"Quiet ground floor 2 bed\/2 bath condo in a lovely community.\nSwimming pool and tennis courts accessible.\nDishwasher, washer\/dryer (in unit).\nWalk-in closet in each bedroom.\nBeautiful shared backyard space.\nNo pets, no smokers.\n","num_images":10,"lat":40.405761,"lng":-74.41427,"attrs":"['2BR \/ 2Ba', '1134ft2', 'available aug 1', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T14:28:25-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-disposal-gas-heat-patios-or\/7498206074.html","post_id":7498206074,"result_date":"2022-06-18 14:22","title":"Disposal, Gas Heat, Patio’s or Balconies","description":"We are located in Blackwood New Jersey and close to the Philadelphia area. We offer spacious one and two bedroom apartment floor plans to choose from so you can find your perfect home for your family. Another great reason to live at Washington Way apartments is that each apartment has its own  balcony or patio overlooking our beautiful park like views.At Washington Way Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails. Our community enjoys hosting seasonal resident events for our residents with extended pool hours and DJ, food and raffles for a great way to meet your neighbors.At Washington Way Apartments consider our great location in Blackwood, NJ. Located in the top ten Washington Township School District, Your children enjoy a top rated education being one of the best school districts in the state. Our residents enjoy the convenient access to Routes I-295, and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Sicklerville, Deptford, and Turnersville, and the new Outlet Mall that just opened locally. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Washington Way Apartments today.\n-Patio’s or Balconies\n-Fitness Center\n-Public Transportation\n-Clubhouse\n-Cable Hookup\n-Courtyard\n-Gas Heat\n-Playground\n-Air Conditioner\n-Small Pets Welcome\n-Ceiling Fans\n-24 Emergency Service\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/rij6iywn\/washington-way\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8,"lat":39.7901,"lng":-75.0367,"attrs":"['2BR \/ 1Ba', '1005ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T14:18:02-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-perfect-location-laundry\/7498199958.html","post_id":7498199958,"result_date":"2022-06-18 14:09","title":"Perfect Location, Laundry Room, Tree Lined Streets","description":"Top of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nTop of the Hill has a park like setting. Surrounded by tow parks and lush wooded landscaping.\nThis two bedroom two bathroom apartment has plenty of space and a walk in closet. Balcony and more.\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm\nCommunity Features\n* Renters Insurance is Required\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Car Wash Area\n* Tennis Court\n* Fitness Studio\n* After-Hours Emergency Maintenance\n* Professionally Managed\n* Some Utilities Included\n* Playground\n* Sun Deck\n* Laundry Care Center\n* Swimming Pool","num_images":8,"lat":39.795988,"lng":-75.485192,"attrs":"['2BR \/ 2Ba', '1221ft2', 'available jul 16', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T14:05:06-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mount-royal-perfect-location-playground\/7498199874.html","post_id":7498199874,"result_date":"2022-06-18 14:08","title":"Perfect Location, Playground Area, Dog Park","description":"Located in desirable Gloucester County, our residents enjoy nearby attractions including shopping, recreation, and fine dining. Your day-to-day needs can be easily met within the surrounding area, but if you wish to explore a bit further, our location offers that as well! In less than fifteen minutes you can enjoy the city of Philadelphia or head thirty minutes south to Wilmington.\nThis two bedroom one bathroom apartment has a large living and dining room and the benefit of a great closet off for extra storage. Each bedroom has it's own large closet. Washer dryer and more!\nVIEW OUR WEBSITE:\nhttps:\/\/heatherridgeapts.net\nHeather Ridge Apartments, managed by Panco Management\n454 Heather Drive\nMantua, NJ 08051\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm\nApartment Features\n* Dishwasher\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Walk-in Closet\n* Refrigerator\n* Washer and Dryer in unit\n* Microwave\n* Pre-wired for internet and cable\n* Central Heat and Air\n* Electric Stove\n* Window Coverings\n* Designer Track Lighting\n* Disposal\n* Extra Storage\n* Air Conditioning\n* Private Balcony\n* Vertical Blinds","num_images":18,"lat":39.806488,"lng":-75.177315,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T14:04:56-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-your-pets-are-like-family-here\/7498186941.html","post_id":7498186941,"result_date":"2022-06-18 13:42","title":"Your Pets are like Family Here! We love dogs and cats! 2 Bed, 2 Bath","description":"Welcome home to The Apartments at Pike Creek! Located at: 100 Red Fox LaneNewark, DE 19711 Rental Information:  # of Bedrooms: 2  # of Bathrooms:  2  Square Footage: 1000 sq ft Rental Pricing: $1948 - $2035\/month  Contact our leasing office at  show contact info\nOur apartments were designed with a busy lifestyle in mind. Enjoy a having a private entrance into your apartment and a private patio or balcony where you can enjoy fresh air after a long day stuck in the office. Oversized closets offer extra storage and plenty of space to organize your clothing. Each apartment home includes a washer & dryer unit for your convenience. Many other small details make living at The Apartments at Pike Creek the obvious choice in Newark.\nSchedule a visit to our community today. We are eager to meet you and show you around our beautiful apartment community. Community Features: ❖ 24 Hour Availability❖ Business Center❖ Car Care Center❖ Clubhouse❖ Dogs & Cats Welcome❖ Emergency Maintenance❖ On Site Maintenance❖ Package Acceptance❖ Swimming Pool❖ Tennis Court❖ Christina School District❖ Covered Parking Available❖ Electronic Rental Payments and Service Requests❖ Fireplace & Wireless Internet Access❖ Maintenance Free Lifestyle❖ Monthly Social Events❖ On-site Leasing Office❖ Property Manager on Site❖ Public Transportation❖ User Friendly Resident PortalUnit Features:❖ Balcony❖ Cable Ready❖ Dishwasher❖ Fireplace❖ New\/Renovated Interior❖ Private Entrances❖ Stainless Steel Appliances❖ Vaulted Ceilings❖ Washer & Dryer in Every Apartment❖ Wooded Views in Select ApartmentsOffice Hours: Mon - Fri: 8:30 AM - 5:30 PM show contact info\nPet Policy: We allow cats and dogs with no weight limit on the first floor and weighing a maximum of 35 lbs. full grown on all other floors. Breed restrictions apply. Pet deposit is equal to one month's rent. Leasing Options:  Variable Website: https:\/\/www.apartmentsatpikecreek.comManagement: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY843DA39B59114EAE\n","num_images":23,"lat":39.7011,"lng":-75.7375,"attrs":"['2BR \/ 2Ba', '1000ft2', 'available aug 16', 'air conditioning', 'application fee details: $50 non-refundable application fee per applicant 18 yrs and older', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-06-18T13:38:41-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/new-brunswick-cozy-beautiful-bedroom\/7498185308.html","post_id":7498185308,"result_date":"2022-06-18 13:39","title":"Cozy  Beautiful 2 Bedroom\/ 2 Bathroom Available","description":"Beautiful 1 Bedroom\/ 1 Bathroom Available Now in! This 1 bedroom, 1 bath home is loaded with character. The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $550 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latino. We are a gay couple, family oriented, clean, busy college students, and full time workers. Most of our time would be spent commuting and\/or attending work and\/or school. We are super quiet, clean, simple, and drama free, just looking to live with quiet, nice folk, looking for about $550\/month. If you're interested or would like to know more from either one of us please feel free to reach out to me.","num_images":4,"lat":40.4891,"lng":-74.4482,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T13:35:28-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/monroe-township-beautifully-luxurious\/7498135071.html","post_id":7498135071,"result_date":"2022-06-18 13:26","title":"Beautifully luxurious 2bedroom 2 bathroom apartment","description":"Contact info:\nThe Lofts at Monroe Parke |  show contact info\nTHE LOFTS AT MONROE PARKE\n623 Spotswood Englishtown Rd, Monroe Township, NJ 08831\nshow contact info\nwww.theloftsatmonroeparke.com\nIDEALLY SITUATED IN MONROE TOWNSHOP\nConvenient to Route 9\nClose to shopping centers\nLocated near many parks and recreation (Thompson Park, Manalapan Lake, hiking trails, beaches and more!)\nDESCRIPTION\nLive the lifestyle you deserve at The Lofts at Monroe Parke, a brand new luxurious community offering spacious one and two bedroom apartment homes. The Lofts will offer incredible convenience to its residents with shops and eateries below the apartments. The community has easy access to Routes 9, 18, 33 and The New Jersey Turnpike. Be among the first to live in one of the beautiful homes at The Lofts at Monroe Parke!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theloftsatmonroeparke.com\nContact info:\nThe Lofts at Monroe Parke\nshow contact info\n","num_images":5,"lat":40.3192,"lng":-74.4285,"attrs":"['2BR \/ 2Ba', '1031ft2', 'available jul 31', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T11:59:45-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-beautiful-home-three-bed-room\/7498140787.html","post_id":7498140787,"result_date":"2022-06-18 13:21","title":"Beautiful home three bed room and two bat room","description":"Beautiful home located on almost 1\/2 acre of serene, wooded setting in the highly sought after Blossom Hill neighborhood. This ideal location perfectly balances accessibility and privacy. The home is a blend of the original one story rancher plus a two story addition, plus many improved features. The original one story wing of the home has been lovingly updated and improved to include a gorgeous custom built kitchen (by Horizon Kitchens) with plentiful cabinetry space, granite counters, gas range, and well-planned workspace with island and prep areas. This space also includes a sunny breakfast area and is open to the dining area through to the huge Sunroom addition. This open concept allows for creative freedom and can even be arranged to include an additional sitting area.  The sunroom is incredibly comfortable with high ceilings and large windows, beckoning the forest indoors. A gas fireplace keeps this generous space cozy, and a sliding door accesses the stamped concrete patio in the backyard. The rest of this level also includes two bedrooms or office spaces and a full bath. Continuing on to the two-story addition, stairs lead to the second floor bedrooms and baths. This wing contains the huge Primary Bedroom and ensuite Primary Bath, as well as a private balcony to enjoy! This floor also encompasses three additional bedrooms and a Hallway Bath. The first floor of this wing is the 2 car garage with a laundry room and in-law quarters tucked behind. The in-law apartment on the first floor has a private entrance and includes a kitchenette and private bath. This would be a great space for guests or possible office space, allowing plenty of privacy while still connected to the main house through the garage. Heading back downstairs, the renovated basement forms a first floor wing with a comfortable family room with plenty of space for entertaining with a wet bar and additional sitting area. Some of the upgrades throughout this wonderful home include windows and door replacements, three separate heating and cooling zones, exterior siding, Manny Beiler kitchen, the refinished basement, the sunroom addition, and two new separate furnaces, one for the main house and the other for bedrooms and in-law quarters. Outside, there is plenty of yard space for play and a central patio for relaxing and entertaining. Trees and shrubs surround the home and allow for a beautiful, private space in every season! This great Manheim Township location has easy access to major highways, shopping, and schools, and is centrally situated between Lititz and Lancaster City. Come take a look and see this forest gem for yourself! text me: paolafaba245g_mail.com","num_images":5,"lat":40.0766,"lng":-76.3107,"attrs":"['3BR \/ 2Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T12:10:20-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/bridgeton-spacious-bd-bath-garage-pool\/7498172265.html","post_id":7498172265,"result_date":"2022-06-18 13:19","title":"Spacious 3 bd 2 bath 2 garage w pool","description":"3 bd, 2 bath, 2 garage w pool. Updated w SS appli, Bosch dishwasher, Whirlpool microwave, glass kitchen cabs, eng hardwoods, fresh paint interior & garage, garage cabs, garage motor, wireless garage remotes, dbl pane tinted windows, extended back wood deck, stained wood fence & restained beautiful glass front door.\ntEXT: (9~2~9)==(4~4~7)==(1~6~1~6)\n","num_images":4,"lat":39.439615,"lng":-75.260909,"attrs":"['3BR \/ 2Ba', '2513ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T13:10:13-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/monroe-township-luxury-2bed-2bath-with\/7498139728.html","post_id":7498139728,"result_date":"2022-06-18 13:13","title":"Luxury 2Bed 2Bath with Luxurious Amenities","description":"Contact info:\nThe Lofts at Monroe Parke |  show contact info\nTHE LOFTS AT MONROE PARKE\n623 Spotswood Englishtown Rd, Monroe Township, NJ 08831\nshow contact info\nwww.theloftsatmonroeparke.com\nIDEALLY SITUATED IN MONROE TOWNSHOP\nConvenient to Route 9\nClose to shopping centers\nLocated near many parks and recreation (Thompson Park, Manalapan Lake, hiking trails, beaches and more!)\nDESCRIPTION\nLive the lifestyle you deserve at The Lofts at Monroe Parke, a brand new luxurious community offering spacious one and two bedroom apartment homes. The Lofts will offer incredible convenience to its residents with shops and eateries below the apartments. The community has easy access to Routes 9, 18, 33 and The New Jersey Turnpike. Be among the first to live in one of the beautiful homes at The Lofts at Monroe Parke!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theloftsatmonroeparke.com\nContact info:\nThe Lofts at Monroe Parke\nshow contact info\n","num_images":5,"lat":40.3192,"lng":-74.4285,"attrs":"['2BR \/ 2Ba', '1031ft2', 'available jul 31', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T12:08:19-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-patios-or-balconies-fitness\/7498171385.html","post_id":7498171385,"result_date":"2022-06-18 13:12","title":"Patio’s or Balconies, Fitness Center, Ceiling Fans","description":"We are located in Blackwood New Jersey and close to the Philadelphia area. We offer spacious one and two bedroom apartment floor plans to choose from so you can find your perfect home for your family. Another great reason to live at Washington Way apartments is that each apartment has its own  balcony or patio overlooking our beautiful park like views.At Washington Way Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails. Our community enjoys hosting seasonal resident events for our residents with extended pool hours and DJ, food and raffles for a great way to meet your neighbors.At Washington Way Apartments consider our great location in Blackwood, NJ. Located in the top ten Washington Township School District, Your children enjoy a top rated education being one of the best school districts in the state. Our residents enjoy the convenient access to Routes I-295, and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Sicklerville, Deptford, and Turnersville, and the new Outlet Mall that just opened locally. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Washington Way Apartments today.\n-Swimming Pool\n-Courtyard\n-Ceiling Fans\n-Playground\n-Clubhouse\n-Air Conditioner\n-Gas Heat\n-Dishwasher\n-Cable Hookup\n-Small Pets Welcome\n-24 Emergency Service\n-Patio’s or Balconies\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/wczi2fyc\/washington-way\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8,"lat":39.7901,"lng":-75.0367,"attrs":"['2BR \/ 1Ba', '950ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T13:08:34-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-multi-level-condo-baths-all\/7498165173.html","post_id":7498165173,"result_date":"2022-06-18 13:01","title":"multi level condo, 3 baths, all appliances, new carpeting, balcony","description":"Woodbridge: for more information and to schedule an appointment contact  show contact info\nto see this beautiful 2 level condo with 2 bedrooms, 3 full baths, Wall to Wall Carpet, living rm, huge Rec Room in basement, eat in kitchen with refrigerator, dishwasher and stove, washer\/dryer, balcony, parking, Next to Mall, Near All Major Hwys, nr transportation, CAC\/Ht, No Pets, $2300\/mo. tenant pays gas and electric, 1.5\/mo. security, available August 1st. validate information: http:\/\/therealestateclassified.com?listid=591329","num_images":16,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 3Ba', 'available aug 1', 'condo', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T12:57:13-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-pool-rooftop-courtyard-fitness\/7498162840.html","post_id":7498162840,"result_date":"2022-06-18 12:56","title":"Pool, Rooftop Courtyard, Fitness Center","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Business CenterGrillsOutdoor SeatingCatering KitchenExterior Vented Kitchen ExhaustPet WashDog ParkAmazon LockersStainless Steel AppliancesPrivate Patio, Juliet Balcony, or Full Balcony in Most ApartmentsLoungeEvent SpaceCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/zovizzev\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10,"lat":40.5716,"lng":-74.3167,"attrs":"['1BR \/ 1.5Ba', '917ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-06-18T12:52:37-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-enjoy-nice-bedroom-livingroom\/7498154538.html","post_id":7498154538,"result_date":"2022-06-18 12:40","title":"Enjoy nice 1 Bedroom, 1 Livingroom, a huge eat-in kitchen, full bath","description":"please, Give me your phone number ...\nTalk about living space. Includes 1 Bedroom, 1 Livingroom, a huge eat-in kitchen and full bathroom. Enjoy the nice front porch where you can sit and enjoy talking to neighbors. Plenty of windows to let in the sunlight, making it nice and bright. Bathroom and kitchen are updated. Walking distance to all the great restaurants and shops located in South Bethlehem. Tenant will be responsible for electric and cable. Landlord covers: water, sewer, trash, landscaping.\n","num_images":17,"lat":40.6002,"lng":-75.3805,"attrs":"['1BR \/ 1Ba', '800ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T12:36:37-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/trenton-looking-for-convenience-well\/7498144201.html","post_id":7498144201,"result_date":"2022-06-18 12:29","title":"Looking For Convenience? Well, Look No Further! Train Minutes Away!","description":"show contact info\np>Contact info:\nThe Crossings at Hamilton | Edgewood Properties |  show contact info\nTHE CROSSINGS AT HAMILTON STATION\n900 Grand Central Drive, Hamilton, NJ 08619\nshow contact info\nwww.apartmentsathamiltonstation.com\nDESCRIPTION\nThe Crossings at Hamilton Station, a pristine community located in the heart of Hamilton, will make you wish you never lived anywhere else but here! Our perfect location offers residents the ability to access a multitude of delicious restaurants, shopping centers, and endless entertainment. We are just steps away from the Hamilton Train Station, providing quick rail service to Philadelphia, New York, Princeton, and Trenton. Our brand new 1, 2, and 3 bedroom apartments and 3 bedroom, 2.5 bathroom townhomes are designed to complement your lifestyle featuring open floorplans, stainless steel appliances, granite countertops, and so much more. Schedule your tour today to see why everyone is falling in love with The Crossings.\nCommunity Perks and Top-of-the Line Amenities\n❇️ Luxurious Clubhouse and Concierge Service\n❇️ Large Resort-Style Swimming Pool and Grill Area\n❇️ 24\/7 Emergency Maintenance\n❇️ 24-hour Business Center\n❇️ 24-hour Fitness Center\n❇️ Brand New Playground\n❇️ Fenced-in Dog Park\n❇️ Continental Sunday Breakfast\nSleek and Modern Apartments and Townhouses\n❇️ Spacious, Open Floorplans\n❇️ Soaking Tubs\/Walk-in Showers\n❇️ Large Washer\/Dryer in the unit\n❇️ Granite Countertops\n❇️ Large Walk-in Closets\n","num_images":12,"lat":40.2418,"lng":-74.6962,"attrs":"['2BR \/ 2Ba', '1467ft2', 'available now', '\\nsunday 2022-06-19\\n', '\\nmonday 2022-06-20\\n', '\\ntuesday 2022-06-21\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T12:16:45-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-no-fee-perfect-2bed-2bath\/7498089967.html","post_id":7498089967,"result_date":"2022-06-18 12:28","title":"NO FEE! Perfect 2Bed\/2Bath layout with attached garage","description":"show contact info\nNewly constructed spacious house for rent! Special attention has been given to each and every detail in the building of this state-of-the-art home.\nThis gorgeous home has 2 bedrooms with 2 custom bathrooms. The home boasts hardwood flooring, and recessed lighting throughout the house, smoke\/carbon monoxide detectors, fire-sprinkler system, and is also cable ready. Enter the home to be greeted by a well-lit and spacious grand living room. Past the sun-lit grand living room you will find your state-of-the-art open galley kitchen. The beautifully appointed kitchen is outfitted with soft-close cabinets, modern Quartz counter-tops, contemporary backsplash, deep sink with chef's faucet, SS Samsung appliance package (dishwasher, fridge, range, microwave), and under cabinet lighting. From the kitchen via you will find the entrance to your private backyard. From the first floor, commercial grade Pine staircases (secured by custom railing). Here the home presents a large room with a spacious organized closet, a huge bathroom with a custom vanity set, and laundry room. you enter to your own private oasis.  custom spa-like bathroom, and a spacious closet! dual vanity set, soaking tub and a designer rainfall shower. Take another step up the stairs to the pilot-house where you will find the access to your private dual rooftop decks. The home has electric and water lines on the rooftop, making it an ideal area to host parties and get-togethers. The finished basement offers another spacious bedroom or home office, custom full bathroom, and utility closet. show contact info","num_images":8,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 2Ba', '1200ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T10:24:01-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-lease-today-great-views\/7498147292.html","post_id":7498147292,"result_date":"2022-06-18 12:26","title":"Lease Today, Great Views, Minutes to I 95","description":"Lease today at Top of the Hill! Call for leasing details.\nThis two bedroom two bathroom apartment has plenty of space and a walk in closet. Balcony and more.\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nTop of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm\nApartment Features\n* Refrigerator\n* Pre-wired for internet and cable\n* Central Heat and Air\n* Gas Stove\n* Walk-in Closet\n* Private Patio or Private Balcony (on select apartments)\n* Vertical Blinds\n* Microwave\n* Dishwasher\nCommunity Features\n* After-Hours Emergency Maintenance\n* Swimming Pool\n* Fitness Studio\n* Some Utilities Included\n* Sun Deck\n* Car Wash Area\n* Renters Insurance is Required\n* Playground\n* Laundry Care Center\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Tennis Court\n* Professionally Managed","num_images":8,"lat":39.795988,"lng":-75.485192,"attrs":"['2BR \/ 2Ba', '1221ft2', 'available jul 16', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T12:22:39-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/landisville-additional-storage-private\/7498124881.html","post_id":7498124881,"result_date":"2022-06-18 12:21","title":"ADDITIONAL STORAGE, PRIVATE, ATTACHED AND DETACHED GARAGES, MEDIA ROOM","description":"THIS 2 BED, 2 BATH CONDO IS A GREAT PLACE. SECOND FLOOR UNIT WITH EAT-IN KITCHEN, LIVING ROOM, TWO BEDROOMS WITH LARGE CLOSETS, FULL BATH, PRIVATE DECK, STORAGE UNIT AND COIN-OP WASHER AND DRYER IN BASEMENT. RENT INCLUDES HEAT, RUBBISH, SNOW REMOVAL, LAWN CARE, HOT WATER, WATER AND SEWER AND TWO ONSITE PARKING SPACES. TENANT EXPENSE IS ELECTRIC, CABLE AND\/OR INTERNET.","num_images":0,"lat":40.0892,"lng":-76.4156,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T11:38:37-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-24-emergency-service-cable\/7498143858.html","post_id":7498143858,"result_date":"2022-06-18 12:20","title":"24 Emergency Service, Cable Hookup, Ceiling Fans","description":"We are located in Blackwood New Jersey and close to the Philadelphia area. We offer spacious one and two bedroom apartment floor plans to choose from so you can find your perfect home for your family. Another great reason to live at Washington Way apartments is that each apartment has its own  balcony or patio overlooking our beautiful park like views.At Washington Way Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails. Our community enjoys hosting seasonal resident events for our residents with extended pool hours and DJ, food and raffles for a great way to meet your neighbors.At Washington Way Apartments consider our great location in Blackwood, NJ. Located in the top ten Washington Township School District, Your children enjoy a top rated education being one of the best school districts in the state. Our residents enjoy the convenient access to Routes I-295, and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Sicklerville, Deptford, and Turnersville, and the new Outlet Mall that just opened locally. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Washington Way Apartments today.\n-Public Transportation\n-Playground\n-Dishwasher\n-Fitness Center\n-Ceiling Fans\n-24 Emergency Service\n-Air Conditioner\n-Clubhouse\n-Courtyard\n-Disposal\n-Patio’s or Balconies\n-Cable Hookup\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/ien4mo7h\/washington-way\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8,"lat":39.7901,"lng":-75.0367,"attrs":"['1BR \/ 1Ba', '855ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T12:16:07-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bangor-lovely-bedroom\/7498140393.html","post_id":7498140393,"result_date":"2022-06-18 12:13","title":"Lovely 2 Bedroom","description":"Beautiful industrial chic apartment with 12 foot ceilings for rent in historic downtown Bangor in recently renovated Bank building. Garbage, sewer and off street parking for one vehicle included. This lovely secured building was granted its historical status just a few years ago, but has been completely renovated and updated, including central air, a brand new elevator, on-site laundry and parking for one vehicle. Please call Todd at  show contact info","num_images":7,"lat":40.865745,"lng":-75.20463,"attrs":"['2BR \/ 1Ba', 'available jul 1', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T12:09:32-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/trenton-welcome-home-call-today-to-tour\/7498133920.html","post_id":7498133920,"result_date":"2022-06-18 12:01","title":"Welcome Home! Call TODAY to Tour Your New Beautiful Community!","description":"show contact info\np>Contact info:\nThe Crossings at Hamilton | Edgewood Properties |  show contact info\nTHE CROSSINGS AT HAMILTON STATION\n900 Grand Central Drive, Hamilton, NJ 08619\nshow contact info\nwww.apartmentsathamiltonstation.com\nDESCRIPTION\nThe Crossings at Hamilton Station, a pristine community located in the heart of Hamilton, will make you wish you never lived anywhere else but here! Our perfect location offers residents the ability to access a multitude of delicious restaurants, shopping centers, and endless entertainment. We are just steps away from the Hamilton Train Station, providing quick rail service to Philadelphia, New York, Princeton, and Trenton. Our brand new 1, 2, and 3 bedroom apartments and 3 bedroom, 2.5 bathroom townhomes are designed to complement your lifestyle featuring open floorplans, stainless steel appliances, granite countertops, and so much more. Schedule your tour today to see why everyone is falling in love with The Crossings.\nCommunity Perks and Top-of-the Line Amenities\n❇️ Luxurious Clubhouse and Concierge Service\n❇️ Large Resort-Style Swimming Pool and Grill Area\n❇️ 24\/7 Emergency Maintenance\n❇️ 24-hour Business Center\n❇️ 24-hour Fitness Center\n❇️ Brand New Playground\n❇️ Fenced-in Dog Park\n❇️ Continental Sunday Breakfast\nSleek and Modern Apartments and Townhouses\n❇️ Spacious, Open Floorplans\n❇️ Soaking Tubs\/Walk-in Showers\n❇️ Large Washer\/Dryer in the unit\n❇️ Granite Countertops\n❇️ Large Walk-in Closets\n","num_images":15,"lat":40.2418,"lng":-74.6962,"attrs":"['2BR \/ 2Ba', '1467ft2', 'available now', '\\nsunday 2022-06-19\\n', '\\nmonday 2022-06-20\\n', '\\ntuesday 2022-06-21\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T11:57:34-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-rooftop-deck-bike-storage\/7498097899.html","post_id":7498097899,"result_date":"2022-06-18 12:00","title":"Rooftop Deck, Bike Storage, Pet Friendly","description":"These brand-new studio, one-, and two-bedroom apartments offer open floor plans and sleek finishes that will make you feel right at home the moment you step inside. Our pet-friendly community features amenities meant to make the most out of your lifestyle, such as a rooftop deck, fitness center, and a private courtyard.\nLocated on Lower Market Street, The Cooper offers unbeatable access to the Wilmington Train Station and Transit Center, local employment hubs, and neighborhood attractions in Downtown Wilmington and on the Riverfront. For those who want it all — contemporary apartments, impressive amenities, and walkable convenience — The Cooper is a place you can truly call home.\n-Pet Friendly\n-Smoke-Free Community\n-Keyless Entry\n-Onsite Management & Maintenance\n-20% off rooms at the Hotel du Pont\n-Access-Controlled Package Receiving\n-Complimentary ticket giveaways to shows at The Queen, The Playhouse on Rodney Square, and The Grand Opera House\n-10% off your morning coffee at Starbucks\n-Fitness Center\n-15% off local restaurants like Bardea\n-Private Courtyard\n-Bike Storage\nCall:  show contact info\nFor more information, visit us at: https:\/\/livebpgroup.net\/o6kebfb4\/cooper\n","num_images":9,"lat":39.7378,"lng":-75.5497,"attrs":"['1BR \/ 1Ba', '523ft2', 'available aug 14', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-06-18T10:41:56-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/newark-looking-for-the-ideal-bed-bath\/7498130253.html","post_id":7498130253,"result_date":"2022-06-18 11:53","title":"Looking for the ideal 1 bed \/ 1 bath? Check out The Apartments at Pike Creek!","description":"Community Location: 100 Red Fox Lane - Newark, DE 19711 Rental Information: $1664 - $1735\/Month | 1 Bedroom 1 Bath | 800 sq ftLeasing Options:  Variable show contact info\nApartment Amenities:  ● Balcony● Garbage Disposal● Mini Blinds on all Windows● Oversized Closets● Private Entrances● Refrigerator, Microwave, Range and Oven● Stainless Steel Appliances● Vaulted Ceilings● Washer & Dryer in Every Apartment● Wooded Views in Select ApartmentsProperty Features: ● 24 Hour Availability● Clubhouse● Coffee Bar● Dogs & Cats Welcome● Emergency Maintenance● Grill● On Site Maintenance● Package Acceptance● Swimming Pool● Tennis Court● Christina School District● Electronic Rental Payments and Service Requests● Fireplace & Wireless Internet Access● Fitness Center w\/Cardio Machines and Free Weights● Maintenance Free Lifestyle● Monthly Social Events● On-site Leasing Office● Property Manager on Site● Public Transportation● User Friendly Resident Portal Description: Our apartments in Newark, DE offer a great community you will want to be a part of. We have an elegant clubhouse for residents to use with a lounge perfect for home-away-from-home relaxation. Don't miss out on our business center where you can complete the work you brought home or simply utilize the wireless internet access. If you are looking for a way to save money, at our community you will find a membership-grade fitness center so you can cancel your gym membership and enjoy our facility here. Don't forget about the resort-style swimming pool with comfortable seating for tanning. You can even invite your friends over for a friendly game of tennis!Pets: We allow cats and dogs with no weight limit on the first floor and weighing a maximum of 35 lbs. full grown on all other floors. Breed restrictions apply. Pet deposit is equal to one month's rent.Call: The Apartments at Pike Creek at  show contact info\nWebsite: https:\/\/www.apartmentsatpikecreek.comAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY187CB7BF5FBE448\n","num_images":21,"lat":39.7011,"lng":-75.7375,"attrs":"['1BR \/ 1Ba', '800ft2', 'available jun 30', 'air conditioning', 'application fee details: $50 non-refundable application fee per applicant 18 yrs and older', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-06-18T11:49:44-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-gas-heat-included-ceiling\/7498129960.html","post_id":7498129960,"result_date":"2022-06-18 11:53","title":"Gas & Heat Included, Ceiling Fan, Dishwasher","description":"601 North Black Horse Pike, Monroe Township, NJ 08094Work, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes.Apartment Features:PoolDishwasherPublic TransportationDW\/Garbage DisposalW\/W CarpetingCable HookupPlaygroundGas & Heat IncludedCeiling FanParkingPets WelcomeLaundry FacilitiesAir ConditioningPrivate EntrancesLarge Floor PlansCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/ht5mhsrd\/laurelton-village*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!","num_images":7,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available jul 16', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T11:49:13-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mauricetown-historic-waterfront-home-in\/7498129253.html","post_id":7498129253,"result_date":"2022-06-18 11:51","title":"Historic waterfront home in historic town","description":"Charming historic waterfront home in Historic District of Mauricetown, NJ - home built in 1830 - tastefully restored. LR, DR, K, 2 BR, Office, 1BA. Deck with view overlooking Maurice River. Sun room off dining room. Congress designated the river as the Maurice National Scenic and Recreational River, as part of the National Wild and Scenic Rivers program.","num_images":8,"lat":39.2853,"lng":-74.9983,"attrs":"['2BR \/ 1Ba', '1400ft2', 'available jul 1', 'air conditioning', 'house', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T11:47:39-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-two-bedroom-with-balconyheat\/7498124310.html","post_id":7498124310,"result_date":"2022-06-18 11:41","title":"Two bedroom with  balcony(heat &hot water included)(on wHamilton st)","description":"Two bedroom apartment with a balcony on w Hamilton street. Clean and secure building with intercom , elevator and laundry located at 941 W Hamilton street Allentown between 9th and 10th street. Rent is $1200.00 HEAT AND HOT WATER INCLUDED you only pay electric . NO PETS. We require two month security deposit and a first month rent, proof of income (resent pay stubs and income tax) and back round check. For more information call\/text Leon at  show contact info\nShowing of the apartment is every Monday and Friday 5-8 pm by APPOINTMENT ONLY\n","num_images":8,"lat":40.600845,"lng":-75.476745,"attrs":"['2BR \/ 1Ba', '700ft2', 'available jun 20', '\\nmonday 2022-06-20\\n', '\\nfriday 2022-06-24\\n', '\\nmonday 2022-06-27\\n', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T11:37:28-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/new-brunswick-bedroom-bath-luxury-rental\/7498101939.html","post_id":7498101939,"result_date":"2022-06-18 11:35","title":"2 Bedroom, 2 Bath, Luxury Rental","description":"Contact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIGHTS\n11 US-1, New Brunswick, NJ 08901>\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n… AND MORE!\nDESCRIPTION\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\nContact info:\nThe Edge at Raritan Heights\nEdgewood Properties\nshow contact info\nContact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIHTS\n11 US-1, New Brunswick, NJ 08901\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n…AND MORE!\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\n","num_images":14,"lat":40.4891,"lng":-74.4482,"attrs":"['2BR \/ 2Ba', '1325ft2', 'available aug 12', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T10:51:01-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/pottstown-newly-renovatedgreat\/7498087252.html","post_id":7498087252,"result_date":"2022-06-18 11:21","title":"Newly-renovated,Great-2BR=1BA)*Available Immediately. $600\/ Month Rent","description":"Newly-renovated, fully-furnished bungalow available for month-to-month lease. Location is within walking distance. Utilities, lightning-fast internet, and lawn maintenance included. Fully stocked kitchen, washer and dryer included, two bedrooms with linens, and entertainment center with 55 in LED TV in the living room. Live the downtown lifestyle. Perfect for students, those working in downtown, short-term stays for government or military, or families moving to area and in search of a transition space while building. Fenced back yard, with porch and seating area. please reach me here; jasyjenifar698gmail,com","num_images":4,"lat":40.2635,"lng":-75.6172,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T10:17:56-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-theater-leasing-office-pool\/7498114198.html","post_id":7498114198,"result_date":"2022-06-18 11:20","title":"Theater, Leasing Office, Pool Shower","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Pool ShowerOutdoor SeatingLoungeParking GarageRooftop CourtyardLocker RoomBike StoragePantry ClosetCoffee ShopSpacious 9’ Ceilings with Open-Concept Floor PlansTheaterGame RoomCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/7mqloqzp\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":11,"lat":40.5716,"lng":-74.3167,"attrs":"['2BR \/ 2Ba', '1218ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-06-18T11:16:37-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-locker-room-fitness-center-bike\/7498112894.html","post_id":7498112894,"result_date":"2022-06-18 11:17","title":"Locker Room, Fitness Center, Bike Storage","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Full-Size Gas Stackable Washer\/Dryer in ApartmentsAmazon LockersMusic RoomConference CenterBike StorageLocker RoomCoffee ShopTot LotSpacious 1 BR, 2BR & 2 BR-plus Loft Apartments 1-2 ½ BathsOutdoor SeatingPool ShowerGrillsCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/g2lvsmhg\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10,"lat":40.5716,"lng":-74.3167,"attrs":"['1BR \/ 1Ba', '804ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-06-18T11:13:59-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/delanco-1x1-apartment-with-walk-in\/7498112623.html","post_id":7498112623,"result_date":"2022-06-18 11:17","title":"1x1 Apartment with a Walk-In Closet in the Bedroom","description":"Welcome Home to SDK Tenby Chase in Delran NJ  Ellery House  1  bed \/ 1 bath \/ 811 Sq.Ft \/ $1,862 - $2,434  * Unit W300 - Available 09\/15\/22 SDK Tenby Chase ApartmentsAddress:  193 Tenby Chase Dr Delran, NJ 08075  Call Us Today!  show contact info\nx409  Property Description  Apartments in this one-bedroom, one-bathroom floor plan at Tenby Chase have walk-in closets in the bedrooms and separate dining areas. This model includes an updated kitchen and bathroom and a full-size washer and dryer. This pet-friendly community has landscaped courtyards and access to a saltwater pool, tennis court, and free Wi-Fi. Call now to learn more.  Floor Plan\/Unit Features  * Wall to wall carpeting  * New window treatments  * Fireplaces in select units  * Full-sized washer & dryer  * Abundance of closet space  * Unbelievably spacious floor plans  * Updated kitchens and baths with new appliances  * Dishwasher  * Central Heating & Air Conditio  * Dining Area  Property Amenities  * Swimming pool with free Wi-Fi  * Playground  * Pet friendly  * Tennis court  * On-site laundry  * Park like setting  * Off-street parking  * Online resident services  * Close to major highways  * On-site 24-hour maintenance  * Professional on-site management  * Professionally landscaped courtyards  * Off-street parking  * Close to dining, shopping and entertainment  * Park like setting  * Fitness center  * Clubhouse Lease Terms: 3 to 13 Months Parking:Type - Street Parking Off Street Parking and Good Guest Parking Available Pet Policy: Cat, Dog s are allowed. There is a one-time non-refundable pet fee of $250.00 per pet. Monthly pet rent is $35.00 per pet. Aggressive breeds are prohibited. Example: Pit Bulls and Dobermans are not permitted Units: 327 Office HoursMonday:   9:00am to 5:00pm   Tuesday:   9:00am to 5:00pm   Wednesday:   9:00am to 5:00pm   Thursday:   9:00am to 5:00pm   Friday:   9:00am to 5:00pm   Saturday:   11:00am to 3:00pm   Management Company: SDK Apartments Call Us Today!  show contact info\nx409 Equal Housing Opportunity\n","num_images":0,"lat":40.008697,"lng":-74.962943,"attrs":"['1BR \/ 1Ba', '811ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T11:13:24-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-fire-pit-juice-bar-business\/7498111894.html","post_id":7498111894,"result_date":"2022-06-18 11:15","title":"Fire Pit, Juice Bar, Business Center","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Locker RoomTot LotLoungeGame RoomThe HubChildren's Play AreaHotel Style Card Access Security Lock at Apartment EntryCatering KitchenQuartz Kitchen CountertopsGrillsPet WashTheaterCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/qvfe3dsi\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10,"lat":40.5716,"lng":-74.3167,"attrs":"['2BR \/ 2Ba', '1070ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-06-18T11:11:51-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-event-space-game-room-fire-pit\/7498110057.html","post_id":7498110057,"result_date":"2022-06-18 11:12","title":"Event Space, Game Room, Fire Pit","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Dog ParkGas Fireplaces in Many ModelsLeasing OfficeMusic RoomEvent SpaceAmazon LockersCoffee ShopChildren's Play AreaFitness CenterPool ShowerGame RoomPet WashCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/n4t5edeh\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10,"lat":40.5716,"lng":-74.3167,"attrs":"['1BR \/ 1Ba', '897ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-06-18T11:08:11-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/blackwood-gas-heat-courtyard-dishwasher\/7498109270.html","post_id":7498109270,"result_date":"2022-06-18 11:10","title":"Gas Heat, Courtyard, Dishwasher","description":"We are located in Blackwood New Jersey and close to the Philadelphia area. We offer spacious one and two bedroom apartment floor plans to choose from so you can find your perfect home for your family. Another great reason to live at Washington Way apartments is that each apartment has its own  balcony or patio overlooking our beautiful park like views.At Washington Way Apartments you can relax and enjoy our beautiful sparkling swimming pool, take a walk or jog on our private serene scenic nature trails. Our community enjoys hosting seasonal resident events for our residents with extended pool hours and DJ, food and raffles for a great way to meet your neighbors.At Washington Way Apartments consider our great location in Blackwood, NJ. Located in the top ten Washington Township School District, Your children enjoy a top rated education being one of the best school districts in the state. Our residents enjoy the convenient access to Routes I-295, and the NJ Turnpike. Our rental homes are minutes to Philadelphia three bridges to Center City, Your new rental home will be located close to major shopping centers in Sicklerville, Deptford, and Turnersville, and the new Outlet Mall that just opened locally. It is only a short ride away to the Cherry Hill or Moorestown Malls where you will enjoy some of the best shopping, dining, and entertainment!We take pride in our beautifully landscaped grounds and well maintained community. Enjoy plenty of storage with walk in closets, other features include window coverings, ceiling fans, comfortable heating and AC and high speed internet access.For a great deal on our apartment home rentals contact Washington Way Apartments today.\n-Air Conditioner\n-Dishwasher\n-24 Emergency Service\n-Courtyard\n-Disposal\n-Small Pets Welcome\n-Playground\n-Fitness Center\n-Patio’s or Balconies\n-Gas Heat\n-Cable Hookup\n-Public Transportation\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/liyyaidj\/washington-way\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":8,"lat":39.7901,"lng":-75.0367,"attrs":"['1BR \/ 1Ba', '765ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T11:06:38-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/new-brunswick-luxury-br-2bath-with-d\/7498096189.html","post_id":7498096189,"result_date":"2022-06-18 11:07","title":"Luxury 2 BR\/2BATH with W\/D plus many more amenities","description":"Contact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIGHTS\n11 US-1, New Brunswick, NJ 08901>\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n… AND MORE!\nDESCRIPTION\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\nContact info:\nThe Edge at Raritan Heights\nEdgewood Properties\nshow contact info\nContact info:\nThe Edge at Raritan Heights | Edgewood Properties |  show contact info\nTHE EDGE AT RARITAN HEIHTS\n11 US-1, New Brunswick, NJ 08901\nshow contact info\nwww.TheEdgeatRaritanHeights.com\nKEY FEATURES\n1&2-Bedroom Apartments\n9’ ceilings\nStainless steel appliances\nQuartz countertops\n…AND MORE!\nThe Edge at Raritan Heights, situated in a brand-new enclave in the City of New Brunswick, offers stunning luxury apartments and a truly unparalleled amenities package that includes an exclusive resident bar and lounge and two sprawling courtyards encompassing a resort-style pool, cabana a barbecue area, enclosed pet mark and much more! You’ll also find a 24-hour premium fitness center on site as well as concierge service.\nThis is true luxury living in a location that is second-to-none. Downtown New Brunswick, Rt 1, Rt 18, I-95 and every convenience imaginable are within easy reach. Come see this amazing brand-new community today!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttps:\/\/www.theedgeatraritanheights.com\/\n","num_images":14,"lat":40.4891,"lng":-74.4482,"attrs":"['2BR \/ 2Ba', '1463ft2', 'available now', 'EV charging', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T10:38:06-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-dishwasher-ceiling-fan-pool\/7498101778.html","post_id":7498101778,"result_date":"2022-06-18 10:54","title":"Dishwasher, Ceiling Fan, Pool","description":"Bedrooms: 2Bathrooms: 1Square Feet: 760Date Available: 2022-07-16Address: 601 North Black Horse PikeWork, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes. Amenities Include:PoolAir ConditioningParkingPets WelcomePrivate EntrancesCeiling FanLaundry FacilitiesPublic TransportationLarge Floor PlansDishwasherPlaygroundCable HookupCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/d72oizaa\/laurelton-village*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":7,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available jul 16', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T10:50:40-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/vineland-newly-updated-bedrooms-with\/7498093685.html","post_id":7498093685,"result_date":"2022-06-18 10:45","title":"Newly Updated 2 Bedrooms with 3rd floor Loft","description":"Move right in to this newly updated 2 bedrooms, 1 bath home for rent with 3rd floor loft for extra living space or home office. New carpets installed throughout the home, freshly painted, professionally cleaned with new oven. Property has a large yard with an extra-large driveway capable of parking 5+ cars. Property is available immediately upon review of application.","num_images":5,"lat":39.4818,"lng":-75.0091,"attrs":"['2BR \/ 1Ba', '1648ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T10:32:19-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-pool-shower-music-room-coffee\/7498092308.html","post_id":7498092308,"result_date":"2022-06-18 10:33","title":"Pool Shower, Music Room, Coffee Shop","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: TheaterFire PitGrillsGame RoomBusiness CenterDog ParkPrivate Patio, Juliet Balcony, or Full Balcony in Most ApartmentsHotel Style Card Access Security Lock at Apartment EntryRooftop CourtyardGas Fireplaces in Many ModelsTop Floor Lofts with Vaulted Ceilings and SkylightsLeasing OfficeCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/sw7eiy7m\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":10,"lat":40.5716,"lng":-74.3167,"attrs":"['0BR \/ 1Ba', '545ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: daily', 'wheelchair accessible']","posted_date":"2022-06-18T10:29:21-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/matawan-waitlist-1b-1b-with-beautiful\/7498090217.html","post_id":7498090217,"result_date":"2022-06-18 10:28","title":"Waitlist 1B\/1B with Beautiful Amenities and 24 Hr Fitness Center","description":"Contact info:\nThe Edge at Matawan | Edgewood Properties |  show contact info\nTHE EDGE AT MATAWAN\n249 Broad St, Matawan, NJ 07747\nshow contact info\nwww.theedgeatmatawan.com\nResidential Community with Luxurious Services and Amenities\nResident Lounge\nBusiness Center\n24 Hour Fitness Center\nConference Room\nElevators\nBicycle Storage\nCovered and Surface Parking\nDESCRIPTION\nLive the lifestyle you deserve at The Edge at Matawan, a brand new luxurious apartment community offering spacious one and two bedroom apartment homes. The Edge will offer incredible convenience to its residents with shops and eateries below the apartments. The community has easy access to the Garden State Parkway, Routes 34, 35, and 36 and I-287. The Edge at Matawan offers commuter convenience,the Matawan Aberdeen Train station is just minutes away, and a NJ Transit bus stops at the community. Be the first to rent a first class apartment home at The Edge at Matawan!\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/theedgeatmatawan.com\nContact info:\nThe Edge at Matawan\nEdgewood Properties\nshow contact info\n","num_images":24,"lat":40.4085,"lng":-74.233458,"attrs":"['1BR \/ 1Ba', '1003ft2', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T10:24:31-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-cozy-bedroom-and-bathroom\/7498077383.html","post_id":7498077383,"result_date":"2022-06-18 10:22","title":"- COZY -2 bedroom and 1 bathroom boutique Home Room","description":"COZY -2 bedroom and 1 bathroom boutique House Cincinnati . -Enjoy super low energy bills This beautiful three bedroom Fulton Hill home on a corner lot is available now!!, all new windows with granite window sills, hardwood cherry floors throughout, updated kitchen with granite, new cabinets and stainless steel appliances, upgraded bathroom with new vanity, new toilet and tiled shower\/tub combo; inside laundry with washer and dryer included. IF YOU ARE INTERESTED, CONTACT ME NOW FOR VIEW AND MORE INFO.  show contact info\nLUXURY-2 bedroom and 1 bathroom boutique House. -Enjoy super low energy billsLUXURY-2 bedroom and 1 bathroom boutique House. -Enjoy super low energy bills\nINCREDIBLE views. Laundry mat no more! Each unit also includes a washer and dryer. Building amenities include an indoor gym, a service elevator, and a roof deck featuring a dog park, a yoga area, a covered and uncovered lounge area, and amazing city views.The SURROUNDING East Kensington neighborhood is in the hottest neighborhood in the city with nearby green spaces like Norris Square Park and Palmer Park. There are many local restaurants, bars, and coffee shops such as Forin Cafe, Soup Kitchen, Martha, Philadelphia Brewing Company, Evil Genius Brewing, LMNO, International Bar, Suraya and Philly Style Bagels, just to name a few. 171 Berks Street has great proximity to public transportation; it's just a few blocks from the Berks train station and the Temple University bus route The bedroom is located downstairs with its own restroom. Rental Prices: (includes everything) Month to month: $500 a month Deposit: Rental Rrice Includes: All utilities High speed internet Cable TV Washer and Dryer Full size refrigerator Access to full kitchen Professional cleaning service Many other amenities - Includes utilities and unlimited internet usage, double size bed - $500 \/month on a yearly lease - For post-secondary students or recent graduates only - 10 minutes walk to UC campus, Building or C-train station\/major bus terminal. Registered free street parking is available for the first two vehicles - Sorry, we cannot accommodate smoking\/vaping\/firearms\/weapons or pets. - with desired viewing time, full name, email address and daytime contact number to set up a viewing appt. Please Tex","num_images":3,"lat":40.0091,"lng":-76.3671,"attrs":"['2BR \/ 1Ba', '744ft2', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:54:24-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-large-bedroom-apartment\/7498086144.html","post_id":7498086144,"result_date":"2022-06-18 10:19","title":"@@@LARGE 2 bedroom apartment available immediately@@@","description":"Large 2 bedroom 1 bath duplex for rent immediately. Freshly everything, including kitchen, bathroom, painted, flooring, fridge, dish washer. Washer and Dryer in the kitchen. 1 car covered parking, outside storage, Cats considered. Garbage included. $750\/month. NO deposit. \/.\/The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests.2 parking, home available now! APPLIANCES include a REFRIGERATOR, range\/oven, microwave, dishwasher, garbage disposal, and stacked WASHER & DRYER.Super clean, recently renovated kitchen and bath,The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $750 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latinoI have first level local references. I don't smoke, take drugs or drink. I am clean, calm, responsible. I like to take care of plants and animals. I am going to a church. I want to rent a granny flat in or near me La Mesa.. Hope all is well, I'm new to the area, a corporate tech sales professional looking for a master bedroom, or entire apartment. If anyone has any opportunities, my number is listed. I'm clean, respectful, courteous and looking to grow my business. In my spare time, I stay active, play basketball, lift weights, and love committing to the best version of myself. Thank you!For more info please contact: show contact info","num_images":5,"lat":40.6018,"lng":-75.5225,"attrs":"['2BR \/ 1Ba', '830ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T10:15:35-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/allentown-large-bedroom-apartment\/7498086125.html","post_id":7498086125,"result_date":"2022-06-18 10:19","title":"@@@LARGE 2 bedroom apartment available immediately@@@","description":"Large 2 bedroom 1 bath duplex for rent immediately. Freshly everything, including kitchen, bathroom, painted, flooring, fridge, dish washer. Washer and Dryer in the kitchen. 1 car covered parking, outside storage, Cats considered. Garbage included. $750\/month. NO deposit. \/.\/The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests.2 parking, home available now! APPLIANCES include a REFRIGERATOR, range\/oven, microwave, dishwasher, garbage disposal, and stacked WASHER & DRYER.Super clean, recently renovated kitchen and bath,The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $750 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latinoI have first level local references. I don't smoke, take drugs or drink. I am clean, calm, responsible. I like to take care of plants and animals. I am going to a church. I want to rent a granny flat in or near me La Mesa.. Hope all is well, I'm new to the area, a corporate tech sales professional looking for a master bedroom, or entire apartment. If anyone has any opportunities, my number is listed. I'm clean, respectful, courteous and looking to grow my business. In my spare time, I stay active, play basketball, lift weights, and love committing to the best version of myself. Thank you!For more info please contact: show contact info","num_images":5,"lat":40.6018,"lng":-75.5225,"attrs":"['2BR \/ 1Ba', '830ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T10:15:32-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-bedroom-bath-duplex-for-rent\/7498085076.html","post_id":7498085076,"result_date":"2022-06-18 10:17","title":"2 bedroom 1 bath duplex for rent Lancaster, PA.-","description":"2 bedroom 1 bath duplex for rent Lancaster, PA. Freshly everything, including kitchen, bathroom, painted, flooring, fridge, dish washer. Washer and Dryer in the kitchen. 1 car covered parking, outside storage, Cats considered. Garbage included. $700\/month. NO deposit. \/.\/The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests.2 parking, home available now! APPLIANCES include a REFRIGERATOR, range\/oven, microwave, dishwasher, garbage disposal, and stacked WASHER & DRYER.Super clean, recently renovated kitchen and bath,The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $750 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latinoI have first level local references. I don't smoke, take drugs or drink. I am clean, calm, responsible. I like to take care of plants and animals. I am going to a church. I want to rent a granny flat in or near me La Mesa.. Hope all is well, I'm new to the area, a corporate tech sales professional looking for a master bedroom, or entire apartment. If anyone has any opportunities, my number is listed. I'm clean, respectful, courteous and looking to grow my business. In my spare time, I stay active, play basketball, lift weights, and love committing to the best version of myself. Thank you!For more info please contact:  show contact info","num_images":4,"lat":40.0091,"lng":-76.3671,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T10:13:01-0400"},{"url":"https:\/\/lancaster.craigslist.org\/apa\/d\/lancaster-bedroom-bath-duplex-for-rent\/7498085061.html","post_id":7498085061,"result_date":"2022-06-18 10:17","title":"2 bedroom 1 bath duplex for rent Lancaster, PA.-","description":"2 bedroom 1 bath duplex for rent Lancaster, PA. Freshly everything, including kitchen, bathroom, painted, flooring, fridge, dish washer. Washer and Dryer in the kitchen. 1 car covered parking, outside storage, Cats considered. Garbage included. $700\/month. NO deposit. \/.\/The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests.2 parking, home available now! APPLIANCES include a REFRIGERATOR, range\/oven, microwave, dishwasher, garbage disposal, and stacked WASHER & DRYER.Super clean, recently renovated kitchen and bath,The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $750 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latinoI have first level local references. I don't smoke, take drugs or drink. I am clean, calm, responsible. I like to take care of plants and animals. I am going to a church. I want to rent a granny flat in or near me La Mesa.. Hope all is well, I'm new to the area, a corporate tech sales professional looking for a master bedroom, or entire apartment. If anyone has any opportunities, my number is listed. I'm clean, respectful, courteous and looking to grow my business. In my spare time, I stay active, play basketball, lift weights, and love committing to the best version of myself. Thank you!For more info please contact:  show contact info","num_images":4,"lat":40.0091,"lng":-76.3671,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T10:13:00-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/neptune-one-bedroom-luxury-apartment\/7498079523.html","post_id":7498079523,"result_date":"2022-06-18 10:03","title":"One bedroom Luxury apartment- coming soon!","description":"Contact info:\nThe Pointe at Neptune | Edgewood Properties |  show contact info\nTHE POINTE AT NEPTUNE\n3425 W. Bangs Avenue, Neptune, NJ 07753\nshow contact info\nwww.pointeatneptune.com\nLOCATED NEAR POPULAR DESTINATIONS\nClose to popular destinations such as Jersey Shore points, Asbury Park Boardwalk, Belmar Boardwalk\nNear popular shopping centers such as Jersey Shore Premium Outlets, Seaview Square Shopping Center, Freehold Raceway Mall, Monmouth Mall, and more!\nNext to tons of dining destinations\nEasy access to major highways\nEasy access to Jersey Shore University Medical Center\nNear numerous colleges\/universities, such as Monmouth University, Brookdale Community College, Fairleigh Dickinson University - Eatontown, and more!\nDESCRIPTION\nWelcome to The Pointe at Neptune, Edgewood Properties’ premier garden style rental community located in the heart of Monmouth County. You are invited to experience excellence in living with our scenic views, proximity to major highways and transportation, and luxurious amenities. Your new community includes concierge service, 24-hour business and fitness center, emergency maintenance and a resort style pool. A variety of spacious floor plans that offer full size washer\/ dryers, over-sized patios, and extensive kitchens. Basements are included in selected floor plans. We are open 7 days a week, and just a call or click away. Schedule your visit with our leasing professionals and you too will find that “All Roads Lead to the Pointe.”\nVISIT OUR WEBSITE FOR MORE INFORMATION\nhttp:\/\/pointeatneptune.com\nContact info:\nThe Pointe at Neptune\nEdgewood Properties\nshow contact info\n","num_images":6,"lat":40.2096,"lng":-74.0714,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:59:43-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-all-utilities-high-speed\/7498075274.html","post_id":7498075274,"result_date":"2022-06-18 09:52","title":"All Utilities High Speed ​​Internet Cable Television Washer and Dryer","description":"NEW UPDATE 1bedroom and 2 bath apt rent in 601 N Black Horse Pike # 6, washer and dryer in unit, attached balcony. This combination kitchen and living room combo is fully equipped with granite counter tops, spacious cherry wood cabinets, ceramic tile flooring, remote control ceiling fan and dim-able lighting. Living areas outside the kitchen feature hardwood floors and bedrooms have Hardwood floors.We are a gay couple, busy, clean, family oriented college students and full time workers. Most of our time would be spent traveling and\/or going to work and\/or school. We are super easy going, clean, simple and drama free, just looking to live with nice easy going people, looking around $1000\/mo. If you are interested or want to know more about any of us, please do not hesitate to contact me. I am of legal age and I am looking to rent an apartment for grandmothers in La Mesa. I have first level local references. I don't smoke, take drugs or drink. I am clean, calm, responsible. I like to take care of plants and animals. I am going to a church. I want to rent a granny flat in or near me La Mesa. Central heating and cooling, washer & dryer in unit, jetted tub in bathroom, and a balcony. The current roommates are aerospace engineers. The bedroom is located on the ground floor with its own bathroom. Rental Prices: (includes everything) Month to Month: $900\/month Deposit: $10 Rental Price Includes: All Utilities High Speed ​​Internet Cable Television Washer and Dryer Full Size Refrigerator Access to Full Kitchen Professional Cleaning Many Other Amenities - Includes Utilities & Unlimited Internet Usage, Double Bed - $900\/mo Annual Lease - Post-Secondary or Recent Graduates Only - 10-minute walk to UC Campus, Building or C\/ Train Station main bus terminal. Free registered street parking is available for the first two vehicles. Sorry, we cannot allow smoking\/vaping\/firearms\/weapons or pets. - with the desired viewing time, full name, email address and daytime contact number to set up a viewing appointment. Hope all is well, I'm new to the area, a corporate tech sales professional looking for a master bedroom, or entire apartment. If anyone has any opportunities, my number is listed. I'm clean, respectful, courteous and looking to grow my business. In my spare time, I stay active, play basketball, lift weights, and love committing to the best version of myself. Thank you!","num_images":6,"lat":39.665,"lng":-74.971,"attrs":"['3BR \/ 2Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:48:48-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/williamstown-large-floor-plans-pets\/7498074221.html","post_id":7498074221,"result_date":"2022-06-18 09:50","title":"Large Floor Plans, Pets Welcome, Public Transportation","description":"Work, play and shop all within easy reach of your splendid two bedroom home. Enjoy the casinos and beaches of Atlantic City or take advantage of the employment opportunities and sights of Philadelphia.Close to Deptford Mall, Routes 168, 42, I-295 and NJ Turnpike. Experience the best value in Gloucester County! Visit Laurelton Village today and let our professional management staff show you our apartment homes.\n-Pets Welcome\n-Parking\n-W\/W Carpeting\n-Gas & Heat Included\n-Dishwasher\n-Playground\n-Cable Hookup\n-Ceiling Fan\n-Public Transportation\n-Air Conditioning\n-Private Entrances\n-Pool\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekamsoncorp.com\/lx3sn5zk\/laurelton-village\n*Pricing and availability are subject to change daily. Photos may not be of the exact advertised unit. Please contact us today for the most up to date information!\n","num_images":7,"lat":39.665,"lng":-74.971,"attrs":"['2BR \/ 1Ba', '760ft2', 'available jul 16', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:46:08-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/flemington-spacious-cherry-wood\/7498073898.html","post_id":7498073898,"result_date":"2022-06-18 09:49","title":"spacious cherry wood cabinets, ceramic tile flooring","description":"BEAUTIFUL 3bedroom and 1.5 bath apt rent in Flemington, washer and dryer in unit, attached balcony. This combination kitchen and living room combo is fully equipped with granite counter tops, spacious cherry wood cabinets, ceramic tile flooring, remote control ceiling fan and dim-able lighting. Living areas outside the kitchen feature hardwood floors and bedrooms have Hardwood floors.We are a gay couple, busy, clean, family oriented college students and full time workers. Most of our time would be spent traveling and\/or going to work and\/or school. We are super easy going, clean, simple and drama free, just looking to live with nice easy going people, looking around $1000\/mo. If you are interested or want to know more about any of us, please do not hesitate to contact me. I am of legal age and I am looking to rent an apartment for grandmothers in La Mesa. I have first level local references. I don't smoke, take drugs or drink. I am clean, calm, responsible. I like to take care of plants and animals. I am going to a church. I want to rent a granny flat in or near me La Mesa. Central heating and cooling, washer & dryer in unit, jetted tub in bathroom, and a balcony. The current roommates are aerospace engineers. The bedroom is located on the ground floor with its own bathroom. Rental Prices: (includes everything) Month to Month: $1000\/month Deposit: $100 Rental Price Includes: All Utilities High Speed ​​Internet Cable Television Washer and Dryer Full Size Refrigerator Access to Full Kitchen Professional Cleaning Many Other Amenities - Includes Utilities & Unlimited Internet Usage, Double Bed - $900\/mo Annual Lease - Post-Secondary or Recent Graduates Only - 10-minute walk to UC Campus, Building or C\/ Train Station main bus terminal. Free registered street parking is available for the first two vehicles. Sorry, we cannot allow smoking\/vaping\/firearms\/weapons or pets. - with the desired viewing time, full name, email address and daytime contact number to set up a viewing appointment. Hope all is well, I'm new to the area, a corporate tech sales professional looking for a master bedroom, or entire apartment. If anyone has any opportunities, my number is listed. I'm clean, respectful, courteous and looking to grow my business. In my spare time, I stay active, play basketball, lift weights, and love committing to the best version of myself. Thank you!","num_images":9,"lat":40.518,"lng":-74.8453,"attrs":"['3BR \/ 1.5Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T09:45:18-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/mount-royal-convenient-location-dog\/7498073269.html","post_id":7498073269,"result_date":"2022-06-18 09:47","title":"Convenient Location, Dog Park, Minutes from 295","description":"You will love living at Heather Ridge! Call today!\nGreat one bedroom one bathroom apartment with washer dryer, large walk in closet in bedroom and off the living room and more!\nHeather Ridge Apartments, managed by Panco Management\n454 Heather Drive\nMantua, NJ 08051\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/heatherridgeapts.net\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm","num_images":18,"lat":39.806488,"lng":-75.177315,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:43:35-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/piscataway-this-modern-house-features\/7498065536.html","post_id":7498065536,"result_date":"2022-06-18 09:35","title":"This Modern house features contemporary updates","description":"Unique and stunning! This Modern house features contemporary updates coupled with eclectic charm. The home was taken down to the studs and completely remodeled and expanded in 2015 - vintage details were preserved. The main living area is light and bright with soaring ceilings and an original fireplace. The open concept floor plan flows through to the outdoors with a beautifully decked backyard ideal for entertaining. The kitchen features quartz countertops, a farmhouse sink, and two-tone cabinetry.******➽➽You can own the home by rent month to month. Don't worry about your Credit. ☏Contact:  show contact info\n➽PR0PERTY ID: 293581467","num_images":1,"lat":40.5515,"lng":-74.459,"attrs":"['4BR \/ 2Ba', '1550ft2', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:21:06-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-convenient-location-tree\/7498064714.html","post_id":7498064714,"result_date":"2022-06-18 09:22","title":"Convenient Location, Tree Lined Streets, Great Views","description":"Top of the Hill, managed by Panco Management\n2101 Prior Road\nWilmington, DE 19809\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/topofthehillapts.com\nThis community features tennis courts, a pool and fitness center. Call Top of the Hill today!\nGreat studio with patio area and large kitchen.\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 4:00pm\nCommunity Features\n* Laundry Care Center\n* Swimming Pool\n* After-Hours Emergency Maintenance\n* Playground\n* Tennis Court\n* Car Wash Area\n* Fitness Studio\n* Renters Insurance is Required\n* Sun Deck\n* Some Utilities Included\n* Professionally Managed\n* Our prices can change daily, price listed is based on today's availability. Call for details.","num_images":8,"lat":39.795988,"lng":-75.485192,"attrs":"['0BR \/ 1Ba', '500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T09:18:40-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/iselin-open-concept-front-loader-d\/7498063450.html","post_id":7498063450,"result_date":"2022-06-18 09:18","title":"Open Concept, Front Loader W\/D, Heated, Salt Water Pool","description":"The Grande at Metropark3 Ronson Road, Woodbridge Township, NJ 08830The Grand at Metro Park Virtual Tour: https:\/\/www.apartments.com\/the-grande-at-metro-park-iselin-nj\/9wgvcg6\/Experience the difference at The Grande at Metropark! Our luxury residential apartments in the heart of Woodbridge, NJ — and convenient to Iselin and Edison — offer contemporary style, a wealth of resident amenities, an extensive resident activity program, and unparalleled conveniences, which are only the beginning. Magnificent modern living starts here!Property Amenities: Locker RoomLeasing OfficeAmazon LockersPoolPet WashOutdoor SeatingTheaterLoungeParking GarageRetailFitness CenterGrillsCall Us Today!  show contact info\nFor more information, visit us at: https:\/\/livegoldoller.com\/lwqwq3xw\/grande-at-metropark*Pricing and availability are subject to change daily. Photos may not be of your exact home. Please contact us today for the most up to date information! Professionally managed by GoldOller Real Estate Investments, a provider of Fair Housing and Equal Opportunity.\n","num_images":24,"lat":40.5716,"lng":-74.3167,"attrs":"['1BR \/ 1Ba', '914ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T09:14:44-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-duplex-bedroom-row-home-for\/7498055462.html","post_id":7498055462,"result_date":"2022-06-18 08:51","title":"@@@DUPLEX 2 bedroom row home for rent in Northeast Reading##","description":"2 bedroom 1 bath duplex for rent immediately. Freshly everything, including kitchen, bathroom, painted, flooring, fridge, dish washer. Washer and Dryer in the kitchen. 1 car covered parking, outside storage, Cats considered. Garbage included. $599\/month. NO deposit. \/.\/The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests.2 parking, home available now! APPLIANCES include a REFRIGERATOR, range\/oven, microwave, dishwasher, garbage disposal, and stacked WASHER & DRYER.Super clean, recently renovated kitchen and bath,The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $750 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latinoI have first level local references. I don't smoke, take drugs or drink. I am clean, calm, responsible. I like to take care of plants and animals. I am going to a church. I want to rent a granny flat in or near me La Mesa.. Hope all is well, I'm new to the area, a corporate tech sales professional looking for a master bedroom, or entire apartment. If anyone has any opportunities, my number is listed. I'm clean, respectful, courteous and looking to grow my business. In my spare time, I stay active, play basketball, lift weights, and love committing to the best version of myself. Thank you!For more info please contact: show contact info","num_images":4,"lat":40.3507,"lng":-75.9143,"attrs":"['2BR \/ 1Ba', '1227ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T08:47:10-0400"},{"url":"https:\/\/reading.craigslist.org\/apa\/d\/reading-duplex-bedroom-row-home-for\/7498055453.html","post_id":7498055453,"result_date":"2022-06-18 08:51","title":"@@@DUPLEX 2 bedroom row home for rent in Northeast Reading##","description":"2 bedroom 1 bath duplex for rent immediately. Freshly everything, including kitchen, bathroom, painted, flooring, fridge, dish washer. Washer and Dryer in the kitchen. 1 car covered parking, outside storage, Cats considered. Garbage included. $599\/month. NO deposit. \/.\/The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests.2 parking, home available now! APPLIANCES include a REFRIGERATOR, range\/oven, microwave, dishwasher, garbage disposal, and stacked WASHER & DRYER.Super clean, recently renovated kitchen and bath,The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $750 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latinoI have first level local references. I don't smoke, take drugs or drink. I am clean, calm, responsible. I like to take care of plants and animals. I am going to a church. I want to rent a granny flat in or near me La Mesa.. Hope all is well, I'm new to the area, a corporate tech sales professional looking for a master bedroom, or entire apartment. If anyone has any opportunities, my number is listed. I'm clean, respectful, courteous and looking to grow my business. In my spare time, I stay active, play basketball, lift weights, and love committing to the best version of myself. Thank you!For more info please contact: show contact info","num_images":4,"lat":40.3507,"lng":-75.9143,"attrs":"['2BR \/ 1Ba', '1227ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T08:47:08-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-beautiful-2bedroom-and-15\/7498054982.html","post_id":7498054982,"result_date":"2022-06-18 08:49","title":"BEAUTIFUL 2bedroom and 1.5 bath apt rent in Wilmington","description":"BEAUTIFUL 2bedroom and 1.5 bath apt rent in Wilmington, washer and dryer in unit, attached balcony. This combination kitchen and living room combo is fully equipped with granite counter tops, spacious cherry wood cabinets, ceramic tile flooring, remote control ceiling fan and dim-able lighting. Living areas outside the kitchen feature hardwood floors and bedrooms have Hardwood floors.We are a gay couple, busy, clean, family oriented college students and full time workers. Most of our time would be spent traveling and\/or going to work and\/or school. We are super easy going, clean, simple and drama free, just looking to live with nice easy going people, looking around $1000\/mo. If you are interested or want to know more about any of us, please do not hesitate to contact me. I am of legal age and I am looking to rent an apartment for grandmothers in La Mesa. I have first level local references. I don't smoke, take drugs or drink. I am clean, calm, responsible. I like to take care of plants and animals. I am going to a church. I want to rent a granny flat in or near me La Mesa. Central heating and cooling, washer & dryer in unit, jetted tub in bathroom, and a balcony. The current roommates are aerospace engineers. The bedroom is located on the ground floor with its own bathroom. Rental Prices: (includes everything) Month to Month: $900\/month Deposit: $100 Rental Price Includes: All Utilities High Speed ​​Internet Cable Television Washer and Dryer Full Size Refrigerator Access to Full Kitchen Professional Cleaning Many Other Amenities - Includes Utilities & Unlimited Internet Usage, Double Bed - $900\/mo Annual Lease - Post-Secondary or Recent Graduates Only - 10-minute walk to UC Campus, Building or C\/ Train Station main bus terminal. Free registered street parking is available for the first two vehicles. Sorry, we cannot allow smoking\/vaping\/firearms\/weapons or pets. - with the desired viewing time, full name, email address and daytime contact number to set up a viewing appointment. Hope all is well, I'm new to the area, a corporate tech sales professional looking for a master bedroom, or entire apartment. If anyone has any opportunities, my number is listed. I'm clean, respectful, courteous and looking to grow my business. In my spare time, I stay active, play basketball, lift weights, and love committing to the best version of myself. Thank you!","num_images":7,"lat":39.7434,"lng":-75.5827,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T08:45:11-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-beautifully-renovated\/7498041207.html","post_id":7498041207,"result_date":"2022-06-18 08:19","title":"@@BEAUTIFULLY RENOVATED 2 BEDROOM APARTMENT Move IN READY!!","description":"BEAUTIFULLY RENOVATED 2 BEDROOM APARTMENT.Walking distance to Woodbridge train station with express train to Newark and New York.Close to major highways (Route 1, Route 9, Route 1&9, Parkway, 287, 440, Turnpike.)Driveway Parking, Electric, Water and Sewer Included.\nFeatures: Including refrigerator, dishwasher, microwave, stove and oven, washer and dryer, central air conditioning and heater, fire place.\nUtilities:\nAll utilities are paid by Tenant (water, gas, and electric) Washer and Dryer\nTerms:\n1.5 Month Security Deposit: $1,400\nApplication Fee: $00\n1-year lease\nContact:  show contact info\nShowing by Appointment only\n","num_images":5,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T07:41:03-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-newly-renovated-single-house\/7498046681.html","post_id":7498046681,"result_date":"2022-06-18 08:13","title":"NEWLY RENOVATED SINGLE HOUSE FOR RENT-EAST SIDE","description":"Single house with 3 bedrooms and 2 bathrooms in the east side of Allentown. Completely remodeled with new flooring and freshly painted. Full basement and large size back yard in addition to fenced concrete patio.\nWithin walking distance to schools, shopping centers and parks.  HOUSE WILL BE SHOWN TODAY (SATURDAY 06\/18) AT 11AM SHARP.\nRequirements:\nCredit scores above 600\nNo prior evictions or criminal history\nLandlord and income verifications\nBackground check\nTenants pay utilities","num_images":8,"lat":40.618018,"lng":-75.438132,"attrs":"['3BR \/ 2Ba', '1700ft2', '\\nsaturday 2022-06-18\\n', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T08:09:42-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-beautiful-large-br-well\/7498039572.html","post_id":7498039572,"result_date":"2022-06-18 07:51","title":"@@Beautiful Large 2 BR well-maintained apartment Wahser\/Dryer in-unit!","description":"Beautiful 2 BR Large well-maintained apartment with in-unit Wahser\/Dryer + storage room in basement. Living, dining, bedroom, kitchen and bath. Private storage room in the basement.Beautiful top (second) floor unit with Balcony; sunny and bright apartment.Washer and Dryer in the apartment.Hardwood\/ Laminate flooring; carpet in Bedroom.Upgraded Stove, Fridge, AC, Boiler, Dish Washer, etc.One assigned + ample guest parking spaces.\nGreat Location: 3 minutes walk to the bus stop to NYC & 3 min driving distance to train; Very close to major highways NJTP, Rt 9, Rt 1, Rt 514; close to Oak Tree\nContact:  show contact info\nOne year lease preferred\nUtilities not included in the rent\n","num_images":6,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T07:30:09-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/woodbridge-beautiful-large-br-well\/7498039557.html","post_id":7498039557,"result_date":"2022-06-18 07:34","title":"@@Beautiful Large 2 BR well-maintained apartment Wahser\/Dryer in-unit!","description":"Beautiful 2 BR Large well-maintained apartment with in-unit Wahser\/Dryer + storage room in basement. Living, dining, bedroom, kitchen and bath. Private storage room in the basement.Beautiful top (second) floor unit with Balcony; sunny and bright apartment.Washer and Dryer in the apartment.Hardwood\/ Laminate flooring; carpet in Bedroom.Upgraded Stove, Fridge, AC, Boiler, Dish Washer, etc.One assigned + ample guest parking spaces.\nGreat Location: 3 minutes walk to the bus stop to NYC & 3 min driving distance to train; Very close to major highways NJTP, Rt 9, Rt 1, Rt 514; close to Oak Tree\nContact:  show contact info\nOne year lease preferred\nUtilities not included in the rent\n","num_images":6,"lat":40.556,"lng":-74.2845,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T07:30:04-0400"},{"url":"https:\/\/cnj.craigslist.org\/apa\/d\/clifton-br-15-ba-apartment-rent-in\/7498029717.html","post_id":7498029717,"result_date":"2022-06-18 06:07","title":"2 BR & 1.5 BA Apartment rent in Central NJ .","description":"BEAUTIFUL!!! 2 BR & 1.5 BA Apartment rent in Central NJ . IF YOU INTERESTED, SEND ME MASSAGE:  show contact info\n..!!This combination kitchen and living room combo is fully equipped with granite counter tops, spacious cherry wood cabinets, ceramic tile flooring, remote control ceiling fan and dim-able lighting. Living areas outside the kitchen feature hardwood floors and bedrooms have Hardwood floors. Central heating and cooling, washer & dryer in unit, jetted tub in bathroom, and a balcony.\nWe are a gay couple, busy, clean, family oriented college students and full time workers. Most of our time would be spent traveling and\/or going to work and\/or school. We are super easy going, clean, simple and drama free, just looking to live with nice easy going people, looking around $555\/mo. If you are interested or want to know more about any of us, please do not hesitate to contact me. I am of legal age and I am looking to rent an apartment for grandmothers in La Mesa. I have first level local references. I don't smoke, take drugs or drink. He hardly ever leaves him at home. Since he is almost always with me, you wouldn't even know that I have a terrible situation and I need help ASAP. Right now I live in No. The house is clean and quiet. IF YOU INTERESTED, SEND ME MASSAGE: show contact info\n! It is professionally cleaned 2 times a month.Free registered street parking is available for the first two vehicles. Sorry, we cannot allow smoking\/vaping\/firearms\/weapons or pets. - with the desired viewing time, full name, email address and daytime contact number to set up a viewing appointment. Hope all is well, I'm new to the area, a corporate tech sales professional looking for a master bedroom, or entire apartment. If anyone has any opportunities, my number is listed. I'm clean, respectful, courteous and looking to grow my business. In my spare time, I stay active, play basketball, lift weights, and love committing to the best version of myself. Thank you! Please contact me for more questions. I have a LinkedIn, social media, and am looking for similar professionals in my interests. Let's connect! Hey! Looking for a room to rent by August. We are super quiet, clean, simple, and drama free, just looking to live with quiet, nice folk, looking for about $555\/month. If you're interested or would like to know more from either one of us please feel free to reach out to me. IF YOU INTERESTED, SEND ME MASSAGE:  show contact info","num_images":4,"lat":40.8344,"lng":-74.1377,"attrs":"['2BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T05:57:16-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/dover-bdr-apartment\/7498024873.html","post_id":7498024873,"result_date":"2022-06-18 04:34","title":"2 bdr Apartment","description":"2 bdrm   2nd floor Apartment for rent.\nAll utilities included  $1200\/mo\nEmail me a request to send you a Rental Application","num_images":1,"lat":39.160434,"lng":-75.525126,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T04:30:23-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/oaklyn-pet-friendly-bed-15-bath\/7497996458.html","post_id":7497996458,"result_date":"2022-06-18 00:14","title":"Pet Friendly 3 Bed 1.5 Bath","description":"Pet-friendly! Large 3 bed 1.5 bath house for rent in beautiful Haddon Township featuring an enormous 5,800 sq ft fenced-in backyard with deck, patio, fire pit, gas grill, and great gardening spaces, which makes this home perfect for entertaining or enjoying the outdoors in your own backyard!\nAs you enter your new home from the wraparound front porch, you walk into the spacious living room with a view into the dining room and kitchen.Through the kitchen you head to the family room in the back that has access to the deck and the outdoor living spaces.\nTons of storage space is available in the outdoor shed, basement, and attic. A washer and dryer is included and the kitchen has all new appliances. This home has central heat and air conditioning for your comfort.\nGreat Neighborhood:\n-Membership available for Crystal Lake Pool\n-Excellent Haddon Township School district\n-Friendly and caring neighbors\n-Children in the neighborhood of different age groups\nCentrally Located:\n- Philadelphia Airport (PHL) in 13 Minutes\n- Old City, Philadelphia in 12 minutes\n- PATCO Speedline in 5 minutes\n- Cherry Hill Mall in 10 minutes\n- Knight Park in 4 Minutes\nExterior Features:\n- 5,800 square foot backyard\n- Large Deck\n- Patio set\n- Fire pit w\/ firewood\n- Outdoor Gas Grill\n- Two-car Driveway\n- Large Storage Shed\n- Roomy Wraparound Front Porch\nSecurity & Convenience Features:\n- Ring Doorbell\n- Motion Sensing Outdoor Lighting\n- Google Nest Thermostat\nInterior Features:\n- All New Kitchen Appliances\n- Washer and Dryer\n- Central Heat & Air Conditioning\n- Additional Air Conditioning Wall Units for added comfort\n- Electric Fireplace w\/ Mantel\nLawn Maintenance and Snow Removal are done by the tenant\nApply at apartments dot com: https:\/\/www.apartments.com\/1215-grant-ave-haddon-township-nj\/h5d52n0\/\nText  show contact info\nwith any questions","num_images":17,"lat":39.908,"lng":-75.0849,"attrs":"['3BR \/ 1.5Ba', '1760ft2', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly']","posted_date":"2022-06-17T23:35:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-2nd-fl-rear-bed-apt\/7498264762.html","post_id":7498264762,"result_date":"2022-06-18 16:28","title":"Modern 2nd Fl Rear 1 Bed. Apt in Bella Vista\/Queen Village! C\/A! Deck!","description":"Modern 2nd Fl. Rear 1 Bedroom Apt. in Bella Vista\/Queen Village! One block from the S. 9th St. Italian Market! Close to public transpiration and the E. Passyunk Ave. Dining and Shopping District. Close to major highways. Separate large bedroom with large kitchen area. H\/W floors and tile floors throughout. Central air and heat! Deck! Come see this gem! Shared coin-operated laundry in building! Potential for a storage unit at an additional monthly fee. Tenant pays gas, electric, and cable\/internet. Cold water and sewer is included. $75 non-refundable application fee, two paystubs\/some income verification and photo ID with application - we run a credit, criminal and eviction check. For gross monthly income, we look for 3x the rent. 1st, last and security due at lease signing. 1 year lease minimum. Cats and small dogs below 25 lbs. ok with a one-time non refundable pet fee. Available August 1, 2022. Contact Mike Giordano for more info at  show contact info\n!","num_images":11,"lat":39.937717,"lng":-75.156502,"attrs":"['1BR \/ 1Ba', '500ft2', 'available aug 1', 'air conditioning', 'application fee details: $75 -  credit, criminal and eviction check - 2 paystubs and ID w\/ application', 'broker fee details: $0', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'listed by: Mike Giordano II, Forrester Property Mgmt', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T16:24:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-indoor-parking-target\/7498258052.html","post_id":7498258052,"result_date":"2022-06-18 16:13","title":"Indoor Parking, Target, Starbucks and Sprouts Onsite","description":"Bedrooms: 1Bathrooms: 1Square Feet: 648Date Available: 2022-08-02Address: 1000 South Broad Street\nExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer.\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/gk3p2t2b\/lincoln-square\n","num_images":1,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '648ft2', 'available aug 2', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-06-18T16:09:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-convenient\/7498242116.html","post_id":7498242116,"result_date":"2022-06-18 15:41","title":"One Bedroom-Convenient Location","description":"One bedroom\nSecond floor apt\nLarge bedroom with efficiency kitchen and living room.\nConvenient to all modes of transportation, dining and shopping\n","num_images":14,"lat":39.923652,"lng":-75.179651,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T15:34:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-convenient-location-in\/7498240430.html","post_id":7498240430,"result_date":"2022-06-18 15:34","title":"Convenient location in Lafayette Hill - Come see our 2 Bed \/ 2 bath!","description":"The Glen at Lafayette Hill Bedroom: 2 | Bathroom: 2Square Footage: 1157 sq ftMonthly Rent: $2366 - $2454 show contact info\nCommunity Description  Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.    Community Amenities✓ 24 Hour Availability✓ Cardio Machines✓ Conference Room✓ Elevator✓ Online Services✓ Package Service✓ Pet Play Area✓ Planned Social Activities✓ Recycling✓ Renters Insurance Program✓ BBQ Picnic Garden✓ Billiards, Club Lounge, Cafe Area, Library and Community Room✓ Fitness Center w\/ Free Weights, Weight Machines✓ Message Therapist Practice On-site✓ Outdoor Cafe & Coffee Bar✓ Outdoor Patio Lounge✓ Sprinkler System✓ Storage Space✓ Wi-Fi at ClubhouseUnit Features✓ Air Conditioning & Heating✓ Cable Ready✓ Carpet✓ Ceiling Fans (Select Floor Plans)✓ Heating✓ Range, Oven, Disposal, Oven✓ Refrigerator, Freezer and Ice Maker✓ Tub\/Shower✓ Wi-Fi✓ Window Coverings✓ Crown Molding (Select Floor Plans)✓ High Speed Internet Access✓ Linen Closet✓ Microwave✓ Tile Floors✓ Trash Compactor✓ Vaulted Ceiling (Select Floor Plans)✓ Walk-In Closets (Select Floor Plans)✓ Washer\/Dryer✓ Wheelchair Accessible (Rooms)  Contact InformationVisit Us: 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.com   Additional DetailsPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthManagement Company: Paradise Management, LLC Price is subject to change without prior noticeAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":17,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T15:30:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-washer-dryer-smart-home\/7498227948.html","post_id":7498227948,"result_date":"2022-06-18 15:07","title":"Washer\/Dryer, Smart Home Features, Elevator","description":"Bedrooms: 1Bathrooms: 1Square Feet: 518Date Available: 2022-06-18Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:FOB Controlled AccessElevatorParking Garage (Additional Fees)Bike StorageElectronic ThermostatPackage ReceivingRooftop DeckHardwood FloorsDishwasherSmart Home FeaturesRefrigeratorOn-Site ManagementCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/lp7nyly2\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '518ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T15:03:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-perfect-location-direct-access\/7498222155.html","post_id":7498222155,"result_date":"2022-06-18 14:55","title":"Perfect Location, Direct Access Garages, Fitness Center","description":"The Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nYou will love living at The Point at Pennbrook Station. From our prime location in Lansdale, PA, you can easily travel to North Wales, Hatfield, Blue Bell, City Center Philadelphia, and the Philadelphia International Airport. Visit us today!\nThis second floor two bedroom two bathroom apartment features a fully equipped kitchen with island, coat closet, walk-in closets, washer\/dryer, two porches, and direct access to the garage downstairs!\nCommunity Features\n* Garage Parking\n* WiFi Access\n* Swimming Pool\n* Bark Park\n* Package Acceptance\n* Outdoor Grill Area\n* Easy Access to Public Transportation\n* Community Kitchen\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Easy Freeway Access\n* Fitness Studio\n* After-Hours Emergency Maintenance\n* Minutes from Restaurants, Shopping, and Much More\n* Community Lounge\n* Short Term Lease Available\n* Sun Deck\n[#9275415]","num_images":12,"lat":40.226234,"lng":-75.283466,"attrs":"['2BR \/ 2Ba', '989ft2', 'available jun 25', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T14:51:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-studio-apartment-downtown\/7498206875.html","post_id":7498206875,"result_date":"2022-06-18 14:23","title":"Studio Apartment- Downtown West Chester","description":"Looking for someone to take over my lease in the Greentree Building in West Chester. The unit is a 300 sqft studio apartment in downtown West Chester, right at the corner of Gay and High Street. The building has a laundry room and gym in the basement. Pets are allowed, although there is a small fee. Must be able to pass the normal background and credit checks.","num_images":0,"lat":39.96082,"lng":-75.605221,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T14:19:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-incredible-amenities\/7498204351.html","post_id":7498204351,"result_date":"2022-06-18 14:18","title":"Incredible Amenities, Stylish Features, Lease Today","description":"Lease today at The Point at Glen Mills where you will fall in love with our long list of amenities! Whether it's cooking up a gourmet meal in your chef-inspired kitchen or taking a swim in our salt water pool, you'll find plenty to comfort and entertain at The Point at Glen Mills. Call now!\nThis two bedroom two bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Full sized Washer and Dryer in unit\n* Wood-Like Floors\n* Granite Countertops\n* Extra Storage\n* Private Patio or Private Balcony (on select apartments)","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1079ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T14:14:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-refrigerator-electronic\/7498202745.html","post_id":7498202745,"result_date":"2022-06-18 14:14","title":"Refrigerator, Electronic Thermostat, Washer\/Dryer","description":"Bedrooms: 1Bathrooms: 1Square Feet: 798Date Available: 2022-06-18Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Large ClosetsHigh Speed InternetSmart Home FeaturesOn-Site ManagementPackage ReceivingMicrowave24\/7 Front Desk AttendantHardwood FloorsElectronic ThermostatRooftop DeckWindow CoveringsFitness Center w\/ Peloton BikesCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/mhikacrr\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '798ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T14:10:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7498201888.html","post_id":7498201888,"result_date":"2022-06-18 14:13","title":"Schedule a Tour, Granite Countertops, Playground","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1207ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-06-18T14:09:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7498201662.html","post_id":7498201662,"result_date":"2022-06-18 14:12","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"Find yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":22,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1101ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-06-18T14:08:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7498200883.html","post_id":7498200883,"result_date":"2022-06-18 14:11","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T14:07:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-lease-today-close-to-shops\/7498193425.html","post_id":7498193425,"result_date":"2022-06-18 13:55","title":"Lease Today, Close to Shops and Dining, Laundry in Unit","description":"The Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nThe Point at Plymouth Meeting offers open floor plans, clean white cabinetry, and sleek kitchens that immerse you in style, while sunny dining areas, wall-to-wall carpeting, and private patios will lull you into the easy life. Visit us today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, entry closet, washer\/dryer, walk-in closet, and a private patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm","num_images":14,"lat":40.110645,"lng":-75.324535,"attrs":"['1BR \/ 1Ba', '769ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T13:51:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-beautiful-bedroom-bath-in\/7498189242.html","post_id":7498189242,"result_date":"2022-06-18 13:55","title":"Beautiful 2 Bedroom, 1 Bath in Upper Darby!","description":"This 2 Bedroom, 1 Bath features a Full Kitchen, Large Bedrooms and Newly Carpeted Bedrooms. The first floor offers a spacious living and dining room, followed by the kitchen. The kitchen includes a range and refrigerator. The second floor features two large bedrooms with new carpets and the bathroom. Additional storage space is available in the basement. Come check this out before its gone! 32O4O3-2354\nMove in costs will include first month, last month, and one month security deposit. No section 8\n","num_images":1,"lat":39.9579,"lng":-75.2681,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T13:43:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom\/7498191931.html","post_id":7498191931,"result_date":"2022-06-18 13:52","title":"One Bedroom","description":"One bedroom ground floor apartment, private entrance, $800 per month, first last and security, to move in Utilities included, available now Preferred 55 years and older,  show contact info\n10:AM-5:PM","num_images":0,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T13:48:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-convenient-location-fitness\/7498189832.html","post_id":7498189832,"result_date":"2022-06-18 13:48","title":"Convenient Location, Fitness Center, Close to Shops and Dining","description":"The Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nDiscover an easier, more fulfilling way of life at The Point at Plymouth Meeting. We have all the modern amenities in a great location close to some if the areas best dining, retail, and entertainment options. Call for a tour!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, walk-in closet, and a private patio\/balcony!\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nCommunity Features\n* Extra Storage\n* Bark Park\n* Bike Racks\n* Short or Long Term Lease Available\n* Professionally Managed\n* Outdoor Grill Area\n* Community Lounge\n* Sun Deck\n* Car Wash Area\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* E-Lounge\n* Credit Cards Accepted\n* Liability Insurance is Required\n* Community Kitchen\n* Non Smoking Community\n* Smoke Free Community\n* Minutes from Restaurants, Shopping, and Much More\n* Renters Insurance is Required\n* Package Acceptance\n* WiFi Access\n* After-Hours Emergency Maintenance\n* Swimming Pool\n* Easy Freeway Access","num_images":14,"lat":40.110645,"lng":-75.324535,"attrs":"['2BR \/ 2Ba', '1078ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T13:44:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7498188698.html","post_id":7498188698,"result_date":"2022-06-18 13:46","title":"Private Balcony, Quiet Community, Move In Now","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nCommunity Features\n* Professionally Managed\n* Fitness Studio\n* Easy Freeway Access\n* Community Lounge\n* Spa\n* Outdoor Grill Area\n* Pet Salon\n* Swimming Pool\n* Bark Park\n* Sun Deck\n* Billiards\n* TV Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Yoga Lounge\n[#9275142]","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1363ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T13:42:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-vintage-one-bed-rm\/7498170889.html","post_id":7498170889,"result_date":"2022-06-18 13:41","title":"vintage one bed rm apartment","description":"one bed rm living rm kitchen and bath the apart inclues heat and hot water ,origal wood floors washer dryer\nit is located on south str. i can be reach at   show contact info\nplease do not text me call me any time not before 8:00 Am\nand no later 7:00 pm what is required is ID proof of income, their is no brooker fees and application fees. call and ask for george\n","num_images":4,"lat":40.0118,"lng":-75.1861,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T13:07:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-window-coverings-smart\/7498176508.html","post_id":7498176508,"result_date":"2022-06-18 13:22","title":"Window Coverings, Smart Home Features, Large Closets","description":"Bedrooms: 1Bathrooms: 1Square Feet: 705Date Available: 2022-06-18Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:High Speed InternetWasher\/DryerElectronic ThermostatRefrigeratorRecyclingParking Garage (Additional Fees)Bike StorageMicrowaveRooftop DeckSmart Home FeaturesLarge Closets24\/7 Front Desk AttendantCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/66qr56iq\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['1BR \/ 1Ba', '705ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T13:18:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-2bed-and-1bath\/7498163163.html","post_id":7498163163,"result_date":"2022-06-18 13:11","title":"*BEAUTIFUL 2bed and 1bath apt rent in philadelphia*","description":"BEAUTIFUL 2bedroom and 1bath apt rent in philadelphia, washer and dryer in unit, attached balcony. This combination kitchen and living room combo is fully equipped with granite counter tops, spacious cherry wood cabinets, ceramic tile flooring, remote control ceiling fan and dim-able lighting. Living areas outside the kitchen feature hardwood floors and bedrooms have Hardwood floors.We are a gay couple, busy, clean, family oriented college students and full time workers. Most of our time would be spent traveling and\/or going to work and\/or school. We are super easy going, clean, simple and drama free, just looking to live with nice easy going people. If you are interested or want to know more about any of us, please do not hesitate to contact me. I am of legal age and I am looking to rent an apartment for grandmothers in La Mesa. I have first level local references. I don't smoke, take drugs or drink. Please mention your phone number.","num_images":4,"lat":40.0338,"lng":-75.1731,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T12:53:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-furnished-4br-2ba-house\/7498168536.html","post_id":7498168536,"result_date":"2022-06-18 13:07","title":"Furnished 4BR, 2BA House with Parking","description":"Fully furnished, fully renovated house with 4BR, 2BA will be available August 1. The house is located on Umbria  Street, ten minutes from Main Street and two blocks from the Ivy Ridge train Station.  In addition to being a great house, it also has parking directly behind the house, which is unheard of in Manayunk!\nThe house was fully renovated in 2017, so everything is updated and in great condition. Kitchen has new cabinets, granite countertops and stainless steel appliances.  Open-concept living and dining room area with recessed lighting and wood floors.  The living room is furnished with a sofa, love seat, coffee and end tables and a new flat screen tv and electric fireplace.  The dining area has a table and six chairs.  Furniture can be removed if you don't need it.\nThe second and third floors are carpeted wall-to-wall.  Each floor has two bedrooms and a full bathroom.  The bathrooms have been fully renovated and include step-in showers.  New washer and dryer in the basement with plenty of room for storage.  Also covered rear porch and nice fenced back yard which leads to rear parking.\nThe house is very nice and well maintained by the current tenants.    The house will be available in early August before the start of the school year.\nThis is an awesome house in a great location which will not last long!  If you are interested, send some information about you or your group and when you would be available to check it out. Also feel free to ask any other questions.  No smoking or vaping permitted and no pets.","num_images":14,"lat":40.03164,"lng":-75.231156,"attrs":"['4BR \/ 2Ba', '2160ft2', 'available aug 1', 'air conditioning', 'furnished', 'house', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T13:03:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-salt-water-pool-with\/7498156407.html","post_id":7498156407,"result_date":"2022-06-18 12:44","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"You will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 12:00pm - 5:00pm\n[#9275254]","num_images":19,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T12:40:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-vintage-one-bed-rm\/7498152426.html","post_id":7498152426,"result_date":"2022-06-18 12:36","title":"vintage one bed rm apartment","description":"one bed rm living rm kitchen and bath the apart inclues heat and hot water ,origal wood floors washer dryer\nit is located on south str. i can be reach at  show contact info\nplease do not text me call me any time not before 8:00 Am\nand no later 7:00 pm what is required is ID proof of income, their is no brooker fees and application fees.  call                                              and ask for george","num_images":6,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T12:32:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-lease-today-close-to-shops-and\/7498145106.html","post_id":7498145106,"result_date":"2022-06-18 12:29","title":"Lease Today, Close to Shops and Dining, Pets Welcome","description":"Lease today at The Point at Pennbrook Station in Lansdale, PA. Come home to convenience. With a modern, open-plan kitchen and meticulous stainless steel appliances, making dinner is easier (and more exciting) than ever. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, walk-in closets, washer\/dryer, attached garage, and a private porch!\nThe Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nCommunity Features\n* After-Hours Emergency Maintenance\n* Swimming Pool\n* Short Term Lease Available\n* Minutes from Restaurants, Shopping, and Much More\n* Sun Deck\n* Easy Access to Public Transportation\n* Easy Freeway Access\n* Community Lounge\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Community Kitchen\n* WiFi Access\n* Bark Park\n* Fitness Studio\n* Package Acceptance\n* Outdoor Grill Area\n* Garage Parking","num_images":11,"lat":40.226234,"lng":-75.283466,"attrs":"['2BR \/ 2Ba', '1330ft2', 'available aug 13', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T12:18:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house-with-office\/7498148504.html","post_id":7498148504,"result_date":"2022-06-18 12:29","title":"2 Bedroom House with Office and Laundry","description":"This two bedroom house with bonus office\/nursery, sits on a small, quiet street between the Whole Foods and Palumbo Park in Bella Vista.\nThroughout the house you will find high ceilings, new triple-pane windows, exposed brick, and hardwood floors. The first floor features a living room, dining area, and kitchen that leads to an outdoor brick and mosaic patio.\nStraight stairs lead you to the second floor, which features a full bathroom, a bedroom, and a second outdoor patio. Continue up another set of straight stairs to a recently renovated office\/nursery and master bedroom. The basement has high ceilings, ample storage, and a washer\/dryer. There is also a dishwasher, gas stove, gas radiated heating, and mini split AC units are located on each floor.\nSteps away from Whole Foods, Acme, Palumbo Park, the Italian Market, and South Street restaurants and shops. Close to Center City, Penn and Jefferson, Washington Square Park, and Headhouse Square. Permit parking is very convenient.\nPets welcome, water included, tenant pays gas and electric. Credit check, first, last, and deposit required for a one-year lease, which can begin Aug 1st, Aug 15th, or Sept 1.","num_images":13,"lat":39.941862,"lng":-75.158232,"attrs":"['2BR \/ 1Ba', 'available aug 1', 'air conditioning', 'application fee details: Credit check required to sign lease', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T12:25:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bi-level-3bd-2ba-in-uc\/7498147484.html","post_id":7498147484,"result_date":"2022-06-18 12:27","title":"Bi-level 3bd\/2ba in U.C.","description":"Available August: Spacious and beautiful apartment for rent on the 2nd and 3rd floors at 47th and Chester Ave. 2nd floor features large kitchen and dining room, a bedroom and a living room plus a full bathroom. 3rd floor has two more bedrooms and a full bathroom with laundry. Hardwood floors throughout, window air conditioning units, and original Victorian details make this apartment one of a kind. Centrally located- just a quick walk to Clark Park, Mariposa Co-Op, and many other U.C. attractions. Trolley stops on the corner for easy access to Center City and beyond. Tenant pays heat and electric. NO PETS, PLEASE. First, last month's rent and security deposit required to move in. $30 application fee. One year lease, with the opportunity to renew. Please email with your name and telephone number to schedule a showing.","num_images":14,"lat":39.9454,"lng":-75.213295,"attrs":"['4BR \/ 2Ba', '1600ft2', 'available aug 5', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T12:23:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-electronic-thermostat\/7498139309.html","post_id":7498139309,"result_date":"2022-06-18 12:11","title":"Electronic Thermostat, Package Receiving, 24\/7 Front Desk Attendant","description":"Bedrooms: 0Bathrooms: 1Square Feet: 372Date Available: 2022-06-18Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Package ReceivingWasher\/DryerParking Garage (Additional Fees)Large ClosetsDishwasherRecycling24\/7 Front Desk AttendantFitness Center w\/ Peloton BikesWindow CoveringsHigh Speed InternetOn-Site ManagementSmart Home FeaturesCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/nz2e6lyu\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '372ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T12:07:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-remodeled-3bd-bth\/7498131833.html","post_id":7498131833,"result_date":"2022-06-18 11:57","title":"Amazing remodeled 3bd\/2 bth apt for rent","description":"Beautiful 3 Bedroom\/ 2 Bathroom Available Now in Middletown! This 2 bedroom, 2 bath home is loaded with character. The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $680 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latino. We are a gay couple, family oriented, clean, busy college students, and full time workers. Most of our time would be spent commuting and\/or attending work and\/or school. We are super quiet, clean, simple, and drama free, just looking to live with quiet, nice folk, looking for about $680 \/month. If you're interested or would like to know more from either one of us please feel free to reach out to me.","num_images":1,"lat":39.915,"lng":-75.192,"attrs":"['3BR \/ 2Ba', '1400ft2', 'available now', '\\nthursday 2022-06-23\\n', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T11:53:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/warrington-bed-bath-2nd-floor-duplex-apt\/7498130547.html","post_id":7498130547,"result_date":"2022-06-18 11:54","title":"3 bed 1 bath 2nd floor duplex apt","description":"Note: If interested, kindly reply with your email and phone #\n####\nFreshly painted 2nd floor, 3 bed 1 bath cozy duplex apt\nrecently renovated:  new windows, HVAC, and flooring\nAll electric.\nCold water is included.\nWasher and dryer available.\nPets negotiable\nSection 8 is negotiable.\nAvailable Aug 1st\nReq  :  credit report, 1st month and security deposit\n1 bay garage is optional extra.\n###\nNote: If interested, kindly reply with your email and phone #\n","num_images":0,"lat":40.24459,"lng":-75.12543,"attrs":"['3BR \/ 1Ba', '1000ft2', 'available aug 1', 'air conditioning', 'application fee details: credit and background check', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T11:50:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/trenton-welcome-home-call-today-to-tour\/7498129742.html","post_id":7498129742,"result_date":"2022-06-18 11:52","title":"Welcome Home! Call TODAY to Tour Your New Beautiful Community!","description":"show contact info\np>Contact info:\nThe Crossings at Hamilton | Edgewood Properties |  show contact info\nTHE CROSSINGS AT HAMILTON STATION\n900 Grand Central Drive, Hamilton, NJ 08619\nshow contact info\nwww.apartmentsathamiltonstation.com\nDESCRIPTION\nThe Crossings at Hamilton Station, a pristine community located in the heart of Hamilton, will make you wish you never lived anywhere else but here! Our perfect location offers residents the ability to access a multitude of delicious restaurants, shopping centers, and endless entertainment. We are just steps away from the Hamilton Train Station, providing quick rail service to Philadelphia, New York, Princeton, and Trenton. Our brand new 1, 2, and 3 bedroom apartments and 3 bedroom, 2.5 bathroom townhomes are designed to complement your lifestyle featuring open floorplans, stainless steel appliances, granite countertops, and so much more. Schedule your tour today to see why everyone is falling in love with The Crossings.\nCommunity Perks and Top-of-the Line Amenities\n❇️ Luxurious Clubhouse and Concierge Service\n❇️ Large Resort-Style Swimming Pool and Grill Area\n❇️ 24\/7 Emergency Maintenance\n❇️ 24-hour Business Center\n❇️ 24-hour Fitness Center\n❇️ Brand New Playground\n❇️ Fenced-in Dog Park\n❇️ Continental Sunday Breakfast\nSleek and Modern Apartments and Townhouses\n❇️ Spacious, Open Floorplans\n❇️ Soaking Tubs\/Walk-in Showers\n❇️ Large Washer\/Dryer in the unit\n❇️ Granite Countertops\n❇️ Large Walk-in Closets\n","num_images":17,"lat":40.2418,"lng":-74.6962,"attrs":"['2BR \/ 2Ba', '1467ft2', 'available now', '\\nsunday 2022-06-19\\n', '\\nmonday 2022-06-20\\n', '\\ntuesday 2022-06-21\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T11:48:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-dog-and-cat-friendly\/7498127225.html","post_id":7498127225,"result_date":"2022-06-18 11:47","title":"Dog and Cat-Friendly 1157 SqFt 2 Bed \/ 2 Bath! Pets Welcome Here!","description":"The Glen at Lafayette Hill Visit our community today! 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nUnit Rates:  $2366 - $2454\/month Unit Type: 2-BR 2-BA Unit Size: 1157 sq ftLease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.What you’ll find in our community: ➢ 24 Hour Availability➢ Conference Room➢ Elevator➢ Furnished Units Available➢ Gated, Controlled Access➢ Online Services➢ Package Service➢ Pet Friendly➢ Recycling➢ Renters Insurance Program➢ BBQ Picnic Garden➢ Billiards, Club Lounge, Cafe Area, Library and Community Room➢ Fitness Center w\/ Free Weights, Weight Machines➢ Message Therapist Practice On-site➢ Outdoor Cafe & Coffee Bar➢ Outdoor Patio Lounge➢ Sprinkler System➢ Storage Space➢ Wi-Fi at ClubhouseDescription: Are you searching for the best apartments in Lafayette Hill? Look no further than The Glen Apartments. Take a tour of our property to see everything our pet-friendly Lafayette Hill apartments have to offer. Our professional staff is waiting to welcome you home to a care-free lifestyle. Please schedule a tour today and see what the best Lafayette Hill, PA apartments have for you.\n* We have Garages ( Approx. 19.5x9.5) available for $185.00 Monthly & Storage Lockers available for $40.00 Monthly ( Approx. 4x4x7) & $75.00 Monthly ( Approx. 4x8x7)This unit comes with: ➢ Air Conditioning & Heating➢ Carpet➢ Ceiling Fans (Select Floor Plans)➢ Dining Room➢ Heating➢ Range, Oven, Disposal, Oven➢ Refrigerator, Freezer and Ice Maker➢ Tub\/Shower➢ Wi-Fi➢ Window Coverings➢ Crown Molding (Select Floor Plans)➢ High Speed Internet Access➢ Linen Closet➢ Microwave➢ Storage Units➢ Trash Compactor➢ Vaulted Ceiling (Select Floor Plans)➢ Walk-In Closets (Select Floor Plans)➢ Washer\/Dryer➢ Wheelchair Accessible (Rooms)Call or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.comProperty Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":17,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T11:43:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-electric-included-perfect\/7498124918.html","post_id":7498124918,"result_date":"2022-06-18 11:42","title":"ELECTRIC INCLUDED ~PERFECT LOCATION W\/ RENT ! 2 BEDROOMS START","description":"Everyone loves the iconic French Quarter, one of\nPhiladelphia original entertainment districts. Join your friends in our ever-growing community.\nExperience living in an apartment community where the entertainment is accessible right outside your front door, enjoying the scenery from your spacious balcony. Old world elements of New Orleans' French Quarter meets beautiful painted buildings with a modern twist.\nWe have a variety of styles and floorplans to choose from, whether you want a cozy second or third floor flat or a multi level townhome, we have what you are looking for.\nSeriously, We Have It All Here!\n~ 1 Bedroom start @ $875.00\n~2 Bedrooms start @ $1,050.00\n~2 Bedroom Suites & Townhomes - call for pricing.\n**ELECTRIC INCLUDED IN ALL RENTS**\nWater - Trash - Sewage - Pest Control billed\nThe Continent French Quarter offers easy access to major freeways, shopping & downtown. Most \"Furry Roommates\" are welcome here... (restrictions do apply)\nCall  show contact info\ntoday to tour this historical landmark and reserve your new home!  show contact info\n~*~*~*~\nOffice Hours: 9 am - 5 pm Monday through Friday\nPlease call for more information or stop in the leasing office during normal business hours, we would be happy to let you tour one of our available apartments!\n4222 ALDINE ST\nPHILADELPHIA, PA 19136\n","num_images":1,"lat":40.0422,"lng":-75.0244,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T11:38:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-electric-included-perfect\/7498124899.html","post_id":7498124899,"result_date":"2022-06-18 11:42","title":"ELECTRIC INCLUDED ~PERFECT LOCATION W\/ RENT ! 2 BEDROOMS START","description":"5158 WAKEFIELD ST\nPHILADELPHIA, PA 19144\nEveryone loves the iconic French Quarter, one of\nPhiladelphia original entertainment districts. Join your friends in our ever-growing community.\nExperience living in an apartment community where the entertainment is accessible right outside your front door, enjoying the scenery from your spacious balcony. Old world elements of New Orleans' French Quarter meets beautiful painted buildings with a modern twist.\nWe have a variety of styles and floorplans to choose from, whether you want a cozy second or third floor flat or a multi level townhome, we have what you are looking for.\nSeriously, We Have It All Here!\n~ 1 Bedroom start @ $875.00\n~2 Bedrooms start @ $1,050.00\n~2 Bedroom Suites & Townhomes - call for pricing.\n**ELECTRIC INCLUDED IN ALL RENTS**\nWater - Trash - Sewage - Pest Control billed\nThe Continent French Quarter offers easy access to major freeways, shopping & downtown. Most \"Furry Roommates\" are welcome here... (restrictions do apply)\nCall  show contact info\ntoday to tour this historical landmark and reserve your new home!  show contact info\n~*~*~*~\nOffice Hours: 9 am - 5 pm Monday through Friday\nPlease call for more information or stop in the leasing office during normal business hours, we would be happy to let you tour one of our available apartments!\n","num_images":1,"lat":40.0338,"lng":-75.1731,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T11:38:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-electric-included-perfect\/7498124818.html","post_id":7498124818,"result_date":"2022-06-18 11:42","title":"ELECTRIC INCLUDED ~PERFECT LOCATION W\/ RENT ! 2 BEDROOMS START","description":"1225 ENGLEWOOD ST\nPHILADELPHIA, PA 19111\nEveryone loves the iconic French Quarter, one of\nPhiladelphia   original entertainment districts. Join your friends in our ever-growing community.\nExperience living in an apartment community where the entertainment is accessible right outside your front door, enjoying the scenery from your spacious balcony. Old world elements of New Orleans' French Quarter meets beautiful painted buildings with a modern twist.\nWe have a variety of styles and floorplans to choose from, whether you want a cozy second or third floor flat or a multi level townhome, we have what you are looking for.\nSeriously, We Have It All Here!\n~ 1 Bedroom start @ $875.00\n~2 Bedrooms start @ $1,050.00\n~2 Bedroom Suites & Townhomes - call for pricing.\n**ELECTRIC INCLUDED IN ALL RENTS**\nWater - Trash - Sewage - Pest Control billed\nThe Continent French Quarter offers easy access to major freeways, shopping & downtown. Most \"Furry Roommates\" are welcome here... (restrictions do apply)\nCall  show contact info\ntoday to tour this historical landmark and reserve your new home!  show contact info\n~*~*~*~\nOffice Hours: 9 am - 5 pm Monday through Friday\nPlease call for more information or stop in the leasing office during normal business hours, we would be happy to let you tour one of our available apartments!\n","num_images":1,"lat":40.0422,"lng":-75.0244,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T11:38:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-townhouse-for-rent-in\/7498104180.html","post_id":7498104180,"result_date":"2022-06-18 11:37","title":"Townhouse for RENT in Philadelphia, PA(19120)- 1 bedR --1 bathroom-=","description":"This state-of-the-art 1 bedroom 1 bathroom apartment of high ranch, Large living rm, spacious EIK, lrg bathroom.Laminate flooring. Washer\/Dryer, Fridge-Freezer\/Dishwasher\/Range-Oven. The upstairs continues with the original hardwood,full kitchen nice bath, bright, lots of windows.heat and hot water included. one window A\/C included as well as hallway closet storage. Level 1 has an open concept eat-in kitchen\/entertainment area with birch cabinets, stainless steel appliances, dishwasher, and ice-maker fridge, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Open concept apartment home, new washer\/dryer, fridge, ffree parking. One small quiet dog considered, has pet door and fenced yard. Im a Non-smoker,Spacious Victorian, lower, Rent includes water, sewer and trash.heat, electricity, cooking gas, cable.Internet. High Ceilings, Hardwood Floors, Garage bay, Dryer and Washer hookup","num_images":3,"lat":40.0343,"lng":-75.1213,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T10:56:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-hardwood-floors-parking\/7498113305.html","post_id":7498113305,"result_date":"2022-06-18 11:18","title":"Hardwood Floors, Parking Garage (Additional Fees), Package Receiving","description":"Bedrooms: 0Bathrooms: 1Square Feet: 390Date Available: 2022-06-18Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Large ClosetsParking Garage (Additional Fees)Rooftop DeckHardwood FloorsBike StorageFitness Center w\/ Peloton BikesWasher\/DryerWindow CoveringsDishwasherRecyclingFOB Controlled AccessElevatorCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/vsoe7ddw\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '390ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T11:14:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bark-park-bbq-and-deck\/7498105922.html","post_id":7498105922,"result_date":"2022-06-18 11:09","title":"Bark park, BBQ and deck area, 48-hour Maintenance Commitment","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Marble master baths, some with deep linen storage48-hour Maintenance CommitmentJogging trail right outside your door9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardBBQ and deck areaUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densPet-friendly livingUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsBark parkAlexa or Google Home Capable in all ApartmentsFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingHuge walk-in closets with ample storageCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/fmeqcbh7\/ApexManayunk\n","num_images":9,"lat":40.0275,"lng":-75.2242,"attrs":"['1BR \/ 1Ba', '768ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-06-18T11:00:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7498108357.html","post_id":7498108357,"result_date":"2022-06-18 11:08","title":"Lease Today, Playground, Luxurious Bathrooms","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nSchedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '833ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-06-18T11:04:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-first-floor-one-bedroom\/7498106518.html","post_id":7498106518,"result_date":"2022-06-18 11:05","title":"First floor one bedroom apartment","description":"One bedroom apartment.\nFirst floor","num_images":11,"lat":39.9925,"lng":-75.1133,"attrs":"['1BR \/ 1Ba', '460ft2', 'available jul 1', 'application fee details: $50 per person', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T11:01:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-convenient-location-fitness\/7498099007.html","post_id":7498099007,"result_date":"2022-06-18 10:48","title":"Convenient Location, Fitness Center, Close to Shops and Dining","description":"The Point at Pennbrook Station has all the modern amenities in a great location. You will enjoy complimentary coffee, WiFi, and printing services in our clubhouse. or you can use our social hub, complete with computers and individual or communal workspaces, to work on your passion project. We have everything you need! Call today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, walk-inc lost, laundry room with washer\/dryer, and a private porch!\nThe Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com","num_images":12,"lat":40.226234,"lng":-75.283466,"attrs":"['1BR \/ 1Ba', '755ft2', 'available jul 19', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T10:44:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-updated-offering\/7498063992.html","post_id":7498063992,"result_date":"2022-06-18 10:48","title":"recently updated offering New fresh paint inside and out, outstanding","description":"show contact info\nNewly remodeled unit in a one-story building in the Arlington area close to Philadelphia University. The unit consists of a 1 bedroom \/ 1 bath with approx. 756 sq ft and a spacious living room and separate kitchen with a bar top. Freshly painted, new flooring, central AC, new granite countertops, white appliances including dishwasher, separate laundry room space with hookups for washer and dryer. Plenty onsite parking space. Easy access to city main roadways, 10 mins from downtown , and across the street from under renovation shopping center. Large open new kitchen with brand new stainless steel appliances and LED lights throughout the home. Comes with a car garage and large gorgeous backyard with coconut trees. Short walk to TY Park & YMCA, Lauderdale & Airport, Dania Point and Oakwood plaza and close to all major shopping centers. Quick access\n-Dishwasher\n-Lake Views\n-Swimming Pool\n-Cable Ready\n-Laundry Facility\n-Clubhouse\n-Oversized Closets\n-Premium Updated Interior\n-Emergency Maintenance\n-Sports Court\n-Stove\n-Bike Racks\n-Dog Park\n-BBQ\/Picnic area\n-Fitness Center\n-Disposal\n-Air Conditioning","num_images":7,"lat":39.9223,"lng":-75.2338,"attrs":"['1BR \/ 1Ba', '756ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T09:16:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-laundry-in-unit-lease\/7498094199.html","post_id":7498094199,"result_date":"2022-06-18 10:37","title":"Laundry in Unit, Lease Today, Convenient Location","description":"Looking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\n[#9274833]","num_images":18,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T10:33:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ardmore-haverford-br-garden-parking\/7498085624.html","post_id":7498085624,"result_date":"2022-06-18 10:18","title":"Haverford, 1 BR w\/garden, parking","description":"Beautiful hardwood floors; glass wall opening to sunny, enclosed  200SF private garden. Wood-burning FP in LR. Freshly modernized kitchen with ample storage. In-wall ACs, baseboard heating controlled by tenant. Generous closet space. Parking at your door. Rent includes trash fee, heat, water, hot water. Tenant pays electric. Nice lighting, quiet neighborhood. Landscaped grounds. W\/D on site. Solid 4-Unit building. Each apartment has its own front door and mailbox (no common hallway). Lots of privacy.","num_images":15,"lat":40.016511,"lng":-75.303229,"attrs":"['1BR \/ 1Ba', '900ft2', 'available jul 22', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T10:14:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cute-bedroom-bathroom\/7498079246.html","post_id":7498079246,"result_date":"2022-06-18 10:14","title":"Cute 2 bedroom 2 bathroom. Freshly painted, nice kitchen,","description":"show contact info\nNice 2 bedroom 2 bathroom Apartment for rent . Each home is equipped with a stainless steel appliance package and a full-size WASHER AND DRYER Large park\/play ground, community POOL and catch and release ponds. Single story with FENCED YARD and 2 car garage. 800 sq. feet. Built in 2015. . unique, spacious floor plan options, and whether you are looking for a MicroSuite, studio, or Tow-bedroom apartment, each of our rentals has hardwood floors and walk-in closets. The kitchens have fabulous cabinets and countertops with built-in appliances. You’ll love the exceptional curbside appeal . building is listed on the National Historic Register. apartments for rent on the Main Line are near  University and located in  School District. rentals appeal to Philadelphia apartment shoppers. In addition to traditional residential apartments,  provide corporate and furnished options, and every one includes a long list of great amenities\n-Seasonal Bike Share Program\n-On site washer and dryer\n-Elevator building\n-Pet friendly\n-Oversized closets\n-Energy efficient appliances including built-in microwave, refrigerator, and dishwasher\n-Covered parking Featured amenity\n-Onsite playground\n-Spacious floor plans with large bedrooms and closets\n-Complimentary Wi-Fi lounge\n-Garage and parking lot available\n-Listed on the National Historic Register\n-New fitness center\n-Modernista Apartment kitchens with stainless steel appliances available\n-Smoke-free apartments available","num_images":9,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 2Ba', '1200ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-18T09:59:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fitness-center-peloton\/7498080977.html","post_id":7498080977,"result_date":"2022-06-18 10:07","title":"Fitness Center w\/ Peloton Bikes, Window Coverings, On-Site Management","description":"Bedrooms: 0Bathrooms: 1Square Feet: 390Date Available: 2022-06-18Address: 510 Broad StNestled in the heart of Philadelphia's Avenue of the Arts\nneighborhood, LVL North offers a home built with creative details, modern features,\nand sleek design. Offering spacious studio, one, and two-bedroom Philadelphia apartment homes,\nLVL North is an artful blend of stylish apartments and luxury living. Amenities Include:Bike StorageFitness Center w\/ Peloton BikesMicrowaveElectronic ThermostatRooftop DeckHardwood FloorsFOB Controlled AccessPackage ReceivingDishwasherElevatorWindow CoveringsLarge ClosetsCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/cadkjnyc\/lvl-north\n","num_images":9,"lat":39.944135,"lng":-75.165818,"attrs":"['0BR \/ 1Ba', '390ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T10:03:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bathroom\/7498080741.html","post_id":7498080741,"result_date":"2022-06-18 10:06","title":"*-*Beautiful 2 Bedroom\/ 2 Bathroom Available Now in philadelphia*-*","description":"Beautiful 2 Bedroom\/ 2 Bathroom Available Now in philadelphia! This 2 bedroom, 2 bath home is loaded with character. The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $610 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latino. We are a gay couple, family oriented, clean, busy college students, and full time workers. Most of our time would be spent commuting and\/or attending work and\/or school. We are super quiet, clean, simple, and drama free, just looking to live with quiet, nice folk, looking for about $750 \/month. If you're interested or would like to know more from either one of us please feel free to reach out to me.t. Please mention your phone number.","num_images":5,"lat":39.9788,"lng":-75.1262,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-06-18T10:02:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-downtown-apartment\/7498078825.html","post_id":7498078825,"result_date":"2022-06-18 10:02","title":"Downtown Apartment","description":"July 1 Occupancy\nDowntown West Chester Apartment\n3rd floor apartment\nThree apartment complex\nWest Chester, Pennsylvania\n·Living room\n·Kitchen\n·One bedroom\n·Bath\n·Hot water provided\n·Renter pays for heat and electricity\n·Maximum number of occupants: 1","num_images":4,"lat":39.95945,"lng":-75.605003,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'apartment', 'no laundry on site', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T09:58:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-2bed-and-1bath\/7498072001.html","post_id":7498072001,"result_date":"2022-06-18 10:02","title":"*BEAUTIFUL 2bed and 1bath apt rent in philadelphia*","description":"BEAUTIFUL 2bedroom and 1.5 bath apt rent in philadelphia, washer and dryer in unit, attached balcony. This combination kitchen and living room combo is fully equipped with granite counter tops, spacious cherry wood cabinets, ceramic tile flooring, remote control ceiling fan and dim-able lighting. Living areas outside the kitchen feature hardwood floors and bedrooms have Hardwood floors.We are a gay couple, busy, clean, family oriented college students and full time workers. Most of our time would be spent traveling and\/or going to work and\/or school. We are super easy going, clean, simple and drama free, just looking to live with nice easy going people. If you are interested or want to know more about any of us, please do not hesitate to contact me. I am of legal age and I am looking to rent an apartment for grandmothers in La Mesa. I have first level local references. I don't smoke, take drugs or drink.","num_images":6,"lat":39.954221,"lng":-75.170013,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:40:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cool-sleek-bedroom\/7498066982.html","post_id":7498066982,"result_date":"2022-06-18 09:50","title":"Cool & Sleek 2 bedroom 1 bathroom, Unit is available ASAP!","description":"Cool & Sleek 2 bedroom 1 bathroom, Unit is available ASAP!\nNO FEE!\nExcellent spacious 2 bedroom\nTrue 2 bedroom, 1 queen size bedrooms and 1 full-sized\n1 Full bath!\nCentral Air\nThe Stainless Steel kitchen features a dishwasher\nHigh Ceilings\nClassic Exposed Brick\nAmple closet space\nOversized windows drench the unit in natural sunlight\nSleek finishes, original details, and artful touches!\nSteps to shopping, bars\/nightlife, convenience & more!\nTenant pays utilities\nNo Pets\nLease Terms\nNO FEE! Just 1st-month rent, security to move in\nCREDIT CHECK & INCOME VERIFICATION ARE REQUIRED!\nAPPLICANTS: Must Earn 25-30X the rent and have decent credit.\nGUARANTORS: must earn 60-70X rent. In & out-of-state Guarantors.\nUnit is available ASAP- Serious tenants ONLY to view.\nCONTACT: NINE-ONE-SEVEN-NINE-NINE-FOUR-ZERO-TWO-ONE-ZERO\n","num_images":4,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 1Ba', 'available jun 30', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:25:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-passyunk-bedroom-15-bath\/7498068546.html","post_id":7498068546,"result_date":"2022-06-18 09:34","title":"E. Passyunk 3 bedroom\/1.5 bath house 8\/1 avail","description":"Prime location 3 bedroom, 1.5 bath up for . Roughly 1000 sq. ft. Amazing location, cute little backyard, washer\/dryer in basement. Corner house convenient to amazing stuff.\nThis pet-friendly house would be great for 2-3 people.\nFirst, last and security due at signing.\nH20 included in Rent, Tenant pays for Gas (stove and heat\/water heater), electric and internet\n","num_images":6,"lat":39.925928,"lng":-75.166659,"attrs":"['3BR \/ 1.5Ba', '1000ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T09:30:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-walk-to-drexel-9\/7498068230.html","post_id":7498068230,"result_date":"2022-06-18 09:33","title":"5 bedroom walk to Drexel 6-9 month rental","description":"5 bedroom,2 bath home within a 2 minute walk to Penn Presbyterian, 10 minute walk to Drexel University.property has 4 bigger bedrooms and 1smaller room but big enough for a bed, bureau and desk.2 recently done bathrooms.Appliances include refrigerator stove,microwave,dishwasher.washer and dryer in the basement. 6 or 9 month lease available 3,400 per month","num_images":13,"lat":39.9597,"lng":-75.2024,"attrs":"['5BR \/ 2Ba', '1800ft2', 'available sep 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:29:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7498067896.html","post_id":7498067896,"result_date":"2022-06-18 09:32","title":"Pets Welcome, Lease Today, Quiet Community","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nApartment Features\n* Garden Tub\n* Washer and Dryer in unit\n* Linen Closet\n* Stainless Steel Appliances\n* Walk-in Closet\n* Kitchen Island\n* Private Patio or Private Balcony (on select apartments)\nCommunity Features\n* Pet Salon\n* Community Lounge\n* Spa\n* Easy Freeway Access\n* TV Lounge\n* Swimming Pool\n* Bark Park\n* Billiards\n* Outdoor Grill Area\n* Yoga Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Fitness Studio\n* Professionally Managed\n* Sun Deck","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '789ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:28:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-studio-available-sept\/7498067035.html","post_id":7498067035,"result_date":"2022-06-18 09:30","title":"Cozy Studio Available Sept\/Oct at 2025 Walnut St!","description":"Available to lease starting September 7th - October 1st!\nCall or text Annie at  show contact info\nwith any questions or to set up a showing!\nWe only require the security deposit and first month's rent to move in (no last month's rent upfront!) 640 credit score required. Other requirements apply. Cosigners accepted!\nComing available this Fall 2022! This cozy studio is located on the third floor of a walkup. Features include air conditioning, hardwood floors, and a great layout. Ideal location, easy access to Rittenhouse Square Park and the Schuylkill River Park, fine restaurants, shopping, transportation, the river, the walking and bike trails to Kelly Drive. Close to University City, Trader Joes, Rittenhouse Square Park, 30th Street Station, and the Schuylkill River. Easy access to public transportation!\nWe are pet friendly! No breed or weight restrictions - just a one-time fee of $250\/pet. Water is included in the rent. Only security deposit and first month's rent needed to move in! Credit requirements apply.\nAddress: 2025 Walnut Street #3M\nThis property is professionally managed by AMC Delancey Group.\nContact Annie to schedule a showing!\nAnnie Oliver\nAMC Delancey\nshow contact info\n- text me!\n","num_images":3,"lat":39.950589,"lng":-75.174284,"attrs":"['0BR \/ 1Ba', 'available sep 7', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T09:25:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated-bd-ba\/7498065396.html","post_id":7498065396,"result_date":"2022-06-18 09:24","title":"Completely Renovated 3 BD \/ 2 BA Home, Central Air, Private Rear Deck!","description":"Completely Renovated 3 Bedroom 2 Bath Home, Central Air, Private Rear Deck, brand new rehab in Elmwood Park\/Kingsessing\nProperty Address\n6345 Kingsessing Ave | Philadelphia, PA 19142\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️Stunning renovation in Elmwood Park\/Kingsessing! ⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 2 Bath\n✔️Updated Kitchen w\/ custom designer backsplash\n✔️Master Bedroom has a Private brand new full bath\n✔️Located just minutes to schools, parks, and University City\n✔️All New Appliances\n✔️Hardwood flooring throughout\n✔️Recessed Lighting\n✔️Spacious bedrooms\n✔️Open layout, plenty of closet space.\n✔️Large basement perfect for storage\n✔️Central Air\n✔️Private Rear Deck\n✔️Washer\/Dryer Hookup\n✔️Located just minutes to schools, parks, and University City\n✔️Easy commute to and from the city\n✔️This property won't last long, inquire now!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1330\nRental Terms\nRent: $1900\nApplication Fee: $35\nSecurity Deposit: $3800\nPet Policy\nCats allowed\nDogs not allowed\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\nVirtual Tour: https:\/\/my.matterport.com\/show\/?m=xG8QmjAkkCh\nStunning renovation in Elmwood Park\/Kingsessing! This immaculate home has been completely renovated from top to bottom! Located just minutes to schools, parks, and University City. Brand new renovation! Steps to UPENN, Drexel, USciences, Center City CHOP, and Hospital of the University of Pennsylvania. Home features 3 bedrooms, 2 baths! Central air! Private Rear Deck! Washer\/dryer hookup! Absolutely everything here is brand new! #nata\nFor security purposes, all of our properties are under live video and audio surveillance. All access and showings are recorded and monitored remotely\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,332\nRental Terms\nRent: $1,900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,800.00\n\nPet Policy\nCats allowed\nDogs not allowed","num_images":24,"lat":39.928403,"lng":-75.236155,"attrs":"['3BR \/ 2Ba', '1332ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:20:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-renovations-bed\/7498062001.html","post_id":7498062001,"result_date":"2022-06-18 09:21","title":"BRAND-NEW RENOVATIONS! 2 bed\/1 BATH HOUSE! AVAILABLE NOW!","description":"BEAUTIFUL 2 Bedroom\/ 1 Bathroom Available Now in! This 2 bedroom, 1 bath home is loaded with character. The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $600 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latino. We are a gay couple, family oriented, clean, busy college students, and full time workers. Most of our time would be spent commuting and\/or attending work and\/or school. We are super quiet, clean, simple, and drama free, just looking to live with quiet, nice folk, looking for about $750\/month. If you're interested or would like to know more from either one of us please feel free to reach out to me.If you are interested please text me here-  show contact info","num_images":3,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:10:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-newly-renovated\/7498063529.html","post_id":7498063529,"result_date":"2022-06-18 09:18","title":"BRAND NEW!!! NEWLY RENOVATED 3 BD & 2 BA HOME LOCATED IN OAK LANE!","description":"BRAND NEW!!! NEWLY RENOVATED 3 BEDROOMS & 2 BATHS HOME LOCATED IN OAK LANE!\nProperty Address\n6238 Limekiln Pike | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️LOOK NO FURTHER!\n✔️EVERYTHING IS BRAND NEW!\n✔️LARGE 3 BEDROOMS AND 2 BATHS HOME LOCATED IN WEST OAK LANE!\n✔️THIS HOME HAS BEEN RENOVATED FROM TOP TO BOTTOM TO PROVIDE MAXIMUM COMFORT!\n✔️LARGE BRAND NEW KITCHEN W\/ STAINLESS STEEL APPLIANCES!\n✔️BRAND NEW! CUSTOM DESIGNER KITCHEN 42\" CABINETS!\n✔️GRANITE COUNTERTOPS W\/ DESIGNER BACKSPLASH AND A BREAKFAST BAR!\n✔️BAMBOO HARWOOD FLOORING!\n✔️SPACIOUS ROOMS!\n✔️A LARGE LIVING ROOM!\n✔️MASTER BEDROOM W\/ ITS OWN PRIVATE BATHROOM\n✔️LOTS OF NATURAL LIGHT\n✔️DESIGNER BATHROOMS W\/ CUSTOM TILE WORK\n✔️SEMI - FINISHED BASEMENT\n✔️WASHER\/DRYER HOOK UP\n✔️FRONT PORCH\n✔️CONVENIETLY LOCATED\n✔️CLOSE TO PUBLIC TRANSIT\n✔️EASY ACCESS TO MAJOR ROADS\n✔️THIS PROPERTY WILL NOT LAST LONG, APPLY TODAY!\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3 months rent to move in. (1 months rent and 2 months security)\n- The tenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\n***Please apply online at https:\/\/redblock.com\/apartment\/\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\nTags: 3 bedrooms, 3BR, house, REDBLOCK, REDBLOCK REALTY INC, RED BLOCK REALTY, West Oak Lane, spacious, large, big house, West Oak Lane, East Oak Lane, Belfield, Germantown, Stenton, La Mott, Ashbourne, Pennsylvania Department of Transportation - Drivers License Center, W. Oak Lane, Rowen William School, Gratz College, Albert Career School, Community College of Philadelphia - Northwest Regional Center, 19126, 19138, 19124, 19141, 19144, 19150, #nata\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,212\nRental Terms\nRent: $1,900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,800.00\n\nPet Policy\nCats allowed\nDogs not allowed","num_images":12,"lat":40.049406,"lng":-75.152493,"attrs":"['3BR \/ 2Ba', '1212ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:14:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/morrisville-finally-available-huge-one\/7498063370.html","post_id":7498063370,"result_date":"2022-06-18 09:18","title":"Finally Available Huge One bedroom Luxury Loft  Won't Last","description":"Beautiful non- smoking private entrance community will be unrecognizable in 2022with amenities galore coming for you to enjoy! Beautiful outdoor spaces, fire pits, pool decks, grilling, lounge seating and so much more!\nWatch the club house be transformed to a state of the art entertainment center for residents to enjoy as an extension of their home!All of this and we haven't even mentioned the amazing apartment homes!\nBe the first to take advantage of new construction prices with quartz countertops, glass showers, deep tubs and beautiful hard surface flooring.\n","num_images":8,"lat":40.2084,"lng":-74.8291,"attrs":"['1BR \/ 1Ba', '1120ft2', '\\nsaturday 2022-06-18\\n', '\\nmonday 2022-06-20\\n', '\\nwednesday 2022-06-22\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'loft', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:14:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-modern-3br\/7498062116.html","post_id":7498062116,"result_date":"2022-06-18 09:14","title":"Newly Renovated MODERN 3BR in booming Brewerytown!","description":"Newly Renovated MODERN 3BR in booming Brewerytown\nProperty Address\n2312 W Thompson Street | Philadelphia, PA 19121\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ NEW! BEST VALUE APARTMENT! ⭐⭐⭐\n✔️ NEW! SPACIOUS 3 BEDROOMS AND 2 BATHS HOME IN BREWERYTOWN\n✔️ NEW! GRANITE COUNTERTOP KITCHEN\n✔️ NEW! CUSTOM BACKSPLASH AND FLOOR TILES\n✔️ NEW! MODERN PARQUET FLOORING\n✔️ NEW! DESIGNER PAINTER COLORS\n✔️ NEW! CUSTOM TILED BATHROOM W\/ ALL-NEW VANITIES\n✔️ NEW! CENTRAL AIR\n✔️ WASHER\/DRYER HOOKUP\n✔️ BACKYARD\n✔️ FINISHED BASEMENT\n✔️ ALL ELECTRIC\n✔️ CLOSE TO PUBLIC TRANSPORTATION!\n✔️ EASY ACCESS TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO AND FROM THE CITY!\n✔️ APPLY TODAY!!!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- Tenant pays all own utilities\n*** Build your credit! We report rent payments to Experian! ***\n*** Please apply online at https:\/\/redblock.com ***\nVIRTUAL TOUR:  https:\/\/my.matterport.com\/show\/?m=SFUoEj4haDk\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,200\nRental Terms\nRent: $1,900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3,800.00\n\n#nata\n","num_images":21,"lat":39.97512,"lng":-75.173886,"attrs":"['3BR \/ 2Ba', '1200ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:10:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-renovations-bed\/7498061996.html","post_id":7498061996,"result_date":"2022-06-18 09:14","title":"BRAND-NEW RENOVATIONS! 2 bed\/1 BATH HOUSE! AVAILABLE NOW!","description":"BEAUTIFUL 2 Bedroom\/ 1 Bathroom Available Now in! This 2 bedroom, 1 bath home is loaded with character. The first floor features original hardwood flooring, a spacious living room, dining room, kitchen with gas oven\/stove, laundry room with washer\/dryer, as well as a lovely front porch and garden area. The upstairs continues with the original hardwood, and features the two bedrooms and 1 bath as well as hallway closet storage. The room flows into an open kitchen with granite countertops, stainless steel appliances, and ample cabinet space, where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. Im a Non-smoker, I have no pets but Im ok if you have them. I don't do drugs or party. Im a quiet person. Im a live in Caregiver for an elderly and stay with her 4 days a week. Im off Tues-Thursday every week. So I would only be home 3 days a week. I would prefer furnished if possible. Im looking to pay around $600 per month utilities included and would perfer month-to-month if possible but plan to stay for a year or more if its good for you. Feel free to email me or ask any questions. I am a 20 year old Latino partnered with a 26 year old latino. We are a gay couple, family oriented, clean, busy college students, and full time workers. Most of our time would be spent commuting and\/or attending work and\/or school. We are super quiet, clean, simple, and drama free, just looking to live with quiet, nice folk, looking for about $750\/month. If you're interested or would like to know more from either one of us please feel free to reach out to me.If you are interested please text me here-  show contact info","num_images":3,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:10:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7498060527.html","post_id":7498060527,"result_date":"2022-06-18 09:09","title":"SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN OGONTZ!","description":"SPACIOUS 1 BEDROOM & 1 BATH APARTMENT LOCATED IN OGONTZ!\nProperty Address\n1526 W Grange Ave | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ UPDATED, 1 BEDROOM & 1 BATH APARTMENT LOCATED IN OGONTZ!\n✔️ OPEN LAYOUT\n✔️ SPACIOUS KITCHEN\n✔️ SPACIOUS BEDROOM\n✔️ LAMINATE FLOORING\n✔️ LARGE CLOSETS\n✔️ LOTS OF NATURAL LIGHT\n✔️ ALL-ELECTRIC\n✔️ CUSTOM BATHROOM TILES\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\nVirtual tour\nhttps:\/\/my.matterport.com\/show\/?m=pyB5PLfGNLG\nDETAILS:\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- The tenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\n***Please apply online at https:\/\/redblock.com\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\ntags: redblock realty, red block, septa, 1BD, 1 bedroom, La salle University, Ogontz, Mount airy, Logan, Germantown, Olney, brand new, route 309, spacious, cozy, nice, buses, schools, Philadelphia, broad st, Kembel park, Albert Einstein Medical Center, Pennsylvania College of Optometry, SEPTA, commuter, Fern rock, Gratz College, 19144, 19141, 19138, 19126, 19120, #nata\n\nAmenities\n1BR\n1BA\n1 bedroom\n1 bath\nStove\nrefrigerator\nmicrowave\nCable ready\nDetails\nBeds\/Baths: 1BD\/1.0BA\nSquare Feet: 700\nRental Terms\nRent: $950.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,900.00\n","num_images":7,"lat":40.041456,"lng":-75.146421,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T09:05:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-old-city-bedroom-loft-apt\/7498059628.html","post_id":7498059628,"result_date":"2022-06-18 09:06","title":"Old City 3 Bedroom LOFT apt","description":"Keyed elevator opens into your Old City loft duplex. 2500 sf of living space. New to market.\nEmail Joe to learn more details and submit application .\nBeautifully Furnished Historic Loft in Center City-Old City neighborhood. Next Door to all shopping, nightlife, & Metro. 2 blocks from Liberty Bell & NYC Megabus to Manhattan, Philly Tour Bus and Museums.\nAvailable for Long Term or Monthly rentals.\nUpdated kitchens, bathrooms, and interior!\nYou will be just steps away from the Market Frankford Line's 2nd Street Station, Dozens of Restaurants, 5 min Walk to Penns Landing waterfront, 5 minute Uber to the Rivers Casino.\nThe unit is a 3 bedroom 3.5 bathroom 2400 ft in the heart of old city Philadelphia.\nNear the intersection of Market and Strawberry street. Steps (3 min walk) to the market Frankfort blue line subway, steps from all the nightlife and restaurants, cvs, and other attractions.\nClimate control in every room. Utilities Not included ( Electric, Water, Gas,).\nlocated in Philadelphia County and the 19106 ZIP Code.\nThis area is served by the Philadelphia City School District attendance zone.","num_images":3,"lat":39.9495,"lng":-75.1438,"attrs":"['3BR \/ 3.5Ba', '2500ft2', 'air conditioning', 'application fee details: $50.', 'loft', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-18T09:02:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-studio-apt\/7498056577.html","post_id":7498056577,"result_date":"2022-06-18 08:55","title":"STUDIO APT","description":"AVAILABLE FOR VIEWING ON SUNDAY JUNE 19 AFTER 3PM\nlarge, airy studio350 sqs. ft.  on quiet st\nfull kitchen nice bath, bright, lots of windows\nheat and hot water included. one window A\/C included\n800.00\/mo.  first, last and one months security required\n35.00 non-refundable credit,eviction check required\nAvailable July 1.","num_images":8,"lat":40.020116,"lng":-75.213327,"attrs":"['1BR \/ 1Ba', '350ft2', 'available jul 1', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-18T08:51:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-br-with-parking\/7498038643.html","post_id":7498038643,"result_date":"2022-06-18 07:27","title":"Gorgeous 1 BR with PARKING & utilities included","description":"Act fast, not many places like this.  Lots of character in this recently renovated 2nd floor apartment. Beautiful new kitchen, bathroom and hardwood floors with exposed brick make it feel like a NY loft style apartment.  You have your own full size washer and dryer and area for storage in the secure basement and designated parking in the rear parking lot for one car.  You'll also have fabulous neighbors. :)  Rent includes all utilities and parking. Hablamos español también.","num_images":9,"lat":40.034649,"lng":-75.219345,"attrs":"['1BR \/ 1Ba', '750ft2', 'available jun 24', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-18T07:23:34-0400"},{"url":"https:\/\/southjersey.craigslist.org\/apa\/d\/camden-stop-renting-start-owning\/7498367494.html","post_id":7498367494,"result_date":"2022-06-18 21:48","title":"Stop Renting🛑 Start OWNING!","description":"Many renters think they don’t have enough money to buy a house when in reality if you’re paying $1000 or more in rent, then you may qualify for a mortgage and buy a home.\nOwning a home has so many benefits! One of them being that your monthly payment goes toward something valuable and you gain equity in your home! When you’re renting, you’re making your landlord  richer and paying his\/her bills.\nIf you’re considering purchasing a home or want to know more about the home buying process feel free to reach out to me!\nKaylin Williams, REALTOR®\nC📲:  show contact info\nO☎️:  show contact info\nKeller Williams Realty, Washington Twp\n381 Egg Harbor Rd Suite 200 Sewell, NJ 08080\nKaylinwilliams.kw.com\n","num_images":1,"lat":39.9186,"lng":-75.1078,"attrs":"['0BR \/ splitBa', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T21:44:24-0400"},{"url":"https:\/\/delaware.craigslist.org\/apa\/d\/wilmington-welcome-to-14-murphy-road-in\/7498349995.html","post_id":7498349995,"result_date":"2022-06-18 20:40","title":"+++WELCOME TO 14 MURPHY ROAD IN DEERHURST!++++","description":"This beautiful three bedrooms two bath home is open for rent! The home has hardwood floors in the living and dining room and granite counters in the Kitchen. The home has three large bedrooms on the second level with a full bath on the second floor. There is a second full bath on the main floor. The home also includes a one-car garage for parking or storage. The driveway is shared. The backyard is private and great for entertaining! House located close to I-95, Route 202, and close to many popular destinations in the Wilmington area, roughly 30 minutes away from Philadelphia. Text :-  show contact info\nfor more inquiry (please include your e-mail and the house address you inquire on for the best response).","num_images":1,"lat":39.7994,"lng":-75.5317,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T20:31:38-0400"},{"url":"https:\/\/allentown.craigslist.org\/apa\/d\/bethlehem-nice-bedroom-and-bathroom\/7498328856.html","post_id":7498328856,"result_date":"2022-06-18 20:00","title":"NICE 2 bedroom and 1 bathroom boutique apt Allentown","description":"NICE 2 bedroom and 1 bathroom boutique apt Allentown -Enjoy super low energy bills This beautiful three bedroom Fulton Hill home on a corner lot is available now!!, I have home furniture, kitchen, dining table, microwave, I am quiet, respectful,honest, trustworthy. Right now I live in No. The house is clean and quiet. It is professionally cleaned 2 times a month. all new windows with granite window sills, hardwood cherry floors throughout,updated kitchen with granite,new cabinets and stainless steel appliances, upgraded bathroom with new vanity, new toilet and tiled shower\/tub combo; inside laundry with washer and dryer included.The room flows into an open kitchen with granite countertops, stainless steel appliances,and ample cabinet space,where you'll be able to cook like a chef while entertaining your guests. Looking for a room to rent by August. I work in San Marino and would like to live close to work. Im flexible on location as long as its not too far away. I'm single and gay. We are super quiet, clean, simple, and drama free, just looking to live with quiet, nice folk, looking for about $750\/month. If you're interested or would like to know more from either one of us please feel free to reach out to me.\nIf you are interested please send me your number.\n","num_images":8,"lat":40.5891,"lng":-75.4645,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-18T19:20:42-0400"}]