[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-with-laundry\/7493290080.html","post_id":7493290080,"result_date":"2022-06-06 23:11","title":"Large 2 Bedroom with Laundry in Brewerytown","description":"Spacious 2 bedroom with LAUNDRY in Brewerytown. This unit occupies the entire 2nd floor of the building, centrally located on Girard Ave. Perfect for roommates, a couple or individual","num_images":12.0,"lat":39.974571,"lng":-75.182705,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-06T23:07:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bi-level-bed-in\/7493287922.html","post_id":7493287922,"result_date":"2022-06-06 23:02","title":"Large Bi-Level 2 Bed in Brewerytown with Laundry and Central Air","description":"Large, Renovated 2 Bedroom bi-level apartment in great location in Brewerytown, with many windows for plenty of NATURAL LIGHT. The apartment includes CENTRAL AIR, HARDWOOD FLOORS, LAUNDRY and plenty of STORAGE SPACE. Pet friendly","num_images":21.0,"lat":39.974193,"lng":-75.17983,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available aug 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-06T22:58:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/woodlyn-widener-university-housing\/7493284890.html","post_id":7493284890,"result_date":"2022-06-06 22:49","title":"Widener University Housing","description":"Hello- JUST AVAILABLE!\nWidener Student Only.\n3 bedrooms 2 bathrooms\nNo PETS AT. ALL\nwasher\/ dryer\nliving room\ndining room\nkitchen\nfreshly painted\nPlenty of Parking\nnew hot water heater\nnew roof\nnew heater\nrehabbed in 2020.\nAvailable 6\/15\/2022- 6\/1\/2023\n","num_images":12.0,"lat":39.865212,"lng":-75.356034,"attrs":"['3BR \/ 1.5Ba', 'available jul 1', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T22:45:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/oliver-bedroom-bath-house-unfurnished\/7493277564.html","post_id":7493277564,"result_date":"2022-06-06 22:18","title":"2 bedroom 1 bath house Unfurnished for rent","description":"Located in a nice and quite neighborhood, (North Union Township-Oliver area,\nLaurel Highlands School District) and Clark Elementary School District.\nNo pets & not HUD approved, Rental application, credit and background checks required.\nWasher and Dryer hookups in the basement parking in the rear drive way.\nNew metal roof and new flooring. New Gas furnace heating unit.\n$750 first month's rent + $750 Security deposit required.\nUtilities not included, Landlord pay for Disposal and Sewage Service.\nIf you are interested please contact the landlord with your name and number.\nStove and Refrigerator are not included.\n","num_images":17.0,"lat":39.910814,"lng":-79.712688,"attrs":"['2BR \/ 1Ba', '875ft2', 'available now', 'house', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T22:14:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-unit-has-it-all\/7493265479.html","post_id":7493265479,"result_date":"2022-06-06 21:51","title":"This unit has it all, nicely wrapped up in a cozy package.","description":"Lots of natural light, high ceilings, oversized windows, architectural details, original natural wood floors, contemporary open floor plan--. this unit has it all, nicely wrapped up in a cozy package! The cozy residence stuns with its abundance of light flowing through the amazing windows that border the west wall, a feature that defines the space with breadth and design. The kitchen is an attractive, functional eating area with white cabinetry, stainless steel appliances granite counters and bar stools for casual seating. The living room, accented with high ceilings and lovely floors, feels surprisingly spacious, offering a comfortable seating and entertaining space. A dedicated, king-sized bedroom is accessed through the adjoining doorway, also accented with those amazing windows and a nice sized closet. A decorative column is a showcase of the original building and sits in a hallway that defines the entrance. A retro-designed bathroom with handsome black and white floor tiles, a tub\/shower combo with a sliding glass door and white vanity with black granite counter sits conveniently off the entryway. Located in the historic district of Old City, 315 Arch is a well maintained, stately structure located across from the Quaker Meeting House and next to the Ben Franklin key sculpture and fountain park. Old City is a vibrant neighborhood, home to cultural and historic institutions, numerous cafes and restaurants, boutiques and design shops. It is a hub of public transportation with easy access within and out of the city. Truly an urban oasis for the ultimate urban lifestyle!","num_images":5.0,"lat":39.952234,"lng":-75.145713,"attrs":"['1BR \/ 1Ba', '586ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T21:31:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-ground-floor-studio-with\/7493269501.html","post_id":7493269501,"result_date":"2022-06-06 21:50","title":"Ground Floor Studio with Private Yard at 2209 Walnut Street!","description":"Available to lease starting July 8th - August 1st!\nCall or text Annie at  show contact info\nwith any questions or to set up a showing!\nWe only require the security deposit and first month's rent to move in (no last month's rent upfront!) 640 credit score required. Other requirements apply. Cosigners accepted!\nThis ground floor studio is located in the back of a wonderful walk up building in Rittenhouse. It features a large private backyard, air conditioning, separate kitchen, and HW floors. Shared laundry is located in the building.\nIdeal location, easy access to Rittenhouse Square Park and the Schuylkill River Park, fine restaurants, shopping, transportation, the river, the walking and bike trails to Kelly Drive. Close to University City, Trader Joes, Rittenhouse Square Park, 30th Street Station, and the Schuylkill River. Easy access to public transportation!\nWe are pet friendly! No breed or weight restrictions - just a one-time fee of $250\/pet. Water is included in the rent. Only security deposit and first month's rent needed to move in! Credit requirements apply.\nAddress: 2209 Walnut Street #LL\nThis property is professionally managed by AMC Delancey Group.\nContact Annie to schedule a showing!\nAnnie Oliver\nAMC Delancey\nshow contact info\n- text me!\n","num_images":5.0,"lat":39.950975,"lng":-75.177417,"attrs":"['0BR \/ 1Ba', 'available jul 8', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-06-06T21:46:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-modern-bed-in-art\/7493268778.html","post_id":7493268778,"result_date":"2022-06-06 21:47","title":"Bright, modern 2 bed in Art Museum area","description":"Bright, modern 2 bedroom apartment on one of the Art Museum area’s nicest blocks!\nLots of natural light, spacious feel.\nNice size kitchen w\/ self-cleaning oven, oak cabinets, full size refrigerator.\nW\/W carpet, Central Air, Full size Washer\/Dryer on site, large bathroom.\nVideo intercom system.\nNo pets, non-smoker.\nAvailable August 20.\nClose to everything that the area offers - Museums, the Benj. Franklin Parkway, Whole Foods, etc.\nEasy access to public transportation.\nCall 9AM – 8PM for more info or an appointment to view.\n","num_images":11.0,"lat":39.964975,"lng":-75.17068,"attrs":"['2BR \/ 1Ba', '900ft2', 'available aug 20', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T21:43:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1bedroom-apartment\/7493268751.html","post_id":7493268751,"result_date":"2022-06-06 21:47","title":"1bedroom apartment","description":"Enter thru kitchen has separate living room, 1 bathroom and 1 bedroom. Apartment is located on 2nd floor.  Required to move in proof of income for past 90 days. Reference from current landlord. 2 security and 1st month rent. Total $2700.  And credit check.","num_images":6.0,"lat":39.99241,"lng":-75.097046,"attrs":"['1BR \/ 1Ba', 'available now', 'application fee details: Credit check', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T21:43:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/doylestown-enjoy-the-sunny-eat-in\/7493257915.html","post_id":7493257915,"result_date":"2022-06-06 21:46","title":"Enjoy the sunny eat-in kitchen with brand new garbage disposal.","description":"This 2nd floor home has had many recent upgrades including a stunning completely remodeled bathroom. There are hardwood floors throughout, new window blinds and ceiling fans in every room. Enjoy the sunny eat-in kitchen with brand new garbage disposal, stainless steel in unit washer\/dryer and large breakfast bar overlooking spacious living room. The oversized, light filled main bedroom with dual closets (one being a walk in) has ample space to set up a home office within. Three additional closets provide generous amounts of storage space. This home includes dedicated parking and is within walking distance to train station, shopping, theatre, parks, museums and restaurants.","num_images":16.0,"lat":40.301783,"lng":-75.128468,"attrs":"['1BR \/ 1Ba', '888ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T21:06:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/hatboro-adorable-bedroom-bath-bungalow\/7493255153.html","post_id":7493255153,"result_date":"2022-06-06 21:28","title":"adorable 1 bedroom 1 bath bungalow","description":"Once you step foot onto the welcoming front porch of this adorable 1 bedroom 1 bath bungalow you will feel right at home. Take a moment and picture yourself on the porch swing with the hydrangeas fully in bloom you won't want to get up!! Inside the front door is a large open living \/ dining room with beautiful hardwood floors. This opens right up to the kitchen that has access to the fully fenced in rear yard, complete with a shed. Both bedrooms and are also on this level separated by the bath. The partially finished basement offers a living area with a wet bar and large closet for storage in addition to a separate laundry area and a workshop. There is also access to the backyard from here which is fully fenced in","num_images":11.0,"lat":40.171201,"lng":-75.126225,"attrs":"['1BR \/ 1Ba', '748ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'duplex', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T20:57:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/haverford-bedroom-bath-apartment-1200-sq\/7493261842.html","post_id":7493261842,"result_date":"2022-06-06 21:23","title":"2 Bedroom 1 Bath Apartment 1200 sq'","description":"Completely renovated 2 bedroom 1 bath apartment on second floor in Haverford. Unit is not handicap accessible.\nPrivate entrance. 2 parking spaces included.\nFull size washer dryer stack. Brand new, high end, stainless steel appliances include a 36\" refrigerator with water and ice maker, 30\" 5 burner range with convection oven and microwave. Deep stainless steel sink with garbage disposal. Granite countertops. Tiled backsplash.\nBeautifully tiled walk-in shower. Lots of storage and shelving in bathroom.\nSpacious floor plan. Rich wood floors. Great closet space. Ceiling fans.\nCentral HVAC.\nTwo minute walk to Norristown high speed line, centrally located 1\/2 mile from downtown Bryn Mawr, Haverford and Ardmore shopping areas.\n$1,975 per month plus utilities.\nBy appointment only, phone calls only please.","num_images":22.0,"lat":40.00915,"lng":-75.314045,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available jul 1', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T21:19:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/feasterville-trevose-updated-remodeled\/7493257762.html","post_id":7493257762,"result_date":"2022-06-06 21:22","title":"Updated remodeled full hall Bath.","description":"Nice Rancher, Move In Ready, Priced to Sell! Award Winning Neshaminy School District! Nice Large Living rm. , Eat-in Kitchen with lots of cabinets, back door to covered side porches, perfect for relaxing! Nice very generous size master bedroom, ! Updated remodeled full hall Bath. Double your living space with a full finished walk-out basement great for entertaining with a custom built bar, separate office, plus laundry rm. and storage space.","num_images":11.0,"lat":40.1554,"lng":-74.972832,"attrs":"['1BR \/ 1Ba', '999ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T21:06:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/salfordville-rare-opportunity-in\/7493257825.html","post_id":7493257825,"result_date":"2022-06-06 21:17","title":"A rare opportunity in desirable Upper Salford township.","description":"A rare opportunity in desirable Upper Salford township. Nearly an acre and a half partially wooded lot and a property that's a true gem! Enter through the tile foyer complete with office alcove to a spacious great room featuring a 12 foot vaulted ceiling, an energy efficient tankless hot water heater, and wood-frame Pella windows to enjoy scenic views of the neighboring pasture. The kitchen is complete with custom maple cabinets, stainless steel appliances, granite counters, built-in microwave. under-cabinet lighting, huge pantry, and gas cooking that home chefs wish for! French doors lead to the master bedroom with roomy walk-in closet, and access to the versatile loft area","num_images":13.0,"lat":40.29416,"lng":-75.432388,"attrs":"['1BR \/ 1Ba', '805ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T21:06:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enjoy-the-easy-access-to\/7493254897.html","post_id":7493254897,"result_date":"2022-06-06 21:12","title":"Enjoy the easy access to Penn's Landing and show visitors a good time","description":"steps away from the city's best restaurants, cafes, galleries, and shops resides this picture perfect one bedroom condo. Residence 502 is a sun-drenched top-floor, corner residence in the Historic Wireworks condominium building. Welcome to this well-appointed home boasting gleaming laminate hardwoods, recessed lighting, high ceilings, exposed brick + ductwork, and large windows overlooking the Benjamin Franklin Bridge with an eastern exposure. The clean white kitchen features an island perfect for cooking and dining, and is open to the living area. On the other side of the home you’ll find the spacious bedroom with direct access to the tiled bathroom, ample closet space, and in-unit laundry. The Wireworks common areas include a secured entrance, storage lockers, elevator access, a bike room, and recently updated lobby. Enjoy the easy access to Penn's Landing and show visitors a good time by the water at Cherry St Pier, Morgans Pier, Fringe Arts, and Spruce Street Harbor Park. Head to Sassafras Market, Cafe Ole, Race Street Cafe or any of the other nearby unique restaurants, boutiques and art galleries. A short stroll to the Market Street subway line to zip around the city with quickness and ease.","num_images":13.0,"lat":39.954007,"lng":-75.14484,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T20:56:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/willow-grove-charming-ranch-home-that\/7493255028.html","post_id":7493255028,"result_date":"2022-06-06 21:11","title":"a charming ranch home that is meticulously maintained.","description":"Welcome to 210 Ellis Road, a charming ranch home that is meticulously maintained and nestled on a quiet street in Upper Moreland. This sunny 1 bedroom residence features a brand new roof\/siding, gleaming hard woods, a stone fireplace, and a 3-season family room. The front walkway leads to a cozy living room, featuring a stone fireplace with shiplap mantle, that opens to the dining room with nicely crafted built in cabinetry. The kitchen offers wood cabinets, gas cooking, a built-in pantry, and adjoins the 3-season family room (144 sq. ft) filled with an abundance of natural sunlight and beautiful views of the rear yard.","num_images":17.0,"lat":40.148782,"lng":-75.123664,"attrs":"['1BR \/ 1Ba', '1053ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T20:57:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/colmar-this-exceptional-home-is-located\/7493254974.html","post_id":7493254974,"result_date":"2022-06-06 21:11","title":"This exceptional home is located in a gorgeous setting surroundings.","description":"this house is adorable with loads of character! Every once in a while, that special home comes on the market and we have a cutie for you! This exceptional home is located in a gorgeous setting surrounded by mature landscaping and beautiful perennial gardens. Located on a spacious . 40 acre lot, backing to trees.  This means that you can have your privacy and still have your compact low maintenance lifestyle. This charming, meticulously maintained, move-in ready single floor living home features gorgeous amenities.","num_images":16.0,"lat":40.251277,"lng":-75.266843,"attrs":"['1BR \/ 1Ba', '1000ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T20:57:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-bd-house\/7493021929.html","post_id":7493021929,"result_date":"2022-06-06 12:51","title":"Nice 3 Bd House","description":"Come to see the house. Good location! Good credit is needed!","num_images":4.0,"lat":40.0247,"lng":-75.0518,"attrs":"['3BR \/ 1Ba', 'available jun 15', 'house', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:47:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-apartments-to-cool-down\/7493018725.html","post_id":7493018725,"result_date":"2022-06-06 12:50","title":"Apartments to cool down your summer","description":"Summer is right around the corner, come spend it with us!\nMonthly Rent: 2 Bedrooms start at $1,525 and up\nApplication Fee: $50 per person\nSquare Footage: 610 to 800 Sq Feet\nLease Term: Flexible - Please Inquire!\nIncluded Utilities: Water, Sewer, Trash, Recycle\nTenant Pays: Electric, Cable\/Internet\nSchools: Henry C. Lea Elementary, West Philadelphia High School\nParking: Street Parking is Free\nStorage: Indoor Storage Units Available for $19.99\/month\nUnique Features such as:\n- Online Resident Portal\n- Package Concierge\n- Secure Entry with FOB\n- Enclosed Community Courtyard with gazebo, firepit, lawn games and grill!\n- Individual Climate Control\nOur Amenities include:\n- Loading Zone for all your shopping needs\n- Lobby Staffed 24\/7 with Package Concierge\n- Laundry Card or App Payment for our recently renovated 24\/7 Laundromat located within the building with elevator access on most floors\n- Fully Equipped Fitness Center in Building\n- Recreation Lounge with TV, Games, Vending Machines, & more\nEach Apartment features:\n- fully renovated with spacious granite countertops, modern backsplash, and a large kitchen sink with a garbage disposal\n- stainless steel appliances including a dishwasher, microwave, glass top range, and an upright fridge\/freezer\n- each room's climate is controlled by its own high-efficiency electric heat\/AC unit so no worrying about not being comfortable\n- the flooring is PVC flooring throughout the rooms & tile in the bathroom\nThe neighborhood:\n- Within walking distance to Baltimore Ave., there are a number of cafes, restaurants, shops, co-ops, parks, community gardens, & even a tennis court in the neighborhood to enjoy!\n- There are 2 bus stops within a block and a half (#42 & #21) and the MFL station is just a 10-15 minute stroll.\n- Prefer to bike? We've got you covered with indoor bicycle racks, too!\nPet Policy:\nPets are residents, too!\nTwo pets per apartment.\nBreed & Weight restrictions apply*.\nNon-refundable pet fee of $200\/per pet.\nInterested?\nProperty Management works on-site and is available M-F 9:30A-4:30P. Evening & weekend tours can be arranged with an agent as well. We are also currently offering virtual tours via Facetime. Contact me today to schedule your private tour!\nDon't see your move-in date?\nAsk! We're sure to have something you'll love.\n*All animals must be approved by management prior to move-in and during the course of residency.\nPhotos are of our model apartment.\nAvailability is subject to change rapidly, so contact us ASAP to schedule your\nprivate tour of our available floor plans!\n","num_images":20.0,"lat":39.954293,"lng":-75.219827,"attrs":"['2BR \/ 1Ba', '750ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:41:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-the-best-apartments-in\/7493012522.html","post_id":7493012522,"result_date":"2022-06-06 12:45","title":"The best apartments in town - 506","description":"Your day doesn’t end when the sun goes down, so make sure you enjoy where you live! Come and spend the summer with us.\nAt Croydon Hall Apartments we offer apartments that are perfectly accessorized with stainless steel appliances, granite countertops, spacious layouts, environmentally friendly PVC and tile flooring throughout, self-controlled heating and cooling via PTAC units, and bathrooms equipped with a rainfall showerhead, tying everything together with sleek, modern finishes you'll be sure to love.\nUnique Features\n- Secure Entry with FOB access\n- Online Resident Portal\n- Smoke-Free Building\n- Conference Room\n- Lobby Staffed 24\/7 with Package Concierge\n- Elevator\nApartment 506 - 2 Bedroom, 1 Bath\nMonthly Rent: $1,550.00\nSquare Footage: 650 Sq Ft\nApplication Fee: $50 per applicant\nLease Term: Flexible - Please Enquire!\nIncluded Utilities: Water, Sewer, Trash, Recycle\nTenant Pays: Electric, Cable\/Internet\nSchools: Henry C. Lea Elementary, West Philadelphia High School\nParking: Street Parking is Free\nStorage: Indoor Storage Units Available for $19.99\/month\nCommunity Amenities\n- Recently renovated 24 hour Laundry Room with card or mobile app payment\n- Fully Equipped Fitness Center in Building\n- Recreation Lounge with TV, Games, Vending Machines, & more\n- Playroom for the kiddies\n- Loading Zone out front for all your shopping needs\n- Conference Room\n- Free Bicycle Storage and Free Air for bike tires\n- Enclosed Community Courtyard with gazebo, fire pit, lawn games, and grill!\nPet Policy\nPets are residents, too!\nTwo pets per apartment.\nBreed & Weight restrictions apply*.\nNon-refundable pet fee of $200\/per pet.\nNo pet rent!\nRental Requirements\nAll applicants (18+) go through a background and credit check. Ownership will not accept delinquencies, judgments, evictions, and\/or tenant-landlord issues.\nInterested?\nContact us to schedule a tour! Don't see your move-in date?\nAsk! We're sure to have something you'll love.\n*All animals must be approved by management prior to move-in and during the course of the residency.\nPhotos are of our model apartment.\nAvailability is subject to change rapidly, so contact us ASAP to schedule your\nprivate tour of our available floor plans!","num_images":24.0,"lat":39.954277,"lng":-75.219913,"attrs":"['2BR \/ 1Ba', '650ft2', 'available aug 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:30:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedroom-house-in\/7493017435.html","post_id":7493017435,"result_date":"2022-06-06 12:43","title":"Two Bedroom House in Fishtown For Rent","description":"This is a two bedroom rowhouse in Fishtown available for rent. Full bathroom and and powder room. Close to shops and restaurants on Frankford Ave. Just renovated throughout with updated appliances, hardwood floors, Washer\/Dryer and dishwasher. Outdoor space. Lots of windows, great light.\nOther rehabs coming to market in Northern Liberties, Fairmount, Olde and East Kensington.\nThis property allows some pets with deposit. Tenants pay all utilities except water which is included in the rent.\nPlease email with questions and to schedule a showing.\n1st\/Last\/Security to move in.\nEmail to set up a showing.\n","num_images":5.0,"lat":39.978021,"lng":-75.126164,"attrs":"['2BR \/ 1.5Ba', '1000ft2', 'available jun 15', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:39:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/beautiful-two-bedroom-apartment-with\/7493000639.html","post_id":7493000639,"result_date":"2022-06-06 12:38","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-quartz-countertops-close\/7493013920.html","post_id":7493013920,"result_date":"2022-06-06 12:37","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-fitness-center-pet\/7493011279.html","post_id":7493011279,"result_date":"2022-06-06 12:32","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-leasing-now-pool-and-sundeck\/7493007615.html","post_id":7493007615,"result_date":"2022-06-06 12:26","title":"Leasing Now, Pool and Sundeck, Direct Access Garages","description":"The Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nYou will love living at The Point at Pennbrook Station. From our prime location in Lansdale, PA, you can easily travel to North Wales, Hatfield, Blue Bell, City Center Philadelphia, and the Philadelphia International Airport. Visit us today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, walk-inc lost, laundry room with washer\/dryer, and a private porch!\nApartment Features\n* Full sized Washer and Dryer in unit\n* Refrigerator\n* Disposal\n* Stainless Steel Appliances\n* Granite Countertops\n* Central Heat and Air\n* Wood-Like Floors\n* Dishwasher\n* Microwave","num_images":11.0,"lat":40.226234,"lng":-75.283466,"attrs":"['1BR \/ 1Ba', '852ft2', 'available aug 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:22:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-spacious-modern-living\/7493005797.html","post_id":7493005797,"result_date":"2022-06-06 12:23","title":"Spacious Modern Living","description":"Manchester floor plan — 1,149 sq. ft. — $3,188\nLocated on the 1st floor, this 2-bedroom\/2-bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full sized front-loading washer and dryer, and stainless steel appliances. The large master bedroom is equipped with a private patio, a walk-in closet and a spacious bathroom with double sink vanity and walk in shower. The second bedroom and bathroom are spacious as well! This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!\n","num_images":18.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T12:19:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-spacious-modern-living\/7493003461.html","post_id":7493003461,"result_date":"2022-06-06 12:19","title":"Spacious Modern Living","description":"Manchester floor plan — 1,149 sq. ft. — $3,188\nLocated on the 1st floor, this 2-bedroom\/2-bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full sized front-loading washer and dryer, and stainless steel appliances. The large master bedroom is equipped with a private patio, a walk-in closet and a spacious bathroom with double sink vanity and walk in shower. The second bedroom and bathroom are spacious as well! This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!\n","num_images":18.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T12:15:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-temple-bed-bath-apartment\/7492993224.html","post_id":7492993224,"result_date":"2022-06-06 12:17","title":"Temple U - 2 bed 1 bath Apartment Minutes from Main Campus","description":"Great two bedroom apartment in Temple university area. Right on Broad St. Hardwood Floors throughout, two very spacious bedrooms, nice spacious bath with classic subway tile shower. Cozy open living kitchen area, lots of windows for natural light. Washer and Dryer access in the basement is free. Tall ceilings. Easy access to public transportation, safe block close to everything. Available now!","num_images":15.0,"lat":39.987877,"lng":-75.155934,"attrs":"['2BR \/ 1Ba', '800ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T11:57:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/doylestown-new-gray-carpet-gray-paint\/7493001213.html","post_id":7493001213,"result_date":"2022-06-06 12:15","title":"New Gray Carpet\/Gray Paint, Designer Kit, Elevator, Pool, Gym, Storage","description":"Visit your new apartment home by taking a self-guided tour with Stella today! Please call or email us today to set up your personalized tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday: 8:30 am-5:30 pm. Need to request another time for your personalized visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nLeasing Office Hours:\nMonday thru Friday 8:30 AM-5:30 PM\nSaturday-By Appointment Only\n#246 FEATURES:\n-Third Floor apartment home\n-New Gray Carpet\/Gray Paint\n-New Shower Doors\n-Accent Walls Available\n-Open Floor plan\n-Central Air\n-Dishwasher, Garbage Disposal, Fridge, Microwave, Stove\n-Plush Wall-to-wall Carpets\n-Window Treatments\n-PET-FRIENDLY\/Dog Park\n-Mid-Rise Elevator Building\n-Laundry Facilities on Each Floor\n-Professional Management\n-24-Hour Fitness Center\n-24-Hour Emergency Service\n-On-site Maintenance\n-Intercom System\n-Tennis Court\n-Storage\n-Saltwater Pool\n-BBQ\/Picnic Area\nAt the metropolitan doylestown apartment homes, you'll enjoy 10 beautifully landscaped acres in Historic Borough of Doylestown in Bucks County, PA. Conveniently located close to the Main Street shopping, restaurants, nightlife, and theaters in the Borough of Doylestown. We are also just minutes from the historic towns of New Hope, PA and Princeton, NJ. Doylestown Hospital is within close proximity for nurses and doctors seeking an easy daily commute. Not to mention that we are located in the award-winning Central Bucks School District. Your \"wish list\" of convenience, a quality of life, and attention from our on-site team, the metropolitan doylestown has what you have been looking for. Call today to set an appointment to see your new apartment home. metropolitan doylestown. Apartment homes for living.\nEqual Housing Opportunity\n*Prices subject to change without notice","num_images":10.0,"lat":40.3054,"lng":-75.1489,"attrs":"['2BR \/ 2Ba', '968ft2', 'available jul 21', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:11:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-central-air\/7493000233.html","post_id":7493000233,"result_date":"2022-06-06 12:13","title":"Lease Today, Central Air, Granite Countertops","description":"A pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nCommunity Features\n* Easy Freeway Access\n* Fitness Studio\n* Sun Deck\n* EV Charging\n* Minutes from Restaurants, Shopping, and Much More\n* Billiards\n* Pet Salon\n* Bark Park\n* Playground\n* Swimming Pool\n* Gaming Area","num_images":22.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '965ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:09:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/doylestown-corner-balcony-new-gray\/7492999486.html","post_id":7492999486,"result_date":"2022-06-06 12:12","title":"CORNER BALCONY, New Gray Carpet\/Paint, Gym, Pool, Open Fl Pn, Storage","description":"Visit your new apartment home by taking a self-guided tour with Stella today! Please call or email us today to set up your personalized tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday: 8:30 am-5:30 pm. Need to request another time for your personalized visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nLeasing Office Hours:\nMonday thru Friday 8:30 AM-5:30 PM\nSaturday-By Appointment Only\n#224 FEATURES:\n-Second Floor CORNER BALCONY apartment home\n-New Gray Carpet\/Gray Paint\n-Accent Walls Available\n-Open Floor plan\n-Central Air\n-Dishwasher, Garbage Disposal, Fridge, Microwave, Stove\n-Plush Wall-to-wall Carpets\n-Window Treatments\n-PET-FRIENDLY\/Dog Park\n-Mid-Rise Elevator Building\n-Laundry Facilities on Each Floor\n-Professional Management\n-24-Hour Fitness Center\n-24-Hour Emergency Service\n-On-site Maintenance\n-Intercom System\n-Tennis Court\n-Storage\n-Saltwater Pool\n-BBQ\/Picnic Area\nAt the metropolitan doylestown apartment homes, you'll enjoy 10 beautifully landscaped acres in Historic Borough of Doylestown in Bucks County, PA. Conveniently located close to the Main Street shopping, restaurants, nightlife, and theaters in the Borough of Doylestown. We are also just minutes from the historic towns of New Hope, PA and Princeton, NJ. Doylestown Hospital is within close proximity for nurses and doctors seeking an easy daily commute. Not to mention that we are located in the award-winning Central Bucks School District. Your \"wish list\" of convenience, a quality of life, and attention from our on-site team, the metropolitan doylestown has what you have been looking for. Call today to set an appointment to see your new apartment home. metropolitan doylestown. Apartment homes for living.\nEqual Housing Opportunity\n*Prices subject to change without notice\n","num_images":10.0,"lat":40.3054,"lng":-75.1489,"attrs":"['2BR \/ 2Ba', '968ft2', 'available aug 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:08:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-temple-university-main\/7492988538.html","post_id":7492988538,"result_date":"2022-06-06 12:11","title":"Temple University - Main Campus - 2 Bedroom Apartment","description":"This beautifully renovated apartment is fresh and ready for you! The Temple University section of the city is an awesome and comfortable place for living. The apartment features two bedrooms and one full bathroom with high ceilings. There is beautiful new solid hardwood oak flooring throughout. The unit features a central air heat system. For your convenience, there is a laundry room in the basement with a washer\/dryer on site. Lastly, there is a beautiful large enclosed backyard that makes outdoor entertaining fantastic. This space would also be great for pets. Public transportation is easily accessible and just one block away from the Susquehanna-Dauphin Station on the Broad Street Line. Come to see this!!!","num_images":9.0,"lat":39.987877,"lng":-75.155934,"attrs":"['2BR \/ 1Ba', '800ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T11:49:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-mail-room-lease-today\/7492997356.html","post_id":7492997356,"result_date":"2022-06-06 12:08","title":"Mail Room, Lease Today, Professionally Managed","description":"When you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, Den, washer\/dryer, walk-in closet, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Garden Tub\n* Stainless Steel Appliances\n* Kitchen Island\n* Private Patio or Private Balcony (on select apartments)\n* Linen Closet\n* Washer and Dryer in unit\n* Walk-in Closet\nCommunity Features\n* Sun Deck\n* Community Lounge\n* TV Lounge\n* Billiards\n* Swimming Pool\n* Outdoor Grill Area\n* Pet Salon\n* Fitness Studio\n* Yoga Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access\n* Bark Park\n* Spa\n* Professionally Managed","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '879ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:04:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-temple-university-main\/7492990920.html","post_id":7492990920,"result_date":"2022-06-06 12:08","title":"Temple University - Main Campus - Cozy 2 Bedroom Apartment","description":"Great two bedroom apartment in Temple university area. Right on Broad St. Hardwood Floors throughout, two very spacious bedrooms, nice spacious bath with classic subway tile shower. Cozy open living kitchen area, lots of windows for natural light. Washer and Dryer access in the basement is free. Tall ceilings. Easy access to public transportation, safe block close to everything. Available June 15th.","num_images":5.0,"lat":39.987877,"lng":-75.155934,"attrs":"['2BR \/ 1Ba', '800ft2', 'available jun 15', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T11:53:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fishtown-norris-square-bed\/7492997142.html","post_id":7492997142,"result_date":"2022-06-06 12:08","title":"Fishtown\/Norris Square - 3 bed 2 bath Apartment","description":"Amazing New Renovation 3 bed 2 bath apartment available August 1st. This property features all new everything including central air, washer dryer, stainless appliances, high powered garbage disposal, 9 foot ceilings, natural light, spacious bedrooms, full roof deck with Center City and BF Bridge views, spa shower, and a wide open an spacious floor plan . The apartment is secure, the block is very safe with a daycare leaving open access parking in the evenings. There is almost always parking in front of the property. Beautiful sunset views, the roof deck is HUGE, pet friendly, hardwood floors throughout, exposed brick, solid core doors, high end trim, and less than one block away from the very well kept Norris Square Park. Close to Fishtown, Northern Liberties, Public Transportation, I95, and Ben Franklin Bridge. Virtual tours available upon request. unchecked details in photos to be detailed prior to move in. Security and Fire safety has been detailed for the building. Available August 1st!","num_images":24.0,"lat":39.981887,"lng":-75.13487,"attrs":"['3BR \/ 2Ba', '1200ft2', 'available aug 1', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:04:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/doylestown-close-to-laundry-rm-entrance\/7492997148.html","post_id":7492997148,"result_date":"2022-06-06 12:08","title":"Close to Laundry Rm & Entrance, Elevator, Pool, Gym, Central Air","description":"Visit your new apartment home by taking a self-guided tour with Stella today! Please call or email us today to set up your personalized tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday: 8:30 am-5:30 pm. Need to request another time for your personalized visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nLeasing Office Hours:\nMonday thru Friday 8:30 AM-5:30 PM\nSaturday-By Appointment Only\n#118 FEATURES:\n-Second Floor apartment home\n-Close to Elevator & Laundry Room\n-Gray Carpet\/Paint\n-Accent Walls Available\n-Open Floor plan\n-Central Air\n-Dishwasher, Garbage Disposal, Fridge, Microwave, Stove\n-Plush Wall-to-wall Carpets\n-Window Treatments\n-PET-FRIENDLY\/Dog Park\n-Mid-Rise Elevator Building\n-Laundry Facilities on Each Floor\n-Professional Management\n-24-Hour Fitness Center\n-24-Hour Emergency Service\n-On-site Maintenance\n-Intercom System\n-Tennis Court\n-Storage\n-Saltwater Pool\n-BBQ\/Picnic Area\nAt the metropolitan doylestown apartment homes, you'll enjoy 10 beautifully landscaped acres in Historic Borough of Doylestown in Bucks County, PA. Conveniently located close to the Main Street shopping, restaurants, nightlife, and theaters in the Borough of Doylestown. We are also just minutes from the historic towns of New Hope, PA and Princeton, NJ. Doylestown Hospital is within close proximity for nurses and doctors seeking an easy daily commute. Not to mention that we are located in the award-winning Central Bucks School District. Your \"wish list\" of convenience, a quality of life, and attention from our on-site team, the metropolitan doylestown has what you have been looking for. Call today to set an appointment to see your new apartment home. metropolitan doylestown. Apartment homes for living.\nEqual Housing Opportunity\n*Prices subject to change without notice\n","num_images":10.0,"lat":40.3054,"lng":-75.1489,"attrs":"['1BR \/ 1Ba', '748ft2', 'available sep 15', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:04:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-clean-bedroom-bathrooms-in\/7492991605.html","post_id":7492991605,"result_date":"2022-06-06 11:59","title":"clean 3 bedroom 2 Bathrooms in downtown Philadelphia","description":"Built to fit your lifestyle, The Ledger is the effortless blend of home and community located in the heart of Center City. Designed for living, working, and playing, our complete list of amenities includes lifestyle bonuses for you and your pet.\nPrivate garage and more.\nTwo parking spots in the garage\nCost is for the entire apartment.\nCall or text (2 one 5) 403-3732\n","num_images":23.0,"lat":39.948256,"lng":-75.149353,"attrs":"['3BR \/ 2Ba', '1244ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T11:55:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-looking-to-move-in-asap\/7492982066.html","post_id":7492982066,"result_date":"2022-06-06 11:41","title":"Looking to Move in ASAP? Beautiful 1 Bedroom Available!","description":"Welcome Home to Chestnut Hill Village *Private Entry.*Septa Train Station in Backyard.*Patio\/Balcony Area.  Call Now:  show contact info\nx 1OR Text 1 to  show contact info\nto chat!Follow The Link Below:https:\/\/cl.greystar.com\/8a8u2u This is a 1 Bedroom, 1 Bath, approximately 585 Sq. Ft. Features - Garbage Disposal  - Wood Plank Flooring  - All New Stainless Steel Appliances!!  - Air Conditioning Units *Dishwasher *Refrigerator *Microwave Community Amenities - Movie Screening Room  - Elevator  - Fitness Center  - Smart Package 365  - Controlled Access Building  - Swimming Pool  - Near Public Transportation  - Smoke-Free  - On-site Recycling  - Guarantors Welcome  - Clubhouse  - Wi-Fi in Common Areas  - Playground  - Barbecue Area  - Visual and Voice Intercom  - Business Center Pet Policy Pets are residents, too!Two pets per apartmentBreed restrictions apply*No weight restrictionsNon-refundable pet fee of $350 per petMonthly pet rent of $30 or $40, depending on size Office Hours Monday-Friday:9:00AM-6:00PMSaturday:10:00AM-5:00PMChestnut Hill Village  7715 Crittenden St, Philadelphia, PA, 19118OtRNA9ox\n","num_images":5.0,"lat":40.0723,"lng":-75.2034,"attrs":"['1BR \/ 1Ba', '585ft2', 'available now', '\\nmonday 2022-06-06\\n', '\\ntuesday 2022-06-07\\n', '\\nwednesday 2022-06-08\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T11:37:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1400ft2-townhome-on-the\/7492959946.html","post_id":7492959946,"result_date":"2022-06-06 11:33","title":"&1400ft2 - Townhome on the Golf Course in Drexel Park*3100 Powelton Av","description":"This beautifully remodeled 3\/3 townhome in  Drexel Park Village features a fenced back yard with golf course views, and is located on a quiet cul-de-sac street. The unit has been freshly painted, and includes newer appliances (gas stove), plus tile and vinyl plank flooring throughout (no carpeting at all). Enjoy three large bedrooms and two full bathrooms with about 1,400 sq ft of living space. First floor features one bedroom and one full bathroom. There is a private driveway and a 1 car garage for parking. There is even a large screened patio with golf course views, and a fenced back yard. Washer & dryer hook-ups are present in the garage. This one is a must see!","num_images":6.0,"lat":39.9925,"lng":-75.1133,"attrs":"['3BR \/ 3Ba', '1400ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:58:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-on-site-management-rooftop\/7492967741.html","post_id":7492967741,"result_date":"2022-06-06 11:16","title":"On-Site Management, Rooftop Deck, Window Coverings","description":"Thank you for your interest in leasing an Apartment Home at Lincoln Square!\n\nOur community features Studio through Three Bedroom apartment homes to be leased for terms between 5-months and 15-months.\n\nIn addition to our beautiful apartment homes, our community features an abundance of amenities including our Fitness Center and Yoga Room, Community Lounge Area, Private Movie Theater, a state-of-the-art Golf Simulator and including but not limited to our 50,000 Square Foot Rooftop Deck, which houses a Dog Park, Running Track, remarkable city views and so much more! Bedrooms: 2Bathrooms: 2Square Feet: 1010Date Available: 2022-06-06Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Laundry FacilityRefrigerator with Ice MakerPackage ReceivingStainless Steel AppliancesClose to Public TransportationSoaker TubHeat IncludedSecurity CameraOn-Site ManagementBilliards TableWalk-In ShowerHigh-Speed Internet AccessCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/q3ncu5u4\/lincoln-square\nI am available for both Virtual and In-Person Tours from Sunday through Thursday within our office hours and we are currently offering some amazing deals I would love to assist you in securing.\nFeel free to reach out to our team at your convenience to let us know how you'd like to proceed. We'll be standing by!\nKindest Regards,\n\nStephen Fortune-Stewart\nLeasing Professional\nshow contact info\n\n","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '1010ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: 75', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: APG Living | Alterra Property Group,', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T11:12:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/willow-grove-welcome-home-in-horsham\/7492963584.html","post_id":7492963584,"result_date":"2022-06-06 11:08","title":"Welcome Home in Horsham!! Pet Friendly & Free Wifi","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryPicnic & Grilling AreaFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 114 Welsh Rd., Horsham, PA 19044","num_images":9.0,"lat":40.159722,"lng":-75.144253,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T11:04:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-2nd-3rd-floor-apartment-in\/7492959874.html","post_id":7492959874,"result_date":"2022-06-06 11:02","title":"2nd\/3rd floor apartment in Lansdale","description":"2nd and 3rd floor apartment. Convenient location in a no-outlet street. Hardwood floors. Laundry hookup in basement. No smokers or dogs.\nSecurity deposit, first month and last month rent due prior to possession.\nAvailable Aug.1 possibly sooner. Background check is part of the rental application.\n$1100\/month plus utilities.\n","num_images":9.0,"lat":40.248434,"lng":-75.288762,"attrs":"['2BR \/ 1Ba', 'available aug 1', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:58:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bensalem-large-fully-furnished-studio\/7492958549.html","post_id":7492958549,"result_date":"2022-06-06 10:59","title":"LARGE: Fully furnished Studio Suite Call TODAY!!!","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryOn-Site Fitness FacilityFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 3216 Tillman Dr., Bensalem, PA 19020","num_images":3.0,"lat":40.116742,"lng":-74.960137,"attrs":"['0BR \/ 1Ba', 'available now', '\\ntuesday 2022-06-07\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T10:55:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-remodeled-home-thats\/7492917384.html","post_id":7492917384,"result_date":"2022-06-06 10:59","title":"Remodeled Home that's perfect for all West Philly home","description":"An elegant West Philadelphia Huge home that's ready now for rent! BASEMENT  PORCH PATIO BALCONY CEILING FAN HARDWOOD FLOORS LIVING ROOM STORAGE GAS HEAT WASHER\/DRYER INCLUDED UNFURNISHED PETS NEGOTIABLE NEAR TRANSPORTATION\nshow contact info","num_images":0.0,"lat":39.9612,"lng":-75.2303,"attrs":"['3BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T09:26:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-poplar-st-spacious-studio\/7492957459.html","post_id":7492957459,"result_date":"2022-06-06 10:57","title":"Poplar St - Spacious Studio type","description":"Are you looking for a nice, quiet, and comfortable place? We offer this Studio type unit that can surely meet your standards, that is ready for moving, Freshly Renovated, Unit that is well maintained, New Floors and spacious area and has a dedicated team who manage the property and is very responsive, for your ease and convenience. No requirement, To move in just a security deposit, 1st and last month deposit. Please feel free to send an SMS or call me if you have any inquiry.","num_images":9.0,"lat":39.971111,"lng":-75.166936,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:53:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-clean-bargain-bedroom\/7492917943.html","post_id":7492917943,"result_date":"2022-06-06 10:54","title":"Clean Bargain 3 bedroom Walnut Hill","description":"All new Gorgeous Walnut Hill 3 bedroom gorgeous home with modernized kitchen! PORCH PATIO BALCONY HARDWOOD FLOORS LIVING ROOM STORAGE DISHWASHER UNFURNISHED PETS WELCOME\nshow contact info","num_images":0.0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T09:28:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-3br-apartment-in\/7492945423.html","post_id":7492945423,"result_date":"2022-06-06 10:46","title":"Spacious 3BR Apartment in Victorian Mansion","description":"Hi! I am renting the upstairs of my Victorian home in University city, at the corner or Melville st and Locust st, minutes walking from University of Pennsylvania.\nThe house has a separate entrance that leads you upstairs to a lovely, bright, and recently renovated 3BR, 1BA, attic space that can be turned into a TV room, yoga space or office. There is spacious and fully equipped kitchen, and very cozy living room\/dining room. The apartment is furnished and comes with window AC units. Some furniture could be removed if needed.\nThere is a laundry room in the basement and shared backyard with firepit.\nHopefully the nearby restaurants will be doing more than take-out and delivery soon, because they are wonderful. Don Barriga cooks up traditional Mexican a block away. On the corner, you’ve got some of the best Ethiopian of our fair city sizzling at Abyssinia. Just above it is the gem and secret speakeasy Fiume, specializing in bluegrass bands, gypsy jazz and a remarkable collection of craft beer, bourbon and whiskey. Manakeesh, Saads, Tampopo, Taco Taco and Local 44 are also steps away.\nClark Park, with its cultural goodies and weekly farmer’s market is a pleasant stroll towards Baltimore Ave.\nWe are looking to rent it to 1 or 2 people max.\nUtilities are shared 50-50% with the downstairs house.\nThe place is available for rent on August 1st. :) We ask for a background check, first, last month rent and security. In addition to full leases.\nPlease email me and we will schedule a zoom conversation followed by a tour of the apartment.\nLooking forward to hearing from you!","num_images":18.0,"lat":39.954231,"lng":-75.213012,"attrs":"['3BR \/ 1Ba', '1200ft2', 'available aug 1', 'air conditioning', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:29:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1716-mt-vernon-street-1r\/7492943293.html","post_id":7492943293,"result_date":"2022-06-06 10:40","title":"1716 Mt. Vernon Street - 1R, 1716 Mount Vernon St, Philadelphia, PA 19","description":"1716 Mt. Vernon Street - 1R, 1716 Mount Vernon St, Philadelphia, PA\nContemporary renovation, spacious floorplan with tons of natural light\nHistoric brownstone renovation, right down the street from community garden and park. Full kitchen features stainless appliances and gas range. Central livingroom has private entrance from gated courtyard. Unit also has main entrance through building lobby. Subway tile restroom with full bath. Central air and washer\/dryer in unit. Professionally managed by caring and attentive owner.\nNo SMOKING\nNO PETS","num_images":6.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', 'available now', '\\nmonday 2022-06-06\\n', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T10:25:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-looking-for-temple-student\/7492944439.html","post_id":7492944439,"result_date":"2022-06-06 10:31","title":"Looking for temple student to sublease","description":"Hello!!!!My roomates and I are looking for someone to sublease one of our rooms for the 2022-23 school year in a gorgeous apartment, from Aug 2022-July 2023! It is 3 blocks from campus on 17th and Diamond St. It is 2 girls and 1 boy (He is gay), we are very clean and respectful! We are all 20, going to be Sophomores and Juniors. This room is very big and comes with a full personal bathroom (including a tub) attached to your room, with lots of natural light. Big living room and kitchen is the common area. We have our own rooftop with the apartment, very beautiful view of the city! Washer and Dryer is included. We live with 2 cats and are smoker friendly. We won't be throwing big parties, maybe the occasional birthday party with friends. We are not loud. It is $700 a month plus utilities split. I've included pictures of the apartment when we toured. First months rent and security deposit (totalling $1400) will be due asap to the person you are subletting from. Then last months rent of $700 will be due July 1st as well.\nPlease contact me if you're interested!!! I am fastest reached by phone at  show contact info\nif you have questions or want to tour the place before you make any decisions!!\n","num_images":14.0,"lat":39.986385,"lng":-75.161119,"attrs":"['4BR \/ 4Ba', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:27:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1st-level-large-bdrm-with\/7492942970.html","post_id":7492942970,"result_date":"2022-06-06 10:28","title":"1st Level Large 2 BdRm with Enclosed Back Yard - Perfect for Dog Owner","description":"Available Immediately For Move-In!\nNewly re-constructed 2 BdRm, 1st floor unit. Apartment has it's own gas and electric account with PECO\/PGW and pays a RUBS Heating and Water allocation charge monthly. Full and private access to back yard which is enclosed - Perfect for a dog owner. New Kitchen and Bathroom. Bathroom is a walk-through bathroom accessible from both bedrooms - very private. Ample closets. New flooring and carpet throughput. Quiet and clean building with basement storage locker and coin-op washers and dryers. Go to listings.npres.net to schedule a showing or Call\/Text Rob at  show contact info\n.\nAmenities:\nNew rehab\nexclusive use of fenced back yard\nRental Terms:\nRent: $1,300\nApplication Fee: $75\nSecurity Deposit: $1,300\nAvailable Now - June 6th, 2022\nPet Policy:\nCats allowed\nDogs allowed (any size)\n","num_images":19.0,"lat":40.061579,"lng":-75.187203,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:24:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/haverford-new-fitness-center-elevator\/7492941937.html","post_id":7492941937,"result_date":"2022-06-06 10:26","title":"New fitness center, Elevator building, Smoke-free apartments available","description":"Korman Residential on the Main Line are beautiful apartments in Haverford, PA. We offer unique, spacious floor plan options, and whether you are looking for a MicroSuite, studio, or one-bedroom apartment, each of our rentals has hardwood floors and walk-in closets. The kitchens have fabulous cabinets and countertops with built-in appliances. You’ll love the exceptional curbside appeal. Built in 1926, and once a hotel named Casa Del Sol, our building is listed on the National Historic Register. Our apartments for rent on the Main Line are near Villanova University and located in Lower Merion School District. Located less than 10 miles from Center City, our rentals appeal to Philadelphia apartment shoppers. In addition to traditional residential apartments, we provide corporate and furnished options, and every one includes a long list of great amenities. Living in Haverford, PA at Korman Residential on the Main Line places you two blocks from SEPTA’s regional rail station and close to major roadways so traveling to the city and the surrounding suburbs is convenient. Contact a leasing agent to schedule a personal tour of our Haverford apartments.\n-Beautiful courtyards\n-Spacious floor plans with large bedrooms and closets\n-This is a cat friendly community\n-Smoke-free apartments available\n-Seasonal Bike Share Program\n-24\/7 emergency maintenance service\n-Professional on-site management team\n-Listed on the National Historic Register\n-New fitness center\n-Elevator building\n-Garage and parking lot available\n-On site washer and dryer\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekormanres.com\/ogf7ydwg\/korman-residential-on-the-main-line-casa-del-sol-\n","num_images":4.0,"lat":40.0097,"lng":-75.3121,"attrs":"['1BR \/ 1Ba', '630ft2', 'available aug 29', 'apartment', 'laundry on site', 'off-street parking', 'rent period: daily']","posted_date":"2022-06-06T10:22:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-freshly-rehabbed-ready-to\/7492940380.html","post_id":7492940380,"result_date":"2022-06-06 10:22","title":"Freshly Rehabbed & Ready To Rent In Overbrook","description":"Now available in Overbrook is this bright and airy 4 bed 1.5 bath home that has been fully updated throughout. This property sits on a quaint tree lined block. The home features new flooring throughout, a brand new state of the art kitchen with a new stainless-steel appliance package. The basement is fully finished with a half bathroom and bedroom\/office. The second floor features 3 air spacious bedrooms and a fully updated bathroom with all new tile and fixtures. Schedule your appointment today!","num_images":16.0,"lat":39.972796,"lng":-75.244212,"attrs":"['4BR \/ 1.5Ba', '1080ft2', 'available now', 'application fee details: $50', 'broker fee details: 1st Month Rent Paid To Broker', 'apartment', 'w\/d hookups', 'listed by: Compass Pennsylvania', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:18:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-the-center-of-west-chester\/7492939270.html","post_id":7492939270,"result_date":"2022-06-06 10:20","title":"The Center of West Chester Boro: Carriage House","description":"Situated on a quiet resedential street 1\/2 block from the intersection of Gay & Church street, this 1 bedroom apartment is ideal for boro living. The apartment is on the rear of an original Boro Carriage House, and boasts original hardwood floors, vaulated cieling, full kitchen and bathroom, in unit laundry, large living room, large bedroom, and use of a private courtyard. This is one of the best locations in the Boro and a must see.","num_images":5.0,"lat":39.960264,"lng":-75.607417,"attrs":"['1BR \/ 1Ba', '800ft2', 'available aug 1', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:16:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-center-city-1br-1ba\/7492939222.html","post_id":7492939222,"result_date":"2022-06-06 10:20","title":"Luxury Center City 1br\/1ba","description":"Looking for the perfect place to rest your head. Quiet, serene and relaxing this gem is close to all major attractions. Email to set up a viewing. Available July 1st. Serious Inquiries Only.","num_images":0.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T10:16:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/trenton-looking-for-convenience-well\/7492938859.html","post_id":7492938859,"result_date":"2022-06-06 10:19","title":"Looking For Convenience? Well, Look No Further! Train Minutes Away!","description":"show contact info\np>Contact info:\nThe Crossings at Hamilton | Edgewood Properties |  show contact info\nTHE CROSSINGS AT HAMILTON STATION\n900 Grand Central Drive, Hamilton, NJ 08619\nshow contact info\nwww.apartmentsathamiltonstation.com\nDESCRIPTION\nThe Crossings at Hamilton Station, a pristine community located in the heart of Hamilton, will make you wish you never lived anywhere else but here! Our perfect location offers residents the ability to access a multitude of delicious restaurants, shopping centers, and endless entertainment. We are just steps away from the Hamilton Train Station, providing quick rail service to Philadelphia, New York, Princeton, and Trenton. Our brand new 1, 2, and 3 bedroom apartments and 3 bedroom, 2.5 bathroom townhomes are designed to complement your lifestyle featuring open floorplans, stainless steel appliances, granite countertops, and so much more. Schedule your tour today to see why everyone is falling in love with The Crossings.\nCommunity Perks and Top-of-the Line Amenities\n❇️ Luxurious Clubhouse and Concierge Service\n❇️ Large Resort-Style Swimming Pool and Grill Area\n❇️ 24\/7 Emergency Maintenance\n❇️ 24-hour Business Center\n❇️ 24-hour Fitness Center\n❇️ Brand New Playground\n❇️ Fenced-in Dog Park\n❇️ Continental Sunday Breakfast\nSleek and Modern Apartments and Townhouses\n❇️ Spacious, Open Floorplans\n❇️ Soaking Tubs\/Walk-in Showers\n❇️ Large Washer\/Dryer in the unit\n❇️ Granite Countertops\n❇️ Large Walk-in Closets\n","num_images":14.0,"lat":40.2418,"lng":-74.6962,"attrs":"['2BR \/ 2Ba', '1467ft2', 'available now', '\\ntuesday 2022-06-07\\n', '\\nwednesday 2022-06-08\\n', '\\nthursday 2022-06-09\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T10:15:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-freshly-rehabbed-and-ready\/7492938704.html","post_id":7492938704,"result_date":"2022-06-06 10:19","title":"Freshly Rehabbed And Ready To Rent In Grays Ferry!","description":"Now available for rent in Grays Ferry! Beautiful 2 bedroom 2 bathroom home that has been fully remodeled. The property features all new flooring throughout. The open and spacious layout allows for enough space for both a living room, and a formal dining space. The kitchen has been fully remodeled with all new counter-tops, brand new shaker-style cabinetry, and a new stainless steel appliance package. Upstairs features 3 bright and airy bedrooms with a full bathroom that has been completely updated with all new tile and fixtures. The property features all mechanicals with a brand new HVAC system. Located in the heart of Grays Ferry the entire city is just steps from your front door. This location provides easy access to University of Penn, Center City, and all of the major highways. There is a major grocery store just a few blocks away. Schedule your appointment today!","num_images":14.0,"lat":39.936658,"lng":-75.191125,"attrs":"['2BR \/ 2Ba', '920ft2', 'available now', 'application fee details: $50', 'broker fee details: 1st Month Rent Paid To Broker', 'apartment', 'w\/d hookups', 'listed by: Compass Pennsylvania', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:15:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/royersford-royersford-bdrm-1080sq-ft\/7492938209.html","post_id":7492938209,"result_date":"2022-06-06 10:17","title":"Royersford - 1 Bdrm. 1080sq. ft.","description":"** All included except cable an electric!\n* 1 Bed\n* 1 Bath\n* Washer\/Dryer - Apt. Size\n* Dishwasher\n* Microwave\n* Refrigerator\n* Includes: Water\/Sewer\/Hot Water\/Trash\/Heat!\n* You Pay Only Electric and Cable\/Internet!\n* No Smoking – No Pets\n** Equal Housing Opportunity\n** Owner is a Licensed PA Realtor","num_images":7.0,"lat":40.2075,"lng":-75.5329,"attrs":"['1BR \/ 1Ba', '1080ft2', 'available jun 10', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:13:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-housing-opportunity\/7492937146.html","post_id":7492937146,"result_date":"2022-06-06 10:15","title":"GREAT HOUSING OPPORTUNITY FOR YOU","description":"Beautiful NEW house in Germantown\nGreat Housing Opportunity on a great tree line block\nNew updated Kitchen & Baths\n3 large Bedrooms with living room and dining room\n2 bathrooms also laundry room (washer and dryer included)\nspacious back yard!\nfinished basement\nCall  show contact info\nAsk for Mr. Thorne\n","num_images":4.0,"lat":40.0338,"lng":-75.1731,"attrs":"['3BR \/ 2.5Ba', '1400ft2', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:11:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-now-available-in-east\/7492936972.html","post_id":7492936972,"result_date":"2022-06-06 10:15","title":"Now Available In East Kensington! New Construction Apartment!","description":"Beautiful newly constructed building in the heart of East Kensington. The building sits just a half block from the Market-Frankford Line & everything that East Kensington and Fishtown have to offer. This beautiful unit is a bi-level 1 bedroom 1.5 bathroom. Hardwood flooring throughout, brand new gourmet kitchen, all new bathrooms, and in-unit laundry. These units will not last! Reach out today for a tour. This unit comes with an additional storage space in the basement, and in-unit laundry.","num_images":11.0,"lat":39.982684,"lng":-75.13216,"attrs":"['1BR \/ 1.5Ba', '700ft2', 'available now', 'application fee details: $50', 'broker fee details: 1st Month Rent Paid To Broker', 'apartment', 'w\/d in unit', 'listed by: Daniel Baer', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:11:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-housing-opportunity\/7492936092.html","post_id":7492936092,"result_date":"2022-06-06 10:13","title":"GREAT HOUSING OPPORTUNITY FOR YOU (Mt. Airy)","description":"Beautiful NEW house in Mt. Airy\nGreat Housing Opportunity on a great tree line block\nNew updated Kitchen & Baths\n3 large Bedrooms with living room and dining room\n2 bathrooms also laundry room (washer and dryer included)\nspacious back yard!\nfinished basement\nCall  show contact info\nAsk for Mr. Thorne\n","num_images":4.0,"lat":40.0726,"lng":-75.1706,"attrs":"['3BR \/ 2Ba', '1300ft2', 'available now', 'house', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:09:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-housing-ownership\/7492934783.html","post_id":7492934783,"result_date":"2022-06-06 10:10","title":"Housing Ownership Opportunity get approved","description":"Beautiful NEW house in Mt. Airy\nGreat Housing Opportunity on a great tree line block\nNew updated Kitchen & Baths\n3 large Bedrooms with living room and dining room\n2 bathrooms also laundry room (washer and dryer included)\nspacious back yard!\nfinished basement\nCall  show contact info\nAsk for Mr. Thorne\n","num_images":1.0,"lat":40.0726,"lng":-75.1706,"attrs":"['3BR \/ 2Ba', '1300ft2', 'available now', 'house', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T10:06:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cafe-business-center\/7492930193.html","post_id":7492930193,"result_date":"2022-06-06 10:00","title":"Cafe, Business Center, Private Balcony","description":"Thank you for your interest in leasing an Apartment Home at Lincoln Square!\n\nOur community features Studio through Three Bedroom apartment homes to be leased for terms between 5-months and 15-months.\n\nIn addition to our beautiful apartment homes, our community features an abundance of amenities including our Fitness Center and Yoga Room, Community Lounge Area, Private Movie Theater, a state-of-the-art Golf Simulator and including but not limited to our 50,000 Square Foot Rooftop Deck, which houses a Dog Park, Running Track, remarkable city views and so much more! Bedrooms: 3Bathrooms: 2Square Feet: 1155Date Available: 2022-06-06Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Business CenterFlexible Lease Terms AvailableWindow CoveringsWalk-In ClosetCopy and Fax ServicesDishwasherPantryBBQ\/Picnic AreaControlled AccessIce MakerFire PitCarpetedCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/k74xxgi3\/lincoln-square\nI am available for both Virtual and In-Person Tours from Sunday through Thursday within our office hours and we are currently offering some amazing deals I would love to assist you in securing.\nFeel free to reach out to our team at your convenience to let us know how you'd like to proceed. We'll be standing by!\nKindest Regards,\n\nStephen Fortune-Stewart\nLeasing Professional\nshow contact info\n\n","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '1155ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: 75', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: APG Living | Alterra Property Group,', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T09:56:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-awesome-lower-level-two\/7492923920.html","post_id":7492923920,"result_date":"2022-06-06 09:54","title":"Awesome Lower Level two baths master suite Upper Duplex.","description":"Beautiful home in the Philadelphia Neighborhood. Enjoy the expansive private yard with its own tool shed, nature area out your back yard and Philadelphia Gardens Park across the street. 2 bedroom, 1 bath home w\/beautiful kitchen w\/wolf appliances, kitchen island and a breakfast bar, dining, open living room w\/beautiful views, main level master, 2 additional bdrms. Walk out deck to enjoy the quiet & sip your morning coffee. The LL screen porch is perfect to relax w\/to sound of the birds, or entertain around the firepit in the evening. This home will have everything you need and more; wood floors, wet bar\/Mother-in-law suite in LL w\/full walkout. Come see the light sprawl across the vaulted ceilings and the great features of this home. 4th LL bdrm is nonconforming. * For more information and pictures call 🏠 ☎️ show contact info","num_images":3.0,"lat":40.0369,"lng":-75.0664,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T09:42:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/exton-no-credit-check\/7492924487.html","post_id":7492924487,"result_date":"2022-06-06 09:48","title":"no credit check","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 877 N. Pottstown Pike (Rt 100), Exton, PA 19341","num_images":5.0,"lat":40.0468,"lng":-75.6432,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T09:44:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recycling-dishwasher\/7492923913.html","post_id":7492923913,"result_date":"2022-06-06 09:46","title":"Recycling, Dishwasher, Carpeted","description":"Thank you for your interest in leasing an Apartment Home at Lincoln Square!\n\nOur community features Studio through Three Bedroom apartment homes to be leased for terms between 5-months and 15-months.\n\nIn addition to our beautiful apartment homes, our community features an abundance of amenities including our Fitness Center and Yoga Room, Community Lounge Area, Private Movie Theater, a state-of-the-art Golf Simulator and including but not limited to our 50,000 Square Foot Rooftop Deck, which houses a Dog Park, Running Track, remarkable city views and so much more! Bedrooms: 2Bathrooms: 2Square Feet: 1050Date Available: 2022-06-06Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Electric Car Charging StationsSpacious FloorplansRooftop DeckClose to FreewayWindow CoveringsJogging TrailAir ConditioningPet FriendlyHeat IncludedViewsYoga StudioCarpetedCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/nykxebpi\/lincoln-square\nI am available for both Virtual and In-Person Tours from Sunday through Thursday within our office hours and we are currently offering some amazing deals I would love to assist you in securing.\nFeel free to reach out to our team at your convenience to let us know how you'd like to proceed. We'll be standing by!\nKindest Regards,\n\nStephen Fortune-Stewart\nLeasing Professional\nshow contact info\n\n","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '1050ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: 75', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: APG Living | Alterra Property Group,', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T09:42:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-furnished-studio-02-months\/7492919154.html","post_id":7492919154,"result_date":"2022-06-06 09:35","title":"Furnished Studio - 02 Months Minimum","description":"Furnished Studio - Only 2 Month Minimum!Take advantage of our special discounted rate! All utilities are included! show contact info\nwww.esa.com\/craigslistLooking for a place to call home for a couple months or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Furnished Studio - Only 2 Month Minimum!Take advantage of our special discounted rate! All utilities are included! show contact info\nwww.esa.com\/craigslistLooking for a place to call home for a couple months or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryPicnic & Grilling AreaIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 2 months?  We also have great nightly, weekly, and 30-night rates.  Call for details.Minimum 60-night length of stay required. Booking conditions apply, including a nonrefundable deposit. Rates and availability subject to change. Rate will vary by room type and stay dates. Rate not inclusive of taxes and fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 8880 Bartram Ave., Philadelphia, PA 19153    Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryPicnic & Grilling AreaIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 2 months?  We also have great nightly, weekly, and 30-night rates.  Call for details.Minimum 60-night length of stay required. Booking conditions apply, including a nonrefundable deposit. Rates and availability subject to change. Rate will vary by room type and stay dates. Rate not inclusive of taxes and fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 8880 Bartram Ave., Philadelphia, PA 19153","num_images":4.0,"lat":39.889516,"lng":-75.246169,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T09:31:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-perfect-location-gated-dog\/7492917355.html","post_id":7492917355,"result_date":"2022-06-06 09:30","title":"Perfect Location, Gated Dog Park, Pet Friendly","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nYou will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features and entry closet, washer\/dryer, linen closet, walk-in closet and a private balcony!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\n[#9253923]","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '753ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-06T09:26:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-move-in-now-bbq-grills\/7492915970.html","post_id":7492915970,"result_date":"2022-06-06 09:26","title":"Move In Now, BBQ Grills, Central Air","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nFind yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, coat closet, built-in shelving, washer\/dryer, linen closet, walk-through closet, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\n[#9254021]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '745ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T09:22:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fireside-lounge-move-in-now\/7492912189.html","post_id":7492912189,"result_date":"2022-06-06 09:16","title":"Fireside Lounge, Move In Now, Lease Today","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis studio apartment features a fully equipped kitchen, entry closet, walk-in closet, and a washer\/dryer!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\n[#9253888]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['0BR \/ 1Ba', '581ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T09:12:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-close-to-airport-window\/7492911778.html","post_id":7492911778,"result_date":"2022-06-06 09:15","title":"Close to Airport, Window Coverings, On-Site Management","description":"Thank you for your interest in leasing an Apartment Home at Lincoln Square!\n\nOur community features Studio through Three Bedroom apartment homes to be leased for terms between 5-months and 15-months.\n\nIn addition to our beautiful apartment homes, our community features an abundance of amenities including our Fitness Center and Yoga Room, Community Lounge Area, Private Movie Theater, a state-of-the-art Golf Simulator and including but not limited to our 50,000 Square Foot Rooftop Deck, which houses a Dog Park, Running Track, remarkable city views and so much more! Bedrooms: 2Bathrooms: 2Square Feet: 928Date Available: 2022-06-06Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:CafeDishwasherCustom CabinetryPantryMicrowaveCopy and Fax ServicesMedia RoomOnline Service RequestsBBQ\/Picnic AreaPackage ReceivingRooftop DeckTile BacksplashCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/onzufjm6\/lincoln-square\nI am available for both Virtual and In-Person Tours from Sunday through Thursday within our office hours and we are currently offering some amazing deals I would love to assist you in securing.\nFeel free to reach out to our team at your convenience to let us know how you'd like to proceed. We'll be standing by!\nKindest Regards,\n\nStephen Fortune-Stewart\nLeasing Professional\nshow contact info\n\n","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '928ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: 75', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: APG Living | Alterra Property Group,', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T09:11:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-pet-friendly-concierge\/7492910298.html","post_id":7492910298,"result_date":"2022-06-06 09:11","title":"Pet Friendly, Concierge, Media Room","description":"Thank you for your interest in leasing an Apartment Home at Lincoln Square!\n\nOur community features Studio through Three Bedroom apartment homes to be leased for terms between 5-months and 15-months.\n\nIn addition to our beautiful apartment homes, our community features an abundance of amenities including our Fitness Center and Yoga Room, Community Lounge Area, Private Movie Theater, a state-of-the-art Golf Simulator and including but not limited to our 50,000 Square Foot Rooftop Deck, which houses a Dog Park, Running Track, remarkable city views and so much more! Bedrooms: 3Bathrooms: 2Square Feet: 1427Date Available: 2022-06-06Address: 1000 South Broad StreetExperience Philadelphia’s newest square. A location with a rich and storied history, Lincoln Square is a unique destination at the crossroads of Center City and South Philly, just steps away from all that Philadelphia has to offer. Amenities Include:Yoga StudioKitchen IslandWindow CoveringsSecurity CameraPrivate BalconyElevatorCarpetedFlexible Lease Terms AvailableBilliards TableCopy and Fax ServicesRecyclingCustom CabinetryCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/sgv26cle\/lincoln-square\nI am available for both Virtual and In-Person Tours from Sunday through Thursday within our office hours and we are currently offering some amazing deals I would love to assist you in securing.\nFeel free to reach out to our team at your convenience to let us know how you'd like to proceed. We'll be standing by!\nKindest Regards,\n\nStephen Fortune-Stewart\nLeasing Professional\nshow contact info\n\n","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 2Ba', '1427ft2', 'available now', 'EV charging', 'air conditioning', 'application fee details: 75', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: APG Living | Alterra Property Group,', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T09:07:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-originally-built-in-1973\/7492903413.html","post_id":7492903413,"result_date":"2022-06-06 09:02","title":"Originally built in 1973 as unique Apartments!","description":"Originally built in 1973 as unique Apartments, The Terrace has an iconic Philadelphia location and shape! Due to its round structure, each apartment has a spacious private balcony with sweeping views of Center City and the world beyond. This is a cozy 1 bedroom, 1 bathroom apartment ideal community. Each unit features hardwood floors and eat-in kitchens. There are smart app-controlled washers and dryers located in the basement.\n*Gas is included in the rent.\n*This unit has radiant heat\n*Owner are responsible for electric and cable\/internet.\n*Pets are welcome.\n*Garage parking.\nLocation*4209 Chester Ave, Philadelphia, PA 19104\n","num_images":1.0,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T08:47:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-1br-with-outdoor\/7492902693.html","post_id":7492902693,"result_date":"2022-06-06 08:49","title":"Spacious 1BR with outdoor space","description":"This first floor apartment has everything you need - outdoor space, stainless appliances, an office for remote work, storage space in the basement, and easy access to all that Fishtown has to offer from its many coffee houses to the city's best restaurants.\nThe apartment is available July 1 and we're looking for a one-year lease.  Email or text to set up an appointment to view the apartment.  The amenities include:\nHardwood floors throughout\nWasher\/dryer in the apartment\nDishwasher\nGas stove\nFull basement for storage\nOutdoor patio that is ideal for BBQ, a potted garden, outdoor eating\nUnmetered on street parking\nClose proximity to Loco Pez, Reanimator Coffee, Lloyd's, Kraftwerk, and many more\nFirst month, last month, security deposit require for move-in.  $35 application fee.  Dogs and cats are ok but require an additional $100 deposit per pet.\n","num_images":12.0,"lat":39.974362,"lng":-75.126011,"attrs":"['1BR \/ 1Ba', '880ft2', 'available jul 1', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T08:45:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-right-on-the-bus-line\/7492880504.html","post_id":7492880504,"result_date":"2022-06-06 08:48","title":"Right on the bus line a Gorgeous Morton 3 bedroom","description":"Excellent Morton 3 bedroom fantastic home right on the bus line includes a large shared yard! PORCH PATIO BALCONY YARD LIVING ROOM STORAGE UNFURNISHED PETS WELCOME NO DOGS ALLOWED NEAR TRANSPORTATION\nshow contact info","num_images":0.0,"lat":40.0338,"lng":-75.1731,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T07:00:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/king-of-prussia-no-credit-check-fully\/7492901528.html","post_id":7492901528,"result_date":"2022-06-06 08:45","title":"NO Credit Check Fully Furnished","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 400 American Avenue, King of Prussia, PA 19406","num_images":5.0,"lat":40.095179,"lng":-75.399448,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T08:41:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-by-campus-stately-four\/7492897109.html","post_id":7492897109,"result_date":"2022-06-06 08:37","title":"By campus, stately Four bedroom Huge home","description":"Close to both Drexel and U Penn, this is a very large 4 bedroom (all of them pretty sizable) gigantic home that's got three bathrooms (two are full, the other is a powder room). Recently fixed the place up with refurbishing the flooring, painting the walls.\nVery big, perfect for any and all kinds of families.\nCall at  show contact info\n(it's landline, so texts can't be answered)\n","num_images":0.0,"lat":39.953826,"lng":-75.209535,"attrs":"['4BR \/ 3Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T08:26:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/plymouth-meeting-studio-apartment\/7492893408.html","post_id":7492893408,"result_date":"2022-06-06 08:15","title":"Studio Apartment w\/ Kitchenette and Work Space","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryOn-Site Fitness FacilityMeeting RoomFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 437 Irwins Lane, Plymouth Meeting, PA 19462","num_images":6.0,"lat":40.1077,"lng":-75.2796,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T08:11:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-first-floor-modern-mill\/7492880385.html","post_id":7492880385,"result_date":"2022-06-06 07:52","title":"First floor Modern Mill Creek 3 bedroom gorgeous home","description":"Excellent Mill Creek Fabulous 3 bedroom perfect for all! HARDWOOD FLOORS LIVING ROOM STORAGE MICROWAVE REFRIGERATOR WASHER\/DRYER HOOK-UPS UNFURNISHED PETS NEGOTIABLE 1ST FLOOR\nshow contact info","num_images":0.0,"lat":39.960122,"lng":-75.203476,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T07:00:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedrooms-bath-apt\/7492877141.html","post_id":7492877141,"result_date":"2022-06-06 06:35","title":"LARGE 2 BEDROOMS & 1 BATH APT LOCATED CLOSE TO LA SALLE UNIVERSITY!","description":"⭐⭐⭐ LARGE 2 BEDROOMS & 1 BATH APARTMENT LOCATED CLOSE TO LA SALLE UNIVERSITY! ⭐⭐⭐\nProperty Address\n5701 N 17th Street | Philadelphia, PA 19141\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ LARGE 2 BEDROOMS & 1 BATH APARTMENT LOCATED IN OGONTZ\/WEST OAK LANE! ⭐⭐⭐\n✔️ LARGE LIVING ROOM\n✔️ UPDATED DESIGNER KITCHEN W\/ BREAKFAST BAR\n✔️ STOVE, FRIDGE, & MICROWAVE\n✔️ SPACIOUS BEDROOMS\n✔️ WATER-RESISTANT LAMINATE FOR EASY CLEANING\n✔️ OPEN LAYOUT CONCEPT\n✔️ CEILING FANS\n✔️ CABLE READY\n✔️ LOCATED CLOSE TO KEMBEL PARK!\n✔️ SHORT COMMUTE FROM LA SALLE UNIVERSITY!\n✔️ EASY ACCESS TO PUBLIC TRANSPORTATION!\n✔️ CLOSE TO MAJOR ROADS!\n✔️ EASY COMMUTE TO CENTER CITY!\n✔️ WON'T LAST LONG INQUIRE TODAY!\nDETAILS\nFull background checks,\n$35 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\nAMENITIES\nOpen layout\nconveniently located\ncable ready\nclose to public transportation\nSIZE\nBeds\/Baths: 2 BD\/1 BA\nSquare Feet: Apx. 850\nRENTAL TERMS\nRent: $1000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2000\nPET POLICY\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY:  WWW.REDBLOCK.COM\/APARTMENTS\ntags: 2 bedroom, two-bedroom, redblock, redblock realty inc, ogontz, west oak lane, east oak lane, logan, Germantown, East Germantown, Olney, La Salle University, central high school, spacious, Olney Transportation Center - BSL, 19141, 19144, 19138, 19126, 19120, 19119, Kemble Park, Philadelphia High School for Girls, Einstein Medical Center Philadelphia, Cristo Rey Philadelphia High School, Central High School, Belfield Recreation Center, Community College of Philadelphia - Northwest Regional.\nAvailability and pricing are subject to change.  Information Deemed Reliable But Not Guaranteed. All information is subject to errors, omissions, or withdrawal without notice. #nata\nDetails\nBeds\/Baths: 2BD\/1.0BA\nSquare Feet: 925\nRental Terms\nRent: $1,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $2,000.00\n","num_images":6.0,"lat":40.040606,"lng":-75.15035,"attrs":"['2BR \/ 1Ba', '925ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T06:31:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-renovated\/7492876670.html","post_id":7492876670,"result_date":"2022-06-06 06:30","title":"Completely Renovated 3 bedrooms and 2 bath home in West Oak Lane!","description":"Completely Renovated 3 bedrooms and 2 bath home in West Oak Lane!!!\nProperty Address\n2472 77th Ave | Philadelphia, PA 19150, PA 19150\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE HOUSE! ⭐⭐⭐⭐⭐\n✔️Completely Renovated 3 bedrooms and 2 bath home\n✔️Spacious living room\n✔️Large dining area\n✔️Brand New kitchen with Island\n✔️Open Concept 1st Floo\n✔️Large Master Suite with private Master Bath\n✔️Contemporary Designs\n✔️Plenty of Natural Light\n✔️Washer\/Dryer Hook Up\n✔️Brand New Central Air\n✔️Rear Deck\n✔️Attached Garage\n✔️Plenty of closet space\n✔️Unfinished basement for storage\n✔️Custom color paint\n✔️Easy access to and from the city\n✔️Easy access to public transportation\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1900\nRental Terms\nRent: $2000\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $4000\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n\n#nata\n","num_images":24.0,"lat":40.070381,"lng":-75.159595,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T06:26:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-modern-3br\/7492876243.html","post_id":7492876243,"result_date":"2022-06-06 06:25","title":"Newly Renovated MODERN 3BR in booming Brewerytown","description":"Newly Renovated MODERN 3BR in booming Brewerytown\nProperty Address\n2312 W Thompson Street | Philadelphia, PA 19121\nAvailable: Now\nOffered By\nREDBLOCK Realty Inc. |  show contact info\nDescription\n✔️ NEW! BEST VALUE APARTMENT! ⭐⭐⭐\n✔️ NEW! SPACIOUS 3 BEDROOMS AND 2 BATHS HOME IN BREWERYTOWN\n✔️ NEW! GRANITE COUNTERTOP KITCHEN\n✔️ NEW! CUSTOM BACKSPLASH AND FLOOR TILES\n✔️ NEW! MODERN PARQUET FLOORING\n✔️ NEW! DESIGNER PAINTER COLORS\n✔️ NEW! CUSTOM TILED BATHROOM W\/ ALL-NEW VANITIES\n✔️ NEW! CENTRAL AIR\n✔️ WASHER\/DRYER HOOKUP\n✔️ BACKYARD\n✔️ FINISHED BASEMENT\n✔️ ALL ELECTRIC\n✔️ CLOSE TO PUBLIC TRANSPORTATION!\n✔️ EASY ACCESS TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO AND FROM THE CITY!\n✔️ APPLY TODAY!!!\nDETAILS:\n- $35 app fee per person\n- Full background checks.\n- Yearly leases only.\n- Available ASAP\n- 3-months rent to move in\n- Tenant pays all own utilities\n*** Build your credit! We report rent payments to Experian! ***\n*** Please apply online at https:\/\/redblock.com ***\nVIRTUAL TOUR:  https:\/\/my.matterport.com\/show\/?m=SFUoEj4haDk\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n\nDetails\nBeds\/Baths: 3BD\/2.0BA\nSquare Feet: 1,200\nRental Terms\nRent: $2,000.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $4,000.00\n\n#nata\n","num_images":21.0,"lat":39.97512,"lng":-75.173886,"attrs":"['3BR \/ 2Ba', '1200ft2', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T06:21:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/conshohocken-open-house-tuesday-the-7th\/7492875482.html","post_id":7492875482,"result_date":"2022-06-06 06:17","title":"Open house Tuesday the 7th at 5:00","description":"2 Bedroom available immediately, no Utilities are included and there is a common patio and yard for your enjoyment. New Carpet through out and is ready for you to move in.\nPlease let me know if you are able to make tomorrow's showing and provide your phone # so that I contact you with other information. If you aren't able to make tomorrow's open house please contact me anyway for alternative date and times.\nThanks for your time.\n","num_images":4.0,"lat":40.080124,"lng":-75.300915,"attrs":"['2BR \/ 1Ba', 'available now', '\\ntuesday 2022-06-07\\n', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T06:13:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-townhouse-in-olney\/7492870118.html","post_id":7492870118,"result_date":"2022-06-06 05:28","title":"3-Bedroom Townhouse In Olney","description":"Look no further. This 1,120 sq ft. home boost 3 nice sized bedroom, 2 and a half baths. A fully finished walk out basement with an office or option to add another bedroom, washer and dryer hook up, and a full bathroom with a custom tiled shower. Centrally located to Center City and Bucks County, close proximity to schools, supermarkets, restaurants and public transportation makes this location very appealing. With prices rising this is a great time to buy and hold for an investor or a homeowner looking to gain some equity in the next few years. What are you waiting for? Book your showing today. This could be yours if the price is right!","num_images":10.0,"lat":40.028659,"lng":-75.127101,"attrs":"['3BR \/ 3Ba', '1120ft2', 'available jun 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T04:43:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-dont-miss-this-beautiful\/7492863542.html","post_id":7492863542,"result_date":"2022-06-06 03:00","title":"Don't miss this beautiful renovated 1 bedroom, 1 bath home- Cityview","description":"Enjoy condo living in this gorgeous recently renovated one bedroom condo on the 18th floor at Cityview Condominiums. The spectacular forever north facing unobstructed views will wow you! It has an open kitchen which features a large granite breakfast bar and makes this perfect for entertaining. The kitchen also features beautiful hi-end cabinetry, stainless steel appliances, flat top range and deep stainless steel sink. The condo features hardwood floors throughout that are in pristine condition. Step into the spacious bedroom which features a custom walk in closet you have been dreaming of!. Cityview Condominium amenities include a fitness enter, outdoor swimming pool, business center 24 concierge\/ front desk and a beautifully landscaped outdoor space with a gazebo. Cityview Condominiums is perfectly situated in the Art Museum neighborhood which has some of the best restaurants, parks, museums and easily accessible to all major highways \/ public transportation!","num_images":7.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '674ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T02:43:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-welcome-home-this-beautifully\/7492855519.html","post_id":7492855519,"result_date":"2022-06-06 01:41","title":"Welcome home! This beautifully updated 1 bedroom, 1 bath house","description":"Welcome home! This beautifully updated 1 bedroom, 1 bath condo located on the second floor is ready for its new owner! As you enter the home, notice the updated flooring, all the natural sunlight and neutral paint color throughout. In the kitchen you will find lovely white cabinets, ample countertop space and some stainless-steel appliances. The bedroom is bright, spacious and not short of storage, just take a look at the closet! This is where you will find the stackable washer\/dryer unit, which is an awesome bonus! Across the hall is the full bath that offers more storage in the vanity and linen closest. Outside on the balcony, there is room to entertain while being able to look at the nice views of the tennis courts and field. A few bonus features of this home are that the washer\/dryer and kitchen refrigerator are staying for the new owner. Plus, the hot water heater is new which was paid and installed by the association! All you will have to do is turn the key and move right in.","num_images":8.0,"lat":40.22825,"lng":-75.317108,"attrs":"['1BR \/ 1Ba', '588ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T01:12:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-corner-bedroom-house\/7492855660.html","post_id":7492855660,"result_date":"2022-06-06 01:36","title":"This corner 1 bedroom house in the stunning Lenox Building","description":"This corner 1 bedroom condo in the stunning Lenox Building in the heart of West Wash & Midtown Village is now available. The layout has a great flow to it, that is spacious and bright. Large bedroom with suite bathroom. Several wonderful upgrades include in unit washer\/dryer, Mini-Split Heating & Cooling systems throughout, and California closets. The kitchen features ample counter space and cabinets, rock stone back splash, stainless steel appliances and granite countertops. Take advantage of the Ave. of the Arts, and all the shops and restaurants in the neighborhood.","num_images":7.0,"lat":39.94724,"lng":-75.162513,"attrs":"['1BR \/ 1Ba', '808ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T01:14:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/doylestown-dont-miss-your-opportunity\/7492854939.html","post_id":7492854939,"result_date":"2022-06-06 01:32","title":"Don't miss your opportunity to own this updated home","description":"Don't miss your opportunity to own this updated house right outside of Historic Doylestown Borough! Enter into the bright and airy living room offering updated flooring, neutral décor, and sliding glass doors leading to a tranquil balcony overlooking the mature greenery. The eat-in kitchen boasts stainless steel appliances, crisp white cabinetry, and plenty of counterspace. The bedroom features wood flooring, plenty of natural light, and barn doors that lead to the walk-in closet and suite bath. There is also a full-size washer & dryer in unit and plenty of storage space! All of this and more within walking distance to the local YMCA, hike & bike trail, as well as the heart of Doylestown where you can find plenty of shopping & dining!","num_images":8.0,"lat":40.301903,"lng":-75.137172,"attrs":"['1BR \/ 1Ba', '880ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T01:07:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ambler-this-beautiful-ambler-single-has\/7493255414.html","post_id":7493255414,"result_date":"2022-06-06 21:09","title":"This beautiful Ambler single has it all!","description":"This beautiful Ambler single has it all! This home offers 1 bed 1 baths, central air, 2 car parking, plenty of outdoor space, main floor laundry, low taxes and an award-winning school district. First floor has hardwood flooring throughout the living and dining area, kitchen has a tiled floor with half bath and laundry off to the side.","num_images":13.0,"lat":40.158068,"lng":-75.229177,"attrs":"['1BR \/ 1Ba', '1500ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T20:58:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-available-in\/7493254173.html","post_id":7493254173,"result_date":"2022-06-06 20:58","title":"Large 2 bedroom available in August at 417 N Preston st!","description":"Security deposit, first and last month to move in. Tenants responsible for all utilities. Pets friendly. New appliances. New kitchen cabinets. Spacious bedrooms. Washer and dryer in the unit. Hot tub! Good size closets. Must see! Call Alena for showing at New property On-street parking Secured entry Jacuzzi \/ Whirlpool High \/ Vaulted ceiling Tile floor Hardwood floor Stainless steel appliances Garbage disposal Microwave Dishwasher Refrigerator Range \/ Oven Porch Heating & Cooling Central A\/C Storage space Call Alena for showing at  show contact info\nCity Wide Realty","num_images":24.0,"lat":39.960463,"lng":-75.203737,"attrs":"['2BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T20:54:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazon-package-locker\/7493251263.html","post_id":7493251263,"result_date":"2022-06-06 20:48","title":"Amazon Package Locker System, Energy Efficient Appliances, Elevator","description":"Bedrooms: 1Bathrooms: 1Square Feet: 506Date Available: 2022-06-06Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:On-Site ManagementClose to FreewayCourtyardElevatorClose to ShoppingPet FriendlyDog ParkPlaygroundEnergy Efficient AppliancesBreakfast BarPantryRecyclingCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/mwoureyg\/fairmount-north\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['1BR \/ 1Ba', '506ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T20:44:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-is-beautiful-loft\/7493241469.html","post_id":7493241469,"result_date":"2022-06-06 20:40","title":"This is a beautiful, loft style 1 bedroom, 1.5 bathroom condo","description":"This is a beautiful, loft style 1 bedroom, 1.5 bathroom condo with PARKING on the top floor of a historical building in the coveted area of Bella Vista across from the park! The home boasts an upscale functional kitchen overlooking the main living area. The open living room\/dining combo, complete with freshly painted walls, and perfect for entertaining, features large windows allowing the light to flood the room and a convenient powder room- just think, no guests in your bathroom! This level also includes the washer and dryer. The loft bedroom features a custom rail overlooking the living area and is located right next to the full bathroom. Perhaps the best part is its private outdoor space: on the top floor of the building, giving you privacy from the street with treetop views and since the unit is in the rear of the building, there is no street noise. Extra storage can be found in the basement. Neighbors are famously friendly as are the people in the building. Close to the finest restaurants, numerous parks, Italian Market, dog park, Whole Foods, Acme, easy commute to University City and Rittenhouse Square, Upenn, HUP, CHOP, public transit, the list goes on and on.","num_images":24.0,"lat":39.941813,"lng":-75.15784,"attrs":"['1BR \/ 1Ba', '925ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T20:15:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-studio-available-now\/7493246342.html","post_id":7493246342,"result_date":"2022-06-06 20:33","title":"Great studio available now at 3412 Spring garden!","description":"Cozy studio available now in university city area. Walking distance to Drexel university. Laundry room in the building. Window air conditioning. Hardwood floors. Tenants will be responsible only for electric. Security deposit, first and last month to move in. $55 application fee.\nRental Terms\nRent: $890\nApplication Fee: $55\nSecurity Deposit: $890\nAvailable now\nPet Policy\nCats allowed\nDogs allowed\nCall Alena for showing at  show contact info\nAlena Skorynina\nCity wide realty\n","num_images":11.0,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T20:29:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-bedroom-available-1\/7493244482.html","post_id":7493244482,"result_date":"2022-06-06 20:28","title":"Great 2 bedroom available 9\/1 at 238 S 45th street!","description":"Great 2BR\/1BA unit in Fantastic location close to UPenn. Very charming 2BR\/1BA unit with lovely yard that is shared. W\/d is in the basement. Original hardwood floors, large bedrooms, spacious bathroom. Tenants will be responsible for electric and gas. 1. First, Last and Security to move in ( three months up front ) 2. $55 application fee ( non refundable ) 3. Good credit ( no prior evictions, judgments or collections ) 4. Proof of income (co signer for students if needed ) 5. $250 non refundable pet fee. Although deemed accurate, this information is subject to change without prior notice. Rental Terms Rent: $1,600 Application Fee: $55 Security Deposit: $1,600 Available 9\/15\/22 Pet Policy Cats allowed Dogs allowed","num_images":16.0,"lat":39.95402,"lng":-75.211932,"attrs":"['2BR \/ 1Ba', 'application fee details: 55', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T20:24:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sought-after-2nd-floor-new\/7493237021.html","post_id":7493237021,"result_date":"2022-06-06 20:27","title":"Sought after 2nd floor New York style loft in the converted Magdalen","description":"Sought after 2nd floor New York style loft in the converted Magdalen School with one car gated assigned parking. Located on the north side with a wall of 9~ windows and 15~ ceilings. Come in the entrance hall and to the left you will find a large open main living\/dining area featuring ceramic tile floors and plenty of wall space for art or bookcases. The European-style gourmet kitchen boasts red lacquer and frosted glass cabinets, black granite countertops, glass tile backsplash, plenty of storage and under cabinet lighting. Stainless steel appliances include a double-drawer dishwasher, induction cooktop with hood, and wine refrigerator. Off of the hall is the spacious modern bathroom with a mix of ceramic tile, slate, and stone with a huge walk-in shower featuring multiple jets and glass blocks for natural light. To the right of the entrance hall you will enter the unique bedroom area featuring hardwood floors, laundry closet, two floor-to-ceiling closets, and a soaking tub. Climb up the ladder to the loft that can be used as office space, storage, or a cozy spot to relax. There is also an interesting bonus area off of the bedroom that was formerly an old stairwell. This large space will be perfect for a walk-in closet, changing room, or extra storage. This unit has old charm with many modern upgrades and tons of natural light. Located in the heart of Bella Vista, blocks from the old Italian Market, and just south of South Street. With a Walkscore of 99, you will find scores of restaurants and shops just steps from your door! Located 7 blocks from Columbus Blvd which has easy access to I95 and I676.","num_images":20.0,"lat":39.937918,"lng":-75.153935,"attrs":"['1BR \/ 1Ba', '980ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T20:03:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom\/7493243261.html","post_id":7493243261,"result_date":"2022-06-06 20:24","title":"Renovated 1 bedroom available now at 4800 Brown st!","description":"Experience forward-thinking urban living.\n1, 2 & 3 bedroom luxury loft-style apartments located in an affordable up-and-coming district just north of University City make up this 34-unit complex. We offer thoughtful architecture and design creating a contemporary feel in an old factory setting. Elevator access, stainless steel appliances including a dishwasher and garbage disposal, a multi-camera security system, intercom system with remote door buzzer, on-site laundry, high ceilings, custom cabinetry with self-closing hardware, granite counters, kitchen pantry, exposed brick & concrete in many units, tile flooring, central heat & air, LED lighting, extra large commercial sized windows, large closets and large bright common hallways will be more than enough to make you want to come home!\nLive the uptown urban lifestyle you crave!\nAmenities:\n-Water $35.00 per month\n-Elevator\n-Assigned gated parking available for car and scooters ($150 per space, coming Summer 2021)\n-Multi-camera security system\n-Intercom system with electronic door opener\n-On-site laundry\n-Choice of Comcast or Verizon\n-Full-size stainless steel appliances\n-Bus line at corner\n-Garbage disposal\n-High ceilings\n-Large closets\n-Custom cabinetry with self closing cabinet doors & drawers\n-Sinks with magnetic retractable faucet hose\n-Granite counters\n-Pantries\n-Exposed ductwork, brick & concrete floors\/ceilings (in some units)\n-Central air and heat\nIn addition to monthly rent, tenant is responsible for their own electricity bill, a water fee of $35 & a liability insurance fee of $9.50\nCall Alena fro showing at  show contact info\nCity wide realty\n","num_images":17.0,"lat":39.966337,"lng":-75.216657,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T20:20:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-bedroom-available-in\/7493240875.html","post_id":7493240875,"result_date":"2022-06-06 20:17","title":"Great 1 bedroom available in September  at 3412 Spring garden!","description":"Great, spacious 1 bedroom available in September at 3412 Spring garden! Gated community, laundry room in the building. 1 year lease. 3 months to move in. Pet friendly, $250 one time pet fee, $25 pet rent.\nCall Alena for showing at  show contact info\nCity wide realty\n","num_images":12.0,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T20:13:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-for-rent-near\/7493230602.html","post_id":7493230602,"result_date":"2022-06-06 19:53","title":"House for Rent Near University City","description":"Welcome to this 3 bedroom, 1.5 bathroom home near University City of West Philadelphia. Equipped with central air, hardwood floors and recessed lighting throughout this one is a must see! As you enter through the entrance, you'll find a  living \/dining room combo with tons of character that you can design your way. Continuing through to the kitchen you will find stainless steel appliances and granite countertops. A half bathroom is conveniently located on the first floor next to the entrance to the backyard. Upstairs you will find three decent sized bedrooms with adequate closet space as well as a three-piece bathroom.  Convenient to public transportation and close to local parks Malcolm X, Cedar Park, and Clark Park all in walking distance. Quiet and friendly neighborhood.\nPlease call  show contact info\n‬ to inquire about the property.","num_images":13.0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1.5Ba', 'available jul 1', 'air conditioning', 'application fee details: Venmo application Fee.', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T19:46:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-bright-and-airy-third\/7493228661.html","post_id":7493228661,"result_date":"2022-06-06 19:50","title":"This bright and airy third floor bi-level condo offers the ultimate","description":"This bright and airy third floor bi-level condo offers the ultimate in city living. Imagine being just steps away from fresh produce, shopping, transportation, and entertainment. To live in this home means to live in the hub of the Italian Market, Passyunk Avenue, and Center City. Walk, bike, or drive anywhere with ease. I-95 and the Broad Street Line are both equally and easily accessible, too. As for your lovely new home, it is the perfect marriage of comfort, style, and efficiency. Enjoy gorgeous hardwoods throughout, a modern kitchen and bathroom, custom built storage solutions, and tons of windows pouring in natural light. Become part of a close-knit community with only a handful of neighbors and the fabulous Bibou restaurant.","num_images":22.0,"lat":39.936846,"lng":-75.156696,"attrs":"['1BR \/ 1Ba', '495ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T19:40:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-upper-in\/7493229969.html","post_id":7493229969,"result_date":"2022-06-06 19:48","title":"Spacious 3 bedroom upper in village of Philadelphia","description":"3 bedroom upper,  newly remodeled,  downtown village of Philadelphia, close to Ft. DRUM","num_images":8.0,"lat":44.1589,"lng":-75.7099,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T19:44:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-energy-efficient\/7493226634.html","post_id":7493226634,"result_date":"2022-06-06 19:39","title":"Energy Efficient Appliances, Amazon Package Locker System, Microwave","description":"Bedrooms: 0Bathrooms: 1Square Feet: 530Date Available: 2022-06-06Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:Fitness CenterKitchen IslandCourtyardClose to Public TransportationClose to SchoolsGranite CountertopsDishwasherMicrowaveBreakfast BarElectronic ThermostatRecyclingOn-Site MaintenanceCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/7b3ta7rt\/fairmount-north\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['0BR \/ 1Ba', '530ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T19:35:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-central-air-conditioning\/7493212715.html","post_id":7493212715,"result_date":"2022-06-06 19:03","title":"Central Air Conditioning, Electronic Thermostat, Breakfast Bar","description":"Bedrooms: 0Bathrooms: 1Square Feet: 512Date Available: 2022-06-06Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:BBQ\/Picnic AreaExtra StorageRecyclingElectronic ThermostatCentral Air ConditioningEnergy Efficient AppliancesDog ParkClose to FreewayMicrowaveBike StoragePlaygroundClose to RestaurantsCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/7go6uqac\/fairmount-north\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['0BR \/ 1Ba', '512ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T18:59:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-bedroom-1bath\/7493210028.html","post_id":7493210028,"result_date":"2022-06-06 18:56","title":"2 Bedroom 1Bath","description":"Totally renovated two bedroom one bath apartment. Ground floor with private entrance. Includes full size washer\/dryer, new wide plank hardwood flooring. Includes one designated parking spot in front of unit and storage locker in basement.\nQuiet residential neighborhood. Walking distance to downtown Ardmore and Suburban Square.\nRent includes heat.\nElectric, gas, cable, internet and any streaming services are paid by tennant.\nAll showings by appointment only. Phone calls only, please.\n","num_images":16.0,"lat":40.000312,"lng":-75.282928,"attrs":"['2BR \/ 1Ba', '936ft2', 'available jul 1', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T18:52:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bedroom\/7493188454.html","post_id":7493188454,"result_date":"2022-06-06 18:08","title":"Newly renovated 2 bedroom duplex","description":"Newly renovated 2 bedroom duplex\nBrand new appliances\nCeiling fans in evry room\nNice remodeled bathroom\nEasy access to Frankford Transportation Center\nGreat neighborhood please e-mail if your at interested","num_images":7.0,"lat":40.0178,"lng":-75.0895,"attrs":"['2BR \/ 1Ba', 'available now', 'application fee details: Basic Background check', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T18:02:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bath\/7493182625.html","post_id":7493182625,"result_date":"2022-06-06 18:06","title":"1 Bedroom 1 Bath","description":"1 Bedroom 1 Bath 599 sqft - Unique opportunity to lease your new home with all of the conveniences of a modern condo living. This unit is 599 sqft 1 bedroom 1 bath which includes all of Gotham's amazing amenities being the new fitness facility, rooftop lounge, rooftop pool, rooftop dog park, 2nd floor courtyard with a deck, 1 outdoor kitchen, 1 indoor community kitchen, pet wash room and private trash collection. There is also a common mail room with a secured package room for secure package delivery. In today's \"Amazon World\" it is certainly nice to have an area for secure package delivery versus the traditional delivery method of leaving packages on an unsecure doorstep if no one is home to receive. The building is also equipped with full camera surveillance system that is rarely found in typical townhome living. Another amazing feature of living at The Gotham is you will no longer have that morning hustle to get your coffee or cappuccino. \"The Ground\", a new coffee shop \/ cafe, is moving in to the corner commercial space in The Gotham.","num_images":3.0,"lat":39.978,"lng":-75.1459,"attrs":"['1BR \/ 1Ba', '599ft2', '\\ntuesday 2022-06-07\\n', '\\nwednesday 2022-06-08\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T17:49:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-for-rent-philadelphia\/7493179647.html","post_id":7493179647,"result_date":"2022-06-06 18:00","title":"House for rent Philadelphia","description":"A beautiful single family home with 2 beds and 1 bath, double garage, fenced yard, refrigerator, stoves , washer and dryer included. Freshly painted, clean and lots of parking.","num_images":5.0,"lat":40.049886,"lng":-75.144167,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T17:43:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-just-what-you-need-1157\/7493184274.html","post_id":7493184274,"result_date":"2022-06-06 17:57","title":"Just what you need! 1157 SqFt 2 Bed\/2 Bath only minutes from campus","description":"RENT: $2366 - $2454\/Month | SIZE: 1157 sq ft | BEDROOMS: 2 | BATHROOMS: 2LEASE TERMS: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nABOUT COMMUNITY: Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.Pet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.UNIT FEATURES:   ◾ Air Conditioning & Heating◾ Cable Ready◾ Carpet◾ Ceiling Fans (Select Floor Plans)◾ Dining Room◾ Range, Oven, Disposal, Oven◾ Refrigerator, Freezer and Ice Maker◾ Tub\/Shower◾ Wi-Fi◾ Window Coverings◾ Crown Molding (Select Floor Plans)◾ Dishwasher◾ High Speed Internet Access◾ Linen Closet◾ Microwave◾ Trash Compactor◾ Vaulted Ceiling (Select Floor Plans)◾ Walk-In Closets (Select Floor Plans)◾ Washer\/Dryer◾ Wheelchair Accessible (Rooms)COMMUNITY FEATURES: ◾ 24 Hour Availability◾ Barbecue\/Grill◾ Cardio Machines◾ Conference Room◾ Elevator◾ Online Services◾ Package Service◾ Pet Friendly◾ Recycling◾ Renters Insurance Program◾ BBQ Picnic Garden◾ Billiards, Club Lounge, Cafe Area, Library and Community Room◾ Fitness Center w\/ Free Weights, Weight Machines◾ Message Therapist Practice On-site◾ Outdoor Cafe & Coffee Bar◾ Outdoor Patio Lounge◾ Sprinkler System◾ Storage Space◾ Wi-Fi at ClubhouseCONTACT US TODAY!The Glen at Lafayette Hill555 Andorra Glen Ct  Lafayette Hill, PA 19444Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMWebsite: https:\/\/www.the-glen-apartments.com Professionally managed by Paradise Management, LLC All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":17.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T17:53:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sunny-apartment-in\/7493174880.html","post_id":7493174880,"result_date":"2022-06-06 17:36","title":"Sunny Apartment in Historic Germantown","description":"Located in the heart of historic Germantown. This upcoming transitional neighborhood offers many significant sites and tours. Near Fairmount Park, 20 mins to Center City.\nThis is a newly-renovated, sun-lite first-floor one-bedroom apartment. The apartment offers all new appliances, original wood flooring, and a cozy kitchenette.\nMore pics to come!\nEmail Anthony for a tour of this amazing space!\n","num_images":4.0,"lat":40.044039,"lng":-75.181357,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T17:32:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-ready-to-lease-bed-bath\/7493173199.html","post_id":7493173199,"result_date":"2022-06-06 17:33","title":"Ready to lease! 2 bed 2 bath home. Check us out!","description":"The Glen at Lafayette Hill show contact info\nUnit Details: 2-BR 2-BA | Square Footage: 1157 sq ft | Rental Rates: $2366 - $2454\/Month! Lease Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthApartment Features:✓ Air Conditioning & Heating✓ Cable Ready✓ Ceiling Fans (Select Floor Plans)✓ Dining Room✓ Heating✓ Range, Oven, Disposal, Oven✓ Refrigerator, Freezer and Ice Maker✓ Tub\/Shower✓ Wi-Fi✓ Window Coverings✓ Crown Molding (Select Floor Plans)✓ Dishwasher✓ Microwave✓ Storage Units✓ Tile Floors✓ Trash Compactor✓ Vaulted Ceiling (Select Floor Plans)✓ Walk-In Closets (Select Floor Plans)✓ Washer\/Dryer✓ Wheelchair Accessible (Rooms)About Our Community:We offer the premier location for apartment homes in Lafayette Hill. With a great location and easy access to I-476 (Veteran's Memorial Hwy), you will love calling The Glen Apartments your home. Residents of our Lafayette Hill apartment rentals enjoy our one, two, and three bedroom floor plans that add a touch of style and sophistication to any lifestyle. We boast a number of lavish amenities, including 42-inch kitchen cabinetry, gas cooking, over-sized closets and in-unit washers and dryers. With its convenient location near the most prominent dining, shopping and entertainment venues in Lafayette Hill, The Glen is perfect for commuters all across the Pennsylvania area. Schedule a tour of our luxury Lafayette Hill apartments today and see why residents love coming home to our apartments.Wonderful Amenities:✓ Barbecue\/Grill✓ Business Center✓ Furnished Units Available✓ Multi-Use Room✓ Online Services✓ Package Service✓ Pet Play Area✓ Planned Social Activities✓ Recycling✓ Renters Insurance Program✓ BBQ Picnic Garden✓ Billiards, Club Lounge, Cafe Area, Library and Community Room✓ Fitness Center w\/ Free Weights, Weight Machines✓ Message Therapist Practice On-site✓ Outdoor Cafe & Coffee Bar✓ Outdoor Patio Lounge✓ Sprinkler System✓ Storage Space✓ Wi-Fi at Clubhouse Contact Information:Address: 555 Andorra Glen Ct Lafayette Hill, PA 19444  show contact info\nWebsite: https:\/\/www.the-glen-apartments.comPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.All pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":17.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T17:29:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-in-unit-laundry\/7493165054.html","post_id":7493165054,"result_date":"2022-06-06 17:15","title":"In-Unit Laundry","description":"Bedrooms: 1Bathrooms: 1Square Feet: 457Date Available: 2022-06-06Address: 100 North 17th StreetThe Arch Luxury Apartments embodies Philadelphia’s architectural splendor. A hidden gem between the Comcast towers, the Arch delivers apartments ideal for city-living in a piece of Philadelphia's history! Amenities Include:Efficient AppliancesPatio\/BalconyCarpetingRefrigeratorNewly renovated apartments with contemporary designDishwasherDisposalLarge ClosetsCable ReadyCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/zmntwn6r\/arch\n","num_images":1.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '457ft2', 'available now', '\\nmonday 2022-06-06\\n', '\\ntuesday 2022-06-07\\n', '\\nwednesday 2022-06-08\\n', 'apartment', 'w\/d in unit', 'no parking', 'rent period: daily']","posted_date":"2022-06-06T17:11:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-incredible-amenities-pets\/7493154555.html","post_id":7493154555,"result_date":"2022-06-06 16:53","title":"Incredible Amenities, Pets Welcome, Pool and Sundeck","description":"At The Point at Pennbrook Station, you'll find roomy apartment homes with open floor plans and oversized windows to flood you with light. Breathe easy with 9-foot ceilings and deep closets. Call or visit us today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar and pantry,  walk-in closet, laundry room with washer\/dryer, and a private porch!\nThe Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm","num_images":12.0,"lat":40.226234,"lng":-75.283466,"attrs":"['1BR \/ 1Ba', '852ft2', 'available aug 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T16:49:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedrooms-with-private\/7493151145.html","post_id":7493151145,"result_date":"2022-06-06 16:47","title":"Bedrooms with private bathrooms in a house at the University City","description":"University city-Several bedrooms with private bathrooms in a nice house\n4 individual bedrooms are available in a nice house at the university city. Each bedroom has its own private bathroom.\nThis student house is located between the 43rd Street and the Pine Street at University City, close to all public transportation. Walk distance to the University of Penn, Drexel University, USP, CHOP, and HUP. House was renovated completely recently with hardwood floor and a new kitchen. Tenants need to share a kitchen.\nRent ranges from $700-$850.00 per month, depending on the size of the bedroom.\nElectricity, water, gas, hot water, and furniture are already included in the rent.\nDeposit: 1st month rent, last month rent, a security deposit equal to one-month's rent plus a separate $30.00 application fee for each applicant.\n","num_images":8.0,"lat":39.951069,"lng":-75.209463,"attrs":"['1BR \/ 1Ba', '380ft2', 'available now', 'application fee details: 30', 'cats are OK - purrr', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T16:43:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-central-air-conditioning\/7493137829.html","post_id":7493137829,"result_date":"2022-06-06 16:20","title":"Central Air Conditioning, Pantry, Pet Friendly","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1048Date Available: 2022-06-06Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:Pet FriendlyEnergy Efficient AppliancesHousekeepingKitchen IslandPantryBreakfast BarLatch Security SystemAmazon Package Locker SystemOnline Service RequestsStainless Steel AppliancesClose to FreewayElectronic ThermostatCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/3k6mdcxw\/fairmount-north\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['2BR \/ 2Ba', '1048ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T16:16:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/clifton-heights-coming-soon-beautiful\/7493135350.html","post_id":7493135350,"result_date":"2022-06-06 16:15","title":"Coming soon!! Beautiful 1 Bedroom Deluxe unit - August  31ST","description":"Welcome Home To :  \" Presidential Square Apartments\"\nWe have a Beautiful one bedroom coming up for Mid to the end of August.\nThis is what we call a (one bedroom deluxe unit) . The unit is 734 sq ft\nSome of the apartment features:\n* Kitchen\n* Refrigerator\n* Stove\/oven\n* Dishwasher\n* Microwave\n* Formal dining Area\n* Eat-in Kitchen\nFor more information - Please call or text Denise  show contact info\n) or Email\nEnjoy the Beautiful Photos!\nWon't last long!!\nBest,\nDenise","num_images":6.0,"lat":39.9218,"lng":-75.2876,"attrs":"['1BR \/ 1Ba', '734ft2', 'available aug 31', 'air conditioning', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T16:11:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-traditional-home\/7493116660.html","post_id":7493116660,"result_date":"2022-06-06 16:11","title":"This traditional home offers 4","description":"Welcome to this beautiful single family home in the Mt. Airy West section of Philadelphia. This traditional home offers 4 beds\/2baths and 3 floors worth of living space. A beautiful front yard, perfect for your favorite summer garden, as well as a back yard patio for entertaining. A bonus is the over sized garage perfect for the family cars or the ideal work space. The home also boast high ceilings, a working fireplace and brick mantle, and the area is one of Philly's main attractions. Mt. Airy is home to some of the best historical architecture, miles of multi-use trails, tree lined streets and the area has a small town feel with lots of restaurants, bars, libraries and more for entertaining. The home is conveniently located within 5 minute walking distance from both Chestnut Hill West and Chestnut Hill East train lines making your Center City commute a breeze. Buyers bring your creativity to finish up this beauty and to create the home of your dreams. The home is in need of some repairs, the 3rd floor bathroom is 25% complete, painting needed and some minor changes would make this the ideal space for any new home owner or investor. All new windows (except kitchen) installed in 2020.\n","num_images":1.0,"lat":40.0547,"lng":-75.1866,"attrs":"['4BR \/ 3Ba', '2200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T15:35:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ridley-park-huge-story-bedroom-bathroom\/7493099582.html","post_id":7493099582,"result_date":"2022-06-06 16:07","title":"huge 2-story 3 bedroom, 1 bathroom corner lot duplex in Ridley Park!!","description":"Available immediately. We invite you to visit this huge 2-story 3 bedroom, 1 bathroom corner lot duplex in Ridley Park!! Freshly painted. New wall to wall carpet. Off Street Parking. On main level, there are 3 rooms all with ceiling fans, full bathroom and updated kitchen with sliding doors to outside deck. Head upstairs to even more open space. Upstairs you will find living room with spacious ceiling height and a generous sized bedroom.","num_images":17.0,"lat":39.871,"lng":-75.323,"attrs":"['3BR \/ 1Ba', '2724ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T15:03:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-logan-square-philadelphia\/7493130405.html","post_id":7493130405,"result_date":"2022-06-06 16:06","title":"Logan Square Philadelphia","description":"Bedrooms: 1Bathrooms: 1Square Feet: 641Date Available: 2022-06-06Address: 100 North 17th StreetThe Arch Luxury Apartments embodies Philadelphia’s architectural splendor. A hidden gem between the Comcast towers, the Arch delivers apartments ideal for city-living in a piece of Philadelphia's history! Amenities Include:CarpetingLarge ClosetsNewly renovated apartments with contemporary designDisposalEfficient AppliancesRefrigeratorDishwasherPatio\/BalconyCable ReadyCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/jjockwsx\/arch\n","num_images":1.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '641ft2', 'available now', '\\nmonday 2022-06-06\\n', '\\ntuesday 2022-06-07\\n', '\\nwednesday 2022-06-08\\n', 'apartment', 'w\/d in unit', 'no parking', 'rent period: daily']","posted_date":"2022-06-06T16:02:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1425-locust-st-9e-bright\/7493125219.html","post_id":7493125219,"result_date":"2022-06-06 15:56","title":"1425 Locust St #9E  -- Bright and modern condo at the Aria","description":"1425 Locust St #9E -- Bright and modern condo at the Aria, located in the heart of Center City. This spacious one bedroom one bath unit has it all. The kitchen has GE stainless steel appliances, gas cooktop, granite counter tops and a large breakfast bar. The unit has beautiful dark hardwood floors. An energy efficient Bosch in unit washer and dryer and gorgeous marble counters and floor in the bathroom. This well-established building also offers 24-hour security, concierge, a fitness center, owners lounge and an extra storage space. First, last, and 1 month security deposit due when lease is signed. The application fee is $55\/applicant. Landlord will consider pets. Extra pet deposit due for any approved pets. Building has size and breed restrictions.\nPlease reply by email with any questions, or to schedule a showing.\nJeff “City” Block\nASSOCIATE BROKER\nPA License No.—AB065556\nCITY BLOCK TEAM\nCompass, RE\n1601 Market Street, 19th Floor\nPhiladelphia, PA 19103\nshow contact info\n(main)\nEQUAL OPPORTUNITY HOUSING","num_images":15.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'air conditioning', 'application fee details: $55 application fee per adult applicant', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T15:52:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/haverford-charming-one-bedroom\/7493111378.html","post_id":7493111378,"result_date":"2022-06-06 15:29","title":"Charming One Bedroom","description":"Korman Residential on the Main Line are beautiful apartments in Haverford, PA. We offer unique, spacious floor plan options, and whether you are looking for a MicroSuite, studio, or one-bedroom apartment, each of our rentals has hardwood floors and walk-in closets. The kitchens have fabulous cabinets and countertops with built-in appliances. You’ll love the exceptional curbside appeal. Built in 1926, and once a hotel named Casa Del Sol, our building is listed on the National Historic Register. Our apartments for rent on the Main Line are near Villanova University and located in Lower Merion School District. Located less than 10 miles from Center City, our rentals appeal to Philadelphia apartment shoppers. In addition to traditional residential apartments, we provide corporate and furnished options, and every one includes a long list of great amenities. Living in Haverford, PA at Korman Residential on the Main Line places you two blocks from SEPTA’s regional rail station and close to major roadways so traveling to the city and the surrounding suburbs is convenient. Contact a leasing agent to schedule a personal tour of our Haverford apartments.\n-On site washer and dryer\n-Listed on the National Historic Register\n-Smoke-free apartments available\n-New fitness center\n-This is a cat friendly community\n-24\/7 emergency maintenance service\n-Elevator building\n-Seasonal Bike Share Program\n-Beautiful courtyards\n-Garage and parking lot available\n-Spacious floor plans with large bedrooms and closets\n-Professional on-site management team\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekormanres.com\/6hhxq25n\/korman-residential-on-the-main-line-casa-del-sol-\n","num_images":1.0,"lat":40.0097,"lng":-75.3121,"attrs":"['1BR \/ 1Ba', '651ft2', 'available sep 16', 'apartment', 'laundry on site', 'off-street parking', 'rent period: daily']","posted_date":"2022-06-06T15:25:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-charming-west-chester-boro\/7493108233.html","post_id":7493108233,"result_date":"2022-06-06 15:23","title":"Charming West Chester Boro Home!","description":"Welcome to 216 Magnolia St.  Just redone for you!  One bedroom single family home with gorgeous new hardwood floors throughout.  New eat in kitchen, new washer and dryer on first floor.  Bedroom has vaulted ceiling.  Newly installed brick patio looking out to a scenic fenced in backyard.  On street permit parking available.\nAvailable:  Immediately\nRent:  $1550 plus utilities\nNeeded to rent:  Security deposit, first and last month's rent.\nPets:  $600 refundable pet deposit and $45 monthly pet rent.\n","num_images":10.0,"lat":39.957821,"lng":-75.597947,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T15:19:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-awesome-lower-level-two\/7493096780.html","post_id":7493096780,"result_date":"2022-06-06 15:18","title":"Awesome Lower Level two baths master suite Upper Duplex.","description":"Beautiful home in the Philadelphia Neighborhood. Enjoy the expansive private yard with its own tool shed, nature area out your back yard and Philadelphia. 2 bedroom, 1 bath home w\/beautiful kitchen w\/wolf appliances, kitchen island and a breakfast bar, dining, open living room w\/beautiful views, main level master, 2 additional bdrms. Walk out deck to enjoy the quiet & sip your morning coffee. The LL screen porch is perfect to relax w\/to sound of the birds, or entertain around the firepit in the evening. This home will have everything you need and more; wood floors, wet bar\/Mother-in-law suite in LL w\/full walkout. Come see the light sprawl across the vaulted ceilings and the great features of this home. 4th LL bdrm is nonconforming. * Text me if interested:~  show contact info","num_images":5.0,"lat":39.9845,"lng":-75.2282,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T14:58:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-just-stunning-spacious\/7493103427.html","post_id":7493103427,"result_date":"2022-06-06 15:14","title":"Just stunning! Spacious 2 Bed, 2 bath with lots of light","description":"The Glen at Lafayette Hill 555 Andorra Glen Ct Lafayette Hill, PA 19444  show contact info\nUnit Information: 2 Bedroom | 2 Bath  Unit Size: 1157 sq ft  Monthly Rent: $2366 - $2454 Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month Unit Includes:➢ Air Conditioning & Heating➢ Carpet➢ Ceiling Fans (Select Floor Plans)➢ Dining Room➢ Heating➢ Range, Oven, Disposal, Oven➢ Refrigerator, Freezer and Ice Maker➢ Tub\/Shower➢ Wi-Fi➢ Window Coverings➢ Crown Molding (Select Floor Plans)➢ High Speed Internet Access➢ Microwave➢ Storage Units➢ Tile Floors➢ Trash Compactor➢ Vaulted Ceiling (Select Floor Plans)➢ Walk-In Closets (Select Floor Plans)➢ Washer\/Dryer➢ Wheelchair Accessible (Rooms)Property Description: Are you searching for the best apartments in Lafayette Hill? Look no further than The Glen Apartments. Take a tour of our property to see everything our pet-friendly Lafayette Hill apartments have to offer. Our professional staff is waiting to welcome you home to a care-free lifestyle. Please schedule a tour today and see what the best Lafayette Hill, PA apartments have for you.\n* We have Garages ( Approx. 19.5x9.5) available for $185.00 Monthly & Storage Lockers available for $40.00 Monthly ( Approx. 4x4x7) & $75.00 Monthly ( Approx. 4x8x7)Property Amenities: ➢ 24 Hour Availability➢ Cardio Machines➢ Furnished Units Available➢ Gated, Controlled Access➢ Multi-Use Room➢ Online Services➢ Pet Friendly➢ Pet Play Area➢ Recycling➢ Renters Insurance Program➢ BBQ Picnic Garden➢ Billiards, Club Lounge, Cafe Area, Library and Community Room➢ Fitness Center w\/ Free Weights, Weight Machines➢ Message Therapist Practice On-site➢ Outdoor Cafe & Coffee Bar➢ Outdoor Patio Lounge➢ Sprinkler System➢ Storage Space➢ Wi-Fi at Clubhouse Website: https:\/\/www.the-glen-apartments.comCall us today!  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMPet Ownership Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.Proudly managed by Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY7B1524241C8D4BFC\n","num_images":17.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1157ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T15:10:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-closets-dishwasher\/7493102665.html","post_id":7493102665,"result_date":"2022-06-06 15:13","title":"Large Closets, Dishwasher, Cable Ready","description":"Bedrooms: 1Bathrooms: 1Square Feet: 491Date Available: 2022-06-06Address: 100 North 17th StreetThe Arch Luxury Apartments embodies Philadelphia’s architectural splendor. A hidden gem between the Comcast towers, the Arch delivers apartments ideal for city-living in a piece of Philadelphia's history! Amenities Include:Large ClosetsRefrigeratorEfficient AppliancesPatio\/BalconyNewly renovated apartments with contemporary designCarpetingDishwasherDisposalCable ReadyCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/f75zu7gd\/arch\n","num_images":1.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '491ft2', 'available now', '\\nmonday 2022-06-06\\n', '\\ntuesday 2022-06-07\\n', '\\nwednesday 2022-06-08\\n', 'apartment', 'w\/d in unit', 'no parking', 'rent period: daily']","posted_date":"2022-06-06T15:09:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazon-package-locker\/7493101059.html","post_id":7493101059,"result_date":"2022-06-06 15:10","title":"Amazon Package Locker System, Fitness Center, Elevator","description":"Bedrooms: 2Bathrooms: 2Square Feet: 1046Date Available: 2022-06-06Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:Stainless Steel AppliancesElevatorDishwasherLatch Security SystemRoof DeckDog ParkCentral Air ConditioningPantryRecyclingBreakfast BarPlaygroundTile BacksplashCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/e7gu2v6a\/fairmount-north\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['2BR \/ 2Ba', '1046ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T15:06:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rent-to-own-no-down\/7493087534.html","post_id":7493087534,"result_date":"2022-06-06 15:05","title":"Rent to Own - No Down Payment Needed - North Philadelphia","description":"RENT TO OWN OPPORTUNITY! Here presented to you is a great opportunity to transition from renting to homeownership. We will help you bridge the gap of any obstacles that stand in front of you to help you acquire financing to buy a home. We will work with you if you have bad credit, not enough money saved up for a downpayment, or a short working history. We are also in the process of rehabbing this property so you have the opportunity to pick your own finishes and design your own home! Reach out today to learn more about our program!","num_images":9.0,"lat":40.044366,"lng":-75.126867,"attrs":"['3BR \/ 1Ba', '1104ft2', 'available jul 31', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:41:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-stylish-features-clubhouse\/7493097296.html","post_id":7493097296,"result_date":"2022-06-06 15:03","title":"Stylish Features, Clubhouse with Kitchen, Laundry in Unit","description":"You will love living at The Point at Plymouth Meeting in historic Norristown, PA, there's always something new to explore-whether it's a tasty restaurant, a surplus of shopping opportunities, or one of many historical sites in the region. Contact us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, linen closet, walk-in closet, washer\/dryer, fireplace, and a private patio\/balcony!\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['2BR \/ 2Ba', '1078ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-06T14:59:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-leasing-now-poolside-grill\/7493097056.html","post_id":7493097056,"result_date":"2022-06-06 15:03","title":"Leasing Now, Poolside Grill, Fenced Dog Park","description":"Lease today at The Point at Plymouth Meeting in Norristown, PA. Our community has a resort-style swimming pool, an outdoor lounge, and a newly renovated clubhouse. Contact us for more information!\nThis two level three bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, a half bath, and coat closet are also on this level. Upstairs you will find the three bedrooms and two full bathrooms as well as the washer\/dryer!\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\n[#9254482]","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['3BR \/ 2Ba', '1532ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-06T14:59:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bridgeport-incredible-amenities-laundry\/7493096426.html","post_id":7493096426,"result_date":"2022-06-06 15:02","title":"Incredible Amenities, Laundry in Unit, Poolside Grill","description":"At The Point at Plymouth Meeting, you'll experience a bundle of comforts and conveniences. In the luxury of your apartment home, you can enjoy spacious bedrooms, plush wall-to-wall carpeting, and open floor plans. Call or visit us today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with breakfast bar, entry closet, washer\/dryer, walk-in closet, and a private patio\/balcony!\nThe Point at Plymouth Meeting, managed by Panco Management\n1000 Regatta Circle\nNorristown, PA 19401\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatplymouthmeeting.com\nCommunity Features\n* Outdoor Grill Area\n* Community Lounge\n* E-Lounge\n* Renters Insurance is Required\n* Car Wash Area\n* Extra Storage\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* WiFi Access\n* Bike Racks\n* Package Acceptance\n* Short or Long Term Lease Available\n* Non Smoking Community\n* After-Hours Emergency Maintenance\n* Sun Deck\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Bark Park\n* Swimming Pool\n* Community Kitchen\n* Liability Insurance is Required\n* Minutes from Restaurants, Shopping, and Much More\n* Credit Cards Accepted\n* Easy Freeway Access\n* Smoke Free Community\n* Professionally Managed","num_images":14.0,"lat":40.110645,"lng":-75.324535,"attrs":"['1BR \/ 1Ba', '769ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-06T14:58:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/malvern-apartment-for-rent\/7493092328.html","post_id":7493092328,"result_date":"2022-06-06 14:54","title":"APARTMENT FOR RENT","description":"Two bedroom, two bath apartment for rent located on King Street in the highly sought after Borough of Malvern.  Walking distance to train, shops and restaurants.  $1,720.00 per month plus utilities.  Pets are OK with deposit and monthly fee.  Freshly painted with new carpet.  Two months security deposit required. In unit washer and dryer.  Available June 15th.","num_images":11.0,"lat":40.037203,"lng":-75.50984,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:50:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lease-purchase-option\/7493082877.html","post_id":7493082877,"result_date":"2022-06-06 14:50","title":"Lease Purchase Option - North Philadelphia","description":"LEASE PURCHASE OPPORTUNITY! Here presented to you is a great opportunity to transition from renting to homeownership. We will work with you if you have bad credit, not enough money saved up for a downpayment, or a short working history. We are also in the process of rehabbing this property so you have the opportunity to pick your own finishes and design your own home! Reach out today to learn more about our program!","num_images":9.0,"lat":40.044366,"lng":-75.126867,"attrs":"['3BR \/ 1Ba', '1104ft2', 'available jul 31', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:32:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/levittown-now-accepting-applications\/7493089781.html","post_id":7493089781,"result_date":"2022-06-06 14:49","title":"Now Accepting Applications For Our Wait List","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.foxwoodmanor.com\nFoxwood Manor, managed by Winn Residential\n2180 Veterans Highway\nLevittown, PA 19056\nshow contact info\nFoxwood Manor, where comfort and convenience surrounds you. We have all of the features you need to feel right at home. Contact our leasing office today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, air conditioning, linen closet, tile bathroom flooring, and window coverings.\nMonday 8:00am - 5:00pm\nTuesday 8:00am - 5:00pm\nWednesday 8:00am - 5:00pm\nThursday 8:00am - 5:00pm\nFriday 8:00am - 5:00pm","num_images":20.0,"lat":40.135512,"lng":-74.887679,"attrs":"['1BR \/ 1Ba', '650ft2', 'available dec 3', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:45:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-great-st1-bed-and-bath-1st\/7493073360.html","post_id":7493073360,"result_date":"2022-06-06 14:43","title":"#Great !!!!ST#1 bed and 2 bath 1st floor apartment","description":"Very large 1st floor apartment ... Living room …eat-in kitchen sunroom with Washer\/Dryer … large bedroom ... front porch, nice garden and back yard … close to the bus ... close to shops and only 7 miles from downtown Lansdowne. Available July 1st","num_images":4.0,"lat":39.9375,"lng":-75.2637,"attrs":"['1BR \/ 2Ba', 'available jul 16', 'air conditioning', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:15:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rent-to-own-bad-credit-ok\/7493080628.html","post_id":7493080628,"result_date":"2022-06-06 14:43","title":"Rent to Own - Bad Credit OK - North Philadelphia","description":"RENT TO OWN OPPORTUNITY! Here presented to you is a great opportunity to transition from renting to homeownership. With this program we will help you bridge the gap from renting into homeownership! We will work with you even if you have bad credit, not enough money saved up for a downpayment, or a short working history. We are also in the process of rehabbing this property so you have the opportunity to pick your own finishes and design your own home! Reach out today to learn more about our program!","num_images":9.0,"lat":40.044366,"lng":-75.126867,"attrs":"['3BR \/ 1Ba', '1104ft2', 'available jul 31', 'townhouse', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:28:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/levittown-now-accepting-applications\/7493086509.html","post_id":7493086509,"result_date":"2022-06-06 14:43","title":"Now Accepting Applications For Our Wait List","description":"Foxwood Manor, where comfort and convenience surrounds you. We have all the features you need to feel right at home. Contact our leasing office today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, air conditioning, linen closet, tile bathroom flooring, and window coverings.\nVIEW OUR WEBSITE:\nhttp:\/\/www.foxwoodmanor.com\nFoxwood Manor, managed by Winn Residential\n2180 Veterans Highway\nLevittown, PA 19056\nshow contact info\nApartment Features\n* Dishwasher\n* Linen Closet\n* Disposal\n* Air Conditioning\n* Refrigerator\n* Window Coverings\n* Gas Stove\n* Central Heat and Air","num_images":20.0,"lat":40.135512,"lng":-74.887679,"attrs":"['1BR \/ 1Ba', '650ft2', 'available dec 3', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:39:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bensalem-welcome-to-chelsea-court-in\/7493039580.html","post_id":7493039580,"result_date":"2022-06-06 14:23","title":"Welcome to Chelsea Court in Bensalem!","description":"Welcome to Chelsea Court in Bensalem! This second floor condo in Coventry Green offers a perfect opportunity. The entire condo was updated including a new kitchen with granite counters, and new stainless steel appliances including a double oven. The master bedroom offers great space and a large walk-in closet. The main living space has a floating floor while the bathroom has new tile floors and tub surround with new fixtures. High efficiency windows and new doors were installed also. The open floor plan is great for entertaining and will lead you to a balcony with new decking boards.","num_images":6.0,"lat":40.1109,"lng":-74.9378,"attrs":"['1BR \/ 1Ba', '825ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T13:17:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-contact-us-today-fitness\/7493073497.html","post_id":7493073497,"result_date":"2022-06-06 14:20","title":"Contact us Today, Fitness Center, BBQ Grills","description":"The Point at West Chester offers small town charm close to everything you need. Stop by today for a tour!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nApartment Features\n* Full sized Washer and Dryer in unit\n* Linen Closet\n* Pantry\n* Granite Countertops\n* Private Patio or Private Balcony (on select apartments)\n* Garden Tub\n* Walk-in Closet\n* Ceiling Fan\n* Air Conditioning\n* Pre-wired for internet and cable\nCommunity Features\n* Fitness Studio\n* Playground\n* Billiards\n* Gaming Area\n* EV Charging\n* Bark Park\n* Sun Deck\n* Pet Salon\n* Easy Freeway Access\n* Minutes from Restaurants, Shopping, and Much More\n* Swimming Pool","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1122ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:16:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/concordville-stainless-steel-appliances\/7493073358.html","post_id":7493073358,"result_date":"2022-06-06 14:19","title":"Stainless Steel Appliances, Easy Freeway Access, Gated Dog Park","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nThe Point at Glen Mills has several floor plan layouts to choose from. We offer a wide range of options: including layouts with dens, lofts, and private balconies. No matter which layout you choose you will love living at The Point at Glen Mills. Visit our location today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen with a pantry, breakfast bar, granite countertops and stainless steel appliances. This unit also features coat and linen closets, full sized washer\/dryer, walk-in closet, and nine-foot ceilings!","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['2BR \/ 2Ba', '1058ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-06-06T14:15:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-outdoor-grilling-stations\/7493073125.html","post_id":7493073125,"result_date":"2022-06-06 14:19","title":"Outdoor Grilling Stations, Leasing Now, Move In Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nSchedule a tour today at The Point at Downingtown. We'd love to help you explore our floorplans and let us help you find a new home that perfectly fits your style. Call now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, washer\/dryer, coat closet, built-in desk, walk-in closets, and a master suite!","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1239ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:15:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-stylish-features-clubhouse\/7493073011.html","post_id":7493073011,"result_date":"2022-06-06 14:19","title":"Stylish Features, Clubhouse , Pets Welcome","description":"The Point at Pennbrook Station has something for every season. In the summer, you can enjoy our resort-style pool and poolside barbeque. When it's cooler out, challenge your friends to a pool table or air hockey tournament in our sleek modern clubhouse. Year-round, explore a number of local restaurants, bars, and retail shops. Call for a tour!\nThis second floor three bedroom two bathroom apartment features a fully equipped kitchen with breakfast bar, linen closet, walk-in closet, laundry room with washer\/dryer, an attached garage downstairs with direct access and a private porch!\nThe Point at Pennbrook Station, managed by Panco Management\n100 Reading Circle\nLansdale, PA 19446\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/thepointatpennbrookstation.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm\nCommunity Features\n* Swimming Pool\n* Package Acceptance\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Short Term Lease Available\n* Garage Parking\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Access to Public Transportation\n* After-Hours Emergency Maintenance\n* Bark Park\n* Fitness Studio\n* Outdoor Grill Area\n* WiFi Access\n* Community Kitchen\n* Easy Freeway Access\n* Community Lounge\n* Sun Deck","num_images":11.0,"lat":40.226234,"lng":-75.283466,"attrs":"['2BR \/ 2Ba', '1330ft2', 'available jun 11', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T14:15:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-postal-services-electronic\/7493072460.html","post_id":7493072460,"result_date":"2022-06-06 14:18","title":"Postal Services, Electronic Thermostat, Close to Schools","description":"Bedrooms: 1Bathrooms: 1Square Feet: 656Date Available: 2022-06-06Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:Kitchen IslandBBQ\/Picnic AreaAmazon Package Locker SystemCentral Air ConditioningGranite CountertopsLatch Security SystemPlaygroundEnergy Efficient AppliancesPet FriendlyRoof DeckQuartz CountertopsDog ParkCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/qjsbnv7v\/fairmount-north\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['1BR \/ 1Ba', '656ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:14:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-where-luxury-meets\/7493067975.html","post_id":7493067975,"result_date":"2022-06-06 14:10","title":"Where Luxury Meets Convenience","description":"Available: 7\/30\/22\nApt. 1101 — Manchester floor plan — 1,149 sq. ft. — $3,188\nLocated on the 1st floor, this 2-bedroom\/2-bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full sized front-loading washer and dryer, and stainless steel appliances. The large master bedroom is equipped with a private patio, a walk-in closet and a spacious bathroom with double sink vanity and walk in shower. The second bedroom and bathroom are spacious as well!  This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-06-06T14:06:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-is-stunning-bedroom\/7493065616.html","post_id":7493065616,"result_date":"2022-06-06 14:06","title":"This is a stunning 1 bedroom \/ 1 bathroom apartment featuring hardwood","description":"Available NOW:Welcome to 1237 N 27th St #C! This is a stunning 1 bedroom \/ 1 bathroom apartment featuring hardwood floors, recessed lighting, private roof deck, in-unit laundry, and more! Enter into the common area with a straight back floor and a large window at the front for natural sunlight. There is room for separate living room \/ dining room set ups, and the space flows directly back into the kitchen. Modern kitchen features include geometrical tile backsplash, two-tone cabinetry above & below, an island with counter seating, and stainless steel appliances including dishwasher, fridge, electric range, and built-in microwave. Continue down the hall behind your kitchen to find your stacked washer \/ dryer in a hall closet. Your bedroom is bright and spacious, offering a a full wall of windows and closet for storage. Head into your modern bathroom boasting tile flooring and a lighted floating vanity. Don't forget to check out your private roof deck on your tour - call today!Please note: photos are from a similar unit, exact layouts and finishes may vary.About The Neighborhood:Located on a lively block in the Brewerytown neighborhood of Philadelphia, you’ll be just off of I-76 and surrounded by public transportation routes. Close proximity to many local shops, restaurants, and entertainment including Crime & Punishment Brewing Company, Philadelphia Museum of Art, iMunch Cafe, Sport Gourmet Burgers, Easter State Penitentiary, Pizza Dads, The Philadelphia Zoo, Kelly Drive, and so many more! Walking distance to Athletic Square Park & Recreation Center, the Brewerytown Garden, Lemon Hill Playground, and Girard College.","num_images":5.0,"lat":39.975161,"lng":-75.180213,"attrs":"['1BR \/ 1Ba', '675ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T14:02:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bath-bi-level\/7493061139.html","post_id":7493061139,"result_date":"2022-06-06 13:58","title":"3 bedroom, 2 bath bi-level apartment 7\/1","description":"LARGE 3 bedroom bi-level apartment\nliving room and den on top floor also","num_images":11.0,"lat":39.988456,"lng":-75.155802,"attrs":"['3BR \/ 2Ba', '1200ft2', 'air conditioning', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T13:54:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedroom-jefferson\/7493058758.html","post_id":7493058758,"result_date":"2022-06-06 13:54","title":"Two Bedroom (Jefferson & Temple Med-Students)","description":"This Spacious Two Bedroom apartment features hardwood flooring, with competently tiled bathroom. Upgraded kitchen cabinets with soft-close doors\/drawers. High ceilings giving an openness feel! The apartment also features 9 foot windows that bring in tons of sunlight. Center Heat\/Cooling, is gas.\n✔ Lively Center City Shopping (Fashion District) and Downtown Dining\n✔ Walking distance to Temple University Podiatry, Jefferson University\n✔ Public Transportation (SEPTA Trains and Buses)\n✔ Minutes form the exciting Nightlife of Center City\n✔ In the heart of Chinatown's Grocery Fresh Markets, Popular Restaurants and Karaoke Bars\n✔ The Reading Terminal Market and the Pennsylvania Convention Center just around the corner\nApartment is conveniently next to the Philadelphia Reading Terminal, Fashion District (Mall), Gray Hound, and Market Street Station. We are only seconds walking distance to all major public transportation (bus or train), grocery stores as well as restaurants.\nLaundry facility located within the building on the second floor (coin-op laundry machines). All the rooms are internet and cable ready (you just need to pick the cable provider). Tenant will be responsible for the utilities (gas and electric). Landlord will pay for all sewer, trash removal and clean of the common area.\nSPECIAL PROMO - Monthly Rent Starting At Only $1620 (SPECIAL FALL RATES)\nNon-Refundable Application Fee $60.\nThis is a must rent apartment for Med-Students. Reply to this ad to make a viewing today!\nAsk for any promotions being offered. (studio, one bedroom, two bedroom)\nNO PETS ALLOWED.\n","num_images":0.0,"lat":39.954425,"lng":-75.156891,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'application fee details: $60', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T13:50:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-ft2-washwest-gayborhood\/7493058177.html","post_id":7493058177,"result_date":"2022-06-06 13:53","title":"$1,100 \/ 600ft2 - WashWest\/Gayborhood Large studio w\/ separate kitchen","description":"Charming extra large studio apartment, bath, separate eat-in kitchen. Large floor to ceiling windows and sliding glass door to private rear deck. Hardwood floors, tile bath, exposed brick wall. Water, Hot water,cooking gas and Heat included. In-wall AC. Quiet rear apartment location.","num_images":10.0,"lat":39.946625,"lng":-75.161882,"attrs":"['0BR \/ 1Ba', '600ft2', 'available jul 1', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T13:49:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-apartment\/7493056883.html","post_id":7493056883,"result_date":"2022-06-06 13:51","title":"ONE BEDROOM APARTMENT","description":"ONE BEDROOM APARTMENT\n2ND FLOOR\nAVAILABLE JULY 1ST\nNO PETS\n","num_images":0.0,"lat":39.9227,"lng":-75.1812,"attrs":"['1BR \/ 1Ba', 'available jul 1', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-06-06T13:47:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southampton-welcome-home-to-1301\/7493042224.html","post_id":7493042224,"result_date":"2022-06-06 13:49","title":"Welcome home to 1301 Steamboat Station located in Upper Southampton.","description":"Welcome home to 1301 Steamboat Station located in Upper Southampton. This First Floor Condominium with Brick Pathway leads you to it's private entrance. Just inside the doorway, you will find a tiled entry, coat closet to the right and an open Living Room\/Dining Room area with neutral carpeting to the left. A few steps away, you will find the Spacious Kitchen with Granite Countertop offering lots of Cabinetry and a Separate Washer & Dryer too. The Kitchen overlooks the Interior Garden Area of the Building. A Spacious Bedroom with plush carpeting, window seat and two closets will be your favorite retreat. Updated Bathroom with custom Vanity\/Medicine Cabinet and custom tiled Bathtub\/Shower ensemble with duel shower heads and . Replaced Sliding Glass Door to Exterior Patio with 2 Storage Closets. Close to shopping, public transportation too. All this and more makes 1301 Steamboat Station a great place to call home!","num_images":7.0,"lat":40.1868,"lng":-75.0071,"attrs":"['1BR \/ 1Ba', '911ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T13:21:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/haverford-beautiful-court-yards-close\/7493055628.html","post_id":7493055628,"result_date":"2022-06-06 13:48","title":"Beautiful Court Yards, Close To Train, & Restaurants","description":"Korman Residential on the Main Line are beautiful apartments in Haverford, PA. We offer unique, spacious floor plan options, and whether you are looking for a MicroSuite, studio, or one-bedroom apartment, each of our rentals has hardwood floors and walk-in closets. The kitchens have fabulous cabinets and countertops with built-in appliances. You’ll love the exceptional curbside appeal. Built in 1926, and once a hotel named Casa Del Sol, our building is listed on the National Historic Register. Our apartments for rent on the Main Line are near Villanova University and located in Lower Merion School District. Located less than 10 miles from Center City, our rentals appeal to Philadelphia apartment shoppers. In addition to traditional residential apartments, we provide corporate and furnished options, and every one includes a long list of great amenities. Living in Haverford, PA at Korman Residential on the Main Line places you two blocks from SEPTA’s regional rail station and close to major roadways so traveling to the city and the surrounding suburbs is convenient. Contact a leasing agent to schedule a personal tour of our Haverford apartments.\n-Smoke-free apartments available\n-Complimentary Wi-Fi lounge\n-New fitness center\n-24\/7 emergency maintenance service\n-Spacious floor plans with large bedrooms and closets\n-On site washer and dryer\n-Listed on the National Historic Register\n-Beautiful courtyards\n-Professional on-site management team\n-Garage and parking lot available\n-Elevator building\n-Seasonal Bike Share Program\nCall:  show contact info\nFor more information, visit us at: https:\/\/livekormanres.com\/fqe37s4v\/korman-residential-on-the-main-line-casa-del-sol-\n","num_images":3.0,"lat":40.0097,"lng":-75.3121,"attrs":"['1BR \/ 1Ba', '630ft2', 'available jul 1', 'apartment', 'laundry on site', 'off-street parking', 'rent period: daily']","posted_date":"2022-06-06T13:44:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bi-level-modern-two\/7493004774.html","post_id":7493004774,"result_date":"2022-06-06 13:32","title":"!!--\/\/-- Bi-level Modern Two Bedroom One Bath Unit --\/\/-- Pennsport!!","description":"Bi-level Modern Two Bedroom One Bath. Newer construction. Guaranteed Parking in-front of the property. Second level is open and spacious with a fully loaded gourmet kitchen with full size refrigerator, garbage disposal, dishwasher, electric stove, microwave, plenty of cabinets and granite counter tops. Opens up to a dining and living room with hardwood floors and high hats galore. Text me::- (804) 442-six9^77","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:17:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-two-bedroom\/7493027644.html","post_id":7493027644,"result_date":"2022-06-06 13:12","title":"Beautiful two bedroom apartment with finished basement","description":"This beautiful two bedroom apartment includes a lot of upgrades. The upgrades are crown molding in the Living Room, Ceramic Tile in the bathroom, stainless steel appliances, and finish basement. This apartment is like living in the country but you were only minutes away from everything you need. It is a Quiet and beautiful area. The apartment includes off street parking, private patio, central air, trash, water, sewer, and washer and dryer hook up in the basement. This apartment is a first floor apartment. No pets, no smoking\nText me::- (571) 781-06^5six\nEste hermoso apartamento de dos habitaciones incluye muchas mejoras. Las mejoras incluyen molduras de techo en la sala de estar, azulejos de cerámica en el baño, electrodomésticos de acero inoxidable y acabados en el sótano. Este apartamento es como vivir en el campo pero estabas a solo unos minutos de todo lo que necesitas. Es una zona tranquila y hermosa. El apartamento incluye estacionamiento fuera de la calle, patio privado, aire acondicionado centralizado, recolección de residuos, agua, alcantarillado y conexiones para lavadora y secadora en el sótano. Este apartamento es un apartamento en el primer piso. No mascotas, no fumar\nEnvíame un mensaje de texto si estás interesado: ~ (571) 781-06^5six\n","num_images":5.0,"lat":39.978,"lng":-75.1459,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-06-06T12:57:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-tile-flooring-throughout\/7492994539.html","post_id":7492994539,"result_date":"2022-06-06 13:02","title":"TILE FLOORING THROUGHOUT THE HOME","description":"CALL ( 8 5 5 ) 7 0 2 2 7 1 8___________________________________________________\nCharming 3 bedroom, 1.75 Bath Home, 1 Car Garage, and 1 Car Carport await its new family. This home is conveniently located off 116 N to the new loop that provides easy access to Fort Hood, Central Texas College, and Hwy 190 South.\n____________________________\nThis home features:\nTile Flooring throughout the home\nMini-blinds throughout home\nStainless steel Stove\/Oven with Vent-A-Hood\nStainless steel Dishwasher\nEat-In Kitchen\n3 Bedrooms\n1 Full Bathroom\n3\/4 Bathroom in Master Bedroom\nHis & Her Closets in Master Bedroom\n1 Car Garage AND 1 Car Carport\nCovered Porch\nChain Link Fenced Back Yard\nLocated on a Cul-De-Sac street\nAnd More!\nPet Friendly-Yes\n____________________________________________________________________________\nAll information provided; including square footage, is deemed reliable but not guaranteed. Information for square footage is gathered from County Tax Records and is public information.\nPet Policy: There is a $200.00 Non-Refundable Pet Fee PER Pet and a maximum 2 pet standard. We DO NOT allow aggressive animals to reside in our homes including Pit Bulls, Ankita's, German Shepherds, Rottweilers, Husky, Malamute, Doberman Pinscher, Chow Chow, Great Dane, Saint Bernard, Presa Canarias, Wolf Hybrids, ANY mix of these breeds or ANY vicious animal; regardless of size.\n__________________________________________________________________________________\nIf you would like to view a home please call the office and we will gladly schedule you an appointment to come to check out the keys\n","num_images":1.0,"lat":39.9223,"lng":-75.2338,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-06-06T12:00:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-awesome-lower-level-two\/7493023004.html","post_id":7493023004,"result_date":"2022-06-06 13:01","title":"Awesome Lower Level two baths master suite Upper Duplex.","description":"510 N Broad St, Philadelphia, PA\nBeautiful home in the Philadelphia Neighborhood. Enjoy the expansive private yard with its own tool shed, nature area out your back yard and Philadelphia Gardens Park across the street. 2 bedroom, 1 bath home w\/beautiful kitchen w\/wolf appliances, kitchen island and a breakfast bar, dining, open living room w\/beautiful views, main level master, 2 additional bdrms. Walk out deck to enjoy the quiet & sip your morning coffee. The LL screen porch is perfect to relax w\/to sound of the birds, or entertain around the firepit in the evening. This home will have everything you need and more; wood floors, wet bar\/Mother-in-law suite in LL w\/full walkout. Come see the light sprawl across the vaulted ceilings and the great features of this home. 4th LL bdrm is nonconforming. * For more information and pictures call 🏠 ☎️ show contact info\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nHermosa casa en el vecindario de Filadelfia. Disfrute del amplio patio privado con su propio cobertizo para herramientas, el área natural en su patio trasero y el parque Philadelphia Gardens al otro lado de la calle. Casa de 2 dormitorios, 1 baño con hermosa cocina con electrodomésticos Wolf, isla de cocina y desayunador, comedor, sala de estar abierta con hermosas vistas, principal en el nivel principal, 2 dormitorios adicionales. Salga a la cubierta para disfrutar de la tranquilidad y tomar un sorbo de su café matutino. El porche con pantalla LL es perfecto para relajarse con el sonido de los pájaros o entretenerse alrededor de la hoguera por la noche. Esta casa tendrá todo lo que necesitas y más; pisos de madera, bar con fregadero\/Suite para la suegra en LL con huelga total. Ven a ver la luz que se extiende por los techos abovedados y las excelentes características de esta casa. El cuarto dormitorio LL no cumple con los requisitos. *Para más información y fotos llamar al 🏠 ☎️\n","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-06-06T12:48:58-0400"}]