[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559486501.html","post_id":7559486501,"result_date":"Sun Nov 20 2022 03:18:24 GMT+0000 ","title":"Spacious house for rent","description":"Move in Ready! Brand new beautiful spacious 3 bedroom house along with a finish basement. A lot of lighting and windows allowing plenty of sunlight and shiny house.Brand new bathroom, kitchen, windows, and flooring. Built in laundry in the building! All appliances are brand new including which includes LG refrigerator with an ice maker, LG dishwasher, and Samsung Stove.Convenient Driveway along with a specious backyard. Very convenient area, right behind the house backyard is full of glorious shopping malls, transportation, schools, and markets! In addition the house is 1 street away from the police station. No pets.\nTenants are responsible for all utilities and maintain lawn.\nFor additional info feel free to contact me !\n","num_images":22.0,"lat":40.0606,"lng":-75.0471,"attrs":"['3BR \/ 2Ba', '1700ft2', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T22:14:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559451459.html","post_id":7559451459,"result_date":"Sun Nov 20 2022 02:25:07 GMT+0000 ","title":"Charming Trinity with 1st Flr Eat-In kitchen (dining area) w\/ slidin","description":"Charming Trinity with 1st Flr Eat-In kitchen (dining area) w\/ sliding doors leading to a spacious South-Facing Garden; Upgraded Air Conditioning (2 splits on 2nd and 3rd flrs); original hardwood floors; 1 Bedroom w\/vaulted ceilings on 3rd floor w\/full Bath; Living Room on 2nd flr. ;Lots of light on all 3 floors;Basement with Washer\/Dryer; Move-in Condition","num_images":24.0,"lat":39.968709,"lng":-75.176882,"attrs":"['1BR \/ 1Ba', '720ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T19:29:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559448624.html","post_id":7559448624,"result_date":"Sun Nov 20 2022 01:09:04 GMT+0000 ","title":"Welcome home to this terrific one bedroom residence at the timeless","description":"Welcome home to this terrific one bedroom residence at the timeless 2601 Parkway Condominium. Built in 1940 and designed with a heavy Art Deco influence by Paul Phillipe Cret, this classic Philadelphia building is centrally located in the leafy Fairmount Art Museum neighborhood and within walking distance to Center City. Enter the building and breeze past the attended concierge desk before taking the elevator to your condo. Once inside, beautiful parquet wood floors lead you into a bright and open living room and kitchen. The upgraded kitchen features a white tiled backsplash, dark modern cabinets with stainless hardware, and stainless steel appliances, including a gas range and dishwasher. The premium stone countertops add a layer of sophistication to this hearth of the home while the breakfast bar island provides another area to enjoy meals from. The spacious living room features two large windows and has room enough for most living room sets. Bring along your three seat couch or sectional, additional chair or small loveseat, and media console! The current resident has even fashioned a desk into the living room. After a busy day of city life, retreat to your corner bedroom which comes complete with a spacious closet and en suite tiled bathroom.","num_images":16.0,"lat":39.967793,"lng":-75.180163,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T19:18:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559429440.html","post_id":7559429440,"result_date":"Sun Nov 20 2022 01:02:43 GMT+0000 ","title":"one-, two-, and three-bedroom apartment homes for rent","description":"322 on North Broad offers upscale studio, one-, two-, and three-bedroom apartment homes for rent in trendy downtown Philadelphia, PA. Featuring four unique and luxurious interior finish packages, each sophisticated and spacious apartment offers granite or quartz countertops, stainless steel appliances, designer cabinetry, and wood plank flooring. Here, residents also enjoy access to contemporary community amenities, including a fitness center, resident lounge, and two courtyards. Plus, it is easy to experience the best restaurants and shops the city has to offer - including the ground-level, on-site retail - from 322 on North Broad's highly walkable location. We are currently offering self-guided tours.if you are interested please leave you phone number.","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['3BR \/ 1.5Ba', 'air conditioning', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T18:11:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559452319.html","post_id":7559452319,"result_date":"Sun Nov 20 2022 00:45:26 GMT+0000 ","title":"Super Charming, Heart of Fairmount! Hardwood floors, exposed brick wa","description":"Super Charming, Heart of Fairmount! Hardwood floors, exposed brick walls, huge 18-foot kitchen, a brilliant orange front door and a cozy brick patio! What's not to LOVE?! Located on a friendly street, 766 N. Bucknell features an enormous kitchen with wood cabinets, plenty of counter space, and a large curving butcher block island just right for friends to gather 'round. The living room is bright, cheerful and big enough to handle sectional sofa seating. Upstairs, you'll find a nicely-sized primary bedroom as well as a charming spare multi-purpose space that works as a den\/office\/nursery\/guest or dressing area. (Could easily be converted back to a 2nd bedroom by removing the extra deep closet & adding back partial walls.) Exposed brick walls and a skylight add to the ambiance upstairs. The full modern bathroom is bright and clean with modern fixtures including a shower-tub combo with Jacuzzi jets. The back patio is bricked and has plenty of room for seating and the outdoor grill. The divided basement is well-sized and could easily be finished to create extra living space with a completely separate storage & laundry room area. Along with the new roof and new water heater in 2015, this home features updated appliances and has been freshly painted and is very well maintained. Move-in ready and in easy walking distance to the vibrant Fairmount art, culture and restaurant scene including the museums, library, Kelly Drive & the River Walk, Whole Foods, Trader Joe's, Target, and breweries.","num_images":18.0,"lat":39.969437,"lng":-75.175948,"attrs":"['1BR \/ 1Ba', '720ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T19:32:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559443319.html","post_id":7559443319,"result_date":"Sun Nov 20 2022 00:38:34 GMT+0000 ","title":"IMAGINE gazing down from above, watching the never ending rush of veh","description":"IMAGINE gazing down from above, watching the never ending rush of vehicles weaving along stretches of tar and concrete below, a hodgepodge of colors, shapes and sizes during the day, a lovely choreography of lights at night. Infinite stretch of space above, a kinetic pulse below and, along with other amazing features, it s also HOME. An eloquent design placed on a curve, the north side boasts a wall of stunning windows that grace the living room and the bedroom, a source of continuous natural light. An attractive contrast of handsome dark wood floors paired with stark white cabinetry is themed throughout the space. The kitchen is a smart collection of wood cabinets, granite counters that extend to allow stool seating, and stainless steel appliances. The masterpiece here is a custom-built hutch consisting of an open lattice frame for bottle storage, glass paneled cabinets, and drawers. Behind the kitchen sits a capacious closet housing the stackable washer\/dryer as well as household cleaning items and accessories. An ample coat closet forms the back wall. In short, there is no dearth of storage here! The dining room slips away from the kitchen, placed neatly in the space leading to the wide and expansive living room.","num_images":24.0,"lat":39.955008,"lng":-75.152735,"attrs":"['1BR \/ 1Ba', '1010ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T18:59:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559446959.html","post_id":7559446959,"result_date":"Sun Nov 20 2022 00:37:04 GMT+0000 ","title":"Welcome to 914 Kimball Street! This darling 1 bedroom, 1 bath trinity","description":"Welcome to 914 Kimball Street! This darling 1 bedroom, 1 bath trinity home is located in the highly desired Italian Market neighborhood. Step through your front door to enter into your first-floor living room that flows seamlessly to your kitchen. This first floor is enriched with the natural light, from your backyard sliding glass door, the kitchen area offers built-in shelving and a vintage nonworking fireplace giving your kitchen a little extra charm. From the kitchen, head out to your private backyard where you can enjoy sunny days outdoors in the warmer months. Head upstairs to the second floor which is where you'll find your bedroom and bathroom in this open floor concept layout. The bedroom space features exposed wood beams, built-in shelving, and plenty of closet space for storage.","num_images":19.0,"lat":39.937133,"lng":-75.158486,"attrs":"['1BR \/ 1Ba', '744ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T19:12:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559445083.html","post_id":7559445083,"result_date":"Sun Nov 20 2022 00:30:20 GMT+0000 ","title":"Sun-filled penthouse 1-bedroom with den and loft in the heart of the","description":"Sun-filled penthouse 1-bedroom with den and loft in the heart of the city with views of the city skyline and City Hall. Truly unique, hand-crafted residence designed with artful flair including exposed brick walls, 2 roof skylights, 15ft-high ceilings, giant windows, hardwood floors throughout, and large wood ceiling beams. Upon entering the unit you are greeted with a good sized living room featuring hardwood floors, exposed brick and bar top that flows perfectly into the kitchen. Off of the living room is the large bedroom with a skylight allowing sunlight to pour in. From having your own washer\/dryer in the unit, an upper level 80-sqft loft above the bathroom for extra storage, and hardwood floors throughout, this condo stands out from the rest. Not only does the condo stand out but the location can't be beat! Conveniently located near Jefferson University Hospitals, this condo is within easy walking distance of most major attractions in Philadelphia, and minutes from Reading Terminal, the Gallery, Jefferson (formerly Market East) Station, and freeways 676\/I-95. The elevator building has a doorman with a secured entrance and video surveillance. This home is a walker's paradise with a Walkscore of 99, a rider's paradise with a transit score of 92 and is quick and convenient to restaurants, bars, coffee shops, markets, and stores.","num_images":21.0,"lat":39.955436,"lng":-75.156372,"attrs":"['1BR \/ 1Ba', '711ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T19:05:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559430394.html","post_id":7559430394,"result_date":"Sat Nov 19 2022 23:44:50 GMT+0000 ","title":"Upstairs you'll find 2 nicely sized bedrooms","description":"Say hello to bright and streamlined unit 302 at Frankford Avenue. With an open, entry floor plan this is the quintessential social gathering spot where you can entertain and prepare at the same time. The modern finished kitchen that includes stainless appliances and a natural stone topped island, opens up beautifully to the living space with a bonus powder room for convenience. Upstairs you'll find 2 nicely sized bedrooms, 2 beautifully appointed baths and center hall laundry. For seasonal outdoor pleasure you can retreat to the splendid roof deck where you can see forever.please leave you phone number so i can contact easyly ..","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2.5Ba', 'air conditioning', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T18:14:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559421160.html","post_id":7559421160,"result_date":"Sat Nov 19 2022 23:22:59 GMT+0000 ","title":"!!!💢GREAT LOCATION 2 BEDROOMS APARTMENT READY TO MOVE IN💢!!!!","description":"GREAT LOCATION 2 BEDROOMS APARTMENT READY TO MOVE IN. CALL FOR SHOWING.","num_images":6.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T17:45:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559392799.html","post_id":7559392799,"result_date":"Sat Nov 19 2022 22:33:03 GMT+0000 ","title":"Welcome to 140 Academy Road.","description":"Welcome to 140 Academy Road! This unique home provides endless possibilities for expansion featuring solid all brick construction with a stone foundation. The huge enclosed porch offers plenty of indoor space for entertaining. Another great feature of this home is a brick portico adjacent to the porch, enjoying easy access from car1 to home and provides cover for outdoor activities during inclement weather. Walk inside to a spacious living room with a beautiful gas fireplace to provide plenty of heat for those chilly days There is a small room adjoining the living room that is perfect for a home office. The large centrally located dining room is perfect for family gatherings. There are One nice-sized bedrooms with a convenient hall bath. The walk-up attic offers many possibilities to expand living space or for extra storage. Lots of tasteful vintage features such as all original door and window frame pediments, moldings and baseboards, original interior doors with crystal doorknobs and custom built-ins. Well-equipped kitchen with refrigerator, dishwasher, garbage disposal and ceramic tile floor. Alongside the kitchen is a handy pantry\/prep area.","num_images":24.0,"lat":40.170669,"lng":-75.113965,"attrs":"['1BR \/ 1Ba', '1296ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T16:24:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559376135.html","post_id":7559376135,"result_date":"Sat Nov 19 2022 22:21:43 GMT+0000 ","title":"Available early January, move in for the New Year!","description":"Available early January, move in for the New Year! Showcasing waterfront and city views from the exclusive vantage of a spacious unit in the Society Hill Towers (designed by IM Pei), this stunning two bedroom condo was designed to impress. Featuring floor to ceiling windows with custom treatments, vinyl plank wood flooring, an open concept living area, modern fixtures, and coveted building amenities including a 24 hour concierge, maintenance, as well as underground Parking, health club, and seasonal pool available for an additional monthly fee, this residence has it all. Rent includes all utilities and basic cable\/ internet. Upon entry through the gracious foyer, you will be entranced by the boundless views and natural light shining through the spacious, open living and dining area. The beautiful kitchen will instantly inspire you to begin preparing meals with features such as stainless steel appliances, granite countertops, and upper and lower cabinetry. The main bedroom is complete with a walk-in cedar closet, tons of space, and stunning views of the river. The second bedroom also includes ample closet space, river views, and tons of opportunity for a home office, guest suite, and more. Tiled hall bath just off the hall and across from both of the two bedrooms. The conveniences continue with a small supermarket on site with delivery service, as well as a dry cleaners and the well regarded Zahav Restaurant. Building has a $250 move in fee, and a $50 application fee for required credit and criminal background check. The building is non smoking and restricts pets.","num_images":4.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-11-19T15:42:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559403403.html","post_id":7559403403,"result_date":"Sat Nov 19 2022 22:12:24 GMT+0000 ","title":"3 bedroom, 2 bath home with modern amenities","description":"Wonderful 3 bedroom, 2 bath home with modern amenities in a fantastic Fishtown location! Upon entering this charming home, you are welcomed with a large living room that has pristine hardwood floors and plenty of natural light. This leads to a convenient coat closet as well as access to the fully finished basement and the upscale kitchen that boasts cherry wood cabinetry, granite countertops, a full set of stainless steel appliances, and a custom storage pantry. Kindly text mr James Decker on  show contact info\nHe will be the one to forward you the application processing Asap. Two months' rent to move in (including first, second and security deposit payment ) along with a good tenancy .","num_images":11.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2Ba', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T16:53:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559395137.html","post_id":7559395137,"result_date":"Sat Nov 19 2022 22:09:33 GMT+0000 ","title":"Convenient and Cute.","description":"Convenient and Cute describe this well cared for stone 1 bedroom Souderton Borough cape cod single. From the moment you enter the fenced access area filled with flower beds you feel at home. Entering this home you are greeted by a warm living room with plenty of natural lighting offered through two skylights. In addition the first floor offers an open concept dining area with original hardwood floors and a kitchen complete oak cabinetry, breakfast bar and all appliances. If you love low maintenance you will enjoy the exterior of this home surrounded by privacy fence and a fabulous outdoor courtyard space for relaxation and entertainment and beautiful flower beds. The home is completed with a full basement offering plenty of storage. The home has many updates including a new roof and gutters in 2020 (w\/ lifetime transferrable warranty) updated windows, newer hot water heater (2019).","num_images":13.0,"lat":40.2884,"lng":-75.341,"attrs":"['1BR \/ 1Ba', '1053ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T16:30:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559224801.html","post_id":7559224801,"result_date":"Sat Nov 19 2022 15:40:14 GMT+0000 ","title":"Sun-soaked 1-Bed Filled With Charm Available at the Historic Touraine!","description":"No. 710: Sun-soaked one bedroom filled with charm available at the Historic Touraine Building. This home features a large, fully appointed kitchen with Custom French Country Cabinetry, subway tile, and peninsula for your guests to sit while you’re cooking. The open floorplan also boasts a large closet outfitted with a custom closet kit, and crown molding in the living space. The Touraine: Formerly an elegant residential hotel built in 1917, The Touraine combines original architectural details with modern comforts. The Touraine is Philadelphia's most central and beautiful address. Located on a tree-lined block of Spruce Street, the Touraine is just a quick walk to Rittenhouse Square, the Avenue of the Arts, and all the transportation and shopping of Center City. Ours is a thriving community of locally owned businesses from craft beer to great coffee, bike repair to bagels, and countless beloved BYOB's where you can dine outside. Our block is home to exquisite buildings and vibrant street life. TouraineÃƒÂ¢Ã‚Â€Ã‚Â™s residents enjoy 24\/7 Front Desk Staff, 24 Hour Emergency Maintenance, on-site Management, Package Reception, Online Rent Pay and Service Request Entry through our Resident Portal which can be accessed online or with an app, our Fitness Center & Yoga Studio, Curated Workshops, Hospitality Suites, complimentary and secure document shredding, composting, recycling, Business Center, and more. **Pictures are of a different unit with the same floor plan.\n1520-28 Spruce St #710","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '305591ft2', 'available dec 27', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T10:11:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559235362.html","post_id":7559235362,"result_date":"Sat Nov 19 2022 15:40:12 GMT+0000 ","title":"3 Bedroom house","description":"3 BEDROOM HOUSE RENOVATED\nNEW BATHROOM\nNEW KITCHEN\nBACKYARD SECLUDED BLOCK\nLOCATION: 618 BRINTON STREET 19138 (EAST MOUNT AIRY)\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html\n","num_images":8.0,"lat":40.0568,"lng":-75.1569,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:36:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559227092.html","post_id":7559227092,"result_date":"Sat Nov 19 2022 15:38:54 GMT+0000 ","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #4\nBI-LEVEL\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":21.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:16:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559234730.html","post_id":7559234730,"result_date":"Sat Nov 19 2022 15:38:50 GMT+0000 ","title":"3 Bedroom house","description":"3 BEDROOM HOUSE RENOVATED\nNEW BATHROOM\nNEW KITCHEN\nBACKYARD SECLUDED BLOCK\nLOCATION: 618 BRINTON STREET 19138 (EAST MOUNT AIRY)\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html\n","num_images":8.0,"lat":40.0568,"lng":-75.1569,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:34:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559226486.html","post_id":7559226486,"result_date":"Sat Nov 19 2022 15:38:27 GMT+0000 ","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #4\nBI-LEVEL\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":24.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:15:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559233661.html","post_id":7559233661,"result_date":"Sat Nov 19 2022 15:36:23 GMT+0000 ","title":"Laundry in Unit, Lease Today, Convenient Location","description":"Looking to relocate to Glen Mills, PA? Then look no further than The Point at Glen Mills. Come for a visit and explore the area's vibrant history and culture. Glen Mills, PA stands at the center of a region teeming with historic sites, museums, art galleries and award-winning restaurants. Call now for leasing details!\nThis one bedroom one bedroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features nine-foot ceilings, and a full sized washer\/dryer!\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\n[#9487471]","num_images":18.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '913ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T10:32:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559225105.html","post_id":7559225105,"result_date":"Sat Nov 19 2022 15:35:00 GMT+0000 ","title":"3 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #4\nBI-LEVEL\nTHREE BEDROOM\nTHREE BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":21.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:12:00-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559222258.html","post_id":7559222258,"result_date":"Sat Nov 19 2022 15:29:49 GMT+0000 ","title":"LUXURY AND BEAUTIFUL, NEW CENTER CITY PHILADELPHIA APARTMENTS!!","description":"Luxury Apartments In Center City Philadelphia. Beautiful, new center city Philadelphia apartments; our building has innovative, efficiently designed spaces that take advantage of every square inch for your comfort and convenience. The modern approach allows us to make your wish list achievable not as a dream in the future but right now when you need it most. Center City apartments at its best! Offering studios, 1 bedroom, and 2 bedroom apartment homes. Conveniently located just a few blocks from Rittenhouse Square, and is near the University Of The Arts (UARTS), Peirce College, Moore College of Art and Design, and Drexel College of Nursing. Be in the center of everything! Walk outside your front door and be steps away from Dilworth Park, Rittenhouse Square, the Avenue of the Arts, and countless restaurants, cafes, bars, and shops. See why Avenir is your ideal Center City apartment. People who participate in group fitness make it to the gym 45% more often! Experience the community within your community. Take a virtual spin class when it s convenient. Plan a Friday night workout with old friends or welcome a new neighbor to the community. Work out on your schedule, not someone else's! ** Photos are of model units * Prices and availability subject to change on daily basis **\n42 S 15th St #0B1BA","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '314ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:04:49-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559221824.html","post_id":7559221824,"result_date":"Sat Nov 19 2022 15:29:39 GMT+0000 ","title":"2 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3\nBI-LEVEL\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":8.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:03:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559228508.html","post_id":7559228508,"result_date":"Sat Nov 19 2022 15:24:18 GMT+0000 ","title":"3 Bedroom house","description":"3 Bedroom House\n1 Bathroom\nFront Porch\nFront yard\nHardwood Floors throughout the house\nClose to public transportation\nLOCATION: 56 N Hirst Street, Philadelphia PA 19139 (West Philadelphia)\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html\n","num_images":6.0,"lat":39.9612,"lng":-75.2303,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:20:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559222921.html","post_id":7559222921,"result_date":"Sat Nov 19 2022 15:23:32 GMT+0000 ","title":"2 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3\nBI-LEVEL\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":9.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:06:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559227874.html","post_id":7559227874,"result_date":"Sat Nov 19 2022 15:22:46 GMT+0000 ","title":"3 Bedroom house","description":"3 Bedroom House\n1 Bathroom\nFront Porch\nFront yard\nHardwood Floors throughout the house\nClose to public transportation\nLOCATION: 56 N Hirst Street, Philadelphia PA 19139 (West Philadelphia)\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html\n","num_images":6.0,"lat":39.9612,"lng":-75.2303,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:18:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559222506.html","post_id":7559222506,"result_date":"Sat Nov 19 2022 15:22:20 GMT+0000 ","title":"2 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #3\nBI-LEVEL\nTWO BEDROOM\nTWO & HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION LUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nWe have more available units ranging from two bedrooms to four bedrooms. For more information call the office or go to our website: http:\/\/www.iss-management.com\/rentals.html\nUnits Available:\nUnit 1: 4 Bedroom, 4 Bath - $2,000\nUnit 3: 2 Bedroom, 2.5 Bath - $1,400\nUnit 4: 3 Bedroom, 3 Bath - $1,650\nLOCATION: 2153 N. 19TH STREET 19121","num_images":9.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2.5Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:05:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559224030.html","post_id":7559224030,"result_date":"Sat Nov 19 2022 15:13:20 GMT+0000 ","title":"Sunny 1 bedroom full floor apartment in Rittenhouse Area","description":"Sunny 1 bedroom full floor apartment in Rittenhouse Area. 2nd floor walk up in bright corner building. Wood floors, New kitchen in 2018 including wood cabinetry, appliances and washer\/dryer. Full tile bath with tub\/shower combination. Wood burning fireplace in spacious bedroom. Just blocks to Rittenhouse Square in the heart of everything! Close to shopping, theater, galleries, parks. Easy access to public transportation. and major highways. Owner supplies 2 window A\/C units. Owner pays heat, water, hot water. Tenant pays electric. 1st, last and 1 month security deposit. $50 application fee per person on lease. Pets and any pet fees are at sole discretion of owner. 3 blocks to Rittenhouse Square. Close to Restaurants, Theatre and shopping. Easy access to SEPTA, PATCO, AMTRAK and major highways.\n1701 Pine St #1","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '800ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:09:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559216516.html","post_id":7559216516,"result_date":"Sat Nov 19 2022 15:13:13 GMT+0000 ","title":"Updated 1 bedroom apartment in a landmark building","description":"$500 Security Deposit and 1st Month's Rent to move-in!! Updated 1 bedroom apartment in a landmark building with a newly renovated lobby. Unit features hardwood floors, new windows, a fully-equipped fitness center and bicycle storage. The original home of the Philadelphia Stock Exchange, 1411 Walnut is a historic, mid-rise building centrally located one block off the Avenue of the Arts. Steps away from the front door, you will find a wide array of dining, shopping, and entertainment options. The building is located within walking distance of Rittenhouse Square Park, numerous performing arts colleges, and all forms of public transportation. Pictures are of a similar unit! Video can be provided upon request!","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '970ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:49:13-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559219277.html","post_id":7559219277,"result_date":"Sat Nov 19 2022 15:12:10 GMT+0000 ","title":"LIVE AT PARK TOWNE PLACE APARTMENT HOMES IN CENTER CITY!!","description":"Live at Park Towne Place Apartment Homes in Center City Philadelphia, and you'll be blocks from the center of nightlife in Logan Square and Rittenhouse Square. Unit features modern kitchens, quartz countertops, stainless steel appliances, in-unit washers and dryers, breakfast bars, pendant lighting, tile backsplashes, wood plank flooring throughout, walk-in closets. Stunning city and museum views are offered in a variety of floor plans! Mainstreet Market and Caf , featuring gourmet coffee and tea and much more! Fitness center with Technogym equipment, Queenax boxing gym, yoga\/spin studio with indoor\/outdoor workout space. It boasts Philadelphia's largest pools, an art studio, fitness center with boxing gym, yoga\/spin studio, social lounge with demonstration kitchen, gourmet market and cafe, outdoor lounge with fire pit, 24-hour concierge, 24\/7 package acceptance, resident shuttle service to Center City and University City and more. Make Whole Foods as your second kitchen conveniently located just 1 block away. Our apartments are within one mile of several institutions of higher education: Drexel University, Temple University, University of Penn, CHOP, Moore college of Arts, Community College of Philadelphia. You won't find a better building to live with amenities in the Fairmount Area. Park Towne Place includes 948 apartment and penthouse homes within four high-rise towers. The community is nestled between green acres on the Benjamin Franklin Parkway in the heart of Center City Philadelphia's Museum District. Park Town. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n2200 Benjamin Franklin Pkwy #0B1BA","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['0BR \/ 1Ba', '425ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:57:10-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559215404.html","post_id":7559215404,"result_date":"Sat Nov 19 2022 15:08:13 GMT+0000 ","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR AND A HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLocation: 2153 N. 19TH  STREET 19121\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html","num_images":14.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:46:13-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559221634.html","post_id":7559221634,"result_date":"Sat Nov 19 2022 15:07:12 GMT+0000 ","title":"Make This Fabulous Apartment in a Great Location Your New Home!","description":"Newer high end rehab in Fitler Square Area. This Loft Like 2 bedroom with wonderful light (Northern & Southern Exposure) has it all. Gorgeous kitchen open to living area with granite countertops, stainless appliances, gas range and built-in microwave. Central Air, recessed lighting, high ceilings and hardwood floors add beauty and convenience. The Bathroom has double sinks and stone floors and the bedrooms have Berber carpeting, one with a built in armoire. Other amenities include, free wireless internet and washer and dryer in the apartment. Make this fabulous apartment in a great location your new home! This is a Non Smoking Apartment in a Non Smoking Building. Street Parking Only. Available January 1st 2023\n2227 Kater St #3RD FL","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:03:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559215972.html","post_id":7559215972,"result_date":"Sat Nov 19 2022 15:06:43 GMT+0000 ","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR AND A HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLocation: 2153 N. 19TH  STREET 19121\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html","num_images":18.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:47:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559213787.html","post_id":7559213787,"result_date":"Sat Nov 19 2022 14:57:41 GMT+0000 ","title":"AMAZING ONE BEDROOM ONE BATHROOM APARTMENT","description":"LIMITED TIME OFFER ONE MONTH FREE ON A 12 MONTH LEASE!!!!!!!! LET the SUNSETS be your permanent back drop!!!!!!!!! This ONE BEDROOM residence, at FRANKLIN TOWER, located at 16TH and RACE STREET is a must see!!! All open and spacious living and dining area, kitchen with STAINLESS steel appliances, breakfast bar, and CUSTOM cabinetry. The Bedroom is VERY spacious, with an all tile EUROPEAN style bathroom. There is nothing like FRANKLIN TOWER apartments, in all of Philadelphia!!! With amenities on EVERY FLOOR, Peloton Rooms, Yoga studios, Screening Rooms, Game Rooms, Lounges, and Gyms, as well as the ROOF TOP LOUNGE , with flat screen, grills, and fire place. A BASKETBALL COURT, and GARAGE PARKING. Parking available for additional cost. Photo's are of model unit.","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '656ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:41:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559216818.html","post_id":7559216818,"result_date":"Sat Nov 19 2022 14:54:14 GMT+0000 ","title":"Beautiful 2 BR Apartment - 18XX Church Street","description":"Brand new 2 bedroom apartment\n2nd Floor\nCentral Air\nAvailable Immediately\nTenant pays Gas, Water, and Electric\n$850\/month\nCall Bob @  show contact info","num_images":7.0,"lat":40.0178,"lng":-75.0895,"attrs":"['2BR \/ 1Ba', 'available dec 1', 'air conditioning', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:50:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559214903.html","post_id":7559214903,"result_date":"Sat Nov 19 2022 14:53:53 GMT+0000 ","title":"4 Bedroom Apartment - TEMPLE UNIVERSITY","description":"UNIT #1\nFOUR BEDROOM\nFOUR AND A HALF BATH\nBRAND NEW APPLIANCES\nCENTRAL AIR\nWOOD FLOORING\nLARGE BEDROOMS\nCERAMIC IN KITCHEN AND BATHROOM\nBRAND NEW CONSTRUCTION\nLUXURY APARTMENT\nWASHER AND DRYER IN UNIT\nTEMPLE UNIVERSITY\nLocation: 2153 N. 19TH  STREET 19121\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html","num_images":24.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:44:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559215920.html","post_id":7559215920,"result_date":"Sat Nov 19 2022 14:51:33 GMT+0000 ","title":"2 bedroom, 2 bath apartment with amazing views","description":"Stunning, completely renovated two bedroom, two bathroom residence located on the 19th floor of The Academy House along the Avenue of the Arts! Enter into the foyer with black tile floors and coat closet. The large eat-in kitchen has granite countertops, a peninsula, breakfast nook, modern wood cabinets, subway tile back splash and stainless steel appliances including a Frigidaire electric range, oven and microwave, a Kitchenaid refrigerator, and a Whirlpool dishwasher. The adjacent great room has hardwood floors and city views to the south and east from a private Juliet balcony which can be accessed from each room. The primary suite has great closet space and a spacious ensuite bathroom which features a shower\/tub with subway tile and a double vanity. The second bedroom is spacious and also has a large amount of closet space. Directly across is the hall bathroom which has tile flooring, a contemporary glass vanity, and a shower\/tub. There is a Maytag stackable washer\/dryer in the unit. No detail was left undone in this showplace condominium. The terrace doors were pushed out to increase interior square footage. Residents of Academy House enjoy a 24-hour doorman and a state-of-the-art fitness and aquatic center. There is valet parking in the building's garage for an additional monthly fee, subject to availability. The Academy House is located in the heart of Center City and within close walking distance to Rittenhouse Square, Washington Square, and the Broad Street and Market Street office corridors. The Philadelphia International Airport and Amtrak's 30th Street Station are easily accessible.\n1420 Locust St #19F","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:47:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559212378.html","post_id":7559212378,"result_date":"Sat Nov 19 2022 14:50:29 GMT+0000 ","title":"SPACIOUS 1 BEDROOM APARTMENT FOR RENT","description":"ADDESS: 229 W Upsal St, Philadelphia, PA 19119\n1bd 1ba 553sft\nRent: $600 deposit: $500\ntext: lucy58756𝐆𝐦𝐚𝐢𝐥com\nBeautiful 1 bedroom apartments with 1 bathrooms feature large square footage & modern living space.\nThese apartments is equipped with beautiful kitchens that have either stainless steel, spacious counter tops, and large cabinets. The Living Rooms are spacious with original hardwood floors. The apartments have ample closet space as well as large windows that bring in lots of natural light.\nPelham Park is located only one block away from the SEPTA Regional Rail and Lincoln Drive so we're only minuets away from Center City. We are also close to all of the great locations that Mount Airy, Chestnut Hill & Germantown have to offer.\n","num_images":3.0,"lat":40.0547,"lng":-75.1866,"attrs":"['1BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:37:29-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559215388.html","post_id":7559215388,"result_date":"Sat Nov 19 2022 14:50:10 GMT+0000 ","title":"Gorgeous, Modern 2 BR w\/ HW Floors, Central Air, WD Avail 12\/4!!!","description":"Gorgeous, Modern Second Floor 2 Bedroom, 1 Bath apartment available 10\/5 in newer Boutique Building on prime block in Queen Village bordering Headhouse Square\/Society Hill. Apartment features Hardwood Floors, Central Air, Washer\/Dryer, Gourmet Chef’s Kitchen with Breakfast Bar which opens into the Living Room. Panoramic Roof Deck which is shared with the 3 other units in the building. Available December 4th!!!","num_images":10.0,"lat":39.940574,"lng":-75.14569,"attrs":"['2BR \/ 1Ba', '950ft2', 'available dec 4', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:46:10-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559212539.html","post_id":7559212539,"result_date":"Sat Nov 19 2022 14:41:56 GMT+0000 ","title":"Pets Welcome, Lease Today, Quiet Community","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nApartment Features\n* Kitchen Island\n* Walk-in Closet\n* Linen Closet\n* Garden Tub\n* Stainless Steel Appliances\n* Washer and Dryer in unit\n* Private Patio or Private Balcony (on select apartments)","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '733ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T09:37:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559207858.html","post_id":7559207858,"result_date":"Sat Nov 19 2022 14:28:04 GMT+0000 ","title":"Lease Today, Playground, Luxurious Bathrooms","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nSchedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available nov 23', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T09:24:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559196289.html","post_id":7559196289,"result_date":"Sat Nov 19 2022 14:20:00 GMT+0000 ","title":"2 Bed 1 Bath Furnitured Apartment in Chinatown!","description":"2 Bed 1 bath FURNITURED apartment in Chinatown. Apartment is featured with hardwood floor, granite counter tops, large L shaped kitchen, central air, and laundry in the building. You will enjoy this ultra convenient center city location. Buses and Trains to NYC or D.C. , and Nave Yard Shuttles are just around the corners. It's 2 blocks to Broad Street Line, and surrounded by fantastic eateries and entertainment venues. Apartment is available. Water is included. Check out the YouTube virtual tour first, and call to schedule a showing!\n1211 Race St #2F","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', '6000ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T08:46:00-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559199418.html","post_id":7559199418,"result_date":"Sat Nov 19 2022 14:18:42 GMT+0000 ","title":"PARKING IS INCLUDED WITH THIS FANTASTIC AND SPACIOUS 2 BED, 2 BATH!","description":"PARKING INCLUDED with this fantastic and spacious 2 Bedroom, 2 Bathroom Bi-Level Apartment w\/Garden In The Heart Of The Art Museum Area! Hardwood Floors, Upgraded Kitchen w\/Dishwasher + Washer\/Dryer. No Pets Allowed. First month, last month & security deposit due at lease signing. $50 application fee per applicant.\n2307 Fairmount Ave","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1.5Ba', '1164ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T08:57:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559198716.html","post_id":7559198716,"result_date":"Sat Nov 19 2022 13:58:59 GMT+0000 ","title":"Available Early January, Move in for the New Year!","description":"Available early January, move in for the New Year! Showcasing waterfront and city views from the exclusive vantage of a spacious unit in the Society Hill Towers (designed by IM Pei), this stunning two bedroom condo was designed to impress. Featuring floor to ceiling windows with custom treatments, vinyl plank wood flooring, an open concept living area, modern fixtures, and coveted building amenities including a 24 hour concierge, maintenance, as well as underground Parking, health club, and seasonal pool available for an additional monthly fee, this residence has it all. Rent includes all utilities and basic cable\/ internet. Upon entry through the gracious foyer, you will be entranced by the boundless views and natural light shining through the spacious, open living and dining area. The beautiful kitchen will instantly inspire you to begin preparing meals with features such as stainless steel appliances, granite countertops, and upper and lower cabinetry. The main bedroom is complete with a walk-in cedar closet, tons of space, and stunning views of the river. The second bedroom also includes ample closet space, river views, and tons of opportunity for a home office, guest suite, and more. Tiled hall bath just off the hall and across from both of the two bedrooms. The conveniences continue with a small supermarket on site with delivery service, as well as a dry cleaners and the well regarded Zahav Restaurant. Building has a $250 move in fee, and a $50 application fee for required credit and criminal background check. The building is non smoking and restricts pets.\n220 Locust St #15AS","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '1201ft2', 'available jan 6, 2023', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T08:54:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559197807.html","post_id":7559197807,"result_date":"Sat Nov 19 2022 13:55:35 GMT+0000 ","title":"Large 2 Bed\/2 Bath Available for Rent in the Becker Building!","description":"Large 2 bedroom\/2 bathroom unit(s) available for rent in The Becker Building with PARKING for some units. A classic turn of the century converted warehouse in Philly's trendy Northern Liberties, The Becker Building is just steps from the shops\/restaurants on Liberty's Walk and 2nd Street, one block from the ACME Grocery Store, 2 blocks from the Frankford EL and just 3 blocks from uber hip Frankford Avenue in Fishtown. BECKER BUILDING AMENITIES INCLUDE: INTERCOM , FITNESS CENTER , LARGE OUTDOOR ROOF DECK FOR ENTERTAINING, KEYLESS ENTRY, HIGH CEILINGS, ELEVATOR IN BUILDING, CENTRAL AIR, IN-UNIT WASHER & DRYER, PET FRIENDLY, FRIENDLY 24 HOUR MAINTENANCE, HARDWOOD FLOORS, TRASH INCLUDED, CABLE READY, 24 HOUR SECURITY SYSTEM, PRIVATE PARKING AVAILABLE FOR SOME UNITS FOR AN ADDITIONAL CHARGE.\n1151-61 N 3rd St","num_images":4.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T08:51:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559190544.html","post_id":7559190544,"result_date":"Sat Nov 19 2022 13:51:18 GMT+0000 ","title":"Midtown Village Loft Style Apartments and Duplexes in Center City!","description":"Midtown Village Loft Style Apartments and Duplexes In Center City Philadelphia. At The Collins, you are in the heart of Midtown Village where it's all happening, from street festivals to cocktail hours to art openings. Stake your claim to insider status in the neighborhood's newest shopping-and-dining destination, home to Target Express, Starbucks, Planet Fitness and all of your neighborhood essentials. Indulge in luxury loft living steps from the Blue and Orange lines near the best of downtown. Get into The Collins, and live all in. Whether you need a 1 or 2 bedroom home, The Collins has a variety of loft style floor plan layouts and spacious 2 bedroom duplex options. The Collins is ideally located just moments from University of the Arts (UARTS) and Thomas Jefferson University (Center City Campus). It's also a perfect location for Drexel University, Temple University and University of Pennsylvania (UPENN). ** Photos are of model units ** Pricing and availability subject to change on a daily basis ***\n1125 Sansom St #2B-621","num_images":5.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '1597ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T08:23:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559191142.html","post_id":7559191142,"result_date":"Sat Nov 19 2022 13:46:56 GMT+0000 ","title":"Magnificent 4-beds 5-baths, Townhome Equipped With an Elevator!","description":"Welcome to Northbank, Fishtown's newest development. 3203 Parkview Walk is a magnificent 4-bedroom 5-baths, 3844 sq. ft. townhome equipped with an elevator! It features an open, spacious floorplan, 500 sq. ft. rooftop terrace and beautiful gourmet chef's kitchen that is perfect for entertaining! The owners floor features a patio with view of the water, walk in closet, huge walk-in shower, and soaking tub. The ground floor has a 2 car garage an and a generously sized study that can be used as a home office or an additional bedroom, and private garage parking. The open kitchen includes a large island, separate pantry, and half bath. Features include: - Smart home technology - Energy Star certification - Elevator - 2 car garage - Pella windows - Private rooftop balcony - Chef's kitchen - Open floor plan\n3203 Parkview Walk","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['4BR \/ 5Ba', '3488ft2', 'available nov 30', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T08:25:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559191860.html","post_id":7559191860,"result_date":"Sat Nov 19 2022 13:41:07 GMT+0000 ","title":"BRIGHT & CHEERY STUDIO AT THE DORCHESTER, LOCATED ON RITTENHOUSE SQ!","description":"Bright and cheery studio at The Dorchester, located on Rittenhouse Square! The Dorchester, Unit 402 is a perfectly sized studio with parquet wood floors, great natural light and excellent storage space. Features include a sun-lit living area with oversized windows; a fully-equipped kitchen; and a dressing area that leads to a full bathroom with a single vanity and shower\/tub combination. The Dorchester is located directly on Rittenhouse Square, ranked the 6th best neighborhood in North America. Residents of The Dorchester enjoy a 24-hour doorman, fitness center, all utilities, and basic cable for TV. There is an additional fee for use of the seasonal rooftop pool. Parking is available for rent through the building for an additional fee, subject to availability.\n224-30 W Rittenhouse Sq #402","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '573ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T08:29:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559189310.html","post_id":7559189310,"result_date":"Sat Nov 19 2022 13:36:39 GMT+0000 ","title":"STUNNING, COMPLETELY RENOVATED 2 BEDROOM, 2 BATHROOM RESIDENCE!","description":"Stunning, completely renovated two bedroom, two bathroom residence located on the 19th floor of The Academy House along the Avenue of the Arts! Enter into the foyer with black tile floors and coat closet. The large eat-in kitchen has granite countertops, a peninsula, breakfast nook, modern wood cabinets, subway tile back splash and stainless steel appliances including a Frigidaire electric range, oven and microwave, a Kitchenaid refrigerator, and a Whirlpool dishwasher. The adjacent great room has hardwood floors and city views to the south and east from a private Juliet balcony which can be accessed from each room. The primary suite has great closet space and a spacious ensuite bathroom which features a shower\/tub with subway tile and a double vanity. The second bedroom is spacious and also has a large amount of closet space. Directly across is the hall bathroom which has tile flooring, a contemporary glass vanity, and a shower\/tub. There is a Maytag stackable washer\/dryer in the unit. No detail was left undone in this showplace condominium. The terrace doors were pushed out to increase interior square footage. Residents of Academy House enjoy a 24-hour doorman and a state-of-the-art fitness and aquatic center. There is valet parking in the building's garage for an additional monthly fee, subject to availability. The Academy House is located in the heart of Center City and within close walking distance to Rittenhouse Square, Washington Square, and the Broad Street and Market Street office corridors. The Philadelphia International Airport and Amtrak's 30th Street Station are easily accessible.\n1420 Locust St #19F","num_images":6.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T08:17:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559188084.html","post_id":7559188084,"result_date":"Sat Nov 19 2022 13:35:04 GMT+0000 ","title":"The Best Location in Rittenhouse Square is Available to Rent!!","description":"Half a block way from Rittenhouse Square Park. Roof top deck with spectacular view of the park as seen in the photos. This rental has two generously size bedrooms (11x11 and 19x8) with two full bathrooms. A garden walkway welcomes you as you enter the property through a private gated entrance. The updated kitchen boasts granite counter tops, newer stainless steel appliances and a charming back splash. The second level offers a full bath with subway tiles and pedestal sink as well as a large bedroom (19x8) with more than ample closet space and built-in shelving - this level has plenty of natural light shining through the windows. The third level features a nicely updated full bathroom with an 11x11 bedroom and plenty of natural light. The lower level has a nice sized unfinished basement with a full-size washer and dryer (included with rental). This home is just steps from Rittenhouse Square restaurants, shops, fabulous nightlife, parking garages, public transportation and everything Center City has to offer. Schedule your private showing today. Make yourself at home with 2 very nice size bedrooms (11x11) and (19x8) each with their own full bath. Ask about including your friendly pet or including utilities.\n1830 Manning St","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', '880ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T08:12:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559187474.html","post_id":7559187474,"result_date":"Sat Nov 19 2022 13:13:11 GMT+0000 ","title":"SPREAD OUT IN THIS LUXE 2 BEDROOM, 2 BATHROOM !!","description":"Spread out in this luxe 2 bedroom, 2 bathroom located on a shaded Society Hill block offering solitude. This fully renovated bi-level apartment includes a cooks kitchen with stainless steel appliances (including a dishwasher), in-unit laundry, central air, 2 modern bathrooms, and more. Convenient to TJUH, Pennsylvania Hospital, historic parks, top-rated restaurants, and food markets. Available for immediate occupancy. The building is not dog friendly.\n317 S 6th St #1F","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T08:09:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559186787.html","post_id":7559186787,"result_date":"Sat Nov 19 2022 13:09:34 GMT+0000 ","title":"LIGHT-FILLED 3 BED PLUS DEN BI-LEVEL APTS IN THE HEART OF QUEEN VILLAG","description":"JUST RENOVATED WITH A BRAND NEW KITCHEN!! Light filled 3 bedroom plus den bi-level apartment in the heart of QUEEN VILLAGE! Enormous living and dining area with 15 ft ceilings. Kitchen with MARBLE floor and tons of cabinet and counter space. Each bedroom is well proportioned, with fantastic closets. Additional den\/ in home office is a fantastic bonus, located just off of the living area. New HARDWOOD floors throughout. Central air and gas heat, laundry in building, as well as a charming shared court yard.\n234 Bainbridge St #G3","num_images":5.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1Ba', '1275ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T08:05:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559186541.html","post_id":7559186541,"result_date":"Sat Nov 19 2022 13:08:16 GMT+0000 ","title":"Charming, Just Renovated 2BR\/1BA Townhouse","description":"Be the first to live in the 2BR\/1BA cozy townhouse hidden away on a quiet, no-traffic street with a fantastic sunset view!  Beautiful brand new kitchen with stainless steel appliances, granite counters, under cabinet lighting, built-in microwave, etc.  Oak and pine floors throughout.  Exposed brick wall in the living room.  New windows and furnace.  The larger bedroom has 2 6-foot closets.  Both bedrooms have ceiling fans.  Small, private patio off kitchen.  House is spotlessly clean and just completely painted.  Brand new washer and dryer in clean, dry basement.  It's a perfect house for a couple or a single person.  Not a roommate house. AC units provided.  No pets or smoking, please!  The tenant pays utilities.  Open house, tomorrow, Sunday Nov. 20,   1 PM -3 PM  4255 Boone St.  (off Lofty, off Terrace)","num_images":12.0,"lat":40.02596,"lng":-75.218856,"attrs":"['2BR \/ 1Ba', '960ft2', 'air conditioning', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T08:04:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559181903.html","post_id":7559181903,"result_date":"Sat Nov 19 2022 12:49:28 GMT+0000 ","title":"Beautiful lower apartment with spacious living room and dining room.","description":"*NO SMOKING* *NO VAPING* *NO PETS* Beautiful lower apartment available Dec 1st. Great natural lighting, spacious living room and dining room with new flooring. Beautiful renovated bathroom with storage space and recessed lighting, 3 bedrooms with integrated closet in each room. Stunning remodeled Kitchen with tons of storage space and recessed lighting. Stainless steel appliances included. Own washer, dryer and private space in the basement.\n*Includes Water, Lawn Mowing, snow removal\n*Tenant pays for own gas, electric, and cable utilities\n*Off-Street Parking: 2 private spots in the backyard\n1 year lease agreement $1280\/month. First month rent and Security deposit required.\n","num_images":3.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 1Ba', 'application fee details: $20 App & lease processing fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:37:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559176837.html","post_id":7559176837,"result_date":"Sat Nov 19 2022 12:40:31 GMT+0000 ","title":"Lovely Bi-level Apartment is Located at 239 Fairmount Ave Available Nw","description":"Located at 239 Fairmount Ave (#1) in the highly desirable Northern Liberties section of Philadelphia, we have a lovely bi-level apartment becoming available now. The apartment features one large bedroom and one full bathroom. There are hardwood floors on the main level and tiled floors on the lower level and bathroom. The kitchen has plenty of counter\/cabinet space and is equipped with an electric stove, refrigerator, and dishwasher. The apartment has a lot of character and there is ample space to get creative and really make the place your own. Plenty of closet space. For your convenience, there is a washer\/dryer in the unit. Pets are negotiable. Public transportation is easily assessable. Just a short stroll to Piazza at Schmidt's, bars, restaurants, CVS, Riteaid, etc etc.\n239 Fairmount Ave #1ST FLOOR","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1.5Ba', '1878ft2', 'available now', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T06:58:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559181213.html","post_id":7559181213,"result_date":"Sat Nov 19 2022 12:36:25 GMT+0000 ","title":"SUN SOAKED, FRESHLY PAINTED, NO CARPET, 1BED 1BATH HOME!","description":"Sun soaked, freshly painted, no carpet, 1bed 1bath home located on the grounds of a gated community on the Delaware River. This Waterfront Square Condominium, located in the desired Regatta Building, offers views and amazing amenities, to INCLUDE PARKING, fitness center with indoor pool and a surrounding deck right on top of the river, 3 dog parks, 2 massive green space areas, Center City shuttle service, 24 hour concierge and 24 hour gated security and so much more. The unit features all hardwood floors, stainless steel appliances and in unit laundry. Working from home? The Regatta Community room provides reservable space for any conference, work or social need. Within a few minutes of walking, enjoy all the hotspots of Fishtown, Northern Liberties and the “Del Ave” bars and restaurants. Located just steps to the Spring Garden Elevated Station, bus lines and I95 for quick transit. Don’t wait, enjoy luxury living today! Sorry - No Cats.\n901 N Penn St #R605","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '738ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:32:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559180800.html","post_id":7559180800,"result_date":"Sat Nov 19 2022 12:33:30 GMT+0000 ","title":"Large modern newly renovated home for rent","description":"Beautiful large 3 bedroom, 2 full bathroom home with finished basement that can be used for entertainment or storage. Home will feature a large kitchen, eat in kitchen, large dining room, living room and 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint and brand new countertops and cabinets. Property has recessed lights throughout living and dining room. Washer and dryer hookup can be added. Down the street from cobbscreek parkway and public transportation. Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Across the street from yeadon. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. Serious inquiries only.","num_images":0.0,"lat":39.935773,"lng":-75.231095,"attrs":"['3BR \/ 2Ba', 'available jan 16, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:29:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559178666.html","post_id":7559178666,"result_date":"Sat Nov 19 2022 12:28:32 GMT+0000 ","title":"Experience all of Center City's Comforts at Riverloft Apartments","description":"Experience all of Center City's Comforts at Riverloft Apartments. Let our 24-hour front desk attendant receive your guests, your deliveries, dry cleaning, or anything else you may need. Our high-rise apartment building also offers an on-site ATM and controlled access guest parking and garage parking for an additional fee. Relax in your loft-style apartment with 16-foot ceilings, 12-foot windows and stainless steel kitchen appliances. There are high-tech touches throughout Riverloft - tech bars with data and charging ports provide convenient pit stops, plus there is a tech lounge with pod seating, a gas fireplace and a Smart TV. Riverloft has free Wi-Fi in all common areas, and iPads are available for check-out at the tech bar. Work out in our 24-hour Resort-Style Fitness with state-of-the-art equipment featuring personal TVs and iPod jacks. There are also weight machines and free weights for a lower-impact workout. Located steps from Rittenhouse Square surrounded by world class dinning and shopping. Monthly rent amount varies based on move-in date, and prices subject to change on daily basis. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n2302 Walnut St #0B1BA","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:14:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559179756.html","post_id":7559179756,"result_date":"Sat Nov 19 2022 12:26:21 GMT+0000 ","title":"Newly renovated 3 bedroom home for rent","description":"Beautiful 3 bedroom home for rent. Home will feature a large nice size kitchen, dining and living room along with 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the first floor, fresh paint, brand new countertops and cabinets with new gray carpets on the stairs and second floor. Washer and dryer hookup can be added. Minutes away from shopping and public transportation. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. First month, Last month and Security deposit is required to move in. Serious inquiries only.","num_images":6.0,"lat":39.950362,"lng":-75.238448,"attrs":"['3BR \/ 1Ba', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:22:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559178169.html","post_id":7559178169,"result_date":"Sat Nov 19 2022 12:24:27 GMT+0000 ","title":"FULLY FURNISHED RENTAL WITH HUGE SIDE YARD AVAILABLE!!","description":"Fully furnished rental with huge side yard available for month to month or short term lease. The side yard has a gate that provides plenty of outdoor space for entertaining and or motorcycle and bike parking. Wifi, 65\" TV and water included in the lease. New paint, carpet and lighting fixtures throughout. Prime Northern Liberties location just one block from the train station. Plenty of on street parking right under the I95 overpass. Walk out the front door to some of the best restaurants and bars in the city.\n152 Fairmount Ave","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '1365ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:10:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559177589.html","post_id":7559177589,"result_date":"Sat Nov 19 2022 12:23:05 GMT+0000 ","title":"Spectacular & Grand 2-story\/2 Bedroom, 2 Bathroom Renovated Apts!","description":"Spectacular & Grand 2-story\/2 bedroom, 2 bathroom renovated apartment filled with charming old-world architectural details that features a private rear garden and PARKING located on beautiful Green Street in the heart of the Art Museum Area! First month's rent, last month's rent, and one month's security deposit is sue at lease signing. $50 application fee per applicant.\n1838 Green St #1","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '4040ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:05:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559178660.html","post_id":7559178660,"result_date":"Sat Nov 19 2022 12:18:30 GMT+0000 ","title":"Cozy 3 bedroom house for rent","description":"Beautiful cozy 3 bedroom home with large partially finished basement that can be used for entertainment or storage. Home will feature a kitchen, dining room, living room and 3 cozy bedrooms with alot of closet space. New walnut colored wall to Laminate throughout the house, fresh paint and brand new countertops and cabinets. Washer and dryer hookup can be added. Down the street from the market El train (63rd st station). Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. First month, Last month and security deposit required. Serious inquiries only.","num_images":10.0,"lat":39.967128,"lng":-75.244264,"attrs":"['3BR \/ 1Ba', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:14:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559175574.html","post_id":7559175574,"result_date":"Sat Nov 19 2022 12:14:11 GMT+0000 ","title":"Stop!! Take the Opportunity and See This Beautifully Done 2 Bed\/1 Bath","description":"Take the opportunity to stop by and see this beautifully done 2 bedroom\/1 bath apartment in one of the best locations in the city. Close to the Business District University City Major highways and The Art Museum this apartment provides proximity to everything. The hardwood floors flow throughout the entire apartment; the newly renovated kitchen boasts high end cabinetry and a lot of storage space; the wood-burning fireplace provides the warm cozy feeling during harsh winters and the deck provides the outdoor space for grilling and planting in the spring and summer. This is a must see apartment! Listing agent is related to the owner\n133 N 21st St #3","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T06:46:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559178020.html","post_id":7559178020,"result_date":"Sat Nov 19 2022 12:13:10 GMT+0000 ","title":"HIGH SOARING CEILINGS WITH UNIQUE FLOOR PLAN!! AWESOME 1BED 1BATH","description":"Over 1100 sq ft in desirable MetroClub Condominiums! ! HIGH SOARING CEILINGS with unique Floor Plan!! Awesome 1Bed 1Bath condo & assigned gated parking space for additional cost ! Great kitchen w\/granite countertops & stainless steel appliances. Open liv & din room w\/dark hardwood fl's & beautiful N views fr HUGE windows for TONS of light! Bedroom with large w\/big closet! Bathroom has DOUBLE sinks & all marble. W\/D in UNIT. Building has a ton to offer, including total Renoved Beautiful New designed Hallways Coming Soon on each Floor!! 24 hr security\/concierge, Outdoor POOL and Hot Tub with Cabana Area including Grills and Firepit as well as beautiful GYM, Bike Room ! easy access highways - 95,76 and 676 and short walking to awesome restaurants and city attractions! $1825 deposit due with application, and first and last month due at signing of lease!\n201-59 N 8th St #211","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '1119ft2', 'available dec 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:09:10-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559176560.html","post_id":7559176560,"result_date":"Sat Nov 19 2022 12:13:02 GMT+0000 ","title":"Welcome to This Nice and Bright 3rd Floor Two-bedroom Apartment!","description":"Welcome to this nice and bright 3rd floor two-bedroom apartment in the vicinity of 15th and Fitzwater Streets in the Graduate Hospital area. This unit boasts hardwood floors throughout and bright natural light. Enter the unit into the spacious living room, the kitchen and bathroom are in the center of the unit, and there is one bedroom at the front and one at the back. The kitchen has great cabinet space and in-unit laundry. The bathroom has classic finishes throughout. This apartment is close to delicious restaurants on South Street, and is conveniently close to Broad Street for public transportation. Tenants are responsible for gas and electric utilities. Cat-friendly only. Available now!\n-746 15th #3","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '1518ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T06:56:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559177849.html","post_id":7559177849,"result_date":"Sat Nov 19 2022 12:11:46 GMT+0000 ","title":"WELCOME TO BRIDGEVIEW! LOCATED IN BUSTLING OLD CITY!","description":"SHORT TERM 6 MONTH LEASE. Welcome to Bridgeview! Located in bustling Old City, on a quiet cobblestone street, is a renovated, top floor loft for you to call home. The building features high quality amenities including roof deck, garage parking, 24 hour concierge service, and a thriving association of owners. Your new home, unit 616, is bathed in natural light and features the high ceilings and exposed brick walls of your dreams. Enter the unit and find ample storage by the door before moving toward the kitchen, notice the hardwood floors throughout. You’ll first find an updated kitchen with a fresh new backsplash, stainless steel appliances and tons of storage. From here, you’ll enter the open living space with plenty of room for a dining table and living room set. Notice the size of these windows! You’ll find more closet storage on the way to the full bath that features stone tile and radiant heating in the floors. Next, is the large primary bedroom with two huge windows and more exposed brick. Another closet here for additional storage. Lastly you’ll find a BONUS room that is perfect for a nursery, home office, gym, dressing room, yoga room, guest bedroom or whatever you desire to make of it! Unit 616 comes with a 3x6 storage unit on the 6th floor (near the elevator and unit). GARAGE PARKING AVAILABLE FOR ADDITIONAL $250\/ MO. Easy access to the Market Frankford Line, I-95 and the Ben Franklin Bridge make this a commuter's dream and on the evenings and weekends you are in the heart of everything that Old City has to offer including tons of boutiques, coffee shops, restaurants and museums. Don’t miss your opportunity to claim this stylish home for yourself!\n315 New St #616","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '790ft2', 'available dec 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T07:07:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559177727.html","post_id":7559177727,"result_date":"Sat Nov 19 2022 12:10:27 GMT+0000 ","title":"Wonderful 3 Bedroom, 2.5 Bath Townhouse With a Dedicated Parking Spot","description":"Wonderful 3 bedroom, 2.5 bath townhouse with a dedicated parking spot right in front of this house! Located in Logan Square, Nectarine Street is between 19th & 20th, Spring Garden and Hamilton Streets. Main Floor offers an open floor plan with a spacious dining room and living room with hardwood floors and a charming balcony\/deck. Also on this floor is an exceptional kitchen with beautiful custom wood cabinetry and stainless steel appliances, and a modern half-bath and a laundry area. Upper level offers an amazing main bedroom with an upscale ensuite bathroom, a cathedral ceiling, huge closets, and the most beautiful natural light! There are also 2 more bedrooms with good closets and a fabulous hall bathroom. This townhouse has every amenity! Convenient to shopping, the Art Museum, and Fairmount Park. Available as of 12\/1\/22.\n1924 Nectarine St","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2.5Ba', '1694ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:06:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559177340.html","post_id":7559177340,"result_date":"Sat Nov 19 2022 12:06:44 GMT+0000 ","title":"Enjoy the Conveniences of City Living from This Sunny 1-bed 1-bath Unt","description":"Enjoy the conveniences of city living from this sunny one bedroom, one bath unit in Society Hill Towers with all utilities included! Located on the 5th floor of the West Tower, this home features hardwood floors, walls of oversized windows, and beautiful treetop views. The kitchen is opened up to the living and dining area and features a convenient breakfast bar, gas range, dishwasher and full-sized refrigerator. A spacious bedroom features an oversized closet, and additional closets off the entryway and hall provide great storage space. Part of the I.M. Pei-designed Society Hill Towers, this home is in an esteemed condo community featuring a 24 hr front desk, renovated common lobby, laundry facilities, and guest parking lot (w\/hourly metered parking). The gym, seasonal pool, and garage parking are available to residents at an additional monthly cost. Perfectly located in the heart of historic Society Hill, this home is steps away from Zahav, Ritz 5 theater, ACME, Independence Hall, Penn's Landing, Headhouse Square, and convenient to public transportation and major thoroughfares. Monthly rent includes all basic utilities (electric, gas, water, heating and cooling) with internet\/cable at an additional $64.00\/m.\n210 Locust St #5HW","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '683ft2', 'available jan 2, 2023', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T07:02:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559176249.html","post_id":7559176249,"result_date":"Sat Nov 19 2022 11:57:21 GMT+0000 ","title":"WELCOME TO UNIT 15A IN THE FABULOUS ELLINGTON BUILDING!","description":"Welcome to Unit 15A in the fabulous Ellington building! Unit 15A is a light-filled, south facing corner unit in one of the more spacious layouts of the building. High up on the 15th floor, you have views of South Philadelphia as well as the iconic Comcast building! High ceilings and oversized windows make for a comfortable living & dining space. The kitchen has plenty of cabinet and counter space plus stainless steel appliances. Storage is not an issue in this unit - the hall is lined with deep closets for all of your belongings and both bedrooms have ample closet space. The primary bedroom is complete with an en-suite bathroom. Stackable washer\/dryer is located right off the kitchen. The Ellington is a secure, convenient building with a 24-hour concierge, fitness center, meeting & party rooms, and a library. Several parking garages with monthly options are within a block of the front door. No pets. First, last, and security deposit due prior to move-in. $300 non-refundable move-in fee required by the building. All utilities included except cable\/internet.\n1500 Chestnut St #15A","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '1096ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T06:53:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559175994.html","post_id":7559175994,"result_date":"Sat Nov 19 2022 11:56:11 GMT+0000 ","title":"Modern 4 bedroom home for rent","description":"Beautiful large 4 bedroom home with finished basement that can be used for entertainment or storage. Home will feature a large kitchen, large dining room, living room and 4 spacious bedrooms with alot of closet space. New wall to Laminate throughout the house, fresh paint, a large fireplace and brand new countertops and cabinets. Recessed lights throughout. Washer and dryer hookup up can be added. Down the street from boys Latin high school. Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Move in just in time for the holidays. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. 3rd party vouchers and payments will not be accepted. First month, Last month and security deposit is required to move in. Serious inquiries only.","num_images":20.0,"lat":39.951696,"lng":-75.236861,"attrs":"['4BR \/ 1Ba', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T06:50:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559175900.html","post_id":7559175900,"result_date":"Sat Nov 19 2022 11:53:48 GMT+0000 ","title":"GORGEOUS AND HUGE NEW CONSTRUCTION HOME IN THE HEART OF FISHTOWN!","description":"Absolutely GORGEOUS and HUGE new construction home in the heart of Fishtown available for rent. This property has so much space! There are living rooms on the first and 2nd floors, a fully finished basement, 4 large bedrooms, 2 full bathrooms and a powder room on the first floor. The kitchen has been perfectly updated with lots of cabinets and a gleaming granite island. The kitchen leads to the backyard, a private outdoor oasis with room to play and relax. This home has more windows than the average row home, and each room is filled with a lovely natural light. The location cannot be beat-- super walkable to shops, restaurants bakeries, music venues, breweries, parks, public transportation, shopping, gyms, salons, truly the best of city living at your fingertips! Pets are ok on a case-by case- basis. Easy online application-- available for immediate move-in!\n1212 E Oxford St","num_images":5.0,"lat":39.9788,"lng":-75.1262,"attrs":"['4BR \/ 2.5Ba', '2224ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T06:49:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559175307.html","post_id":7559175307,"result_date":"Sat Nov 19 2022 11:47:17 GMT+0000 ","title":"Modern style 3 bedroom house w\/garage for rent","description":"Beautiful cozy 3 bedroom home with large partially finished basement that can be used for entertainment or storage. Home will feature a kitchen, dining room, living room and 3 cozy bedrooms with alot of closet space. New walnut colored wall to Laminate throughout the house, fresh paint and brand new countertops and cabinets. Washer and dryer hookup can be added. Down the street from the market El train (63rd st station). Minutes away from shopping. University of Penn and drexel is about 10 minutes away. Enjoy 50% off of your 1st month's rent when you secure one of our homes November 10, 2022- November 30, 2022. The special is on a first come first serve basis. If you are interested and would like to move foward, give us a call or send us an email. Must be able to provide proof of funds. 3rd party vouchers and payments are not accepted. First month, Last month and security deposit is required to move in. Serious inquiries only.","num_images":11.0,"lat":39.936534,"lng":-75.232002,"attrs":"['3BR \/ 1Ba', 'available dec 9', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T06:43:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559167948.html","post_id":7559167948,"result_date":"Sat Nov 19 2022 10:27:48 GMT+0000 ","title":"Move In Ready, in the award winning Upper Dublin School District!","description":"Move In Ready, in the award winning Upper Dublin School District! Hardwood floors and stairs have been refinished throughout, all rooms newly painted with neutral tones. Newer roof, siding and HVAC, Whole House Generator. Traditional colonial with formal dining room and living room. Eat in kitchen has a sweet bay window and is adjacent to the family room with a brick fire place. Sliders lead from the family room to the back patio and private backyard. A perfect place for morning coffee or to unwind at the end of the day! A large first floor laundry room is adjacent to the kitchen and leads out to the two car garage. A first floor powder room completes this level. Primary suite, three additional bedrooms and a Full Bathroom complete the upper level. The full basement is unfinished and has ample room for storage! Located in close proximity to Upper Dublin High School and major routes including PA Turnpike, 476, 63, 309, Fort Washington and Ambler Train Stations, Temple University Ambler Campus, Lifetime Fitness and historic downtown Ambler with its terrific restaurants and theater. Take a short walk to Mondauk Park and find a walking trail along with soccer and baseball fields. This wonderful family home, in the top rated Upper Dublin School District, is located in a coveted neighborhood enhanced with sidewalks and mature trees.","num_images":0.0,"lat":39.9523,"lng":-75.1638,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T04:51:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559167911.html","post_id":7559167911,"result_date":"Sat Nov 19 2022 10:14:53 GMT+0000 ","title":"Updated One Bedroom En Suite Bathroom W\/Parking","description":"This is a great 1 bedroom, 1 bathroom first floor condo located on N 3rd Street in Old City with a great back patio for outdoor space! Inside, there is an open layout with beautiful wood plank flooring and a pass-through kitchen with pendant lighting. The updated kitchen features new backsplash, white cabinetry and stainless steel appliances. There is oversized custom trim in the living room and dining area and a convenient slider leading out back. The condo also includes a full bath with glass shower door, tile flooring, modern vanity, fresh neutral paint throughout and a laundry area! The bedroom has a large walk-in closet with custom built-ins. This home is move in ready and includes extra storage in the basement. You can't beat the location, great neighborhood, convenient to restaurants and shopping with easy access to the Ben Franklin Bridge and 95! I am a 44 y\/o professional man currently separating from my wife. I am the VP of a local automation distributor and have been employed there 18 years. I’m looking for a clean tenant to rent this unit temporarily as I am back to ME for work. So at this point, I would like to go month to month indefinitely.","num_images":0.0,"lat":39.9523,"lng":-75.1638,"attrs":"['1BR \/ 1Ba', '700ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T04:50:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559143871.html","post_id":7559143871,"result_date":"Sat Nov 19 2022 05:35:39 GMT+0000 ","title":"$1150 1 Bd Beautiful Bright Apartment","description":"This cozy newly renovated 1 bedroom 1 bathroom is lovely.  With a dining room and living room, and newly installed washer and dryers.  This is a historic block with wonderful neighbors, two blocks from downtown Mt. Airy and one block away from the Sedwick Train Station giving you access to Temple University and downtown without needing a car.","num_images":12.0,"lat":40.061685,"lng":-75.186847,"attrs":"['1BR \/ 1Ba', '650ft2', 'available dec 12', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-18T23:36:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559142778.html","post_id":7559142778,"result_date":"Sat Nov 19 2022 04:53:57 GMT+0000 ","title":"$1550\/ 2br Beautiful Charming Apt.","description":"This newly renovated 2 bedroom 1 bathroom plenty of Sunlight.  This is a historic block with wonderful neighbors, two blocks from downtown Mt. Airy and one block away from the Sedwick Train Station giving you access to Temple University and downtown without needing a car.   Brand new washer and dryer being installed and a beautiful open kitchen plan.  This is a place to call home.","num_images":8.0,"lat":40.061685,"lng":-75.186847,"attrs":"['2BR \/ 1Ba', '900ft2', 'available dec 12', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-18T23:28:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559402178.html","post_id":7559402178,"result_date":"Sat Nov 19 2022 22:03:50 GMT+0000 ","title":"WALK IN CLOSETS!GREAT VIEWS! STEEL APPLIANCES!","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Front Desk attendant during mornings and evenings to greet you and assist you with anything and everythingOnline Payments AvailableUpgraded Gourmet Kitchens with Stainless Steel Appliances, Granite Countertops and Breakfast Bar SeatingBocce ball field48-hour Maintenance CommitmentUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsState-of-the-art fitness center overlooking the Manayunk canalPet-friendly livingHuge walk-in closets with ample storageGame Room with Billiards Table, Shuffle Board, and moreJogging trail right outside your doorCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/75qtbfbq\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['3BR \/ 2Ba', '1364ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: daily']","posted_date":"2022-11-19T16:49:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559402538.html","post_id":7559402538,"result_date":"Sat Nov 19 2022 22:01:51 GMT+0000 ","title":"Jogging trail right outside your door, Bark park, BBQ and deck area","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:Game Room with Billiards Table, Shuffle Board, and moreUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densOnline Payments AvailableOn-site bike storageHuge walk-in closets with ample storageBark parkUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsState-of-the-art fitness center overlooking the Manayunk canalAlexa or Google Home Capable in all ApartmentsFront Desk attendant during mornings and evenings to greet you and assist you with anything and everythingBBQ and deck areaPet-friendly livingCall:  show contact info\nFor more information, visit us at: https:\/\/livewithjrk.com\/knibi3oh\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: daily']","posted_date":"2022-11-19T16:50:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559395272.html","post_id":7559395272,"result_date":"Sat Nov 19 2022 21:54:56 GMT+0000 ","title":"Convenient and Cute describe.","description":"Convenient and Cute describe this well cared for stone 1 bedroom Souderton Borough cape cod single. From the moment you enter the fenced access area filled with flower beds you feel at home. Entering this home you are greeted by a warm living room with plenty of natural lighting offered through two skylights. In addition the first floor offers an open concept dining area with original hardwood floors and a kitchen complete oak cabinetry, breakfast bar and all appliances.","num_images":24.0,"lat":40.1547,"lng":-74.9904,"attrs":"['1BR \/ 1Ba', '1100ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T16:30:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559393479.html","post_id":7559393479,"result_date":"Sat Nov 19 2022 21:29:59 GMT+0000 ","title":"Check us out! We offer washers and dryers in all of our apartments!","description":"Millview Apartments100 Cobblestone Dr Coatesville, PA 19320Pricing: $1617 - $2187\/Month*Bedrooms: 2  Bathrooms: 2 Square Footage: 1018 sq ft show contact info\nFeatures in this apartment home:◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In ClosetsAbout the community:  Our apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort-style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today. Amenities at our property:◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral BonusesAdditional information:Terms: VariablePets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Website: https:\/\/www.apartmentsincoatesvillepa.com\/Phone:  show contact info\nProfessionally managed by Paradise Management, LLC *Prices are subject to change without notice EQUAL HOUSING OPPORTUNITY7252BEBBC7094AC\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1018ft2', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T16:25:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559392528.html","post_id":7559392528,"result_date":"Sat Nov 19 2022 21:27:17 GMT+0000 ","title":"Spacious layout with private washer & dryer! 1178 SqFt 2 Bed, 2 Bath","description":"Welcome home to Millview Apartments! Located at: 100 Cobblestone DrCoatesville, PA 19320 Rental Information:  # of Bedrooms: 2  # of Bathrooms:  2  Square Footage: 1178 sq ft Rental Pricing: $1625 - $2196\/month  Contact our leasing office at  show contact info\nMillview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets. Community Features: ❖ Business Center❖ On-Site Leasing Office❖ Pet-Friendly❖ Private Garages In Select Units❖ 24-Hour Emergency Maintenance❖ Coffee Bar Clubhouse Kitchen❖ Resident Referral BonusesUnit Features:❖ Built-In Microwave❖ Central Heat & Air Conditioning❖ Disability Access In Select Units❖ Dishwasher❖ Full-Size Washer & Dryer In Every Apartment❖ Mini Blinds On All Windows❖ Refrigerator\/Freezer With Ice Maker❖ Walk-In ClosetsOffice Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM show contact info\nPet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets. Leasing Options:  Variable Website: https:\/\/www.apartmentsincoatesvillepa.com\/Management: Paradise Management, LLCEQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 1.5Ba', '1178ft2', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T16:23:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559392460.html","post_id":7559392460,"result_date":"Sat Nov 19 2022 21:27:05 GMT+0000 ","title":"Big Master Bedroom\/ Large Kitchen With Nice Breakfast Bar\/ New Carpet","description":"RENT PERIOD: YEARLY\nAsk about apartment home A07 on the second floor, available now!! Short term leases not available.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up a tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday 9 AM-5 PM and also Saturday from 10:00 AM-4:00 PM. * Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\n-Full Size Washer\/Dryer In select homes.\nCOMMUNITY FEATURES:\n-On-Site Management\n-On-site maintenance\/24 hour emergency service\n-Septa Bus stop on the corner\n-Ivy Ridge Train Station blocks away\n-Online Payments Available\n-Cable Ready\n-On line service request\n-Septa Transportation outside the Rental Office\n-Pool located at sister property(Pool membership available. Fees Apply)\n-Gym located at sister property\nThe Metropolitan Manayunk Hill apartment homes, are just minutes to Center City Philadelphia, Manayunk Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA turnpike. Walk to Ivy Ridge Shopping Center and ShopRite Supermarket. Convenient to Ivy Ridge Train Station to Center City, Andorra Shopping Center, Target and more! The Metropolitan Manayunk Hill apartment homes are a great choice for both convenience and a quality of life. that's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity.\n","num_images":13.0,"lat":40.043502,"lng":-75.236199,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T16:23:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559391150.html","post_id":7559391150,"result_date":"Sat Nov 19 2022 21:23:30 GMT+0000 ","title":"Open the door to great living at Millview Apartments","description":"Community Location: 100 Cobblestone Dr - Coatesville, PA 19320 Rental Information: $1489 - $1969\/Month | 1 Bedroom 1 Bath | 845 sq ftLeasing Options:  Variable show contact info\nApartment Amenities:  ➢ Built-In Microwave➢ Central Heat & Air Conditioning➢ Disability Access In Select Units➢ Dishwasher➢ Full-Size Washer & Dryer In Every Apartment➢ Mini Blinds On All Windows➢ Refrigerator\/Freezer With Ice Maker➢ Walk-In ClosetsProperty Features: ➢ Business Center➢ On-Site Leasing Office➢ Pet-Friendly➢ Private Garages In Select Units➢ 24-Hour Emergency Maintenance➢ Coffee Bar Clubhouse Kitchen➢ Resident Referral Bonuses Description: Nestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Call: Millview Apartments at  show contact info\nWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/EQUAL HOUSING OPPORTUNITY621A2A371E6A4B8\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['1BR \/ 1Ba', '845ft2', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T16:19:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559390294.html","post_id":7559390294,"result_date":"Sat Nov 19 2022 21:21:15 GMT+0000 ","title":"Nice Breakfast Bar, Stackable Washer & Dryer, Bright Apartment, Pool","description":"RENT PERIOD: YEARLY\nAsk about apartment home H09 on the third floor, available soon!! Short term leases not available.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up a tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday - Friday 9 AM-5 PM and also Saturday from 10:00 AM-4:00 PM. * Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\n-Full Size Washer\/Dryer In select homes.\nCOMMUNITY FEATURES:\n-On-Site Management\n-On-site maintenance\/24 hour emergency service\n-Septa Bus stop on the corner\n-Ivy Ridge Train Station blocks away\n-Online Payments Available\n-Cable Ready\n-On line service request\n-Septa Transportation outside the Rental Office\n-Pool located at sister property(Pool membership available. Fees Apply)\n-Gym located at sister property\nThe Metropolitan Manayunk Hill apartment homes, are just minutes to Center City Philadelphia, Manayunk Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA turnpike. Walk to Ivy Ridge Shopping Center and ShopRite Supermarket. Convenient to Ivy Ridge Train Station to Center City, Andorra Shopping Center, Target and more! The Metropolitan Manayunk Hill apartment homes are a great choice for both convenience and a quality of life. that's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity.\n","num_images":8.0,"lat":40.043502,"lng":-75.236199,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T16:17:15-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559387496.html","post_id":7559387496,"result_date":"Sat Nov 19 2022 21:14:12 GMT+0000 ","title":"This place will feel like home! 1 bed, 1 bath available! 809 Sq Ft!","description":"Welcome home to Silk Factory Lofts! Located at: 200 S Line StLansdale, PA 19446 Rental Information:  # of Bedrooms: 1  # of Bathrooms:  1  Square Footage: 809 sq ft Rental Pricing: $1785\/month  Contact our leasing office at  show contact info\nSEE WHAT YOU'VE BEEN MISSING  Live the luxurious lifestyle you're looking for in a building rich with history enhanced with modern amenities at Silk Factory Lofts. Our Lansdale, PA apartments feature open-concept loft-style layouts with high ceilings, chic kitchens, and oversized windows that make each home bright and welcoming. Communal spaces are designed with residents' comfort and convenience in mind at our Lansdale apartments. Residents can hang out in our upscale lounge, maintain work out goals at the on-site fitness center, and so much more at our apartments in Lansdale, PA. Community Features: ◾ 18' Long Shuffle Board◾ 2 Weber Propane Grills◾ Business Center◾ Dog Wash Room◾ Game Room & Free Wi-Fi◾ Monthly Community Events◾ Package Service◾ Pet-Friendly Community◾ Pool Table◾ Vintage Building◾ Beautifully Landscaped Grounds with Access to Local Businesses◾ Close to Montgomeryville Mall and Routes 202 & 309◾ Community Lounge featuring free Verizon Fios TV\/Wi-Fi◾ Courtyard featuring tasteful Outdoor Seating and Fire Pits◾ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting◾ Lobby Area with Complimentary Coffee◾ Maintenance-Free Lifestyle◾ Professional On-Site Management Team◾ Storage units - $50\/$75 per month◾ Within Walking Distance to TrainsUnit Features:◾ Cable & Hi-Speed Internet Ready◾ Central Air Conditioning◾ Courtyard View in select apartments◾ Dishwasher◾ Full Size Washer & Dryer◾ Range \/ Oven◾ Refrigerator\/Freezer◾ Secured Building Access◾ Storage Spaces◾ Upgraded Kitchens in Select Apartments◾ Cable & Hi-Speed Internet Ready◾ Central Air Conditioning◾ Courtyard View (select apartments)◾ Dishwasher◾ Full-Size Washer & Dryer◾ Range \/ Oven◾ Refrigerator\/Freezer◾ Secured Building Access◾ Storage Spaces◾ Upgraded Kitchens (select apartments)Office Hours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM show contact info\nPet Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German Sheph Leasing Options:  3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/Management: Paradise Management, LLCIncome requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY261CE302F50E4B\n","num_images":24.0,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '809ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T16:10:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559386744.html","post_id":7559386744,"result_date":"Sat Nov 19 2022 21:12:32 GMT+0000 ","title":"Amazing 1 Bed, 1 Bath with public transit access! 797 Sq Ft!","description":"Silk Factory Lofts Visit our community today! 200 S Line St Lansdale, PA 19446 show contact info\nUnit Rates:  $1777\/month Unit Type: 1-BR 1-BA Unit Size: 797 sq ftLease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthPet Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephWhat you’ll find in our community: ❖ 18' Long Shuffle Board❖ 2 Weber Propane Grills❖ Business Center❖ Dog Wash Room❖ Elevator❖ Monthly Community Events❖ Package Service❖ Pet-Friendly Community❖ Pool Table❖ Smoke-Free❖ Beautifully Landscaped Grounds with Access to Local Businesses❖ Close to Montgomeryville Mall and Routes 202 & 309❖ Community Lounge featuring free Verizon Fios TV\/Wi-Fi❖ Courtyard featuring tasteful Outdoor Seating and Fire Pits❖ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting❖ Free Parking - 2 Spaces per Apartment Home + Guest Parking❖ Lobby Area with Complimentary Coffee❖ Maintenance-Free Lifestyle❖ Professional On-Site Management Team❖ Storage units - $50\/$75 per monthDescription: SEE WHAT YOU'VE BEEN MISSING  Discover an upscale lifestyle at Silk Factory Apartments. Our landmark historic building features a brick exterior, soaring ceilings, large windows, and a beautiful courtyard with outdoor lounge seating and firepits, a picnic and grilling area with gas grills, and a community herb garden. Inside your spacious loft-style apartment you'll find modern style from your updated kitchen with dishwasher, stove, refrigerator, and microwave, to central air conditioning, and a private in-home washer and dryer. Call us today for a tour!This unit comes with: ❖ Cable & Hi-Speed Internet Ready❖ Central Air Conditioning❖ Courtyard View in select apartments❖ Dishwasher❖ Large Windows❖ Range \/ Oven❖ Refrigerator\/Freezer❖ Secured Building Access❖ Storage Spaces❖ Upgraded Kitchens in Select ApartmentsCall or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/Property Management: Paradise Management, LLCIncome requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY5B53DF9B2A4041\n","num_images":24.0,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '797ft2', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T16:08:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559386059.html","post_id":7559386059,"result_date":"Sat Nov 19 2022 21:10:57 GMT+0000 ","title":"Stay warm! In-unit heating provided at Silk Factory Lofts!","description":"Silk Factory Lofts Visit our community today! 200 S Line St Lansdale, PA 19446 show contact info\nUnit Rates:  $2283\/month Unit Type: 2-BR 1.5-BA Unit Size: 1411 sq ftLease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthPet Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephWhat you’ll find in our community: ✓ 18' Long Shuffle Board✓ 2 Weber Propane Grills✓ Business Center✓ Dog Wash Room✓ Monthly Community Events✓ Package Service✓ Pet-Friendly Community✓ Pool Table✓ Smoke-Free✓ Vintage Building✓ Beautifully Landscaped Grounds with Access to Local Businesses✓ Close to Montgomeryville Mall and Routes 202 & 309✓ Community Lounge featuring free Verizon Fios TV\/Wi-Fi✓ Courtyard featuring tasteful Outdoor Seating and Fire Pits✓ Free Parking - 2 Spaces per Apartment Home + Guest Parking✓ Lobby Area with Complimentary Coffee✓ Maintenance-Free Lifestyle✓ Professional On-Site Management Team✓ Storage units - $50\/$75 per month✓ Within Walking Distance to TrainsDescription: SEE WHAT YOU'VE BEEN MISSING  Located in the heart of Lansdale, Pennsylvania, Silk Factory Lofts offer an irresistible lifestyle set in a historic landmark building. Our open loft-style apartments feature oversized windows, high ceilings and modern kitchens. Our community boasts an upscale resident lounge, modern fitness center and beautiful courtyards. Apartment options include 1, 2 and 3 bedroom floor plans. Silk Factory Lofts is located close to public transportation, shopping, dining and entertainment. If you want to venture out, we offer convenient access to major highways, and we're less than an hour from downtown Philadelphia.This unit comes with: ✓ Cable & Hi-Speed Internet Ready✓ Central Air Conditioning✓ Courtyard View in select apartments✓ Full Size Washer & Dryer✓ Large Windows✓ Range \/ Oven✓ Refrigerator\/Freezer✓ Secured Building Access✓ Storage Spaces✓ Upgraded Kitchens in Select ApartmentsCall or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/Property Management: Paradise Management, LLCIncome requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYF76CF909050544A5\n","num_images":24.0,"lat":40.237106,"lng":-75.280919,"attrs":"['2BR \/ 1.5Ba', '1411ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T16:06:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559376148.html","post_id":7559376148,"result_date":"Sat Nov 19 2022 20:59:45 GMT+0000 ","title":"Large 1 bedroom\/1 bathroom unit(s) available for rent-$","description":"Large 1 bedroom\/1 bathroom unit(s) available for rent in The Becker Building with PARKING for some units. A classic turn of the century converted warehouse in Philly's trendy Northern Liberties, The Becker Building is just steps from the shops\/restaurants on Liberty's Walk and 2nd Street, one block from the ACME Grocery Store, 2 blocks from the Frankford EL and just 3 blocks from uber hip Frankford Avenue in Fishtown. BECKER BUILDING AMENITIES INCLUDE: INTERCOM , FITNESS CENTER , LARGE OUTDOOR ROOF DECK FOR ENTERTAINING, KEYLESS ENTRY, HIGH CEILINGS, ELEVATOR IN BUILDING, CENTRAL AIR, IN-UNIT WASHER & DRYER, PET FRIENDLY, FRIENDLY 24 HOUR MAINTENANCE, HARDWOOD FLOORS, TRASH INCLUDED, CABLE READY, 24 HOUR SECURITY SYSTEM, PRIVATE PARKING AVAILABLE FOR SOME UNITS FOR AN ADDITIONAL CHARGE.","num_images":4.0,"lat":40.7195,"lng":-76.1158,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2022-11-19T15:42:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559380822.html","post_id":7559380822,"result_date":"Sat Nov 19 2022 20:58:24 GMT+0000 ","title":"Schedule a Tour, Granite Countertops, Playground","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nA pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Dry Cleaning and Laundry Service\n* Credit Cards Accepted\n* Controlled Access\n* Non Smoking Community\n* TV Lounge\n* Garage Parking\n* Outdoor Grill Area\n* Elevator\n* Sun Deck\n* Billiards\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Extra Storage\n* Landscaped Courtyards\n* Bike Racks\n* After-Hours Emergency Maintenance\n* Movie Theatre\n* Professionally Managed\n* Bark Park\n* Fitness Studio\n* Package Acceptance\n* Swimming Pool\n* WiFi Access\n* Short or Long Term Lease Available\n* Playground\n* Easy Freeway Access\n* Community Kitchen\n* EV Charging\n* Pet Salon\n* Gaming Area\n* Minutes from Restaurants, Shopping, and Much More\n* Renters Insurance is Required\n* Long Term Lease Available\n* Community Lounge\n[#9487997]","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1190ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T15:54:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559379746.html","post_id":7559379746,"result_date":"Sat Nov 19 2022 20:55:39 GMT+0000 ","title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"The Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nFind yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two story two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, two patio\/balconies, and a loft with a closet upstairs!","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1199ft2', 'available nov 30', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T15:51:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559377136.html","post_id":7559377136,"result_date":"Sat Nov 19 2022 20:49:12 GMT+0000 ","title":"One-Month FREE! Near Parking, PETS, W\/D, 24\/7 Fitness Center","description":"🍂FALL in Love with Wynnewood- Apply Now - Receive One-Month FREE🍂\nApt #A-20 Second floor apartment w\/ beautiful courtyard view. Newly renovated, close to the train & shopping!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 8:30 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":24.0,"lat":40.0,"lng":-75.276,"attrs":"['2BR \/ 1Ba', '897ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T15:45:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559373277.html","post_id":7559373277,"result_date":"Sat Nov 19 2022 20:39:03 GMT+0000 ","title":"Two Bedroom with Split Bedrooms and Washer and Dryer","description":"The Glen at Lafayette Hill Bedroom: 2 | Bathroom: 2Square Footage: 1078 sq ftMonthly Rent: $2142 - $2695 show contact info\nCommunity Description  Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.-Split Bedrooms\n-Generous Laundry Room\n-Abundant Closet Space\n-High Ceilings    Community Amenities✓ 24 Hour Availability✓ Barbecue\/Grill✓ Business Center✓ Cardio Machines✓ Conference Room✓ Multi-Use Room✓ Package Service✓ Pet Play Area✓ Planned Social Activities✓ Renters Insurance Program✓ BBQ Picnic Garden✓ Billiards, Club Lounge, Cafe Area, Library and Community Room✓ Fitness Center w\/ Free Weights, Weight Machines✓ Message Therapist Practice On-site✓ Outdoor Cafe & Coffee Bar✓ Outdoor Patio Lounge✓ Sprinkler System✓ Storage Space✓ Wi-Fi at ClubhouseUnit Features✓ Air Conditioning & Heating✓ Cable Ready✓ Carpet✓ Ceiling Fans (Select Floor Plans)✓ Dining Room✓ Heating✓ Range, Oven, Disposal, Oven✓ Tub\/Shower✓ Wi-Fi✓ Window Coverings✓ Crown Molding (Select Floor Plans)✓ Dishwasher✓ High Speed Internet Access✓ Linen Closet✓ Microwave✓ Tile Floors✓ Trash Compactor✓ Walk-In Closets (Select Floor Plans)✓ Washer\/Dryer✓ Wheelchair Accessible (Rooms)  Contact InformationVisit Us: 555 Andorra Glen Ct Lafayette Hill, PA 19444 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.the-glen-apartments.com   Additional DetailsPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds.Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-MonthManagement Company: Paradise Management, LLC Price is subject to change without prior noticeAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY220ADF76D80A400A\n","num_images":17.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1078ft2', 'available jan 22, 2023', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T15:35:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559369060.html","post_id":7559369060,"result_date":"Sat Nov 19 2022 20:31:10 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559369048.html","post_id":7559369048,"result_date":"Sat Nov 19 2022 20:28:56 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559355947.html","post_id":7559355947,"result_date":"Sat Nov 19 2022 20:17:27 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559355598.html","post_id":7559355598,"result_date":"Sat Nov 19 2022 19:58:39 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559348524.html","post_id":7559348524,"result_date":"Sat Nov 19 2022 19:43:17 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559348145.html","post_id":7559348145,"result_date":"Sat Nov 19 2022 19:42:26 GMT+0000 ","title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"When you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Easy Freeway Access\n* Minutes from Restaurants, Shopping, and Much More\n* Spa\n* Sun Deck\n* Billiards\n* Community Lounge\n* Yoga Lounge\n* Professionally Managed\n* Outdoor Grill Area\n* TV Lounge\n* Bark Park\n* Swimming Pool\n* Pet Salon\n* Fitness Studio\n[#9487934]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T14:38:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559339641.html","post_id":7559339641,"result_date":"Sat Nov 19 2022 19:23:41 GMT+0000 ","title":"Corner Top Floor Location - D\/W - 24\/7 GYM - PETS - W\/D","description":"🍂FALL in Love with Wynnewood- Apply Now - Receive One-Month FREE🍂\nApt #C-18 Second floor apartment with beautiful courtyard view. Newly renovated and close to the train!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 8:30 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":23.0,"lat":40.0,"lng":-75.276,"attrs":"['1BR \/ 1Ba', '663ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T14:19:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559330238.html","post_id":7559330238,"result_date":"Sat Nov 19 2022 19:04:06 GMT+0000 ","title":"Patio\/Balcony*, Custom Subway Tile Backsplashes, Garage","description":"Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Call Now:  show contact info\nx 49OR Text 49 to  show contact info\nto text our team directly.See our property details here:https:\/\/mack.touraptnow.com\/t9o203 This is a 1 Bedroom, 1 Bath, approximately 776 Sq. Ft. Features - Patio\/Balcony*  - Washer\/Dryer  - Selected  - Premium Stainless Steel Appliance Package  - Disposal  - Gas Range  - Tons of Natural Lighting Throughout  - Cable Ready  - Custom Subway Tile Backsplashes  - Large Closets with Organizing Systems  - Flush Mount Sinks with Goose Neck Faucets  - Air Conditioner  - Dishwasher  - Stone Counters  - Electronic Thermostat  - Hardwood Style Flooring *In Select Apartment Homes Community Amenities - Smoke-Free Community  - Tennis Court  - Sundeck  - BBQ\/Picnic Area  - Parisian Style Café with Demonstration Kitchen  - Free Weights  - Multiple, Expansive Outdoor Spaces  - On-Site Maintenance  - Selected  - Elevator  - Garage  - Covered Parking  - Playground  - Courtyard  - Multiple Co-Working Studios  - Rooftop Dog Park  - On-Site Management  - Fitness Center  - Off Street Parking Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMThe Kelly  10 Union Ave, Bala Cynwyd, PA, 19004EYRluYB2\n","num_images":13.0,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '776ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T14:00:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559319637.html","post_id":7559319637,"result_date":"Sat Nov 19 2022 18:40:45 GMT+0000 ","title":"Large Bedroom With Walk-In Closet\/ Pet Friendly\/ Off-Street Parking","description":"RENT PERIOD: YEARLY.\nAsk about apartment home B08 on the third floor, available soon!! Short term leases not available.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up a tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday - Friday 9 AM-5 PM and also Saturday from 10:00 AM-4:00 PM. * Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\n-Full Size Washer\/Dryer In select homes.\nCOMMUNITY FEATURES:\n-On-Site Management\n-On-site maintenance\/24 hour emergency service\n-Septa Bus stop on the corner\n-Ivy Ridge Train Station blocks away\n-Online Payments Available\n-Cable Ready\n-On line service request\n-Septa Transportation outside the Rental Office\n-Pool located at sister property(Pool membership available. Fees Apply)\n-Gym located at sister property\nThe Metropolitan Manayunk Hill apartment homes, are just minutes to Center City Philadelphia, Manayunk Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA turnpike. Walk to Ivy Ridge Shopping Center and ShopRite Supermarket. Convenient to Ivy Ridge Train Station to Center City, Andorra Shopping Center, Target and more! The Metropolitan Manayunk Hill apartment homes are a great choice for both convenience and a quality of life. that's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity.\n","num_images":13.0,"lat":40.043502,"lng":-75.236199,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T13:36:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559302461.html","post_id":7559302461,"result_date":"Sat Nov 19 2022 18:04:07 GMT+0000 ","title":"Private Balcony, Quiet Community, Move In Now","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Billiards\n* Fitness Studio\n* Easy Freeway Access\n* Spa\n* Bark Park\n* TV Lounge\n* Pet Salon\n* Yoga Lounge\n* Minutes from Restaurants, Shopping, and Much More\n* Swimming Pool\n* Outdoor Grill Area\n* Community Lounge\n* Sun Deck\n* Professionally Managed\n[#9487689]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1232ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T13:00:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559296947.html","post_id":7559296947,"result_date":"Sat Nov 19 2022 17:51:50 GMT+0000 ","title":"Bike Storage, PETS, 24\/7 Gym, Hardwood Floors, W\/D","description":"🍂FALL in Love with Wynnewood- Apply Now - Receive One-Month FREE🍂\nApt #F-12 Second floor apartment w\/ beautiful courtyard view. Newly renovated, close to the train & shopping!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 8:30 am-5 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":24.0,"lat":40.0,"lng":-75.276,"attrs":"['2BR \/ 1Ba', '897ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T12:47:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559296848.html","post_id":7559296848,"result_date":"Sat Nov 19 2022 17:51:36 GMT+0000 ","title":"Gardens of Mt. Airy Large 1-2 bedrooms available with walk in closets","description":"GARDENS OF MT. AIRY\n1133 E. Mt. Airy Ave\nPhiladelphia, PA 19150\nAsk Lisa for details\nCats are welcome!!\nStudio $999\nA12 Apartment - 1 bedroom $1158 monthly rent.\nA9 Apartment -2 bedroom apartment with walk-in closet available for now at Gardens of Mt. Airy Apartments.\nMt. Airy apartments for rent with nice high ceilings, generous closet space and other fine amenities.\n* Free heat, hot water, and cooking gas\n* Hardwood flooring in select apartment homes\n* Over-The-Range Microwave\n* Large Closets\n* Controlled Access\n* Cats Welcome\nGardens of Mt. Airy apartments is a jewel located in the Mt. Airy section of Philadelphia identified by MONEY Magazine as one of the \"Best Big City Neighborhoods.\"\nThis apartment will rent quickly, so call us to schedule an appointment and reserve this unit today\n","num_images":8.0,"lat":40.0726,"lng":-75.1706,"attrs":"['1BR \/ 1Ba', '661ft2', 'available now', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T12:47:36-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559278477.html","post_id":7559278477,"result_date":"Sat Nov 19 2022 17:45:07 GMT+0000 ","title":"Brand New Toll Brothers Waterfront Condo for Rent in Fishtown!!","description":"Brand New Toll Brothers Waterfront Condo for Rent in Fishtown Grow Property Management presents this brand new luxury Toll Brother's Townhome, 3 bedroom condo located in Fishtown's Waterfront community Northbank. Attached Garage, Open Floor Designed, with 2.5 baths. Dramatic kitchen with center island, luxury finishes, cabinets, and stainless steel appliances. Over-sized bedrooms with over-sized closets. The master bedroom has its own covered balcony, lavish bathroom, and a walk-in closet. There is plenty of overflow street parking for your guests. Pictures are just representations and are not of the actual models & finishes & material will vary. Sitting on the Delaware River, Northbank, feature waterfront trails and breathtaking views of the Delaware River, the Ben Franklin Bridge and the City Skyline. Being in Fishtown the Philadelphia neighborhoid known for being the “Cool” kids with its unique approach to life and community here. Art, culinary and musical action with plenty of parks, outdoor cafes, gastro-pubs and strong hold in the food scene. NORTHBANK WATERFRONT COMMUNITY CONDOMINIUMS AMENITIES: • Beautifully Landscaped Courtyard. • Views of the Delaware River and the Ben Franklin Bridge. • Exceptional Walk Score & Immediate Public Transportation • Immediate to Coffee Shops, Gastro Pubs, Breweries, Parks • Close to Restaurants, Shopping, On\/Off Highway Ramps • Close to Market Street Subway Line SERVICES: • Managed by Grow Property Management • Tenant Portal System • 24-hr Emergency Maintenance SHOWING INSTRUCTIONS: You can schedule now, an instant self-showing. It can be at the time & day best for you. Visit our website at and select this property on our available properties tab. Please complete the contact info and details sections to be able to view the property.\n3001 City View Walk #196","num_images":4.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2.5Ba', '1493ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T12:11:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559261314.html","post_id":7559261314,"result_date":"Sat Nov 19 2022 17:42:05 GMT+0000 ","title":"*DEC19th*$850- Open Concept 1BD\/1BA in Downtown Philadelphia!!","description":"$850- Open Concept 1BD\/1BA in Downtown Philadelphia!! Hot Water is Included!! Available DEC19th!! Located right on Convenient access to SEPTA bus routes and minutes away from I-95. . Owner pays for Hot Water, Cold Water, and Sewer. The tenant is responsible for Electricity, Electric Heat, and Cable\/Internet if desired. Laundry On-Site. Security Deposit equal to one month's rent due at the time of rental offer acceptance. Security Deposit and First Month's rent due upon lease signing. I would love to speak with you. Can you Send me Number to discuss more details.","num_images":5.0,"lat":40.064597,"lng":-74.988111,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T11:35:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559288119.html","post_id":7559288119,"result_date":"Sat Nov 19 2022 17:34:01 GMT+0000 ","title":"Salt Water Pool with Sundeck, Convenient Location, Gated Dog Park","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatglenmills.com\nThe Point at Glen Mills, managed by Panco Management\n1000 Ellis Drive\nGlen Mills, PA 19342\nshow contact info\nYou will love the spacious feeling of the apartment homes at The Point at Glen Mills. With nine-foot ceilings, large windows and open floor plans, our apartment homes give you the space to spread out and be yourself. Call now for leasing details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen with granite countertops and stainless steel appliances. This unit also features a coat and linen closet, walk-in closet, and a full sized washer\/dryer!","num_images":19.0,"lat":39.881383,"lng":-75.523257,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T12:30:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559279882.html","post_id":7559279882,"result_date":"Sat Nov 19 2022 17:31:46 GMT+0000 ","title":"THE LATEST SMART HOME FEATURES, AND A FULLY FURNISHED ROOFTOP DECK","description":"LEASING SPECIAL - ASK US HOW YOU CAN QUALIFY FOR 1 MONTH FREE WITH A 13 MONTH LEASE!! Welcome to The Gateway a boutique-style apartment building that includes THE LATEST SMART HOME FEATURES, AND A FULLY FURNISHED ROOFTOP DECK right in the heart of the Art Museum District. Located off of the highly desirable Fairmount Avenue, which is the areas commercial corridor filled with restaurants, bars, and other local businesses. All of our units include high end finishes, luxurious kitchens with quartz counter tops, stainless-steel appliances, California style built out closets, huge windows with tons of natural light throughout each unit. These buildings use the most up to date technology. All units have smart thermostats equipped with Amazon Alexa, virtual doorbell systems, and key-less entry.\n1508-12 Ridge Ave #302","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '1100ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T12:13:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559285816.html","post_id":7559285816,"result_date":"Sat Nov 19 2022 17:29:14 GMT+0000 ","title":"UPDATED 1-BEDROOM HOME IN THE SOUGHT-AFTER NEIGHBORHOOD OF FITLER SQUA","description":"Custom Created and Updated 1-bedroom home in the sought-after neighborhood of Fitler Square. This sun-drenched corner home faces south and west and is on the 3rd floor with views of the surrounding neighborhood. Designed with the owners talent as an architect, all of the surfaces, sinks bath, walls emanates a custom feeling unit . Kitchen features stainless steel appliances, gas cook range, built in microwave, dishwasher, and tile floors. The shared washers and dryers are located on the lower level, as well as an additional storage locker . Right out your front door are phenomenal cafes, restaurants and parks, including Fitler Square, The Schuylkill River trail and Markward Park. A very short walk across the South Street Bridge to University City, CHOP, HUP, UPenn and Drexel. Nearby is 30th Street Train Station, Rittenhouse Square, tennis courts, community gardening, dog runs . A couple of my nearby favorite restaurants include Sabrina's, Rowhome Cafe, Rival Brothers Coffee, Cafe Lutecia, Aunt Pants Cafe, Good Karma Coffee, Lou Birds, Pub & Kitchen & Ten Stone. South Square Market & Heirloom Grocery Market. Amazon Locker store @The Plaza at 23Rd & South to spend the evening cooling off with ice cream\/FroYo from Igloo or a cold beer from Grace Tavern. Brand New Water Heater And Refrigerator to make life easy. Can be rented furnished or unfurnished.\n2531 Lombard St #3S","num_images":4.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '509ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T12:25:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559275356.html","post_id":7559275356,"result_date":"Sat Nov 19 2022 17:28:06 GMT+0000 ","title":"BOUTIQUE apartment building in the HEART of LOGAN SQUARE!","description":"BOUTIQUE apartment building in the HEART of LOGAN SQUARE! Sun splashed living and dining area, with ENORMOUS windows, 10ft ceilings, and HARDWOOD FLOORS throughout. All open living and dining area. Stunning WHITE kitchen w\/ beautiful granite counter tops, and gracious breakfast bar. The bedroom boasts big closets, and super sleek, marble and tile bath. Enjoy living in this wonderful PMC property, with Fantastic gym, Walk to Giant Market, Schuylkill trail, Penn, Drexel and Rittenhouse sq Photo's are of model unit.\n2130 Arch St #206","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '800ft2', 'available dec 27', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T12:05:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559276212.html","post_id":7559276212,"result_date":"Sat Nov 19 2022 17:23:40 GMT+0000 ","title":"Available Now, 2 Full Bathrooms and an Updated Kitchen!!","description":"Available now, a top floor of a converted Warehouse, soaring ceilings, and exposed wood beams throughout. 2 Full Bathrooms and an updated Kitchen. Located at the intersection of Northern Liberties\/Fishtown\/Olde Kensington. Additionally, there is off-street parking available for additional convenience. Schedule your showing today!\n1210-15 Palethorp #301","num_images":4.0,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T12:06:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559274668.html","post_id":7559274668,"result_date":"Sat Nov 19 2022 17:22:44 GMT+0000 ","title":"This Mid-rise Unit Puts Your Right in the Middle of the Action!","description":"Spring has sprung on the square and this mid-rise unit puts your right in the middle of the action! Take in both city & sunset views, through the abundance of West facing windows. Saunter down the elevator and out your front door to take in all the heart of the city has to offer. Grab a coffee at La Colombe, lunch at Parc, get your sweat on at Unite fitness, and then pick up the freshest ingredients from Sue's Produce and Di Bruno's before heading home to prepare the perfect meal in your kitchen. Outfitted with stainless steel appliances, granite countertops, and a large pantry typically not found in center city condos. This location is just a quick commute to University City, 30th Street Station, Market Street, and City Hall. In addition to the application, the following items and criteria must be met: 1. Photo ID (gov't issued) 2. SSN or require double security deposit 3. Income requirement. 36 x rent. If not met, require co-signer 48 x rent 4. 1 month of pay stubs 5. FICO score minimum of 600. ONE FREE month on an 16 month lease. Listed price reflects 16 month lease with 1 month free amortized. Base rent is $1800. Please check with the agent as specials are subject to change without notice.\n37 S 20th St #4C","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '525ft2', 'available now', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T12:03:44-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559272698.html","post_id":7559272698,"result_date":"Sat Nov 19 2022 17:17:58 GMT+0000 ","title":"THANKSGIVING SPECIAL!!!","description":"This house is conveniently located near grocery stores and shopping squares. It is also located on the vibrant Main St. in Lansdale, where the Lansdale train station is located. It is a 7-minute drive.\nHouse is located in a very safe location. You will see many local neighbors taking morning and afternoon walks. The property is perfect for families with young kids that attend elementary school as Oak Park elementary school can be reached within a 5-minute walk.\nThe backyard is large for children to run around and for you to host parties with friends and family.\nTenat is responsible for all utilities.\n","num_images":14.0,"lat":40.2319,"lng":-75.2967,"attrs":"['3BR \/ 1Ba', '1627ft2', 'available now', '\\nsunday 2022-11-20\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-19T11:59:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559279231.html","post_id":7559279231,"result_date":"Sat Nov 19 2022 17:16:32 GMT+0000 ","title":"Available Jan 1 First Floor and Lower Level 2bed, 2 Bath Apt!!","description":"Available Jan 1 First floor and lower level two bedroom, two bathroom apartment, with modern fully equipped kitchen, w\/ dishwasher, 4 burner range\/oven and refrigerator. Living\/dining room combo, full bath, bedroom and rear yard on main level. Spiral staircase to lower level with the main bedroom and bath. Gas hot air heat and central air and individual laundry room. There is ceramic tile and hardwood flooring throughout. Tenant pays gas and electric. This unit is located right across from Isgro's bakery and located just steps to the Italian Market and a short distance to Passyunk Sqaure. First, last and security due w\/ lease signing. Cats only with deposit. Tenant to pay gas, electric and $50 per month due w\/ rent which covers water and trash. Listing agent is related to landlord.\n1004 Christian St #1ST FLOOR","num_images":5.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '2112ft2', 'available jan 2, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T12:12:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559277846.html","post_id":7559277846,"result_date":"Sat Nov 19 2022 17:13:50 GMT+0000 ","title":"One-of-a-kind Community Combines the Convenience of City Living","description":"Brand new construction available for rental. This one-of-a-kind community combines the convenience of city living and the incredible views of the Delaware River and the Ben Franklin Bridge. This is corner lot and enjoy a leisurely stroll on the walking paths along the riverfront. Located within minutes to some of the finest restaurants and hot spots of Fishtown. The interior unit that offers the perfect open concept floorplan. The 9' first and second-floor ceilings add to the appeal and grandeur of this townhome. The kitchen equipped with stainless steel appliances has a generously sized island and leads to the living room and casual dining room lending itself perfectly for either a night of entertaining or relaxing. A spacious primary bedroom features an elegant tray ceiling and a covered deck. The Primary bath includes a dual-sink vanity, seated shower, separate water closet, and leads to a large walk-in closet. Two additional bedrooms on the 3rd level can be used for a home office or guest suite. Park your car in this attached, single car, rear entry garage. Overflow street parking is also available for you and your guests. Pictures from the model home.\n3109 Riseview Lane","num_images":4.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 3.5Ba', '1881ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T12:09:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559277084.html","post_id":7559277084,"result_date":"Sat Nov 19 2022 17:12:23 GMT+0000 ","title":"WOW, MODERN TOWNHOUSE FEATURED IN PHILADELPHIA MAGAZINE!","description":"WOW, MODERN TOWNHOUSE FEATURED IN PHILADELPHIA MAGAZINE! Here is a rare opportunity to live in a modern townhouse on a tree-lined, quiet Center City street. This beautifully maintained, eight-year-old home has an open floor plan on the first floor with a magnificent kitchen that leads to an ultra-private backyard with twinkle lights, wood decking, a chalkboard-paint wall, and a one-of-a-kind mural by local artist Kaitlin Chow. The second floor has 2 spacious bedrooms, generous closet space, and a full bath. The entire third floor is a primary suite with a custom paint treatment, 2 oversized closets including a custom closet system, and a full bath with large, glass-enclosed shower and double vanity - a rare find in Center City! Continue to the fourth floor for a roof deck offering views of the city. The finished basement has high ceilings, a laundry area, plenty of storage, and a half bath. This home is full of smart modern touches: video doorbell, dual-zone air conditioning and heating with Nest thermostats, high ceilings, wide stairs, hardwood floors, hardwired smoke detectors and sprinklers, custom blackout blinds, freshly painted walls, and more. 1309 Rodman Street is in the McCall School catchment, and a couple of blocks to Whole Foods, Acme, the Kimmel Center, Seger Park, and the hottest restaurants of Midtown Village and Rittenhouse.\n1309 Rodman St","num_images":5.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2.5Ba', '2200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T12:08:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559266726.html","post_id":7559266726,"result_date":"Sat Nov 19 2022 17:09:59 GMT+0000 ","title":"Spacious 1 Bedroom 1 Bath Apt $500 Security Deposit to Move-in!","description":"Just 1st month's rent and $500 security deposit to move-in!!! The Society Hill Building is a beautiful mid-rise community located in the Society Hill\/Washington Square neighborhood of Center City. This building features spacious 1 bedroom 1 bath apartments, overlooking scenic Washington Square Park. The Society Hill Building is within walking distance of historic Old City as well as close to all forms of public transportation. 10 foot high ceilings, controlled access keypad entry, hardwood floors in some units, abundant natural light, dishwasher, microwave, high-efficiency individually controlled A\/C and heat. Laundry on each floor and pet-friendly! Brand new windows in all apartments. Pictures are of a similar unit.\n701 Sansom St #206","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1170ft2', 'available dec 21', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T11:46:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559271238.html","post_id":7559271238,"result_date":"Sat Nov 19 2022 17:06:41 GMT+0000 ","title":"2 Bedroom house","description":"New Floors\nNew Bathroom\nNew Kitchen\nOpen Backyard\nOpen Front Porch\nClose to Transportation\nLocation: 4530 N. Hicks ST (North Philadelphia \/ Broad Huntingdon Park)\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html","num_images":4.0,"lat":40.0118,"lng":-75.1456,"attrs":"['2BR \/ 1Ba', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T11:56:41-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559265643.html","post_id":7559265643,"result_date":"Sat Nov 19 2022 17:06:39 GMT+0000 ","title":"HALF MONTH FREE FOR APPLICATIONS BEFORE 11\/15!!!","description":"HALF MONTH FREE FOR APPLICATIONS BEFORE 11\/15!!! Just 1st month's rent and $500 security deposit to move-in!!! 1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. Hardwood floors in the living area and the bedroom is carpeted. The Warehouse Property is located in a highly walkable area with access to all forms of public transportation. Secured entry, gated property, gym\/fitness center and on-site parking- add'l $150 mo. with full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit.\n9 N 9th St #307","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '625ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T11:44:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559274047.html","post_id":7559274047,"result_date":"Sat Nov 19 2022 17:06:36 GMT+0000 ","title":"Renovated Bi-level 1 bedroom apartment in the heart of Rittenhouse Squ","description":"Renovated Bi-level 1 bedroom apartment in the heart of Rittenhouse Square!! This boutique vintage building has all of the historic charm of a converted brownstone paired with modern updates throughout making for stylish and comfortable living. Enjoy restored hardwood floors and a kitchen with brand new appliances and a huge in unit laundry closet. Upstairs you will find a large bedroom with lots of windows that can accomodate any size bed and perfect for at home office set up. There is also a brand new renovated bathroom. The spiral staircase provides access to both floors but also exterior access to hallways on both floors for easy move in. PETS WELCOME! Many parking garages close by. Only first month and 1 month security needed at signing.\n2015 Walnut St #201","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T12:02:36-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559261033.html","post_id":7559261033,"result_date":"Sat Nov 19 2022 17:04:28 GMT+0000 ","title":"One bedroom for rent","description":"One Bedroom for rent with heat included","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '500ft2', 'available jan 1, 2023', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T11:34:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559265075.html","post_id":7559265075,"result_date":"Sat Nov 19 2022 17:01:30 GMT+0000 ","title":"Beautiful Rental in the Heart of Center City is Waiting for You","description":"Beautiful rental in the heart of Center City is waiting for you, a gorgeous sunny one-bedroom, one-bath condominium at the Packard Grande. Totally roomy loft-like open floor plan is south-facing with incredible skyline views which are pretty breathtaking!! High up on the 22nd floor, this unit has an ultimate open layout, southern views which really come to life at night providing an exciting feast for your senses and in the morning energizing sunrises...The open kitchen is huge perfect place for entertaining, stainless steel appliances, granite countertops, and ample cabinet space. Huge Spa-like bathroom features Italian ceramic tile chrome fixtures and a ceramic sink with storage vanity, huge bedroom with ample closet space as well.. be in the heart of Center City Philadelphia, come enjoy your new life.\n111 S 15th St #2209","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '761ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-19T11:43:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559266165.html","post_id":7559266165,"result_date":"Sat Nov 19 2022 16:49:48 GMT+0000 ","title":"LIGHT ,BRIGHT, SOUTH FACING UNIT READY FOR YOU TO CALL HOME!!","description":"Washington Square| Hopkinson House - Light ,Bright, South facing unit ready for you to call HOME. Short or Long term unfurnished Lease welcome. This open floor plan has an abundance of storage, character and charm. WASHER & DRYER in unit, Garage Parking available for lease below , private outdoor space and a rooftop POOL (additional fee) are just a few amenities in this amazing, well managed building. Wood floors, spacious balcony, glass double doors, generous built ins and delightful, soothing VIEWS of the Delaware River and Cityscape await! Retail, Restaurants and Historic sites are all within minutes of your front door! Universities, Hospitals, Major Public transportation all near by. Easy Airport & Train accessibility. Enjoy Washington Square Park as your front yard!\n604-36 S Washington Sq #1209","num_images":4.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '778ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T11:45:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559264526.html","post_id":7559264526,"result_date":"Sat Nov 19 2022 16:46:20 GMT+0000 ","title":"SPACIOUS CORNER 2 BED, 1 BATH IN NORTHERN LIBERTIES","description":"Spacious corner 2 bed, 1 bath in Northern Liberties and just steps from Fishtown! MOVE IN SPECIAL! Only 1st month's rent and HALF month's security deposit due at lease signing. This second floor apartment in newly constructed 18 W. Girard comes with washer dryer in unit, stainless steel appliances, lots of storage, hardwood floors, juliet balcony and an open floorplan with an elevator in the building, bike storage and pet friendly for $25\/month and a one time $250 deposit! Come and check it out before it's gone! Available December 10th. Please note we have the same layout on the 4th floor coming for a mid January move in date if that timing is preferable.\n18 W Girard Ave #204","num_images":4.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '875ft2', 'available dec 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T11:42:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559260013.html","post_id":7559260013,"result_date":"Sat Nov 19 2022 16:36:15 GMT+0000 ","title":"For peace and quiet in West Chester, you've found the place!","description":"Welcome to The Gateway Apartments!1515 Manley Rd West Chester, PA 19380Rental Size: 1 BR - 1 BA - 779 sq ft | Per Month: $1801 - $2495 | Lease Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month show contact info\nOffering a vibrant selection of living options, The Gateway Apartment Homes maintains the prime for luxury apartments in West Chester, PA. Our open and inviting floor plans are enhanced by a variety of exclusive features which define the unique lifestyle only found at our community. With a great location in the East Goshen Township, you will love calling our apartments your home.Please take our virtual tour\nhttps:\/\/my.matterport.com\/show\/?m=4RkQ1PobBkE&brand=0  Our community features:   ➢ Business Center➢ Clubhouse➢ Fitness Center➢ Onsite Maintenance➢ Onsite Management➢ Package Service➢ Picnic and Grilling Area➢ Pool and Sundeck➢ Storage Space➢ Walking\/Biking Trails➢ Across From Wawa & Goshen Crossing Shopping Center➢ Garages For Lease➢ Gated Entrances➢ Onsite Leasing Office➢ Pet-Friendly➢ Relaxing Fire Pit➢ Resort-Style Pool With Sun Deck➢ Storage Units For Lease➢ Three BBQ\/Picnic Areas➢ Wi-Fi Access in Clubhouse and at Pool  Our unit features: ➢ Air Conditioning & Heating➢ Cable Ready➢ Den➢ Dishwasher➢ High Speed Internet Access➢ Refrigerator, Freezer, Ice Maker➢ Trash Compactor➢ Tub\/Shower➢ Walk-In Closets➢ Window Coverings➢ Built-In Computer Nook (select homes)➢ Disability Access (select homes)➢ Gas Fire Place (select homes)➢ Kitchen Pantry➢ Private Entrance To Each Unit➢ Upgrade➢ Vaulted Ceiling (select homes)➢ Washer And Dryer In Each Apartment Home➢ Wired For High-Speed Internet➢ Wooded View\/Pool View (select homes)   Contact us for more information! --  show contact info\n--Our Pet-Policy: Breed Restriction;Weight Restriction;Dogs Allowed: Breed Restrictions Apply. $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per Month) 40lb Weight Limit on 2nd &amp, 3rd Floors, No Weight Limit on 1st Floor.1 Pet $350.00 (One Time, Non-Refundable) 2 Pets $500.00 (One Time, Non-Refundable) $35.00 (Under 40lbs Per Pet, Per Month) $45.00 (Over 40lbs Per Pet, Per MonWebsite: https:\/\/www.thegatewayapartments.com\/Property Management: Paradise Management, LLCAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY970F506CB0054A\n","num_images":9.0,"lat":39.967056,"lng":-75.529129,"attrs":"['1BR \/ 1Ba', '779ft2', 'available now', 'air conditioning', 'application fee details: $60.00', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-19T11:32:15-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559255683.html","post_id":7559255683,"result_date":"Sat Nov 19 2022 16:26:55 GMT+0000 ","title":"2 bed\/2bath - Luxury Living","description":"Ascott floor plan — 1,230 sq. ft. — $3,275\nThis corner-unit apartment has so much to offer! Our brand-new construction includes quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This Ascott also features spacious walk-in closets with custom shelving. This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":24.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1230ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T11:22:55-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559236342.html","post_id":7559236342,"result_date":"Sat Nov 19 2022 16:13:33 GMT+0000 ","title":"2 Bedroom house","description":"3 bedroom\n1 bathroom\nNice kitchen\nNew paint throughout the house\nHardwood floors\nClose to Schools & Transportation\n2235 W Harold St. Philadelphia PA 19132 (Strawberry Mansion)\nLocation: 2235 W Harold St 19132\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html","num_images":6.0,"lat":39.9954,"lng":-75.1698,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:38:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559246942.html","post_id":7559246942,"result_date":"Sat Nov 19 2022 16:08:00 GMT+0000 ","title":"Covered Parking, Garage, On-Site Management, Hardwood Style Flooring","description":"The Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Call Now -  show contact info\nx 76OR Text 76 to  show contact info\nto text our leasing team.Want more info on this unit? See the link (below):https:\/\/mack.touraptnow.com\/355g06 Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree. This is a 1 Bedroom, 1 Bath, approximately 516 Sq. Ft.  The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia. Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMgUucxX0a2\n","num_images":10.0,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '516ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T11:04:00-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559242417.html","post_id":7559242417,"result_date":"Sat Nov 19 2022 16:06:24 GMT+0000 ","title":"Fall In Love with this 2 bed\/2 bath Apartment!","description":"Balmoral floor plan — 1,136 sq. ft. — $3,125 – 3,175\nThis brand-new construction Balmoral boasts 2 bedrooms and 2 bathrooms, on either side of the apartment. It has a spacious living room that can fit ample furniture and a dining set. The master suite comes with a large walk-in closet and double sinks with a luminous shower. The guest bedroom is roomy as well and the bath offers a roomy garden tub\/shower combo! It also features a beautiful balcony that starts in the living room and extends into the master bedroom. This gorgeous apartment is within close proximity to our clubhouse –featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":23.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1136ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-19T10:53:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559236906.html","post_id":7559236906,"result_date":"Sat Nov 19 2022 16:02:47 GMT+0000 ","title":"2 Bedroom house","description":"3 bedroom\n1 bathroom\nNice kitchen\nNew paint throughout the house\nHardwood floors\nClose to Schools & Transportation\n2235 W Harold St. Philadelphia PA 19132 (Strawberry Mansion)\nLocation: 2235 W Harold St 19132\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html","num_images":7.0,"lat":39.9954,"lng":-75.1698,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:39:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559237499.html","post_id":7559237499,"result_date":"Sat Nov 19 2022 15:45:13 GMT+0000 ","title":"Rooftop Dog Park, Covered Parking, Multiple Co-Working Studios","description":"Call Now -  show contact info\nx 48OR Text 48 to  show contact info\nto text our team. This is a 2 Bedroom, 2 Bath, approximately 1130 Sq. Ft.  The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Features: Tons of Natural Lighting Throughout, Air Conditioner, Large Closets with Organizing Systems, Washer\/Dryer, Custom Subway Tile Backsplashes, Electronic Thermostat, Premium Stainless Steel Appliance Package, Hardwood Style Flooring, Flush Mount Sinks with Goose Neck Faucets, Disposal, Gas Range, Cable Ready, Selected, Dishwasher, Patio\/Balcony*, Stone Counters  *In Select Apartment Homes Community Amenities: On-Site Management, On-Site Maintenance, Elevator, Fitness Center, Smoke-Free Community, Selected, Multiple Co-Working Studios, Tennis Court, Garage, Free Weights, Covered Parking, Playground, Off Street Parking, Courtyard, Multiple, Expansive Outdoor Spaces, Parisian Style Café with Demonstration Kitchen, BBQ\/Picnic Area, Sundeck, Rooftop Dog Park Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. See our property details here:https:\/\/mack.touraptnow.com\/sdi6z8TflhgMQ5fE\n","num_images":11.0,"lat":40.0118,"lng":-75.2342,"attrs":"['2BR \/ 2Ba', '1130ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-19T10:41:13-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7559235815.html","post_id":7559235815,"result_date":"Sat Nov 19 2022 15:41:15 GMT+0000 ","title":"3 Bedroom house","description":"3 BEDROOM HOUSE RENOVATED\nNEW BATHROOM\nNEW KITCHEN\nBACKYARD SECLUDED BLOCK\nLOCATION: 618 BRINTON STREET 19138 (EAST MOUNT AIRY)\nPlease do not e-mail, phone calls are answered faster at  show contact info\nFor more listings visit our website at http:\/\/www.iss-management.com\/rentals.html\n","num_images":8.0,"lat":40.0568,"lng":-75.1569,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2022-11-19T10:37:15-0500"}]