[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/morrisville-3br-2ba-all-utilities\/7603377275.html","post_id":7603377275,"title":"3BR 2BA all utilities included","description":"Upper level of private home; completely separate apartment with 3BR, 2BA, laundry in unit. All utilities included: water\/sewer, electricity\/gas, heat\/AC, high speed internet as well as lawn care. Street parking. Pennsbury school district; lovely neighborhood. Seeking considerate, quiet, mature, flexible tenant(s). No smoking please. Pets considered. If you are interested, please send me a robust email describing your situation and why you think we would be a good match :) I will respond in kind. If the ad is posted, the apartment is available. Thank you for your interest and look forward to hearing from you!","num_images":7.0,"lat":40.204988,"lng":-74.822216,"attrs":"['3BR \/ 2Ba', '1080ft2', 'available apr 11', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T22:14:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this-cozy-bed\/7603362315.html","post_id":7603362315,"title":"Welcome to this cozy 1 bed \/ 1 bath","description":"New meets historical, in this fabulous studio condo for rent. The Furness Flats is a landmark building created by Frank Furness, currently home to beautifully appointed condominiums. Convenient to Jefferson Hospital and Pennsylvania Hospital, the Avenue of the Arts, restaurants, shops, theaters, and Center City living in Washington Square West. This bright and airy home offers high ceilings, an original decorative mantle, and hardwood floors. The kitchen features granite countertops. The bath has subway tile and stylish finishes. Roomy enough to designate a bedroom area, this studio offers affordability in the heart of Philadelphia. Tenant pay $100 for heat\/water\/cooking. Tenant pays electric. Coin-op laundry in basement.","num_images":5.0,"lat":39.94737,"lng":-75.162484,"attrs":"['1BR \/ 1Ba', '504ft2', 'available now', '\\nsaturday 2023-03-25\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'carport', 'rent period: monthly']","posted_date":"2023-03-25T20:58:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-bedroom-condo\/7603368493.html","post_id":7603368493,"title":"1 bedroom condo","description":"Spacious 1 bedroom condo. Updated Kitchen, plenty of closet space.  First floor easy access.\nFirst, last and security.\n","num_images":12.0,"lat":40.07302,"lng":-75.248108,"attrs":"['1BR \/ 1Ba', '0700ft2', 'available apr 1', 'air conditioning', 'condo', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T21:27:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bathroom\/7603364913.html","post_id":7603364913,"title":"Spacious 2 bedroom 1 bathroom Apartment Rent in Philadelphia, PA.","description":"Unfurnished apartment, two bedroom, two double beds, closet, one bathroom, kitchen, dining room, stove with oven. I don't know they accept pets. Maximum 4 people. The rent includes water, electricity, wifi, security system. The rent does not include kitchen utensils, no appliances.\nApartamento sin amueblar, una recamara, dos camas matrimoniales, closet, un baño, cocina, comedor, estufa con horno. No sé aceptan mascotas. Máximo 4 personas. La renta incluye, agua, luz, wifi, sistema de seguridad. La renta no incluye utensilios de cocina, no electrodomésticos.\n","num_images":4.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', '1100ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T21:10:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-remodeled-first\/7603353782.html","post_id":7603353782,"title":"Recently remodeled, first floor 2 bed\/1bath apartment in Philadelph PA","description":"Recently remodeled, first floor 2 bed\/1bath apartment in  Philadelphia,PA. Recently remodeled, first floor 2 bed\/1bath in private landlord-owned 3-unit building in the quite neighborhood. Brand new hardwood flooring and new ceramic tile. Large living room and dining room. Heat and cooking gas included in rent. Well-maintained building with quiet neighbors. Tenant pays electricity. Shown with working appliances but Landlord not responsible for maintenance on appliances. Tenant can bring their own appliances. Plenty of street parking. Kitchen, living room and dining area with sliding glass doors leading to patio area. Lower unit, lots of closets, non-smoker. Central air, W\/D, Pool & Club house, parking. Former short term rental appointed with high end linens and details. Fully equipped kitchen. One bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. no damage deposit required and returned at the end of rental if no damage incurred. if you are really interested our property please send me your phone number I will contact you as soon as possible. Thanks.","num_images":4.0,"lat":39.9055,"lng":-75.2444,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T20:19:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bed-bath\/7603352693.html","post_id":7603352693,"title":"**Spacious 2 Bed 1 Bath Available now in Philadelphia,PA**","description":"Spacious 2 Bed 1 Bath Available now in Louisville, KY. Fully equipped kitchen. One bedroom has a queen bed and another bedroom has twin bunkbeds and a sectional\/queen bed. Kitchen, living room and dining area with sliding glass doors leading to patio area. Lower unit, lots of closets, non-smoker. Big living room with lots of southern exposure great natural light. Ample storage in unit. Large eat in kitchen with a gas range. Off street park and onsite laundry. Gas heat and hot water included in rent. No smoking allowed. Second floor unit. Pet negotiable with reference and pet deposit. Please share some info about yourself when applying. There is a standard rental application form. Former short term rental appointed with high end linens and details. Wood-burning fireplace, patio\/deck with propane. Spacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. See photos. no damage deposit required and returned at the end of rental if no damage incurred. if you are really interested our property please send me your phone number I will contact you as soon as possible. Thanks.","num_images":4.0,"lat":39.9055,"lng":-75.2444,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T20:15:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-remodeled-bed\/7603354614.html","post_id":7603354614,"title":"*Beautifully remodeled 2 bed\/1.5bath apartment in Philadelphia,PA*","description":"Beautifully remodeled 2 bed\/1.5bath apartment in Philadelphia,PA.\nSpacious property has a private pond and forest to explore and a fire pit and picnic table. Rent includes utilities (electric stove, gas furnace, brand new high capacity washing machine), high speed internet and property maintenance. Kitchen, living room and dining area with sliding glass doors leading to patio area. Lots of closets, non-smoker. Big living room with lots of southern exposure great natural light. Ample storage in unit. Beautiful 2 bed! This unit boasts gleaming hardwood floors, ceiling fans, and laundry in building! Conveniently located close to bars, restaurants, markets, and local parks! Great access to public transit as well. Amazing value! Large eat in kitchen with a gas range. Off street park. Pet negotiable with reference and pet deposit. Please share some info about yourself when applying. There is a standard rental application form. Former short term rental appointed with high end linens and details. Wood-burning fireplace, patio\/deck with propane. .no damage deposit required and returned at the end of rental if no damage incurred. if you are really interested our property please send me your phone number I will contact you as soon as possible. Thanks.\n","num_images":5.0,"lat":39.9055,"lng":-75.2444,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T20:23:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/king-of-prussia-welcome-to-this-cozy\/7603333383.html","post_id":7603333383,"title":"Welcome to this cozy one bedroom, one full bath condo at the Valley Fo","description":"Welcome to this cozy one bedroom, one full bath condo at the Valley Forge Towers 1000 building. Updated Open kitchen with granite counter tops invites you to gather around for socializing. Recently updated sliding glass door, white shutters, newer flooring, vanity and toilette complete the renovation. This ready to move in one bedroom is a perfect starter home or a nest for downsizing individuals. Monthly rent includes ALL UTILITIES electic, water and sewer), replacement and service of Heating, Air-conditioning and water heater. Club house offers a Party room that can be rented for private gatherings. Pets are allowed. The Upper Merion Rambler picks up at the front lobby and can take you to community locations, library, Wegmans as well as King Of Prussia Mall.\nParking Information\nParking Lot\n","num_images":21.0,"lat":40.0956,"lng":-75.3737,"attrs":"['1BR \/ 1Ba', '840ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T19:07:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-french-doors-lead-to-an\/7603333294.html","post_id":7603333294,"title":"French doors lead to an intimate flagstone patio and garden to enjoy y","description":"Exceptional, carefree living right in the heart of desirable Ardmore! Originally built by renowned Main Line builder B.J. Drueding Builders, this is a rare opportunity to rent a fabulous, spacious 1 bedroom\/1.5 bath end-unit condo in a walk-to everything location. Enter through the marble foyer to gleaming Brazilian Cherry hardwood floors that flow throughout. You'll enjoy effortless entertaining with a gourmet kitchen, designed with Brookhaven cabinets, stainless steel appliances and granite countertops. Adjacent to the kitchen is the dining room, ready for your family and guests. French doors lead to an intimate flagstone patio and garden to enjoy your morning coffee or an evening cocktail. The living room is spacious and airy, highlighted by a slate surround wood-burning fireplace, built-in cabinetry, shelving and bay window. The bright and spacious master suite is complete with walk-in closet, luxurious master bath with limestone vanity and large seamless glass shower. Special upgrades include all new energy efficient windows and sliding glass doors, updated HVAC, two new patios with exterior lighting, overhead cooling fans, new outside landscaping and hardwood floors throughout. For your convenience, you'll also find a laundry area with stackable washer and dryer. This well-situated condo includes two designated parking spaces, one in the enclosed garage, as well as a large storage unit. Enjoy the quiet and convenience of your new home as it is located within walking distance from Lower Merion HS, Suburban Square, Trader Joes and the Ardmore Farmer's Market. The nearby Ardmore train station provides Septa and Amtrak service to Center City, NY or Washington D.C. so that you may indulge in the best of the suburbs and easy access to the city.\nParking Information\nGarage Features: Covered Parking\n# of Total Garage and Parking Spaces: 2\n# of Assigned Spaces: 2\n# of Garage Spaces: 1\nParking Garage - # of Spaces: 1\nParking Lot - # of Spaces: 1\nAssigned\nParking Garage, Parking Lot\n","num_images":14.0,"lat":40.007269,"lng":-75.281531,"attrs":"['1BR \/ 1.5Ba', '1276ft2', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T19:07:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/media-beautiful-media-bed-bath-1st-flr\/7603334849.html","post_id":7603334849,"title":"Beautiful Media - 2 bed\/1 bath - 1st Flr - Available now","description":"MEDIA - 2 BED\/1 BATH - Walking distance to downtown Media, Great location. Move in Ready Now. Available 4\/1Call Chris @  show contact info\nfor showingNewly remodeled in Media with hardwood floors and updated kitchen. Walking distance to trains to downtown Philadelphia, shopping, etc.Available Immediately!*RENTAL REQUIREMENTS* - MONTHLY NET INCOME: $3,900 Rates:$1499 per month. Tenant responsible for all utilities. Experience Everyone's Hometown of Media, PA:  A charming walk able town with shops, diverse restaurants and nearby parks.  Whether business in the County seat brings you to Media or visiting the Philadelphia area for pleasure, experience small town living with convenient public transportation to Philadelphia.Highlights of the Property Include:1. Washer and dryer available2. Tenant is responsible for all utilities. 3. Walking distance to Media SEPTA Train Station that will take you all the way to downtown Philadelphia, Penn University, Temple University, University City. 4. Near Penn State University Brandy Wine5. Walking distances to Delaware County Courthouse6. Walking distance to the restaurant and local shop, etc7. Near Movie Theater8. Near Riddle Hospital\/Media 9. Walking to distance to downtown Media and close to the post office, bank, Wawa store.Off street parking! Walk to train station or walk into town and enjoy the many fine restaurants. North on Route One, turn right at Hill's Seafood, go to stop sign. Property located across from stop sign.No Smoking or Indoor Candles!Call Chris @  show contact info\nfor showing\n2 bed\/1 bath. $1350 rent, 2+ Year lease preferred, longer term tenant\nAmenities:\n- Unfurnished\n- Smoke Free\nAppliances:\n- Air Conditioning\n- Microwave\n- Range\n- Refrigerator\n- Oven\n- Washer & Dryer - Basement\nLeaseLengths:\n- 12 Months lease - Prefer long term tenant\n- 24 Months lease - Prefer long term tenant\nUtilities:\n- Resident Pays Electricity\n- Resident Pays Gas\n- Resident Pays Heat\n- Resident Pays Water\n- Resident Pays Trash Pick-up\n- High-Speed Internet Available\nContact M&C at  show contact info\nfor more information\n","num_images":20.0,"lat":39.915968,"lng":-75.394898,"attrs":"['2BR \/ 1Ba', 'available apr 1', '\\nsunday 2023-03-26\\n', '\\nmonday 2023-03-27\\n', '\\ntuesday 2023-03-28\\n', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T19:12:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-car-garage-parking-3bd-2ba\/7603313983.html","post_id":7603313983,"title":"2 Car Garage Parking 3bd 2\/2ba Northern Liberties","description":"301 Green Street  Philadelphia, PA  19123$7000.00 \/ Month---------------------------Interested in this property?Reply to this listing for more information.---------------------------Property Details:3 BEDROOMS | 4 BATHROOMSBuilt in 2017, this immaculately clean and bright three bedroom corner townhome offers over 3,100 square feet of wide open living space and over $100,000 worth of upgrades. Perched on the corner of Green Ave and N 3rd St, outstanding curb appeal beckons you to enter the front door into a spacious foyer with an added half bath for easy access from the fully finished basement. Relax and take in the gorgeous views of the Ben Franklin Bridge and Center City from your private, expansive 33-foot long south-facing balcony. The attached garage has ceiling and wall storage plus it fits two full size cars and is rarely found in this area. It can be accessed from the foyer or from the extra-wide shared driveway, which also allows for guest parking. This home is wired as a smart home with all doors, locks, and light switches, including the outdoor uplighting, controlled and programmed by Alexa, Google, or Siri. ***Cats, Small Dogs, Large Dogs Allowed***Property Type: Single FamilyLease Terms:$7000.00\/Month$10000.00 DepositLease Length: Contact For DetailsAvailable:05\/01\/2023Unit Amenities:Dishwasher Garbage Disposal Refrigerator Dryer Microwave Washer Freezer OvenBuilding Amenities:On Site Laundry Alarm System Near Parks Secure Building Bicycle Parking Fireplace Garage Washer Dryer Hookups Off Street Parking Security Cameras Wired For Internet---------------------------Interested in this property?Reply to this listing for more information.\n","num_images":24.0,"lat":39.9614,"lng":-75.143279,"attrs":"['3BR \/ 4Ba', '3114ft2', 'available may 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T18:04:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-updated-bed\/7603297729.html","post_id":7603297729,"title":"Beautifully updated 2 bed 2 bath with new kitchen & garage","description":"Beautifully updated Port Royal home featuring 2 bedrooms & 2 baths. 3rd bedroom can be converted back, Murphy bed. New flooring throughout, new kitchen w\/Bosch appliances & coffee bar, new W\/D, HVAC, HWH, solid core int doors, front door, gas FPL & more! Large lap pool w\/Lanai & beautiful plantings & privacy on the golf course. Roof 11\/17, 1\/2 bath has room for a shower. Fresh paint & new Grass cloth wallpaper, & Built ins. All on One level! New uplighting, irrigation & new well for irrig. Currently 1 car garage. Enjoy the Beach House & Port Royal amenities. -If you are really interested your property please send me your number i will contact you as soon as possible. Thanks.","num_images":4.0,"lat":39.9772,"lng":-75.2545,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T17:17:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-renovated-home\/7603297188.html","post_id":7603297188,"title":"***Beautiful renovated home,***","description":"This beautifully renovated 2 bed 2 bath bungalow is exactly what you have been looking for. Come enjoy some fresh air on this Rocking chair front porch. Have family time in this cozy den,take in the natural lighting,hardwood floors,w\/built-in bookshelves. The kitchen will be a delight to cook.\nProperty manager:\nDiana Riddle\nTerms:\nDogs Allowed.\nCats Allowed.\n2 Beds \/ 2 Bath\nDeposit -850 (Refundable)\nRent- $850 (Pro-Rated)\nAddress:\n900 N 63rd St, Philadelphia, PA 19151\n-If you are really interested your property please send me your number i will contact you as soon as possible. Thanks.","num_images":4.0,"lat":39.9772,"lng":-75.2545,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T17:15:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-construction-2bed\/7603277672.html","post_id":7603277672,"title":"+++New construction 2bed 1 batha partment+++","description":"New construction apartment building with first floor unit now available for rent. Unit offers modern designs, that include spacious layout, granite countertop finishes, stainless steel appliances, central A\/C, built-in washer\/dryers, e-keypad access (keyless entry) and so much more! Receive a 1+ MONTH promotional rate right now! Don't hesitate and schedule your tour today to rent with Liberty Bell Management:(716) 288-278-8\nTenant responsible for gas, electric and water. Water will be a flat fee per month based on bedroom count. Pricing includes free month of rent built into lease rate.\n","num_images":4.0,"lat":39.9612,"lng":-75.2303,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T16:25:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-construction-2bed\/7603277668.html","post_id":7603277668,"title":"+++New construction 2bed 1 batha partment+++","description":"New construction apartment building with first floor unit now available for rent. Unit offers modern designs, that include spacious layout, granite countertop finishes, stainless steel appliances, central A\/C, built-in washer\/dryers, e-keypad access (keyless entry) and so much more! Receive a 1+ MONTH promotional rate right now! Don't hesitate and schedule your tour today to rent with Liberty Bell Management:(716) 288-278-8\nTenant responsible for gas, electric and water. Water will be a flat fee per month based on bedroom count. Pricing includes free month of rent built into lease rate.\n","num_images":4.0,"lat":39.9612,"lng":-75.2303,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T16:25:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7603294008.html","post_id":7603294008,"title":"Schedule a Tour, Granite Countertops, Playground","description":"A pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nCommunity Features\n* Minutes from Restaurants, Shopping, and Much More\n* TV Lounge\n* Gaming Area\n* EV Charging\n* Outdoor Grill Area\n* Dry Cleaning and Laundry Service\n* Movie Theatre\n* Playground\n* Bike Racks\n* Long Term Lease Available\n* Garage Parking\n* Easy Freeway Access\n* WiFi Access\n* Community Kitchen\n* Renters Insurance is Required\n* Fitness Studio\n* Elevator\n* Community Lounge\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Package Acceptance\n* Extra Storage\n* Pet Salon\n* After-Hours Emergency Maintenance\n* Sun Deck\n* Bark Park\n* Swimming Pool\n* Landscaped Courtyards\n* Billiards\n* Short or Long Term Lease Available\n* Professionally Managed\n* Non Smoking Community\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Controlled Access\n* Credit Cards Accepted","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1217ft2', 'available apr 1', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T17:07:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-of-the-most-stylish\/7603159181.html","post_id":7603159181,"title":"One of the most stylish one bedroom unit!","description":"Live a short walk from Philadelphia's Art Museum steps and Kelly Drive, famous for its jogging paths along the river. This unit is one of the most stylish one bedroom units offered in 2601 Pennsylvania Avenue. It features an updated kitchen with stainless steel appliances, wood cabinets, a center island, and a classic subway tile backsplash. The spacious living room features updated floors and lots of natural light. The large bedroom has a generous-sized closet. The unit is completed with a tile bathroom and a separate laundry room. This condo building features a 24-hour front door attendant, shuttle service, a gym, and a community room. Now is the time to take advantage of being within walking distance to the finest museums and restaurants in the area. Schedule your appointment today!\n2601 Pennsylvania Ave #1028","num_images":7.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '587ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:07:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-incredible-bedroom\/7603158198.html","post_id":7603158198,"title":"Incredible 3 bedroom, 2-bathroom apartment!","description":"Incredible 3 bedroom, 2-bathroom apartment in the middle of Rittenhouse Square with PARKING!!! Located on the corner of 23rd and Walnut Street, this apartment will give you walking access to the best parts that the city has to offer! This unit boasts large living and bedroom space with a TON of natural light to match! Washer and dryers in every unit. Easy access to all highways including 676 and I-95 in case you have to get out of the city limits easily and conveniently. The best restaurants within minutes' walk and the most vibrant night life as well. Pets allowed. Water and parking included in rent!\n135 S 23rd Street #A1","num_images":10.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 2Ba', '1250ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:06:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-rental-listing-in\/7603157101.html","post_id":7603157101,"title":"Lovely rental listing in the Rittenhouse Square neighborhood!","description":"Lovely rental listing in the Rittenhouse Square neighborhood. At the entrance you are greeted by a fabulous grand staircase leading up to the unit. This spacious home boasts a large living room with high ceilings and a gas fireplace that is perfect for entertaining. The beautiful hardwood floors run throughout the entire unit. The kitchen is modern and equipped with a dishwasher, 5 burner gas range, granite countertops, ample cabinet space, pantry storage, and a wine refrigerator. There are two spacious bedrooms with an abundance of closet space and a roof deck with absolutely gorgeous city views. This unbeatable location is conveniently located within a stone's throw of some of the most popular spots in the city and close proximity to area hospitals, universities, and theaters. Washer\/dryer in the unit. A pet will be considered on a case by case basis. 24+ month lease required.\n511 S 17th St #2","num_images":10.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '1600ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:04:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-two-bedroom-flat\/7603155107.html","post_id":7603155107,"title":"Spacious two bedroom flat showcases gorgeous river views!","description":"Sun-soaked two bedroom, two bathroom available for rent at Pier 3 in Penn's Landing! This spacious two bedroom flat showcases gorgeous river views, oversized windows throughout and an eat-in kitchen. Enter through a foyer into the light-filled great room providing a cozy fireplace and ample space for separate living and dining areas. The well-equipped eat-in kitchen features plenty of white cabinetry, gray countertops and white appliances. Both bedrooms are generously sized and boast excellent closet space. Unique to this unit, the master suite enjoys a large private terrace serving as the perfect spot to enjoy a morning cup of coffee throughout the warmer months. The guest bedroom enjoys use of a nearby full hall bathroom with a single vanity and stall shower. Residents of Pier 3 enjoy a twenty-four hour doorman, heated indoor pool, fitness center, and parking available for an additional fee (subject to availability).\n3 N Columbus Blvd #TD411","num_images":7.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1300ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:00:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-eelegant-living-space-is\/7603154036.html","post_id":7603154036,"title":"Eelegant living space is a MUST SEE!","description":"What a WOW! This NORTHERN LIBERTIES MAGNIFICENT HOME boasting over 2700 SQ FEET of elegant living space is a MUST SEE. Expansive living and dining area with 15 Ft ceilings, state of the art kitchen with high end appliances and tons!!! Of cabinet and counter space . Ascend an elegant stair case and you will see TW0 well proportioned bedrooms and TWO full BATHS. Top FLOOR, primary suite , your will never want to LEAVE, with a spa type bath. Completely FINISHED lower level ideal for in home gym and OFFICE. Yes there’s GARAGE PARKING , JULIET balconies & a DECK! Walking score a 100 percent to some of NORTHERN LIBERTIES best dining & night life. Also super EZ commute to Penn& and Cooper HOSPITALS!\n913 N Lawrence St","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['4BR \/ 3Ba', '2756ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T11:57:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rittenhouse-square-bedroom\/7603154006.html","post_id":7603154006,"title":"Rittenhouse Square 1 Bedroom Apartment Home, Gym with Park View","description":"Apartment Home Features\n* Unfurnished 1 bedroom 1 bathroom apartment home at 1614 on 16th floor\n* Renovated kitchen with white cabinets and granite counters\n* Renovated bathroom\n* Neutral carpet\n* Dishwasher\n* Gas stove\n* Microwave\n* Disposal\n* Large east-facing windows with Chancellor Street view\n* 1 large south-facing bedroom window with Chancellor Street view\n* All utilities included (except cable and internet)\nCommunity Amenities\n* Laundry room on every floor\n* Large laundry room on the 3rd floor\n* Fitness center with park view\n* Lounge with pool table and places to work and study\n* Fitness\/yoga studio\n* Sauna\n* Dog spa\n* Guest suites\n* Bicycle storage\n* Package lockers by Luxer One\n* Elevator building with 24\/7 front door attendant and 24\/7 front desk concierge\n* 24\/7 on-site maintenance\n* Attached valet parking garage! Please note that these parking spaces are not managed by the community and the cost is separate.\n* Roof deck under renovation until spring 2023\nNearby Grocery Stores\n* Rittenhouse Market\n* Trader Joe's\n* Giant\nNearby Restaurants\n* Rouge\n* Devon\n* Parc\n* Via Locusta\n* Schlesinger's\n* Barclay Prime\n* Pietro's\n* a.kitchen\n* The Love.\n* The Dandelion\n* Villekebabs & Platters\n* Gran Caffe L'Aquila\n* Kura Sushi\n* The Continental Mid-town\n* Harper's Garden\n* Veda\n* Marathon on the Square\nNearby Ice Cream\/Gelato Shops\n* Van Leeuwen\n* Jeni's\n* Gran Caffe L'Aquila\nNearby Bakeries\n* Metropolitan Bakery\n* The Bakeshop on 20th\n* Termini Bros. (The Concourse at Comcast Center)\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 1614 is still listed under the Warhol floor plan! Please make an appointment to tour with Gabby or Michelle using ResMate, the chatbot concierge, on our website.\nRental rate posted is for the 22 month lease term. Price depends upon lease term.\nFor an unfurnished home, 2 to 22 month lease terms are available!\nRental rates, availability, and apartment home features are subject to change without notice.\nWe can furnish a home for you over two weeks following rental application approval and after the home is made ready. Please note that there is a three-month lease term minimum for a furnished home. You would pay a furnished rent instead of an unfurnished rent. We can calculate this furnished rent for you based upon your choices of home furnishings.\nRittenhouse Claridge\nWelcome home!","num_images":24.0,"lat":39.949753,"lng":-75.17056,"attrs":"['1BR \/ 1Ba', '575ft2', 'available aug 29', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T11:57:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-cabinets-stainless\/7603148447.html","post_id":7603148447,"title":"New Cabinets\/ Stainless Steel Appl.\/ New Tub & Tile\/ Cat Friendly\/Pool","description":"RENT PERIOD: YEARLY\nAsk about apartment home 206 on the second floor, available now!! This unit has a new carpet, newer kitchen with nice dark brown cabinets and stainless steel appliances. The bathroom has new tile and a new vanity. The unit also has nice 6-panel doors and it overlooks the courtyard, which has a grill, a few tables, and benches. There are also two laundry rooms a few feet down the hall. This unit has a special going on. We are offering $100 off per month for a year, which drops rent to $1,535. This unit does not have a dishwasher.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday 9:00 am-6:00 pm and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":14.0,"lat":40.053166,"lng":-75.236179,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:44:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bcity-views-tons-of\/7603148064.html","post_id":7603148064,"title":"Bcity views & tons of natural light!","description":"Welcome to 200 Locust Street #12E! This river view facing studio home resides in the highly desirable Society Hill neighborhood of Philadelphia. As you enter the elevator accessible building and make your way to this unit, you will immediately notice hardwood flooring throughout and oversized floor to ceiling windows, allowing for beautiful city views & tons of natural light! The kitchen features stainless steel appliances, white Shaker cabinetry, & granite countertops. There are two large corner closets, allowing for ample closet space and a full bathroom. The bathroom boasts a large vanity with under sink storage, and a tiled shower\/tub area. This condominium is in a perfect location, located in a historic and quiet neighborhood. In close proximity to all of the amazing restaurants, bars, grocery stores, coffee shops, and walks along the river, schedule your showing today!\n200 Locust St #12E","num_images":9.0,"lat":39.9474,"lng":-75.1473,"attrs":"['0BR \/ 1Ba', '522ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:43:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-in-one-of-the-most\/7603152367.html","post_id":7603152367,"title":"Located in one of the most beautiful neighborhoods in Philadelphia!","description":"Located in one of the most beautiful neighborhoods in Philadelphia, Washington Square West, The Lincoln Building (1222 Locust Street) boasts a blend of upscale living with modern finishes. The Lincoln Building shares the vision of the city that gives it life! A historical renovation immersed amongst the charm of one of the country's oldest cities, coupled with innovative development seen around the world-- all at your doorstep! Chic and modern finishes mesh with the original character of the building to provide the perfect combination of sophistication and comfort. Twelve22 Locust offers the convenience of living in one of Philadelphia's trendiest neighborhoods- from world class dining to shopping, it has it all! Hardwood floors, City views, W\/D in unit, dishwasher, stainless steel appliances and communal roof deck. The Lincoln has an amazing location in easy walking distance of multiple modes of public transportation and tons of shops and restaurants.\n1222 Locust St #207","num_images":10.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '967ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:53:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stylish-and-elegant-bi\/7603147309.html","post_id":7603147309,"title":"Stylish and elegant bi-level 2 BR apt in the heart of Northern Liberti","description":"Welcome to 987 N 5th St! A stylish and elegant bi-level 2 BR apt in the heart of Northern Liberties waiting for you to move in. Enter into a large living room with original wide plank hardwood flooring and a decorative marble fireplace mantel. Continue on into the dining area and kitchen, which is in the process of receiving an upgrade with new hardwood flooring, granite countertops and a white subway tile backsplash. All appliances were newly installed last year. Beyond the kitchen lies a mud room perfect for bike storage. Retreat to the huge, private backyard great for BBQing, outdoor entertaining and container gardening. Upstairs you will find two bedrooms and a newly updated bathroom. There is an in unit washer and dryer in the basement, which also provides more than ample storage. The location can't be beat. Steps away from all that Northern Liberties has to offer as well as a short walk to Fishtown, Olde Kensington and the Spring Arts\/Loft District. Pets are allowed on a case by case basis so bring your furry friends. Available for a May 1st move in. This one won't last so schedule your showing today!\n987 N 5th St #1","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available apr 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T11:41:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sunny-spacious-newer\/7603150883.html","post_id":7603150883,"title":"Sunny & spacious newer construction unit in Fairmount!","description":"Welcome to 922 N 15th St #1 -- a sunny & spacious newer construction unit in Fairmount! The spacious open concept entry level includes the living area, dining area, and gorgeous kitchen with stainless steel appliances, seated island, and plenty of counter and cabinet space. Down the hall you'll find the first bedroom and full bath with tiled shower and tub. Off the kitchen is a private back patio; perfect for relaxing or entertaining. Downstairs are the second and third bedrooms, in-unit washer\/dryer, and two additional FULL baths. All throughout, you'll appreciate the ample storage space, recessed lighting, high ceilings, wide layout, and luxury finishes\/fixtures. Last but not least, the LOCATION... Walking distance to Fairmount Ave shops\/restaurants\/nightlife, The Met, Divine Lorraine, local favs like Vineyards Cafe, Cambridge St Coffee, Rybread, Bar Hygge, Lorraine, & more; Super easy access to Broad St line and Girard Ave for a breeze of a commute to Center City, Fishtown\/NoLibs, Temple, South Philly\/the stadiums & beyond; Also convenient to the Art Museum, Kelly Drive, Fairmount Park, Wissahickon, highways, hospitals, grocery stores, convenience stores - the list goes on! Schedule a tour today -- you must see this one in person! {Tenant responsible for all utilities plus $50\/mo for water paid to Landlord with monthly rent. Pet friendly on case-by-case basis with owner approval and fees. First\/last\/security due at lease signing.\n922 N 15th St #1","num_images":7.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 3Ba', '1715ft2', 'available apr 17', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:50:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3bed-3bath-roofdeck\/7603150522.html","post_id":7603150522,"title":"3Bed\/3Bath\/RoofDeck\/Finished Basement","description":"Situated in the middle of Graduate Hospital is this 3 bedroom, 3 bath home with a finished basement and roof deck. Open concept, new washer\/dryer in unit, with hardwood floors throughout, a gas fire place, and beautiful crown moldings. Tons of cabinet space in the kitchen with newer granite countertops, stainless steel appliances, and French doors leading to the private patio space perfect for grilling or sitting with morning coffee. Take in the amazing city views from the roof deck which serves as the main outdoor space. Second floor contains 2 bedrooms and a shared hallway bath. Primary bedroom suite with high ceilings and plenty of natural light is located on the third floor with ensuite bath. Enter the updated bath with a double vanity, glass shower, and extra storage space. The finished basement with the bathroom is the perfect office space or den. This rental is located in a prime South Philadelphia location, walking distance to Center City, Sidecar Bar, Ultimo Coffee, Loco Pez and many other hot spots. Close to major road ways and plenty of public transportation options, this property is truly in the heart of all Philadelphia has to offer.","num_images":11.0,"lat":39.9379,"lng":-75.1794,"attrs":"['3BR \/ 3Ba', '1600ft2', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T11:49:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-come-see-this-solid-brick\/7603129805.html","post_id":7603129805,"title":"Come see this solid brick 3 bedroom 2 bath brick single family home.","description":"Come see this solid brick 3 bedroom 1 1\/2 bath brick single with a wonderful Upper Roxborough location just minutes from Fairmount Park s Wissahickon Valley, Chestnut Hill, the shops and restaurants of Manayunk and multiple public transportation routes to Center City. The main level consists of a spacious living and dining room with refinished hardwood floors with adjacent kitchen, powder room, laundry area and one car garage with inside access. Email me view.","num_images":4.0,"lat":40.052713,"lng":-75.233204,"attrs":"['3BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T11:00:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wonderful-living-and\/7603143907.html","post_id":7603143907,"title":"Wonderful living and dining space!","description":"THE MIDTOWN! This value priced spacious and gracious light filled 1 bedroom offers: Wonderful living and dining space which your kitchen over looks. Very well proportioned bedroom and all tile bath. Enjoy living just minutes from Avenue of the Arts, Jefferson Hospital, Pennsylvania Hospital, and the Reading Terminal Market. Walking Score 110!\n1218 Walnut St #202","num_images":8.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '600ft2', 'available may 16', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T11:33:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-featuring-amenities-such\/7603149927.html","post_id":7603149927,"title":"Featuring amenities such as gym and outdoor space!","description":"TransAtlantic Building (430 Fairmount Avenue) is located in the heart of one of the country's hottest neighborhoods! An iconic revitalization surrounded by the charm of Northern Liberties' tree lined streets and historic homes. Just steps from a wide variety of store fronts, restaurants, and parks- the TransAtlantic is the perfect place to call home! White-washed original brick and beam is complemented with luxurious modern finishes for maximum aesthetic pleasure. A rare building for the neighborhood, featuring amenities such as gym and outdoor space!\n430 Fairmount Ave #103","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '837ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:47:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-two-bedroom-two\/7603140896.html","post_id":7603140896,"title":"AMAZING two bedroom two bathroom apartment!","description":"VIDEO TOUR OF THE UNIT AVAILABLE! PLEASE INQUIRE FOR IT! LEASE WILL RUN THROUGH APRIL 2024. AMAZING two bedroom two bathroom apartment in the desirable Washington Square West neighborhood! Beautifully updated with open concept kitchen, stainless steel appliances and wood floors throughout. Tons of natural light! Steps from shopping, dining, Center City, and public transportation. Excellent condition!! Make this place your own -- it will not last! AVAILABLE STARTING NOW! Central air and heat controllable inside the unit make the space comfortable all year round!! Again don't wait long, it will not last at this price! First month, last month, and one month security deposit due prior to move-in. Resident responsible for Electric and Gas. Landlord is charging a $60 monthly fee for water. $45 application fee per applicant.\n1333 Pine St #1F","num_images":10.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '700ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T11:26:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-dont-miss-this-beautifully\/7603143219.html","post_id":7603143219,"title":"Don't miss this beautifully renovated 2nd-floor unit !","description":"Don't miss this beautifully renovated 2nd-floor unit with its own private furnished roof terrace for seasonal plantings and a container garden (maintained by Landlord) This sunny unit has 2 bedrooms and 2 full bathrooms (both en-suite). Enjoy living on this quiet tree-lined street in desirable Fitler Square. The unit has been completely renovated with new hardwood flooring, and brand-new bathrooms (one has a walk-in shower and the other has a bathtub). Prepare gourmet meals in your brand new kitchen with all new appliances and then enjoy alfresco dining on the private furnished roof terrace. Gas & hot water is included in the rent, tenant pays electric. 880 sq feet\n2110 Lombard St #2","num_images":9.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '880ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:31:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-featuring-amenities-such\/7603148739.html","post_id":7603148739,"title":"Featuring amenities such as gym and outdoor space!","description":"TransAtlantic Building (430 Fairmount Avenue) is located in the heart of one of the country's hottest neighborhoods! An iconic revitalization surrounded by the charm of Northern Liberties' tree lined streets and historic homes. Just steps from a wide variety of store fronts, restaurants, and parks- the TransAtlantic is the perfect place to call home! White-washed original brick and beam is complemented with luxurious modern finishes for maximum aesthetic pleasure. A rare building for the neighborhood, featuring amenities such as gym and outdoor space!\n430 Fairmount Ave #103","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '837ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:45:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-move-right-in-to-this\/7603146435.html","post_id":7603146435,"title":"Move right in to this fully updated two-bedroom\/two-bath!","description":"Move right in to this fully updated two-bedroom\/two-bath Graduate Hospital residence. Sun streams into the dramatic two-story living room, where a wood-burning fireplace is waiting to warm your winter days. Built-in bookshelves and excellent wall space for art complete the picture. Off of the living room is a storage room with laundry facilities and mechanicals for the unit. The eat-in kitchen is finished with neutral wood cabinetry topped in granite along with a stainless refrigerator, stainless undermount sink and a gas range. The kitchen also features a tile floor and backsplash, and the dining area includes bench seating with built-in storage. Access a rear deck from this level that provides a spot for a café table or chaise. There is a bedroom on this level served by a full bath with stall shower and pedestal sink. An upstairs bedroom also has a full bath with a tub\/shower. Both bedroom closets include organizers. This is a great opportunity to join one of the city’s most vibrant neighborhoods close to Center City and points west into University City. **Disclaimer BOTH bedrooms do not have carpet anymore. Newly installed vinyl floors in both bedrooms.**\n2029 Bainbridge St #1","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '1146ft2', 'available apr 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T11:39:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-water-and-parking-included\/7603145824.html","post_id":7603145824,"title":"Water and parking included in rent!","description":"Incredible top floor 1 bedroom apartment with wrap around windows PLUS parking in the middle of Rittenhouse Square!!! Located on the corner of 23rd and Walnut Street, this apartment will give you walking access to the best parts that the city has to offer! This unit boasts large living and bedroom space with a TON of natural light to match! Washer and dryers in unit. Easy access to all highways including 676 and I-95 in case you have to get out of the city limits easily and conveniently. The best restaurants within minutes' walk and the most vibrant night life as well. Elevator building that allows pets. Water and parking included in rent!\n135 S 23rd Street #B5","num_images":10.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '720ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:38:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-you-will-find-modern\/7603144642.html","post_id":7603144642,"title":"You will find modern features and amenities!","description":"Welcome to 601 N 12th St Located among all new construction on N 12th St and nuilt with top of the line appliances, finishes, and flooring, this building is a one of a kind gem in Spring Arts. Enjoy having direct access to Center City, Fairmount, N Broad St and tons of shopping and restaurant experiences. Inside you will find modern features and amenities including high efficiency central air + heat, full size washers\/dryers and spacious floorplans. The bi-level, second floor unit offers a spacious living area, gorgeous kitchen space with upgraded appliances and 2 bedrooms suitable for a King bed. Located on a corner parcel, this unit benefits from terrific natural light and large windows throughout!.\n601 N 12th St #B","num_images":7.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1052ft2', 'available may 3', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:35:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-clean-and-spacious-1088-sq\/7603140654.html","post_id":7603140654,"title":"Clean and spacious 1088 Sq Ft, 2 BR \/ 2 BA with gorgeous views","description":"Millview Apartments 100 Cobblestone Dr Coatesville, PA 19320  show contact info\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Rental Size:  2 BR - 2 BA - 1088 sq ft  Per Month: $1704 - $2282  Lease Length: Variable  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  Nestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Features and Amenities: ✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral Bonuses. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . This Unit Comes With: ✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In Closets. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Call us for more information! --  show contact info\n-- Website: https:\/\/www.apartmentsincoatesvillepa.com\/Pets: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'available apr 14', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:25:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-this-is-the-place-youve\/7603139802.html","post_id":7603139802,"title":"This is the place you've been looking for! 2 BD \/ 2 BA!","description":"Millview Apartments Bedroom: 2 | Bathroom: 2Square Footage: 1088 sq ftMonthly Rent: $1638 - $2202 show contact info\nCommunity Description  Our apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.\nComplete with a soothing sauna, dry-cleaning pick-up and delivery, a resort-style pool, and a state-of-the-art fitness center, you will enjoy a lavish lifestyle at our luxury apartment homes in Coatesville. Our pet-friendly apartments are settled on beautiful grounds, perfect for outdoor exercise and recreation. Whether you are searching for high-quality Coatesville apartments or are simply looking for an apartment home in Chester County, find what you need at Millview. Offering the best luxury apartments in Coatesville, PA, we will help you feel right at home.\nIf you would like more information about Millview Apartment Homes, please feel free to contact us today.    Community Amenities◾ Business Center◾ On-Site Leasing Office◾ Pet-Friendly◾ Private Garages In Select Units◾ 24-Hour Emergency Maintenance◾ Coffee Bar Clubhouse Kitchen◾ Resident Referral BonusesUnit Features◾ Built-In Microwave◾ Central Heat & Air Conditioning◾ Disability Access In Select Units◾ Dishwasher◾ Full-Size Washer & Dryer In Every Apartment◾ Mini Blinds On All Windows◾ Refrigerator\/Freezer With Ice Maker◾ Walk-In Closets  Contact InformationVisit Us: 100 Cobblestone Dr Coatesville, PA 19320 show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/   Additional DetailsPet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Lease Terms: VariableManagement Company: Paradise Management, LLC Price is subject to change without prior noticeEQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":12.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:23:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-light-filled-bi-level\/7603138599.html","post_id":7603138599,"title":"Light filled bi-level apartment !","description":"Light filled bi-level apartment on the 1st and 2nd floors of a historic brownstone building on Mt Vernon Street. Newly renovated with contemporary aesthetic. Vaulted ceilings on the first floor lead upstairs to the open floor-plan kitchen and living room. Inquire to immediately receive our video tour and schedule an in person visit with our team. Blonde oak flooring throughout with updated tile bathroom. Chet's kitchen with brand new stainless steel appliances and in-unit laundry. Central air. Plenty of storage space throughout. Deep window sills perfect for your house plants. Property Highlights: - Renovated - Central Air - Full-size laundry in unit - Brand new stainless steel appliances (range, microwave, dishwasher, disposal, fridge) - Professionally managed Pets welcome at owners discretion Tenant covers gas & electric; flat water fee\n1716 Mount Vernon St #UNIT 1\/2","num_images":10.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '3197ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:20:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-delightful-bed-bath-in\/7603138537.html","post_id":7603138537,"title":"Delightful 2 bed \/ 2 bath in Coatesville. 1178 Sq Ft. Great value!","description":"Millview Apartments Visit our community today! 100 Cobblestone Dr Coatesville, PA 19320 show contact info\nUnit Rates:  $1724 - $2307\/month Unit Type: 2-BR 2-BA Unit Size: 1178 sq ftLease Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.What you’ll find in our community: ➢ Business Center➢ On-Site Leasing Office➢ Pet-Friendly➢ Private Garages In Select Units➢ 24-Hour Emergency Maintenance➢ Coffee Bar Clubhouse Kitchen➢ Resident Referral BonusesDescription: Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.This unit comes with: ➢ Built-In Microwave➢ Central Heat & Air Conditioning➢ Disability Access In Select Units➢ Dishwasher➢ Full-Size Washer & Dryer In Every Apartment➢ Mini Blinds On All Windows➢ Refrigerator\/Freezer With Ice Maker➢ Walk-In ClosetsCall or visit our website to schedule a personal tour! Office Phone:  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Property Management: Paradise Management, LLCEQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":14.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'available apr 14', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:20:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-penthouse-bed-bath-at-1701\/7603112529.html","post_id":7603112529,"title":"PENTHOUSE 2 bed 2 bath at 1701 South!","description":"PENTHOUSE 2 bed 2 bath at 1701 South! FEATURES PRIVATE LARGE DECK. Hardwood Flooring, Open living space, Recessed Lighting, Stainless Steel Appliances & Backsplash, Stone Countertop, Washer\/Dryer in Unit. Easy access to Penn, Graduate Hospital, and a few short Blocks to Rittenhouse! Within One Block in Either Direction Restaurants: Acclaimed Pumpkin Restaurant, Founding Father's Sports Bar & Grill; South Street Bistro and so many more; Public Transportation. Pets welcome with one time $250 deposit and $25\/month. Monthly garage parking across the street. Please note this is a non-smoking building. Available April 10th. ONLY 1st month's rent and 1\/2 month security deposit needed at lease signing!\n1701 South St #8","num_images":8.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '900ft2', 'available apr 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T10:11:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-ready-brand-new-appliances\/7603134881.html","post_id":7603134881,"title":"Ready! Brand New Appliances, Quartz Countertops and White Cabinets!","description":"🏠LOVE Your New HOME- Apply Now- Reduced Rent Special🏠\nApt #D-07 First floor apartment with beautiful new kitchen upgrade and great location to parking. Near to shopping and close to the train!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 9 am-6 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":24.0,"lat":40.0,"lng":-75.276,"attrs":"['1BR \/ 1Ba', '663ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T11:12:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/media-media-bed-bath-1st-flr-available-1\/7603111192.html","post_id":7603111192,"title":"Media - 2 bed\/1 bath - 1st Flr - Available 4\/1","description":"MEDIA - 2 BED\/1 BATH - Walking distance to downtown Media, Great location. Move in Ready Now. Available 4\/1Call Chris @  show contact info\nfor showingNewly remodeled in Media with hardwood floors and updated kitchen. Walking distance to trains to downtown Philadelphia, shopping, etc.Available Immediately!*RENTAL REQUIREMENTS* - MONTHLY NET INCOME: $3,900 Rates:$1499 per month. Tenant responsible for all utilities. Experience Everyone's Hometown of Media, PA:  A charming walk able town with shops, diverse restaurants and nearby parks.  Whether business in the County seat brings you to Media or visiting the Philadelphia area for pleasure, experience small town living with convenient public transportation to Philadelphia.Highlights of the Property Include:1. Washer and dryer available2. Tenant is responsible for all utilities. 3. Walking distance to Media SEPTA Train Station that will take you all the way to downtown Philadelphia, Penn University, Temple University, University City. 4. Near Penn State University Brandy Wine5. Walking distances to Delaware County Courthouse6. Walking distance to the restaurant and local shop, etc7. Near Movie Theater8. Near Riddle Hospital\/Media 9. Walking to distance to downtown Media and close to the post office, bank, Wawa store.Off street parking! Walk to train station or walk into town and enjoy the many fine restaurants. North on Route One, turn right at Hill's Seafood, go to stop sign. Property located across from stop sign.No Smoking or Indoor Candles!Call Chris @  show contact info\nfor showing\n2 bed\/1 bath. $1350 rent, 2+ Year lease preferred, longer term tenant\nAmenities:\n- Unfurnished\n- Smoke Free\nAppliances:\n- Air Conditioning\n- Microwave\n- Range\n- Refrigerator\n- Oven\n- Washer & Dryer - Basement\nLeaseLengths:\n- 12 Months lease - Prefer long term tenant\n- 24 Months lease - Prefer long term tenant\nUtilities:\n- Resident Pays Electricity\n- Resident Pays Gas\n- Resident Pays Heat\n- Resident Pays Water\n- Resident Pays Trash Pick-up\n- High-Speed Internet Available\nContact M&C at  show contact info\nfor more information\n","num_images":11.0,"lat":39.915968,"lng":-75.394898,"attrs":"['2BR \/ 1Ba', '900ft2', 'available apr 1', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:07:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-apartment\/7603128095.html","post_id":7603128095,"title":"Large 1 Bedroom Apartment","description":"Nice one bedroom apartment. 600 sqft. Hardwood floors throughout. Spacious bedroom. Modern kitchen with stainless steel appliances. Washer and dryer in the unit.\nConvenient location. 3 blocks to Tasker-Morris subway stop. Short walk to Passyunk Walk, South Philadelphia Tap Room, American Sardine, South Street, and Rittenhouse Square. Walking distance to Center City\nFirst month, Last month and Security Deposit required.\nCats\/Dogs are ok with a $250 non-refundable fee per pet.\nWe will be running a credit and background check.\nCall or Text to schedule showing.\n","num_images":24.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '600ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:55:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-beautiful-bedroom\/7603122861.html","post_id":7603122861,"title":"Bright Beautiful 2 Bedroom 2 Bathroom Apt Home with Washer and Dryer","description":"Apartment Home Features:\n* Unfurnished 2 bedroom 2 bathroom apartment home at 802 on 8th floor\n* Combination washer and dryer\n* Large east-facing windows with Walnut Street view\n* Wood floors throughout living and dining room area\n* Abundant closet space\n* Beautiful kitchen open to living and dining room area\n* Granite kitchen counters\n* Gas stove\n* Dishwasher\n* Disposal\n* Microwave drawer\n* 2 big beautiful bathrooms (1 with bathtub)\n* All utilities included (except cable and internet)\nCommunity Features:\n* High-rise building on Rittenhouse Square\n* Roof deck under renovation until spring 2023\n* Guest suites\n* Bicycle storage\n* 8,000-square-foot lounge with seating areas, pool table, TV room, printer, conference room, kitchen, and more!\n* Fitness center with park view\n* Yoga studio\n* Dog spa\n* Sauna\n* Attached valet parking garage! Parking is not managed by the community, so the cost is separate.\n* Front door attendant\n* Concierge\n* Laundry room on every floor and large laundry room on the 3rd floor\nNearby Retail Stores:\n* Tselaine\n* Lagos\n* Tumi\n* Madewell\n* Outdoor Voices\n* Tiffany & Co.\n* allbirds\n* Brooklinen\n* Lovesac\n* Athleta\n* lululemon\n* Indochino\n* Glossier\n* Vans\n* L'Occitane en Provence\n* Target\nNearby Grocery Stores:\n* Venditore by Giordano\n* Sue's Produce Market\n* Di Bruno Bros.\n* Rittenhouse Market\n* Target\n* Spruce Market\n* Trader Joe's\n* Giant\nNearby Restaurants:\n* Restaurant Aleksandar\n* Tortorice's Specialty Sandwiches\n* Twenty Manning\n* Square on Square\n* Villekebabs & Platters\n* The Love.\n* a.kitchen\n* Pietro's\n* Rouge\n* Parc\n* Via Locusta\n* Barclay Prime\n* Friday Saturday Sunday\n* Trattoria Carina\n* Sally\n* Spice Finch\n* Farina Pasta & Noodle\nNearby Coffee Shops:\n* La Colombe\n* K'Far Cafe\n* Di Bruno Bros.\n* Gran Caffe L'Aquila\n* Konditori\n* Nook Bakery & Coffee Bar\n* Vernick Coffee Bar\n* Vibrant\n* Ultimo\n* Alchemy\n* Bluestone Lane Walnut Street Café\n* Bluestone Lane Rittenhouse Café\n* Elixr\n* J'aime French Café\nNearby Bakeries:\n* Metropolitan Bakery\n* The Bakeshop on 20th\nNearby Ice Cream Shops:\n* Van Leeuwen\n* Jeni's\nTo see if this home is still available, go to our website at rittenhouseclaridge.com to see if 802 is still listed under the Da Vinci floor plan. Please make an appointment to tour with Gabby or Michelle using ResMate, our chatbot concierge, on our website at rittenhouseclaridge.com.\nWe can furnish a home for you over two weeks following rental application approval and after the home is made ready. Please note that there is a three-month lease term minimum for a furnished home. You would pay a furnished rent instead of an unfurnished rent. We can calculate this furnished rent for you based upon your choices.\nRittenhouse Claridge\nPrice posted is for the 22 month lease term.\nFor an unfurnished home, we offer lease terms from 2 to 22 months.\nPrice depends upon lease term as well as move-in date. Check out our website!\nRental rates, availability, and apartment home features are subject to change without notice.\nWelcome home!","num_images":24.0,"lat":39.949721,"lng":-75.17056,"attrs":"['2BR \/ 2Ba', '1180ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T10:40:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-live-stylishly-classic\/7603125408.html","post_id":7603125408,"title":"Live stylishly! Classic hardwood flooring! Tour today!","description":"Silk Factory Lofts200 S Line St Lansdale, PA 19446A wonderful home in Lansdale is waiting for you!We currently have a gorgeous 1 bedroom 1 bathroom renting for $1735 per month. This unit comes with 797 sq ft. SEE WHAT YOU'VE BEEN MISSING  Located in the heart of Lansdale, Pennsylvania, Silk Factory Lofts offer an irresistible lifestyle set in a historic landmark building. Our open loft-style apartments feature oversized windows, high ceilings and modern kitchens. Our community boasts an upscale resident lounge, modern fitness center and beautiful courtyards. Apartment options include 1, 2 and 3 bedroom floor plans. Silk Factory Lofts is located close to public transportation, shopping, dining and entertainment. If you want to venture out, we offer convenient access to major highways, and we're less than an hour from downtown Philadelphia. show contact info\nCommunity Highlights:● 18' Long Shuffle Board● 2 Weber Propane Grills● Business Center● Dog Wash Room● Laundry Facilities● Monthly Community Events● Pet-Friendly Community● Pool Table● Smoke-Free● Vintage Building● Beautifully Landscaped Grounds with Access to Local Businesses● Close to Montgomeryville Mall and Routes 202 & 309● Community Lounge featuring free Verizon Fios TV\/Wi-Fi● Courtyard featuring tasteful Outdoor Seating and Fire Pits● Fitness Center with Free Weights, Verizon TV and Free Wi-Fi● Free Parking - 2 Spaces per Apartment Home + Guest Parking● Maintenance-Free Lifestyle● Professional On-Site Management Team● Storage units - $75\/$100 per month● Within Walking Distance to TrainsUnit Highlights:● Cable & Hi-Speed Internet Ready● Central Air Conditioning● Courtyard View in select apartments● Full Size Washer & Dryer● Large Windows● Range \/ Oven● Refrigerator\/Freezer● Secured Building Access● Storage Spaces● Upgraded Kitchens in Select Apartments● Cable & Hi-Speed Internet Ready● Central Air Conditioning● Courtyard View (select apartments)● Dishwasher● Large Windows● Range \/ Oven● Refrigerator\/Freezer● Secured Building Access● Storage Spaces● Upgraded Kitchens (select apartments)Contact:  show contact info\nFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/Leasing Options: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthPet Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German Sheph Management: Paradise Management, LLC Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITY2A6F1CAF76CF407\n","num_images":24.0,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '797ft2', 'available may 14', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:48:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-apartment\/7603125103.html","post_id":7603125103,"title":"Large 1 Bedroom Apartment","description":"Nice one bedroom apartment. 600 sqft. Hardwood floors throughout. Spacious bedroom. Modern kitchen with stainless steel appliances. Washer and dryer in the unit.\nConvenient location. 3 blocks to Tasker-Morris subway stop. Short walk to Passyunk Walk, South Philadelphia Tap Room, American Sardine, South Street, and Rittenhouse Square. Walking distance to Center City\nFirst month, Last month and Security Deposit required.\nCats\/Dogs are ok with a $250 non-refundable fee per pet.\nWe will be running a credit and background check.\nCall or Text to schedule showing.\n","num_images":24.0,"lat":39.93118,"lng":-75.173778,"attrs":"['1BR \/ 1Ba', '600ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:47:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-the-vine-the\/7603114400.html","post_id":7603114400,"title":"Welcome to The Vine, the newest luxury condo!","description":"Welcome to The Vine, the newest luxury condo development by Philadelphia’s premier developer, Stamm Development, located in the heart of Francisville, just north of bustling Fairmount Avenue. This gorgeous unit boasts an open layout with a large kitchen featuring plenty of cabinet and countertop space, a bright and airy living room, and a huge bedroom. With its large 11’ ceilings, 1A feels wide open and spacious. The kitchen is the heart of this home and is decked out with two-tone UltraCraft cabinets, pure white quartz countertops, Delta Trinsic matte black fixtures, and Whirlpool stainless steel appliances, making it a chef's dream come true. The generously appointed bedroom features custom-built closets, while the bathroom boasts a deep soaking tub, custom vanity, and sleek black matte fixtures. Modern conveniences such as smart thermostats and Latch Technology secured front entry systems are included in all residences, providing an added layer of security and convenience. The building also features an incredible rooftop deck for all residents to enjoy, a private trash\/recycling room, bike storage, and a mail room.\n1723 Francis St #1A","num_images":8.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '750ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:16:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-top-floor-studio-apartment\/7603124528.html","post_id":7603124528,"title":"Top Floor Studio Apartment Home with South-Facing Windows, Near Cafes","description":"Apartment Home Features:\n* Unfurnished studio apartment home at 2610 on top and 26th floor\n* Renovated kitchen and bathroom\n* Neutral carpet\n* Large south-facing windows with peak of South Philadelphia in between high-rise buildings\n* Gas stove\n* Microwave\n* Dishwasher\n* Disposal\n* Granite kitchen counters\n* White kitchen cabinets\n* All utilities, except cable and internet, are included\nCommunity Amenities:\n* Laundry room on every floor and 3rd floor laundry facility\n* Historic high-rise building on Rittenhouse Square\n* 8,000-square-foot lounge with pool table, TV room, conference room, kitchen, and dining area\n* Fitness center with park view\n* Fitness\/yoga studio\n* Sauna\n* Dog spa\n* Luxer One package lockers in 2nd floor package room\n* Guest suites for friends & family of current residents\n* Elevator building with front door attendant and concierge\n* Online resident portal RentCafe for maintenance requests, rent payments, lease renewals, and more\n* On-site maintenance\n* Bicycle storage\n* Attached valet parking garage! Parking spaces not managed by community, so the cost is separate.\nClose to Coffee Shops:\n* Vibrant\n* Ultimo\n* Alchemy\n* Bluestone Lane Walnut Street Café\n* La Colombe\n* K'Far Cafe\n* Konditori\n* Bluestone Lane Rittenhouse Café\n* Elixr\n* Bottega Rittenhouse\n* J'aime French Café\nNearby Retail Stores:\n* Lovesac\n* Athleta\n* lululemon\n* Indochino\n* Glossier\n* Salty Paws Rittenhouse Square\n* Kitchen Kapers\n* Paper Source\n* Anthropologie\n* Lagos\n* Tumi\n* Madewell\n* Outdoor Voices\n* Tiffany & Co.\n* Brooklinen\n* Target\nNearby Grocery Stores:\n* Rittenhouse Market\n* Trader Joe's\n* Giant\nNearby Bakeries:\n* The Bakeshop on 20th\n* Metropolitan Bakery\n* Termini Bros.\nWondering if this home is still available? Visit our website at rittenhouseclaridge.com to check if 2610 is still listed under the Dali floor plan! Schedule an appointment to tour with Michelle or Gabby using ResMate, our chatbot concierge, at rittenhouseclaridge.com.\nRittenhouse Claridge\n201 South 18th Street\nPhiladelphia, PA 19103\nWe can furnish a home for you over two weeks following rental application approval and after the home is made ready. Please note that there is a three-month lease term minimum for a home that we have furnished for you. A furnished rent would be calculated after learning your choices.\nPrice is for the 22 month lease term. For an unfurnished home, 2 to 22 month lease terms are available! Price depends upon lease term and move-in date. Check out rittenhouseclaridge.com for current pricing!\nRental rates, availability, and apartment home features are subject to change without notice.\n* Welcome home *","num_images":24.0,"lat":39.949753,"lng":-75.170538,"attrs":"['0BR \/ 1Ba', '400ft2', 'available apr 20', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T10:45:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-500-security-deposit\/7603108509.html","post_id":7603108509,"title":"$500 SECURITY DEPOSIT - Limited Time Move In Special!!","description":"$500 SECURITY DEPOSIT - Limited Time Move In Special!! Welcome home! Spacious 2 bedroom\/1 bath with fireplace. Washer and dryer in unit! Whether CHOP, HUP, Penn, or Drexel, Liberty View is the ideal location. Spectacular city views! Within blocks of prestigious Rittenhouse Square and Philadelphia public transportation, Liberty View is situated along vibrant, tree-lined South Street. Spacious apartment homes available in bi-level, patio, and balcony unit formats offer Center City living with comfortable outdoor space! Pictures are of the actual unit!\n2031 South St #214","num_images":13.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T10:00:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-your-new-home\/7603119857.html","post_id":7603119857,"title":"Welcome to your new home that was just fully renovated!","description":"Welcome to your new home that was just fully renovated! The large open kitchen features stainless steel appliances and a large window over the sink to the open living space beyond. Down the hall you will find a bathroom and large closest, before entering the huge bedroom, which best provides access to your large, enclosed, PRIVATE back yard. The lower level is all yours as well, and here you'll find plenty of clean storage space and your own washer\/dryer. This is an absolutely unbeatable location; a beautiful, walkable neighborhood with quick and easy access to University City and Center City. Highly desirable Greenfield school catchment. Too many local favorites and locations within walking distance to list -- Schuylkill River Trail, Fitler Square, Rival Bros Coffee, Amazon Hub Locker, to name a few. Your rent includes water, tenant responsible for all other utilities.\n2612 South St #1","num_images":10.0,"lat":39.9379,"lng":-75.1794,"attrs":"['0BR \/ 1Ba', '425ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:32:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-security-deposit-reduced\/7603114164.html","post_id":7603114164,"title":"Security Deposit reduced to $500 and no last month's rent upfront!!!","description":"Security Deposit reduced to $500 and no last month's rent upfront!!! Converted brownstone featuring 12 apartment homes within a close walking distance of scenic Washington Square Park. Property features an intimate setting with washer and dryer in the basement and original hardwood flooring. Parking options available nearby for $250\/month. Pictures are of the actual unit.\n901 Clinton St #11","num_images":8.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T10:16:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-windows-in-all\/7603111774.html","post_id":7603111774,"title":"Brand new windows in all apartments!!!","description":"HALF MONTH FREE AND $1000 MOVE-IN CREDIT FOR APPLICATIONS BEFORE 2\/28!!! Just 1st month's rent and $500 security deposit to move-in!!! The Society Hill Building is a beautiful mid-rise community located in the Society Hill\/Washington Square neighborhood of Center City. This building features spacious 1 bedroom 1 bath apartments, overlooking scenic Washington Square Park. The Society Hill Building is within walking distance of historic Old City as well as close to all forms of public transportation. 10 foot high ceilings, controlled access keypad entry, hardwood floors in some units, abundant natural light, dishwasher, microwave, high-efficiency individually controlled A\/C and heat. Laundry on each floor and pet-friendly! Brand new windows in all apartments. Pictures are of a similar unit. Video available\n701 Sansom St #206","num_images":9.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1170ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T10:09:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-premium-location-in\/7603118983.html","post_id":7603118983,"title":"A premium location in Society Hill!!","description":"A premium location in Society Hill for a super convenient ground level rental in this six unit, boutique building. Full size elevator service to all floors. Site finished, hardwood floors; Samsung appliances; stone counters; custom window treatments; glass shower doors; soaking tubs; washer\/dryer in unit. Ideal home for co-living with 2 beds and 2 baths. Walkscore calls this location Paradise with a score of 99. The perfect location to enjoy all that Center City has to offer.\n600 Addison St #1B NORTH","num_images":8.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '750ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:29:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apt\/7603086039.html","post_id":7603086039,"title":"1 Bedroom Apt.","description":"1 Bedroom Apartment Available April 1, 2023\nApplication fee and background check: $50.00\nNo Pets\nStreet Parking\nQuaint one bedroom apartment located on a friendly, tree lined block in W Mount Airy. Plenty of street parking also convenient to public transportation, just a short walk to the regional rail and multiple bus routes. Close to super market, restaurants and coffee shops, etc.\nMove in requirements are first month, last month and one month security deposit. Tenant pays electric and cooking gas.\nMake a appointment today\n1 year lease\n1st, last and security needed to move in\n$50 per person application fee\n3 months bank's statement & paystubs\nOwner pays heat and hot water\n","num_images":9.0,"lat":40.053,"lng":-75.189,"attrs":"['1BR \/ 1Ba', 'available apr 1', 'application fee details: $50 for credit and background check', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T08:35:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-corner-apartment\/7603118626.html","post_id":7603118626,"title":"Corner apartment renovation overlooking 3rd Street and Monroe!","description":"Corner apartment renovation overlooking 3rd Street and Monroe. Hardwood floors throughout with high ceilings. Full chef's kitchen with stainless steel appliances. Corner bedroom with en-suite full tile bath. Second full bathroom with laundry. French doors open to office\/guest space. Highlights: - Newly renovated - Light filled corner unit - Central Air - Laundry in unit - Full chef's kitchen with stainless steel appliances (range, microwave, dishwasher, disposal, fridge) - Professionally managed Tenant covers gas & electric; flat water fee Pets welcome at owners discretion\n724 S 3rd St #UNIT 2","num_images":10.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T10:28:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-everything-in-this-unit-is\/7603108180.html","post_id":7603108180,"title":"Everything in this unit is brand new!!","description":"This stunning corner and rare condo that is a fully renovated find, with many luxurious upgrades such as quartz countertops and luxury flooring throughout is in the heart of Washington Square. Everything in this unit is brand new, from the designer kitchen with stainless steel appliances to the upgraded bathroom, interior lighting, custom window treatments, and professionally painted interiors. This 2 bedroom, 1 bath unit provides spacious living in the heart of vibrant Washington Sq West, with nearby theaters, fine dining, coffee shops, top medical centers, idyllic parks, and myriad shopping options that offer a high quality, convenient standard of living. With no other tenants on the floor, this special unit is very private. Upon entering, the main living space is airy and open, with lots of natural light from a wall of windows at the front and side, and window treatments that can be raised or lowered for added privacy. The entire condo features modern, engineered hardwood floors. The tasteful kitchen offers upgraded gray cabinetry, white quartz waterfall counters, stainless steel appliances, Calacatta tile backsplash, deep double sinks, under cabinet hidden outlets, a large appliance cubby, pantry, an extended peninsula with pendant lighting, and comfortable seating for two or more. The primary master suite features a large bedroom, a walk-in closet, and a luxurious full bathroom with designer tile, a glass-enclosed shower, and dual access pocket doors. The second bedroom also has a walk-in closet. The entry hall includes multiple closets for coats, a washer\/ dryer hook-up space, an electric water heater, and the central HVAC. FURNISHED options available. ** Prices subject to change on daily basis *\n301 S 11th St #101","num_images":12.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', '973ft2', 'available now', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T09:59:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-trinity-style\/7603115254.html","post_id":7603115254,"title":"Charming trinity style home in the heart of Philadelphia","description":"This charming trinity style home in the heart of Philadelphia's vibrant Bella Vista neighborhood is now available for rent. This well kept one bedroom, one bathroom townhome boasts tons of character throughout. Featuring one room per floor with a spacious eat-in kitchen with access through the sliding glass doors to shared outdoor area. Upstairs on the second floor is a full bathroom with tub shower and down the hall is a nicely sized room that can be used as a second bedroom or the living\/entertainment area. At the top of the stairs features a skylight, letting in an abundance of natural light in the staircase and the primary bedroom. Other amenities include laundry in the basement, ceiling fans throughout, and closet space in each room. With its convenient location, having easy access to public transportation and a short walk to local shops, restaurants cafes, and all the cultural attractions that Philadelphia is famous for. Don't miss out on this fantastic opportunity to rent in one of Philadelphia's most sought-after areas! Pet(s) 50lbs and less accepted. First, Last & Security due at signing.\n904 S Delhi St","num_images":10.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '864ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:19:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-can-be-rented-fully\/7603112900.html","post_id":7603112900,"title":"**CAN BE RENTED FULLY FURNISHED FOR $2800\/MO**","description":"**CAN BE RENTED FULLY FURNISHED FOR $2800\/MO** A spacious and luxurious condominium with great North\/West facing views. This 1-bedroom, 1-bath residence features modern and luxurious finishes including granite countertops, wood floors, stainless steel appliances, 9 -foot ceilings with floor to ceiling windows. The price includes a reserved parking space in the attached covered garage, and a storage locker. The building features a 24HR Concierge, fitness center, a heated 60FT lap pool, renovated sundeck\/community room and much, much more! The building is situated conveniently next door to Trader Joes and Wine & Spirits - and is just walking distance from Philadelphia's top-rated restaurants. Spend the day shopping in Rittenhouse, or enjoying the sights at Boathouse Row, you can't beat the location and attractions located right near the Murano!\n2101 Market St #2108","num_images":10.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '743ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T10:12:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enter-through-gated-garden\/7603115543.html","post_id":7603115543,"title":"Enter through a gated garden to this oasis in the city!!!","description":"Enter through a gated garden to this oasis in the city. Renovated one bedroom with PRIVATE outdoor space, fireplace, updated kitchen with a dishwasher, microwave, granite counter tops, newer bathroom, hardwood floors, brand new washer\/dryer in unit, light from the south and west. Steps away from Acme, charming Society Hill, easy access to street parking\/ all major highways and so much more! Cats only. First, last and security due at signing. Water included, tenant pays gas and electric. Available April 1st.\n407 Cypress St #2F","num_images":10.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '700ft2', 'available apr 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T10:20:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bar-combination-dining\/7603115030.html","post_id":7603115030,"title":"Bar, Combination Dining\/Living, Dining Area!!","description":"Bar, Combination Dining\/Living, Dining Area, Family Room Off Kitchen, Floor Plan - Open, Intercom, Kitchen - Island, Upgraded Countertops, Walk-in Closet(s); No Fireplace; Built-In Microwave, Built-In Range, Dishwasher, Dryer, Freezer, Oven - Single, Refrigerator, Washer; Accessibility Features: None; Main Entrance Lock, Security System; Dryer In Unit, Washer In Unit\n1733 Wallace St #2","num_images":11.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:18:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-ss-appliances-free-parking\/7603114029.html","post_id":7603114029,"title":"SS Appliances, Free Parking, Pet Friendly, W\/D, Elevator Bldg, Pool","description":"Apartment 818 is 1 Bedroom with a stainless steel appliances, breakfast bar and washer\/dryer in unit. Plush carpeting throughout and gets great daylight too! Make this your new apartment home today!\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nElevator Building\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Gian, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-6pm | S, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!","num_images":13.0,"lat":39.966575,"lng":-75.604026,"attrs":"['1BR \/ 1Ba', '731ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:15:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-bed-2bath-luxury-living\/7603113292.html","post_id":7603113292,"title":"2 bed\/2bath - Luxury Living","description":"Apt. 5142 — Carlyle floor plan — 1,153 sq. ft. — $3,275\nLocated on the top floor, this 2-bedroom\/2-bathroom apartment has so much to offer! This beautiful apartment home comes with central air and heat, a full-size front-loading washer and dryer, and upgraded stainless-steel appliances. Our brand-new construction includes quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This gorgeous apartment is within close proximity to our clubhouse featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":24.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1153ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-25T10:13:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-make-this-new-york-style\/7603113261.html","post_id":7603113261,"title":"Make this New York-style loft in the heart of Logan Square !","description":"Make this New York-style loft in the heart of Logan Square with a 1-car deeded garage spot your new home! This great condo features high ceilings, original architectural details, exposed ducts and hardwood floors throughout. The home boasts an open concept-living area with exposed brick, oversized windows with Eastern exposure and exciting city skyline views, and is perfect for entertaining. The roomy kitchen provides generous counter space, modern cabinetry, stainless steel appliances, granite counter tops and a large island with ample seating space. The main level also includes two large bedrooms with lots of closet space, a full marble bath, a laundry closet with a full-size stacked washer\/dryer and a coat closet. A custom metal staircase adorns the stairs leading to the main bedroom, complete with a large walk-in closet and en-suite bathroom featuring a spacious walk-in shower. 2200 Arch St also provides amazing amenities, including a 24-hour monitored entrance, concierge, on-site garage parking, fitness center, Arch Gourmet convenience store on the ground floor and it is pet friendly. The location is extremely convenient and walkable, just steps away from Trader Joe’s and GIANT stores, the Schuylkill River Trail, close to 30th Street Station, Rittenhouse and Logan Squares, many restaurants, cafes, shopping and the museums including The Franklin Institute and The Barnes. Easy access to I-76 and I-676 makes this location perfect for commuters and city dwellers alike. Disclaimer: Property is listed for sale and might be sold during the lease period. Tenants would have to agree to showings during their lease.\n2200 Arch St #207","num_images":16.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 2Ba', '1550ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T10:13:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-come-check-out-this-four\/7603112714.html","post_id":7603112714,"title":"Come check out this four bedroom and 2.5 bathroom townhouse!!","description":"Come check out this four bedroom and 2.5 bathroom townhouse in a great centralized location in Washington Sq West. One block from Broad Street and a view of Kimmel Center from the third floor. Great backyard off the kitchen, central air, hardwood floors throughout. Three bedrooms on second floor, primary bedroom suite on third floor with walk-in closet and beautiful bath. Laundry in the basement! Move right in and enjoy this quiet home convenient to all that Philadelphia has to offer! There is a $50\/month water fee. $3,200\/month rent INCLUDES internet and security system!!\n317 S 13th St","num_images":13.0,"lat":39.9487,"lng":-75.1593,"attrs":"['4BR \/ 2.5Ba', '1614ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:11:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/morrisville-open-house-tour-the-edge-at\/7603112170.html","post_id":7603112170,"title":"Open House! Tour The Edge at Yardley","description":"The edge at Yardley is a wonderful community located in Yardley PA. We offer many different kinds of units including one - , two -, and three-bedroom floor plans with bi-level living options. Our community features a rare combination of great location , generous space and wonderful amenities and features. To schedule a tour please call  show contact info\n#19101\nHours:\nMon-Fri: 9:00am-5:30pm\nSat: 9:00am-5:00pm\nSun: Closed\n","num_images":9.0,"lat":40.2084,"lng":-74.8291,"attrs":"['2BR \/ 2Ba', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:10:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-luxury-loft-the-edge-at\/7603111430.html","post_id":7603111430,"title":"Luxury Loft! The Edge at Yardley!","description":"The edge at Yardley is a wonderful community located in Yardley PA. We offer many different kinds of units including one - , two -, and three-bedroom floor plans with bi-level living options. Our community features a rare combination of great location , generous space and wonderful amenities and features. To schedule a tour please call  show contact info\n#17201\nHours:\nMon-Fri: 9:00am-5:30pm\nSat: 9:00am-5:00pm\nSun: Closed\n","num_images":10.0,"lat":40.203849,"lng":-74.878794,"attrs":"['2BR \/ 2Ba', 'available apr 14', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:08:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/langhorne-open-house-this-saturday-tour\/7603110784.html","post_id":7603110784,"title":"Open House this Saturday! Tour The Edge at Yardley","description":"The edge at Yardley is a wonderful community located in Yardley PA. We offer many different kinds of units including one - , two -, and three-bedroom floor plans with bi-level living options. Our community features a rare combination of great location , generous space and wonderful amenities and features. To schedule a tour please call  show contact info\n#18110\nHours:\nMon-Fri: 9:00am-5:30pm\nSat: 9:00am-5:00pm\nSun: Closed\n","num_images":8.0,"lat":40.203849,"lng":-74.878794,"attrs":"['1BR \/ 1Ba', 'available mar 31', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:06:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-incredible-rental\/7603109737.html","post_id":7603109737,"title":"Incredible rental opportunity in prime Northern Liberties location!","description":"Incredible rental opportunity in prime Northern Liberties location! 1000+ sqft 1 bedroom 1.5 bath. Hardwoods throughout main living area and kitchen. Amazing natural light coming from the oversized windows in this corner unit. Beautiful open floor plan, large master bedroom with walk-in closet. Washer\/dryer in-unit. Common rooftop space available for entertaining. One block away from the Spring Garden El stop. Walking distance to all of Northern Liberties best dining and attractions. Do not miss this!\n201 Green St #3B","num_images":11.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '1173ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:03:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-close-to-the-upcoming\/7603108630.html","post_id":7603108630,"title":"Close to the upcoming Heirloom grocery!","description":"Updated contemporary layout, featuring original hardwood and spacious floorplan. Tons of natural light and perfect location in Society Hill, close to the upcoming Heirloom grocery! Inquire to check out our video tour and floorplan. Space is currently under renovation and photos marketed are of similar unit in building. All stainless kitchen with granite countertops, dishwasher, and disposal. Central eat-in kitchen with front livingroom overlooking greenery on Lombard with community center\/park across the corner. Living room features a wide layout, perfect for entertaining -complete with midcentury modern fireplace. Bedrooms are located at the front and rear of the unit, perfect for privacy. Each bedroom is sized for queen bedsets and have large closet space. Laundry in-unit with storage throughout. Property Highlights: - Well maintained building - Light filled - Working fireplace - Storage throughout - Washer\/dryer in unit - Stainless steel kitchen - Hardwood throughout - Central air - Caring and professional landlord Available now Tenant covers gas\/electric Flat $35\/mo water fee\n334 Lombard St #211","num_images":9.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '950ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T10:00:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-1005-marshall\/7603108433.html","post_id":7603108433,"title":"Welcome to 1005 N Marshall St in Northern Liberties!","description":"Welcome to 1005 N Marshall St in Northern Liberties! Unit 1 is a 3 bedroom , 3.5 bathroom new construction bilevel unit. Two of the 3 bedrooms have their own full bathrooms. Modern features include updated stainless steel appliances, hardwood floors, built in speakers in the ceiling, central air & an intercom system. Towards the rear, there is a small private outdoor space. This property is within a 5 minute Uber to Fishtown & a 10 minute walk to some of the best restaurants in Northern Liberties (Figo Italian, Añejo, Urban Village).\n1005 N Marshall St #1","num_images":12.0,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 3.5Ba', '1700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T10:00:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-you-will-love-living-on\/7603108066.html","post_id":7603108066,"title":"you will LOVE living on Iseminger!","description":"Situated on a quiet, sweet street in Washington Square West, 410 S Iseminger ticks all the boxes of trinity living. This two-bedroom, one-bathroom home features TWO outdoor spaces and has been beautifully updated for both modern comfort and historic preservation. Just through the front door, you’re greeted with a quaint living room with a well-maintained original fireplace and coat closet. Making your way downstairs, you’ll find the renovated kitchen with cellar door access to the street (for unloading groceries) and outdoor space. The kitchen has all new appliances, a new backsplash, and repointed exposed brick walls. The back patio is the perfect place to enjoy your morning coffee or work outside during a warm day. The first bedroom is found on the second floor of the home. Down the hall is the full bath featuring heated floors, a new toilet, and a new vanity. On the third floor of this trinity is the second bedroom with beautiful vaulted ceilings and exposed beams. Off of this bedroom is a little balcony. With two outdoor spaces, original hardwood floors, a basement for storage, central air, and close proximity to all your Center City favorites, you will LOVE living on Iseminger.\n410 S Iseminger St","num_images":11.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', '858ft2', 'available apr 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T09:59:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7603106787.html","post_id":7603106787,"title":"Pets Welcome, Lease Today, Quiet Community","description":"The Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '789ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-25T09:55:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7603097232.html","post_id":7603097232,"title":"Lease Today, Playground, Luxurious Bathrooms","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nSchedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available apr 1', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T09:24:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-featuring-2bed-1st-floor\/7603081651.html","post_id":7603081651,"title":"Featuring 2Bed 1st floor-Beautiful community","description":"Welcome home to 1333 N 53rd Street, 1st floor. This apartment features WASHER\/ DRYER in UNIT, exposed brick in one of the bedrooms, and newly renovated kitchen. Featuring newly renovated hardwood flooring, natural lighting, and sleek modern finishes, this apartment is the perfect place to call home. With direct access to a beautiful community backyard, you'll have a private oasis to enjoy on those sunny afternoons.\n*Apartment is pet-friendly.\n*Stainless steel appliances\n*Modern cabinets\n*All utilities included\n*Heating and Cooling: Heat Fuel, Forced Air, Heat\/AC, Central Air\n*High-speed internet (WiFI)\nNo smoking please!\n","num_images":8.0,"lat":39.973531,"lng":-75.227656,"attrs":"['2BR \/ 1Ba', '830ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T08:10:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-todays-best-opportunity\/7603076715.html","post_id":7603076715,"title":"Today's best opportunity 1Bedroom unit for $900\/mo","description":"Today's best opportunity 1Bedroom unit for $900\/Mo, Fantastic 1BR unit in great location. Luxury apartments located in an affordable up-and-coming district just north of University City. Stainless steel appliances including a dishwasher and garbage disposal, a multi-camera security system. Hardwood floors, in-unit laundry, granite counters, kitchen pantry, contemporary tile flooring in bathrooms, separate heat\/air in bedroom and living areas, sprinkler system, extra tenant storage space in building, LED lighting, large windows and large closets are just some of the great amenities this property has to offer!\n*One pet allowed!!\n","num_images":5.0,"lat":39.962534,"lng":-75.206283,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T07:38:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/clifton-heights-beautiful-2bedroom-with\/7603075798.html","post_id":7603075798,"title":"Beautiful 2bedroom with finished basement","description":"First ,last and security deposit is due upfront.\nSpacious rowhouse 2 floors and a finished basement.\nSpacious living room and dinning room\nLarge backyard\nSpacious Kitchen\nHardwood floors.\nMust have no eviction history. Section 8 accepted\n","num_images":12.0,"lat":39.929566,"lng":-75.299608,"attrs":"['2BR \/ 1Ba', '780ft2', 'available mar 27', 'air conditioning', 'application fee details: $40 background check fee', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T07:31:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-furnished-bedrooms\/7603071621.html","post_id":7603071621,"title":"Luxury furnished 4 bedrooms and 3 bathrooms for rent!","description":"Don’t miss your opportunity to call this large 4 bed 2 ½ bath with tons of character your new home! When you walk in your greeted with a wide-open living\/dining room, coffured ceilings, recessed lighting, original wood floors and half bath. Move through to the beautiful eat in kitchen with hand painted Mexican tile accents and backsplash, newer floors and appliances and cozy breakfast nook with built in storage. Certainly no lack of space in this kitchen! Enjoy having coffee on your private back patio, plus, no need to bring the trash cans through the house, you can use your breezeway! The 2nd floor features 3 good sized bedrooms with an updated hall bath. On the 3rd floor you’ll find your large primary bedroom with updated ensuite bath. Beautiful beam and exposed brick detail, plus tons of closet space make this a great sanctuary. Also, enjoy beautiful nights and cocktails with friends on your large roof deck! The unfinished full basement provides plenty of room for all your storage needs with a newer washer and dryer.\nCall: show contact info","num_images":1.0,"lat":40.0343,"lng":-75.1213,"attrs":"['4BR \/ 3Ba', '1800ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-25T06:52:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-furnished-bedrooms\/7603071607.html","post_id":7603071607,"title":"Luxury furnished 4 bedrooms and 3 bathrooms for rent!","description":"Don’t miss your opportunity to call this large 4 bed 2 ½ bath with tons of character your new home! When you walk in your greeted with a wide-open living\/dining room, coffured ceilings, recessed lighting, original wood floors and half bath. Move through to the beautiful eat in kitchen with hand painted Mexican tile accents and backsplash, newer floors and appliances and cozy breakfast nook with built in storage. Certainly no lack of space in this kitchen! Enjoy having coffee on your private back patio, plus, no need to bring the trash cans through the house, you can use your breezeway! The 2nd floor features 3 good sized bedrooms with an updated hall bath. On the 3rd floor you’ll find your large primary bedroom with updated ensuite bath. Beautiful beam and exposed brick detail, plus tons of closet space make this a great sanctuary. Also, enjoy beautiful nights and cocktails with friends on your large roof deck! The unfinished full basement provides plenty of room for all your storage needs with a newer washer and dryer.\nCall: show contact info","num_images":1.0,"lat":40.0343,"lng":-75.1213,"attrs":"['4BR \/ 3Ba', '1800ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-25T06:52:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-make-yourself-at-home-in-this\/7603072739.html","post_id":7603072739,"title":"MAKE YOURSELF AT HOME IN THIS QUIET COMMUNITY","description":"Newly renovated 3 bedroom, 2 bath apartment in the heart of PA! (a\/c, w\/d, & parking) - Welcome home to Emerald House, Pacific Beach's newest renovated community! Be the first to rent this brand new renovated downstairs 1x1 apartment home. Hardwood floors Kitchen with refrigerator and gas oven\/range, Large, open living room, One bedroom with closet storage. Location... location... location... The walkability of this community is fantastic! A quick walk to shopping, grocery, restaurants, boutiques, etc. A stroll!. BRING YOUR CLOTHES AND TOILETRIES ONLY BECAUSE THIS FULLY RENOVATED, SPACIOUS TWO BEDROOM LOFT-LIKE APARTMENT IS THE ULTIMATE PIED A TERRE IN THE HEART OF Albany NY. SITUATED BEHIND A GATED DRIVEWAY IN A VERY PRIVATE SETTING, THIS UPPER UNIT OFFERS A A LARGE, OPEN LIVING ROOM WITH DINING AREA, DESK AREA, AND A BEAUTIFULLY DESIGNED KITCHEN WITH STAINLESS STEEL APPLIANCES, PLEASE CONTACT ME: show contact info","num_images":1.0,"lat":40.2378,"lng":-75.2955,"attrs":"['3BR \/ 2Ba', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T07:03:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/700-station-ave-haddon-heights-nj-08035\/7603068716.html","post_id":7603068716,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1856-sqft-3br-15ba-in\/7603069357.html","post_id":7603069357,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-in-university-city\/7603059681.html","post_id":7603059681,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-and-elegant\/7603054545.html","post_id":7603054545,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-north-bergen-single-family\/7603027068.html","post_id":7603027068,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-quiet-large-1br-1bath-pet\/7603284474.html","post_id":7603284474,"title":"Quiet & large 1BR\/1bath !!PET FRIENDLY","description":"Quiet & large 2BR\/2bath in an laundry building AT 1000 Regatta Cir, Norristown, PA . Large eat-in kitchen! ALL UTILITIES INCLUDED! An abundance of natural sunlight in each room. Very spacious NICE Kitchen, In-unit laundry, Modern\/tiled bathrooms, New hardwood floors throughout, . PET FRIENDLY","num_images":4.0,"lat":40.1245,"lng":-75.3304,"attrs":"['1BR \/ 1Ba', '1100ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T16:43:13-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rent-per-month-is-hot\/7603276280.html","post_id":7603276280,"title":"Rent per month is hot water INCLUDED.THIS UNIT IS AVAILABLE: IMMEDIATE","description":"💖Beautiful 1 bed! This unit boasts gleaming hardwood floors, ceiling fans, and laundry in building! Conveniently located close to bars, restaurants, markets, and local parks! Great access to public transit as well. Amazing value!💚","num_images":1.0,"lat":39.9207,"lng":-75.1595,"attrs":"['1BR \/ 1Ba', '832ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T16:21:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/duplex-bedroom-bath-apartment-in\/7603273377.html","post_id":7603273377,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-individual-intrusion\/7603280046.html","post_id":7603280046,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-123-butternut\/7603277226.html","post_id":7603277226,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/hatboro-chetcbeautiful-bedroom-bath\/7603271669.html","post_id":7603271669,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/conshohocken-beautiful-bedroom\/7603271618.html","post_id":7603271618,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lafayette-hill-two-bedroom-with-in-home\/7603271112.html","post_id":7603271112,"title":"Two Bedroom with In Home Washer and Dryer","description":"RENTAL INFO Rental Rates: $2268 - $2695\/monthLocation: 555 Andorra Glen Ct Lafayette Hill, PA 19444Unit for Rent: 2-BR 2-BA | Square Feet: 1078 sq ft | Lease Length: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 13-Month, 14-Month, 15-Month show contact info\nPROPERTY AMENITIES➢ Business Center➢ Conference Room➢ Elevator➢ Furnished Units Available➢ Gated, Controlled Access➢ Package Service➢ Pet Friendly➢ Planned Social Activities➢ Recycling➢ Renters Insurance Program➢ BBQ Picnic Garden➢ Billiards, Club Lounge, Cafe Area, Library and Community Room➢ Fitness Center w\/ Free Weights, Weight Machines➢ Message Therapist Practice On-site➢ Outdoor Cafe & Coffee Bar➢ Outdoor Patio Lounge➢ Sprinkler System➢ Storage Space➢ Wi-Fi at ClubhouseAPARTMENT AMENITIES➢ Cable Ready➢ Carpet➢ Ceiling Fans (Select Floor Plans)➢ Dining Room➢ Heating➢ Range, Oven, Disposal, Oven➢ Refrigerator, Freezer and Ice Maker➢ Tub\/Shower➢ Wi-Fi➢ Window Coverings➢ Dishwasher➢ High Speed Internet Access➢ Linen Closet➢ Microwave➢ Storage Units➢ Trash Compactor➢ Vaulted Ceiling (Select Floor Plans)➢ Walk-In Closets (Select Floor Plans)➢ Washer\/Dryer➢ Wheelchair Accessible (Rooms)  ADDITIONAL INFODescription: Exclusive features, including a complete fitness center, outdoor cafe, BBQ picnic garden and on-site massage therapist are what make our apartments the best in the area. Enjoy a leisurely stroll around the beautiful grounds of our pet-friendly Lafayette Hill apartments. Whether you would like to host a social function in our clubroom or get some work done in our Wi-Fi-equipped business center, we have something to offer everyone. Residents of our apartment homes in Lafayette Hill are given peace of mind with our controlled access community entrance. If you are searching for an apartment in Lafayette Hill or seeking off-campus Philadelphia University student housing, come to The Glen. Offering the best apartments in Lafayette Hill, we will help you feel right at home.-Split Bedrooms\n-Generous Laundry Room\n-Abundant Closet Space\n-High CeilingsPet Policy: Pet-friendly community. Cats and dogs allowed. Breed restrictions apply. Ask for details on weight and breeds. Website: https:\/\/www.the-glen-apartments.com The Glen at Lafayette Hill: show contact info\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement. EQUAL HOUSING OPPORTUNITY220ADF76D80A400A\n","num_images":11.0,"lat":40.0896,"lng":-75.2601,"attrs":"['2BR \/ 2Ba', '1078ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-25T16:10:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-extra-closets-corner-unit\/7603263704.html","post_id":7603263704,"title":"Extra Closets\/ Corner Unit\/ Close To Pool\/ Cat Friendly\/Gym\/BBQ Grills","description":"RENT PERIOD: YEARLY\nAsk about apartment home 225 on the second floor, available soon!!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday 9:00 am-6:00 pm and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":10.0,"lat":40.053166,"lng":-75.236179,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T15:53:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-apartments\/7603264890.html","post_id":7603264890,"title":"One Bedroom Apartments Available - Dwell 2nd Street","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:760-800 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '767ft2', 'available now', '\\nsaturday 2023-03-25\\n', '\\nsunday 2023-03-26\\n', '\\nmonday 2023-03-27\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T15:56:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-beautiful-recently-renovated\/7603217273.html","post_id":7603217273,"title":"BEAUTIFUL, RECENTLY RENOVATED 2 BEDROOM, 1.5 BATH FOR RENT !!","description":"Beautiful, recently renovated 2 Bedroom, 1.5 Bath Westover Crossing Townhouse with three above ground floors of living space.\nCompletely renovated top to bottom as of 02\/01\/2019, including:\n- All new, large kitchen with new high quality gray cabinets and granite countertops\n- New master bathroom\n- New powder room\n- New flooring everywhere including basement (high quality laminate hardwood and carpet)\n","num_images":0.0,"lat":40.1496,"lng":-75.3796,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-25T14:08:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wonderful-4br-apartment\/7603249004.html","post_id":7603249004,"title":"Wonderful 4BR Apartment - Temple University","description":"Wonderful 2nd floor apartment, 4BR, 1.5 Baths, Living Room, Washer & Dryer in unit, freshly painted, large kitchen, large rooms, walking distance to Temple University in a student friendly neighborhood. Text  show contact info\n.","num_images":5.0,"lat":39.983503,"lng":-75.150858,"attrs":"['4BR \/ 1.5Ba', 'available apr 1', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T15:18:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-fitness-center-professionally\/7603245801.html","post_id":7603245801,"title":"Fitness Center, Professionally Managed, Lease Today","description":"The Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nWhen you call The Point at Exton home you will enjoy an amazing line up of amenities including a resort style pool, fashionable outdoor space, and a controlled access parking garage. Call now for a tour!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, walk-in closet, and a washer\/dryer!\nApartment Features\n* Quartz Countertops\n* Stainless Steel Appliances\n* Granite Countertops\n* Wood-Like Floors\n* Kitchen Island\n* Washer and Dryer in unit\n* Garden Tub\nCommunity Features\n* Outdoor Grill Area\n* Community Kitchen\n* Extra Storage\n* Professionally Managed\n* Garage Parking\n* Fitness Studio\n* Sun Deck\n* Swimming Pool\n* Easy Freeway Access\n* Controlled Access Parking\n* Bike Racks\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* Package Acceptance\n* TV Lounge","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '668ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T15:11:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-theater-room-quiet-community\/7603245467.html","post_id":7603245467,"title":"Theater Room, Quiet Community, Move In Now","description":"Discover a brand-new community designed to take luxury to the next level while keeping you close to everything you need. Lease now at The Point at Exton!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, ensuite bathrooms, walk-in closets, and a washer\/dryer!\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T15:10:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-br-apartment\/7603241344.html","post_id":7603241344,"title":"Beautiful 4 BR Apartment - Temple University","description":"Beautiful 2nd floor apartment, 4BR, 2 Baths, Washer & Dryer in unit, freshly painted, large kitchen, large rooms, walking distance to Temple University in a student friendly neighborhood. Text  show contact info\n.","num_images":10.0,"lat":39.985542,"lng":-75.162951,"attrs":"['4BR \/ 2Ba', 'available apr 1', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T15:01:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3bed-2bath-for-rent\/7603192627.html","post_id":7603192627,"title":"3BED 2BATH FOR RENT","description":"SOLO on Chestnut is currently offering ONE MONTH FREE on all 12 month leases! We are a luxury apartment building located on Chestnut Street in Philadelphia's hottest neighborhood, University City. Our University City apartments near UPenn make the commute to and from university a breeze while our central location is perfect for young professionals who are working in the city. Whether you are looking to stay with us in one of our short term rentals or for an extended period of time, our new management team is ready and waiting to make living with us as easy and stress free as possible.\n$1550 FOR RENT FEE $450 FOR SECURITY DEPOSIT PAYMENT, TOTAL AMOUNT $2000\nkindly text Mr Tyrone on  show contact info\nHe will be the one to forward you the Application processing Asap.\n","num_images":0.0,"lat":39.9597,"lng":-75.2024,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:15:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-private-patio-or-balcony\/7603226203.html","post_id":7603226203,"title":"Private Patio or Balcony, Gas Fireplaces, Disability Access","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Disability AccessDog ParkAir ConditioningPrivate Patio or BalconyCar Wash AreaCable ReadySpeakeasy Wine RoomGas FireplacesIndividual Intrusion AlarmsCable\/Satellite TVNewly Renovated InteriorsHigh Speed Internet AccessCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/sh5emgzf\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 1Ba', '926ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T14:28:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-3bdrm-3bth\/7603219011.html","post_id":7603219011,"title":"3BDRM 3BTH","description":"Hello Everyone !\nLooking for a place to rent a 3BD 3BTH in the booming Temple Area?\nWe have a Brand-New construction building with a *move in special* located on 2311 Palethorp St, around many restaurants on the strips of Cecil B. Moore, Girard Ave & Fairmount St. Also, this area is great for anyone who is currently or is going to Temple University.\nThis House is:\n- $2,200 with *One Month Free*\n- In unit washer & dryer and Dishwasher\n- Central AC\n- Hardwood and tile floorings\n- Roof top\n- $25 monthly small pet’s fee\n- Newly Renovated\n- Fast efficient maintenance\n- 5min walk to the 3-transit bus going routes (57,89,39)\n- 10 min ride to Temple University\nFor any further questions or concerns feel free to message me","num_images":5.0,"lat":39.9925,"lng":-75.1415,"attrs":"['3BR \/ 3Ba', '1200ft2', 'available now', '\\nsunday 2023-03-26\\n', '\\nmonday 2023-03-27\\n', '\\ntuesday 2023-03-28\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T14:12:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7603222999.html","post_id":7603222999,"title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"When you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nApartment Features\n* Garden Tub\n* Kitchen Island\n* Private Patio or Private Balcony (on select apartments)\n* Walk-in Closet\n* Washer and Dryer in unit\n* Linen Closet\n* Stainless Steel Appliances","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-25T14:20:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-solo-on-chestnut\/7603192528.html","post_id":7603192528,"title":"Solo on Chestnut","description":"SOLO on Chestnut is currently offering ONE MONTH FREE on all 12 month leases! We are a luxury apartment building located on Chestnut Street in Philadelphia's hottest neighborhood, University City. Our University City apartments near UPenn make the commute to and from university a breeze while our central location is perfect for young professionals who are working in the city. Whether you are looking to stay with us in one of our short term rentals or for an extended period of time, our new management team is ready and waiting to make living with us as easy and stress free as possible.\n$1550 FOR RENT FEE $450 FOR SECURITY DEPOSIT PAYMENT, TOTAL AMOUNT $2000\nkindly text Mr Tyrone on  show contact info\nHe will be the one to forward you the Application processing Asap.\n","num_images":14.0,"lat":39.9597,"lng":-75.2024,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:15:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-duplex-bedroom-bath\/7603204969.html","post_id":7603204969,"title":"Duplex 1 bedroom, 1 bath apartment in Philadelphia","description":"Duplex 1 bedroom, 1 bath apartment in Philadelphia. Freshly Painted Updated Kitchen Updated Full Bathroom New Front loader Washer and Dryer Stainless Appliances All Utilities Included. BRING YOUR CLOTHES AND TOILETRIES ONLY BECAUSE THIS FULLY FURNISHED, SPACIOUS ONE BEDROOM LOFT-LIKE APARTMENT IS THE ULTIMATE PIED A TERRE IN THE HEART OF BEVERLY GROVE. SITUATED BEHIND A GATED DRIVEWAY IN A VERY PRIVATE SETTING, THIS UPPER UNIT OFFERS A A LARGE, OPEN LIVING ROOM WITH DINING AREA, DESK AREA, AND A BEAUTIFULLY DESIGNED KITCHEN WITH STAINLESS STEEL APPLIANCES, complete credit\/background check application fee $1. If you interested Please text me::: lucy58756@𝐆𝐦𝐚𝐢𝐥com","num_images":4.0,"lat":40.0343,"lng":-75.1213,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T13:42:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-with-bathroom\/7603210786.html","post_id":7603210786,"title":"*** 1 Bedroom with 1 Bathroom***","description":"Completely New Construction\nNew Floors\nNew Kitchen\nNew Bathroom\nNew Appliances\nElevator in Building\nLaundry in Building\nClose to Schools, Hospital & Transportation\nNo Pets Allowed\nLOCATION: 5101 N. 12TH STREET 19141","num_images":6.0,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:54:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment\/7603209804.html","post_id":7603209804,"title":"1 Bedroom Apartment","description":"Completely New Construction\nNew Floors\nNew Kitchen\nNew Bathroom\nNew Appliances\nElevator in Building\nLaundry in Building\nClose to Schools, Hospital & Transportation\nNo Pets Allowed\nLOCATION: 5101 N. 12TH STREET 19141","num_images":5.0,"lat":40.0365,"lng":-75.1451,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:52:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-reduced-special-free\/7603205887.html","post_id":7603205887,"title":"REDUCED SPECIAL!! Free Parking\/ Close To Laundry Room\/ Pet Friendly","description":"RENT PERIOD: YEARLY\nAsk about apartment home 165 on the first floor, available now!! This unit has a reduced special!! The market rent is $1,420 but has been reduced to $1,320 for a year.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday 9:00 am-6:00 pm and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":8.0,"lat":40.053166,"lng":-75.236179,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:44:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-solo-on-chestnut-3bed\/7603192801.html","post_id":7603192801,"title":"Solo on Chestnut 3bed 2bath available for rent","description":"SOLO on Chestnut is currently offering ONE MONTH FREE on all 12 month leases! We are a luxury apartment building located on Chestnut Street in Philadelphia's hottest neighborhood, University City. Our University City apartments near UPenn make the commute to and from university a breeze while our central location is perfect for young professionals who are working in the city. Whether you are looking to stay with us in one of our short term rentals or for an extended period of time, our new management team is ready and waiting to make living with us as easy and stress free as possible.\n$1550 FOR RENT FEE $450 FOR SECURITY DEPOSIT PAYMENT, TOTAL AMOUNT $2000\nkindly text Mr Tyrone on  show contact info\nHe will be the one to forward you the Application processing Asap.\n","num_images":14.0,"lat":39.9597,"lng":-75.2024,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:16:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bathroom\/7603208650.html","post_id":7603208650,"title":"***3 Bedroom & 1 Bathroom***","description":"3 Bedroom House\nClose to transportation\nClose to park\nClose to Hospital\nvery beautiful Kitchen\nvery big and spacious Living Room\nupdated layout\n","num_images":4.0,"lat":39.9954,"lng":-75.1698,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:50:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-house\/7603207834.html","post_id":7603207834,"title":"3 Bedroom House","description":"3 Bedroom House\nClose to transportation\nClose to park\nClose to Hospital\nvery beautiful Kitchen\nvery big and spacious Living Room\nupdated layout\n","num_images":4.0,"lat":39.9954,"lng":-75.1698,"attrs":"['3BR \/ 1Ba', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:48:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-and-bathroom\/7603206762.html","post_id":7603206762,"title":"***2 Bedroom and 1 Bathroom***","description":"RENOVATED\nNEW KITCHEN\nNEW BATHROOM\nWOOD FLOOR\nLOCATION : 4840 N CAMAC ST Philadelphia PA 19141 ( LOGAN )\n$900 +50 for water\n","num_images":6.0,"lat":40.0365,"lng":-75.1451,"attrs":"['2BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:46:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apt\/7603205759.html","post_id":7603205759,"title":"2 BEDROOM APT","description":"RENOVATED\nNEW KITCHEN\nNEW BATHROOM\nWOOD FLOOR\nLOCATION : 4840 N CAMAC ST Philadelphia PA 19141 ( LOGAN )\n$900 +50 for water\n","num_images":6.0,"lat":40.0365,"lng":-75.1451,"attrs":"['2BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:44:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-amazing-home\/7603200807.html","post_id":7603200807,"title":"Amazing home","description":"Come check out this new rancher available for rent in Coatesville! This home has recently been through a full renovation and is ready for its new tenants. The new renovations to the home include new LVP flooring throughout, granite countertops, stainless steel appliances, a tiled backsplash, and last but not least the fully tiled bathroom. Upgrades have also been made to improve the energy efficiency by adding new windows to the home. With 3 bedrooms and a full bathroom, this home is able to accommodate most needs and then some. Sitting on an oversized corner lot there is plenty of space for outdoor activities, as well as having off street parking and a completely level back yard. Pets and section 8 will be considered on a case by case basis.","num_images":10.0,"lat":39.9843,"lng":-75.8253,"attrs":"['3BR \/ 1Ba', 'available apr 12', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:32:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-1-bathroom\/7603204862.html","post_id":7603204862,"title":"*** 2 BEDROOM W\/ 1 BATHROOM ***","description":"VERY SPACIOUS 2 BEDROOM APARTMENT\nBRAND NEW KITCHEN\nNEW BATHROOM\nCLOSE TO SCHOOL\nCLOSE TO TRANSPORTATION\nLOCATION: 4243 SALEM ST 1ST FL 19124 ( NORTHEAST)\n","num_images":4.0,"lat":40.0178,"lng":-75.0895,"attrs":"['2BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:42:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-d-free-parking-gym-pool\/7603204255.html","post_id":7603204255,"title":"W\/D, Free Parking, Gym, Pool, Pet Friendly, Balcony, Elevator Bldg","description":"Apartment 927 is a 2 Bedroom with a stainless steel appliances, quartz countertops, washer\/dryer and a balcony! Make this your new apartment home today!\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes! Staying at home during all of this? No worries! Just ask your leasing agent about a personalized virtual tour instead to view all the great things we have to offer!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nElevator Building\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Gian, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-6pm | S, 10am-4pm\n","num_images":16.0,"lat":39.966575,"lng":-75.604026,"attrs":"['2BR \/ 2Ba', '935ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:40:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apt-1st-fl\/7603203912.html","post_id":7603203912,"title":"2 BEDROOM APT 1ST FL","description":"VERY SPACIOUS 2 BEDROOM APARTMENT\nBRAND NEW KITCHEN\nNEW BATHROOM\nCLOSE TO SCHOOL\nCLOSE TO TRANSPORTATION\nLOCATION: 4243 SALEM ST 1ST FL 19124 ( NORTHEAST)\n","num_images":4.0,"lat":40.0178,"lng":-75.0895,"attrs":"['2BR \/ 1Ba', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:39:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-bathroom-is\/7603181578.html","post_id":7603181578,"title":"Large 2 bedroom, 1 bathroom is located in the heart of Francisville!","description":"This large 2 bedroom, 1 bathroom is located in the heart of Francisville and is ready for tenants! Unit 3 is drenched in natural light and showcases stunning hardwood floors that have been stained onsite and a spacious kitchen with gorgeous countertops, sleek white cabinets with stainless steel appliances. The unit also features a modern bathroom with a double sink vanity, designated laundry closet with a washer and dryer and lots of closet space. A monthly water fee of $75 includes all cold water usage. Living at Uber Commons I, you are blocks from the delicious restaurants on Fairmount Ave, short bus ride to Center City, and minutes from the Schuylkill River Trail. Just a short walk to Aldi, Bold Coffee Bar, Tela's Market and Kitchen, Francisville Playground, and easy access to public transportation. Photos of a similar property by the same builder.\n814 N Uber St #3","num_images":12.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 3.5Ba', '1490ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:54:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/prospect-park-first-floor-bedroom\/7603200629.html","post_id":7603200629,"title":"First floor, 3 bedroom","description":"Three bedroom, first floor.  Freshly painted, new carpeting, new appliances, new countertop. Extra room off of living room can be used as office\/den.   Enjoy Central Air, Gas heat, gas cooking.  Outside deck off of living room. Laundry hookup in apartment. Near train station, I-95, Airport.  Close to shopping.","num_images":5.0,"lat":39.884507,"lng":-75.309129,"attrs":"['3BR \/ 1Ba', '950ft2', '\\nsaturday 2023-03-25\\n', '\\nsunday 2023-03-26\\n', '\\ntuesday 2023-03-28\\n', 'air conditioning', 'apartment', 'w\/d hookups', 'no smoking', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-25T13:32:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-in-one-of-the-most\/7603175809.html","post_id":7603175809,"title":"Located in one of the most beautiful neighborhoods in Philadelphia!","description":"Text Samantha:  show contact info\n##_Gorgeous 1 Bedroom 1 Bathroom Apartment in Philadelphia. Washington Square West, The Lincoln Building (1222 Locust Street) boasts a blend of upscale living with modern finishes. The Lincoln Building shares the vision of the city that gives it life! A historical renovation immersed amongst the charm of one of the country's oldest cities, coupled with innovative development seen around the world-- all at your doorstep! Chic and modern finishes mesh with the original character of the building to provide the perfect combination of sophistication and comfort. Twelve22 Locust offers the convenience of living in one of Philadelphia's trendiest neighborhoods- from world class dining to shopping, it has it all! Hardwood floors, City views, W\/D in unit, dishwasher, stainless steel appliances and communal roof deck. The Lincoln has an amazing location in easy walking distance of multiple modes of public transportation and tons of shops and restaurants.\n","num_images":4.0,"lat":40.0018,"lng":-75.1179,"attrs":"['1BR \/ 1Ba', '688ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:41:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-bathroom-is\/7603172911.html","post_id":7603172911,"title":"Large 2 bedroom, 1 bathroom is located in the heart of Francisville!","description":"This large 2 bedroom, 1 bathroom is located in the heart of Francisville and is ready for tenants! Unit 3 is drenched in natural light and showcases stunning hardwood floors that have been stained onsite and a spacious kitchen with gorgeous countertops, sleek white cabinets with stainless steel appliances. The unit also features a modern bathroom with a double sink vanity, designated laundry closet with a washer and dryer and lots of closet space. A monthly water fee of $75 includes all cold water usage. Living at Uber Commons I, you are blocks from the delicious restaurants on Fairmount Ave, short bus ride to Center City, and minutes from the Schuylkill River Trail. Just a short walk to Aldi, Bold Coffee Bar, Tela's Market and Kitchen, Francisville Playground, and easy access to public transportation. Photos of a similar property by the same builder.\n814 N Uber St #3","num_images":10.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', '934ft2', 'available apr 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:35:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxurious-studios-dwell\/7603186087.html","post_id":7603186087,"title":"Luxurious Studios! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', '\\nsaturday 2023-03-25\\n', '\\nsunday 2023-03-26\\n', '\\nmonday 2023-03-27\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T13:03:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/media-2br-bath-apt-unit-great-location\/7603157465.html","post_id":7603157465,"title":"2BR & 1 Bath Apt Unit, Great Location & Area","description":"MEDIA - 2 BED\/1 BATH - Walking distance to downtown Media, Great location. Move in Ready Now. Available 4\/1\nCall Chris @  show contact info\nfor showing\nNewly remodeled in Media with hardwood floors and updated kitchen. Walking distance to trains to downtown Philadelphia, shopping, etc.\nAvailable Immediately!\n*RENTAL REQUIREMENTS*\n- MONTHLY NET INCOME: $3,900\nRates:\n$1499 per month. Tenant responsible for all utilities.\nExperience Everyone's Hometown of Media, PA: A charming walk able town with shops, diverse restaurants and nearby parks. Whether business in the County seat brings you to Media or visiting the Philadelphia area for pleasure, experience small town living with convenient public transportation to Philadelphia.\nHighlights of the Property Include:\n1. Washer and dryer available\n2. Tenant is responsible for all utilities.\n3. Walking distance to Media SEPTA Train Station that will take you all the way to downtown Philadelphia, Penn University, Temple University, University City.\n4. Near Penn State University Brandy Wine\n5. Walking distances to Delaware County Courthouse\n6. Walking distance to the restaurant and local shop, etc\n7. Near Movie Theater\n8. Near Riddle Hospital\/Media\n9. Walking to distance to downtown Media and close to the post office, bank, Wawa store.\nOff street parking! Walk to train station or walk into town and enjoy the many fine restaurants.\nNorth on Route One, turn right at Hill's Seafood, go to stop sign. Property located across from stop sign.\nNo Smoking or Indoor Candles!\nCall Chris @  show contact info\nfor showing\n2 bed\/1 bath. $1350 rent, 2+ Year lease preferred, longer term tenant\nAmenities:\n- Unfurnished\n- Smoke Free\nAppliances:\n- Air Conditioning\n- Microwave\n- Range\n- Refrigerator\n- Oven\n- Washer & Dryer - Basement\nLeaseLengths:\n- 12 Months lease - Prefer long term tenant\n- 24 Months lease - Prefer long term tenant\nUtilities:\n- Resident Pays Electricity\n- Resident Pays Gas\n- Resident Pays Heat\n- Resident Pays Water\n- Resident Pays Trash Pick-up\n- High-Speed Internet Available\nContact at  show contact info\nfor more information.","num_images":12.0,"lat":39.915968,"lng":-75.394898,"attrs":"['2BR \/ 1Ba', '900ft2', 'available apr 7', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:04:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-make-sure-to-request-video\/7603173990.html","post_id":7603173990,"title":"Make sure to request VIDEO TOUR OF THE UNIT and FLOOR PLAN!","description":"All UTILITIES INCLUDED!! Make sure to request VIDEO TOUR OF THE UNIT and FLOOR PLAN! AMAZING Two Bedroom BI-LEVEL Apartment in the highly coveted Rittenhouse Square neighborhood! Unit is located in a fantastic, safe, and large apartment building. Great kitchen, hardwood floors throughout, and super high ceilings are just some of the highlights. Unit is very spacious with large living areas, convenient half bath on the 1st floor, and perfect-sized bedrooms. The full bathroom comes complete with a perfect tub\/shower combo!! Steps from shopping, dining, Center City, and public transportation. Excellent condition!! A perfect-sized space! Make this place your own -- Available April 1st! Again don't wait long, it will not last at this price! First month and one-month security deposit due prior to move-in. If the applicant's credit score is above 750 then your security deposit will only be $500. $45 application fee per applicant.\n1720-22 Lombard St #107","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1.5Ba', '800ft2', 'available apr 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T12:37:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wonderful-bedroom-bathroom\/7603166574.html","post_id":7603166574,"title":"Wonderful 3 bedroom \/ 2 bathroom single family home!","description":"Available NOW: Welcome to 244 S Warnock St! This is a wonderful 3 bedroom \/ 2 bathroom single family home in the heart of walkable Washington Square West. Enjoy the convenience of in-unit laundry and central air for year-round comfort. Your living room welcomes you home with a sun-soaked atmosphere and a decorative fireplace with mantle and built-in shelving. Continue back to your gorgeous kitchen boasting tile flooring, wood cabinetry above and below, granite countertops, and stainless steel appliances including a dishwasher, microwave, gas oven \/ stove, and refrigerator. Head upstairs to the 2nd Floor to view 2 bedrooms and 1 full bathroom, and then to the primary suite on the 3rd Floor. This large primary bedroom offers abundant sunlight, good closet space, and an attached full bathroom for a luxurious lifestyle. There's a sizable brick patio for entertaining guests in the warmer months - schedule a tour today! About The Neighborhood: Washington Square West is a walkable neighborhood surrounded by convenient shopping, public transportation, and nightlife options. You'll be just a few blocks from City Hall, iconic South Street, Pennsylvania Hospital, Washington Square, Independence Hall, and the Walnut Street Theater. Close proximity to PATCO, Jefferson Station, the Broad Street Line, the Market-Frankford El Line, and ample bus routes. There are tons of local eatery and hotspots within small radius of this great home including Middle Child, Greenstreete Coffee, Little Nonna's, Strangelove's, Monster Vegan, Mixto, Dirty Frank's, Green Egg's Cafe, Yellowtail, and countless more! Lease Terms: Generally, first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord. $55 application fee per applicant. Strictly, no pets. Tenants responsible for: electricity, gas, cable\/internet, and water. Landlord Requirements: Applicants to make 3x the monthly rent in verifiable net income, credit history to be considered (i.e. no active collections), no evictions within the past 4 years, and must have a verifiable rental history with on-time rental payments. Exceptions to this criteria may exist under the law and will be considered.\n244 S Warnock St","num_images":7.0,"lat":39.9487,"lng":-75.1593,"attrs":"['3BR \/ 2Ba', '1120ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:22:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-innovator\/7603181828.html","post_id":7603181828,"title":"Welcome to Innovator Village, nestled in the heart of Graduate Hospita","description":"Welcome to Innovator Village, nestled in the heart of Graduate Hospital! This gated community is home to 82 brand new construction, luxury units featuring top of the line finishes. 2445 Innovator Way offers everything you could desire in a city apartment and can be moved into immediately. This 775 SF unit features a spacious, open living room with huge windows and lovely natural light, a kitchen with quartz countertops and stainless steel appliances, a beautiful bathroom, hardwood floors and an in unit washer\/dryer. The building features a shared roof deck with beautiful views of Center City. Innovator Village is located on the bustling Washington Ave corridor with easy access to Drexel University, CHOP, Penn University, I76, restaurants, shops, public transportation and much more! On site parking is available for lease for $300\/month.\n2445 Innovator Way #4A","num_images":8.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '775ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:54:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-rare-chance-to-move-into\/7603181399.html","post_id":7603181399,"title":"Rare chance to move into prime location in the heart of Fishtown!","description":"Rare chance to move into prime location in the heart of Fishtown! A large 4 bedroom house with extra large backyard for gatherings and to let your dog run free. Open style kitchen with Samsung appliances including dishwasher. Upstairs the second floor reveals two light filled Bedrooms with a walk-through closet into a modern tiled hall Bath with a tub and shower combo, Samsung laundry room. The master floor features a gorgeous Master suite with large windows, multiple large closets. Master bath showcases white marble counters complete with double his and her's vanities and a large walk-in shower with a frameless glass enclosure. Before you head to the rooftop grab a drink from the full wet bar and go soak up some sun. Walkable to all area restaurants, parks, and entertainment including the Fillmore, Live Casino and much more. Schedule your showing today.\n727 E Thompson St","num_images":11.0,"lat":39.9788,"lng":-75.1262,"attrs":"['4BR \/ 2.5Ba', '2048ft2', 'available apr 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:53:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7603181198.html","post_id":7603181198,"title":"Quiet Community, Luxurious Bathrooms, BBQ Grills","description":"Find yourself right at home in a warm and welcoming community offering spacious one, two and three-bedroom apartments in West Chester. Lease today at The Point at West Chester.\nThis two story two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, ensuite bathrooms, two patio\/balconies, and a loft with a closet upstairs!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1207ft2', 'available apr 1', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:53:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-adorable-premium-tiny-home\/7603166209.html","post_id":7603166209,"title":"ADORABLE PREMIUM TINY HOME ON A CUTE HISTORIC STREET!","description":"Location! Location! Location! ADORABLE PREMIUM TINY HOME ON A CUTE HISTORIC STREET. If you are looking for a cute small home to rent, this is IT! Move-in on April 1st too! Located immediately in between Ben Franklin Parkway and Spring Garden Street. Logan Square-Art Museum Neighborhood. 2 blocks to Gorgeous Logan Square Fountain & Park & the Parkway. Located behind the You are surrounded by MANICURED blocks everywhere, including Carlton Street itself. Walk to Whole Foods, Starbucks, The NEW Giant, Museums, Schuylkill River & Trail, Restaurants, Gyms, and more. This home is a Renovated Combination of Contemporary-Modern & Story Book Styles. Situated in the center of One Of Philadelphia's Prettiest & Picturesque Historic Cute One-Block Long Cobblestone Streets w\/Marble Curbs. The inside contains all of the Modern Amenities that you need and the exterior has it's Historic Charm w\/Marble Steps, Window Boxes, Shutters, and Ornate Cornice along the rooftop. The Entire Street is filled with similar pretty homes. There is Plenty of room for entertaining, especially with the Private Rear Yard-completed with pretty pavers, outdoor fireplace, stainless steel grill, electric, gas, and water service. Throughout this home you will find beautiful REAL hardwood floors, crown molding & baseboards, recessed lights, custom lighting, ceiling fans, and windows in every room-including the bathrooms. NEST Thermostat & New central air & heat. Beautiful new Stone & Gas Fireplace w\/Samsung Flatscreen TV included! Amazing Chef's Kitchen with Custom Solid Wood \"Slow-Close\" Cabinets & Drawers, Samsung French Door Refrigerator-Freezer, Samsung 5-Burner Stove, Samsung Built-In Microwave, and Bosch Dishwasher. GORGEOUS QUARTZ COUNTERS, Custom Backsplash, Under Counter Lighting, Farmhouse Sink. Straight well-lit Staircases on every floor, including to the Basement. FOUR Bedrooms and TWO Full Baths located upstairs. LARGE Granite & Marble Custom Bathrooms with custom tile details. Pamper Yourself Every Day in the Spa-Like Master Bath with Jacuzzi Soaking Tub. The Basement includes ceramic tile floors, laundry area, new LG washer & dryer, and mechanicals. ***Some furniture available to include in the lease*** Walk just a couple of blocks to the Brand New Mega Giant Supermarket at 23rd & Arch(65,000 Square Feet with cafes, indoor & outdoor dining, wine & beer, and more to do.) Rodin Place (with Target, Starbucks, PSC, Hand & Stone, Tesla Supercharger Stations, MANNA, Dry Cleaner, Day Care, Offices, & more), Rodin Museum, Barnes Foundation-Museum, Trader Joe's, Whole Foods, CVS & Rite Aid, Logan Square Park & Gardens & Fountain, The New Comcast Tower & Center, Many Restaurants and Cafes, Franklin Institute, Academy of Natural Sciences, Moor College Of Art, The Philadelphia Museum Of Art, Philadelphia Central Library, Love Park, Benjamin Franklin Parkway, Rittenhouse Square & Fitler Square, Suburban Station & 30th Street Station, and an easy walk to They Schuylkill River & Schuylkill River Walking-Biking Trail & Parks Areas & Gardens. Easy access to 676 for all major highways. Parking easily available within blocks. INDEGO Bike-Share is just 2 blocks away. Walk easily to anywhere in Center City from this Central Location. Come see this Fabulous Home ASAP-it will rent quickly!!!\n1833 Carlton St","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['4BR \/ 2Ba', '1176ft2', 'available now', 'furnished', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:21:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom\/7603178409.html","post_id":7603178409,"title":"Beautiful 2-bedroom apartment with an amazing private roof deck!","description":"Beautiful 2-bedroom apartment with an amazing private roof deck! The spacious living room opens into the new kitchen, with white shaker cabinets, stone countertops, and stainless steel appliances. Off the living room is a stacked washer-dryer and 3-piece bath. Both bedrooms are large enough for queen beds and have great closet space. The smart layout--with bedrooms on either end of the apartment--gives everyone their privacy and is perfect for roommates. Primely located in the booming Graduate Hospital neighborhood, this unit is just steps to plenty eateries and nightlife with every public transit option allowing quick access to Rittenhouse Square, Fairmount, Old City, and South Philly. But, the real selling point for this apartment is the private roof deck with stunning views of the skyline! Tenant responsible for first month’s rent and security deposit.\n760 S 15th St #3","num_images":9.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '760ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:47:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wow-nearly-new-sensational\/7603148420.html","post_id":7603148420,"title":"WOW! Nearly new sensational 2 bedroom, 2 bath Home","description":"Modern Spaces. Elevated Amenities\nWOW! Nearly new sensational 2 bedroom, 2 bath beauty with sunroom, patio and backs to trees! Tsteel appliances, cook top with ventilation to the outside, wall oven and built-in microwave, refrigerator is also included. Bathrooms have quartz counter tops, ceramic tile tub & shower surrounds, owner's bath includes inside bench in shower and ceramic tile floors in both bathrooms*Three skylights*bedrooms- on first floor* Primary bedroom suites- one on first floor and second one privately located on second floor* Tub and separate shower in downstairs primary bath*Hardwood floors and carpeting in bedrooms*Freshly painted interior*Washer, dryer, refrigerator included.\n***Amenities: -Large, spacious mirrored closets -Gas stoves -Dual pane windows throughout -Lush Landscaping -Dishwashers -Modern cabinets and countertops throughout -Ceiling fans -Two sparkling heated pools and spa -Balcony and patios in select apartments -Updated appliances -Fitness center. f you interested room please reply with your phone number🌺💞🌺\n","num_images":4.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-03-25T11:44:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-designed-with-modern\/7603167639.html","post_id":7603167639,"title":"Designed with modern amenities and warm finishes!","description":"No expense spared in this luxurious, light-filled apartment. Designed with modern amenities and warm finishes, you'll look forward to arriving home to this architectural gem. The kitchen features the latest stainless-steel appliances, custom backsplash and space-saving design. Each apartment features an in-unit laundry center and access to an elevator, bicycle racks and extra storage in the basement. With an awareness of the vibrant, surrounding neighborhood, the builder took great care to provide high quality sound reducing windows and walls to provide a relaxing home environment. About Fishtown and Northern Liberties: Located in the heart of Fishtown, just a half block off of Girard Ave and two blocks from Frankford Ave. 1229 Front is walking distance to the best dining and entertainment around: The Fillmore, Fette Sau, Frankford Hall, Johnny Brenda's, Mulherin's, Sugarhouse, the Piazza at Schmidt's and much, much more. Steps to public transit options - the Market-Frankford line, the Girard trolley and SEPTA buses as well as quick access to I-95 and Columbus Ave.\n1229 N Front St #3C","num_images":7.0,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 2Ba', '740ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-03-25T12:24:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/leasing-now-green-roof-quartz\/7603174722.html","post_id":7603174722,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-high-speed-internet-access\/7603172101.html","post_id":7603172101,"title":"High Speed Internet Access, Extra Storage, Cable Ready","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:PlaygroundCable ReadyIndividual Intrusion AlarmsHigh Speed Internet AccessAir ConditioningNewly Renovated InteriorsGaragesOnline Payments AvailableDishwasherDog ParkResort-Style Swimming PoolFull Size Washer and Dryer in All UnitsCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/dwgxd5i3\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['1BR \/ 1Ba', '835ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:33:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-25-bath\/7603155989.html","post_id":7603155989,"title":"Beautiful 3 bedroom, 2.5 bath new construction in 2018!","description":"Coming in April, 2nd Unit Condo in Francisville. Beautiful 3 bedroom, 2.5 bath new construction in 2018 condo located in growing Francisville. The light-filled corner unit features high-end finishes throughout. High-end finishes throughout, this upper unit opens into a welcoming living room with half bath. The main living level has a gourmet kitchen with stainless steel appliances, an island great for gathering and an area for dining and relaxing. The first bedroom features a closet with built-ins and full bathroom accessible in hallway. The upper floor features two large bedrooms, a bathroom with glass shower and a laundry room. Laundry room convenient to bedrooms features washer and dryer. This gorgeous home enjoys a large, private roof deck with skyline views. Scores in the 80's for walking, biking and easy access to various modes of transportation. Within 15 minutes to Philadelphia International Airport. Across the street from a café and withing walking distances from other restaurants, museums, other points of interest. Utilities: Gas and Electric, are tenant responsibility. Water will be kept in owners name and invoiced to tenant. Renter's insurance required. Central Air and Washer & Dryer in unit. On-Street Parking. No smoking. No Pets.\n836 N 16th St #2\n","num_images":7.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2.5Ba', '2000ft2', 'available apr 8', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:01:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-designed\/7603170877.html","post_id":7603170877,"title":"Beautifully designed building!","description":"Available for early to mid April move in: History meets impeccable new construction in this beautifully designed building. Enter through the former Bell Telephone Exchange building, now with a fantastic new addition of new construction condominiums and known as The Exchange. The building combines industrial details with well thought out living spaces. This condominium is a spacious one bedroom, one bath, with its own in unit washer & dryer in HUGE walk in master closet. Modern kitchen with all stainless steel appliances including dishwasher, granite countertops. Light bamboo flooring throughout entire space, including the bedroom. AMAZING closet space. Great natural light from both northern and southern exposures. Common roof deck with outdoor furniture offers incredible skyline views! Great Francisville location offers walking distance access to public transit, with the Girard Broad Street line stop just a short 2 blocks away. Walk to all that the Fairmount and Art Museum Areas have to offer - wonderful shops and cafes, museums, and more. Pet friendly with deposit or fee based on type\/weight, no breed or weight restrictions. Photos are of nearly identical unit in the building. Unit located on the 1st floor.\n1637 Poplar St #1R","num_images":8.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '693ft2', 'available apr 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:31:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-this-beautiful\/7603169834.html","post_id":7603169834,"title":"Welcome to this beautiful 3 bed\/ 2 bathroom home!","description":"*PHOTOS ARE OF AN IDENTICAL PROJECT BY THE OWNER\/licensed realtor. Listing agent is related to the owner. Delivery date mid April\/1st week of May* Welcome to this beautiful 3 bed\/ 2 bathroom home in the heart of Fishtown! Unique opportunity to live in a high end residence with top of the line finishes. This full gut 3 story rehab property features white oak floors, stainless steel appliances and brand new calcutta countertops. On the 2nd floor, there are 2 spacious bedrooms that are connected to a bathroom, which features a full floor to ceiling tile bathroom. The 3rd floor master suite features a large walk in closet & another full floor to ceiling tile marble bathroom with a \"floating toilet\". On the first floor, there is a large concrete filled outdoor space large enough for gatherings & outdoor furniture. The unfinished basement is perfect for storage, washer\/dryer will be located outside of the 3rd story master suite.\n1328 E Eyre St","num_images":7.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2Ba', '1530ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:29:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enjoy-the-entertaining\/7603168634.html","post_id":7603168634,"title":"Enjoy the entertaining, open floor plan and high ceilings!","description":"Here's your opportunity to live in one of the most spacious and desired one bedroom floor plans at The Phoenix Condominiums in Center City, Philadelphia. This unit features large windows, beautiful floors, large kitchen with separate dining room, in-unit washer & dryer and ample closet space. Enjoy the entertaining, open floor plan and high ceilings. 5 X 4 Storage locker included in the price. This grand, historic and amenity filled building is centrally located and just steps away from everything Center City, Philadelphia has to offer. Amenities include a beautiful fitness center, media room, gorgeous roof top terrace with views of the city, direct access to Suburban Station, Starbucks and a full service restaurant. Valet Parking is available for an additional fee. Don't miss this wonderful opportunity.\n1600-18 Arch St #1702","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '961ft2', 'available apr 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:26:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7603162706.html","post_id":7603162706,"title":"Private Balcony, Quiet Community, Move In Now","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1232ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-03-25T12:14:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ardmore-amazing-1100-square-foot\/7603160589.html","post_id":7603160589,"title":"Amazing 1100 square foot 4 bedroom apartment","description":"An amazing deal for this wonderful neighborhood!\nThis is a 4 bedroom, 1 bath apartment located in walking distance to the shops and great restaurants of Ardmore\/ Suburban Square. Convenient to Trader Joes, Whole Foods, Old Navy as well as many hiking trails, Haverford Reserve hiking and Dog park.\nThis is a peaceful street with respectful neighbors and a great land lord.\nThis apartment features hardwood floors through out, a balcony that you can use, washer\/ dryer combo in unit, a nice long galley style kitchen, new appliances, fixtures and plenty of storage. Bathroom has a shower tub combo.\nBackground check will be done by the landlord. We require you to get your own free credit report as well as at least two recent pay stubs\/ proof of income and fill out application.\nPlease contact me to come and check it out!\n*Pets will be considered on individual basis.\n*Tenants responsible for utilities.\n*On street permit parking.\n","num_images":13.0,"lat":40.009998,"lng":-75.295832,"attrs":"['4BR \/ 1Ba', '1100ft2', 'available apr 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-03-25T12:10:39-0400"}]