[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561102968.html","post_id":7561102968,"result_date":"Fri Nov 25 2022 02:08:48 GMT+0000 ","title":"Marble Countertops, Modern Amenities, Quiet Community","description":"The Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, breakfast bar, mudroom with a washer\/dryer, walk-in closets, and a master suite with a balcony!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1110ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T21:04:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561102927.html","post_id":7561102927,"result_date":"Fri Nov 25 2022 02:08:33 GMT+0000 ","title":"Fitness Center, Lease Today, Contact us Today","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nCommunity Features\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* Spa\n* Professionally Managed\n* Outdoor Grill Area\n* Fitness Studio\n* Easy Freeway Access\n* Yoga Lounge\n* TV Lounge\n* Bark Park\n* Billiards\n* Sun Deck\n* Community Lounge\n* Swimming Pool\n[#9494156]","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1296ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T21:04:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561075973.html","post_id":7561075973,"result_date":"Fri Nov 25 2022 00:52:17 GMT+0000 ","title":"Locust St, Norristown, P~A>> HUGE - 3BR\/2.5BA open concept home","description":"Cozy 3BR\/2.5BA open concept home w\/ deed-protected long range views in Norristown neighborhood & on a great street for walking\/biking around a low-density circle street of subdivision. great room offers stone fireplace equipped w\/ gas logs. Open great room, kitchen & dining room - all w\/ cathedral ceilings & major views. Well equipped kitchen features granite and pass through to dining room - both with wood floors. Firewood can be supplied to great room wood box via opening in garage OR put groceries in the opening & pick 'em up for easy garage to kitchen transport! Expansive Dining room accesses back deck: perfect for grilling & entertaining. HUGE master BR boasts equally HUGE unsuited w\/ soaking tub, separate shower, double vanities, bidet & deck access. 3 generous, additional rooms all w\/ nice windows & closets can be used for bedrooms, study, bonus - whatever needed. 2nd full BA close to 2 BRs & a half bath in place for guests. True oversized 2-car garage. Give us your number so we could call you for additional information.","num_images":5.0,"lat":40.1245,"lng":-75.3304,"attrs":"['3BR \/ 2.5Ba', 'air conditioning', 'application fee details: Credit Report Fee $35 - Non Refundable', 'broker fee details: BROKER FEE!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', \"listed by: Pre-War Realty ONe MONTH's RENT!\", 'no smoking', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T18:11:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561077814.html","post_id":7561077814,"result_date":"Fri Nov 25 2022 00:08:11 GMT+0000 ","title":"Smart 2BD Condo !! ++near 2 hospitals.","description":"Spacious smart style 2BR 2BA with Garage. Condo Available Now!! This sunny move-in condition co-op features a kitchen, 1 full bathroom and total of 800 sqft of living space. THE KITCHEN COMES EQUIPPED WITH STAINLESS STEEL APPLIANCES (FRIDGE & RANGE), MICROWAVE OVEN, & a great spot for a small table & 2 chairs to find comfort as you enjoy a meal. This beautiful co-op also boasts hardwood floors, large windows, & plenty of closet space for your convenience. On the 1st floor of the building, you'll find a laundry room, mailboxes, & a beautiful lobby. This building is secure w\/ a doorman & a buzzer\/intercom to open the front door remotely for your guests. This co-op is situated on the 4th floor of a well-kept co-op building in prime East Flatbush, philadelphia location. You'll be near public transportation (subway & bus), places to shop & run errands, & near 2 hospitals.","num_images":4.0,"lat":39.978,"lng":-75.1459,"attrs":"['2BR \/ 2Ba', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T18:22:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561083199.html","post_id":7561083199,"result_date":"Fri Nov 25 2022 00:06:54 GMT+0000 ","title":"Wonderful 2nd floor 1 bedroom + Full finished basement","description":"Update Duplex 1 bedroom and 1 full bath Apt for rent in Philadelphia!! must qualify on income and good history of past tenancy is must. Rate has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, GREAT CLOSET SPACE, LAUNDRY IN UNIT, ASSIGNED PARKING. CORLISS LANDING IS A SECURE COMPLEX AND IS IDEALLY LOCATED AT THE BASE OF WICKENDEN STREET - STEP OUTSIDE TO THE BEAUTIFUL COURTYARD, PROVIDENCE MARINA, LIVELY RESTAURANTS AND BARS. QUICK WALK TO BROWN, RISD, DOWNTOWN. The is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and If you interested please Text","num_images":3.0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T18:55:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561082397.html","post_id":7561082397,"result_date":"Thu Nov 24 2022 23:54:42 GMT+0000 ","title":"Large 2 Bedroom Home w\/Private Back Yard","description":"Spacious expensive 2 bedroom, 1 bath flat with laundry in the unit. Unit is stunning - lots of natural light, reno'd kitchen with a dishwasher and a large living room. One twin\/full-sized bedroom and three full\/queen rooms. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion.Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh. Heated 2-car garage with workbench. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T18:50:42-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561077776.html","post_id":7561077776,"result_date":"Thu Nov 24 2022 23:53:56 GMT+0000 ","title":"*Pricing is subject to change, \/ Amazing One bed&1BA","description":"Amazing One bed And 1bath apt on rent. 720 sf with $549 mnthly rent. Appliances included.\n*Specials apply to 12-month leases only & if moved in by 11\/30\/22.\n*Pricing is subject to change. Call for availability before submitting an application. Application fees are non-refundable.*\n","num_images":3.0,"lat":39.978,"lng":-75.1459,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T18:21:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561075331.html","post_id":7561075331,"result_date":"Thu Nov 24 2022 23:52:43 GMT+0000 ","title":"December 1st renter> 3bdrm,stainless,granite,laundry,parking","description":"Great 3 bedroom unit in good location near Shop & Save Food Market & Deli, Modern kitchen and bathroom, granite counters, stainless appliances, coin laundry in building, parking for two cars, modern lighting throughout, hardwood floors, new high efficiency heating system, Text (don't Call) for information or for showing appointment. We are looking for a December 1st renter> We would allow a small dog or single cat with a pet deposit.","num_images":3.0,"lat":40.1245,"lng":-75.3304,"attrs":"['3BR \/ 1Ba', '1100ft2', 'air conditioning', 'application fee details: Credit Report Fee $35 - Non Refundable', 'broker fee details: BROKER FEE!!', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', \"listed by: Pre-War Realty ONe MONTH's RENT!\", 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T18:07:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561078017.html","post_id":7561078017,"result_date":"Thu Nov 24 2022 23:27:20 GMT+0000 ","title":"Beautiful RENT-1 Bedroom\/1 bath Apartment for rent","description":"Beautiful RENT-1 Bedroom\/1 bath Apartment for rent, showing without application submitted. You must qualify on income and good history of past tenancy is must. has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, is the perfect blank canvas.If you contact are interested.  show contact info","num_images":3.0,"lat":40.0547,"lng":-75.1866,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T18:23:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561058482.html","post_id":7561058482,"result_date":"Thu Nov 24 2022 23:09:00 GMT+0000 ","title":"Gorgeous spacious 1BR\/1BA on Spruce St. - available December!","description":"An absolute gem - I promise you'll love living here just as I have for years; only listing this place because I'll be moving out of town. Looking for someone interested in taking over my lease from December 2022 - July 2023, with the option of signing a year's lease thereafter.\nA spacious 1 BR\/1BA on a quiet and beautiful street in Center City by Rittenhouse Square, with high ceilings and generous natural light.\n- Quiet neighbors\n- Recently renovated kitchen\n- Tons of storage space throughout the unit\n- Window A\/Cs and central heat (electric + gas combined is typically ~$50 a month, maximum I ever paid was ~$80)\n- Free washers\/dryers in the basement\n- Extremely reliable management company\n- Convenient walkable location to literally everything, with multiple bus stops around the block","num_images":9.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '915ft2', 'available dec 1', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T16:35:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561069681.html","post_id":7561069681,"result_date":"Thu Nov 24 2022 22:40:21 GMT+0000 ","title":"Redwood Gardens 1 Bedroom\/1 bath Apartment for rent**","description":"Redwood Gardens 1 Bedroom\/1 bath Apartment for rent in Philadelphia The kitchen features new appliances, including a gas stove and a stainless steel fridge and wall-mounted microwave.. Within our walls, you will find an experience like no other. You must qualify on income and good history of past tenancy is must. has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, is the perfect blank canvas. 🏠\nIf you are interested in getting it please Text me your number for more info. 🏠\n","num_images":4.0,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T17:36:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561067118.html","post_id":7561067118,"result_date":"Thu Nov 24 2022 22:26:16 GMT+0000 ","title":"Spacious Duplex 2 Beds 2 Bath Located in Philadelphia","description":"This spacious duplex two bedroom\/two bathroom on the second floor has recently refinished the hardwood floors. Features a sun room with big bay windows for lots of natural light in the living room, large dining room, and central air\/heat. Large bedrooms. Kitchen has a walk-in pantry, lots of cabinetry and space for an island or a table. Coin laundry and storage available in the building. Large, wide lot with a beautiful side yard. One garage parking space included in the rent.\nNO SECURITY DEPOSIT\n$800 move in fee only\n$34 application fee\n$900 per month\nPlease contact via at -Princess.eugenie69@gmail_com for more information!","num_images":7.0,"lat":40.013,"lng":-75.132,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T17:22:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561064675.html","post_id":7561064675,"result_date":"Thu Nov 24 2022 22:12:46 GMT+0000 ","title":"JUST WOW~~! Spacious-1 bedroom-Apartment in  Havertown, PA","description":"WOW-spacious-1 bedroom- 1 bathroom Apartment in  Havertown, PA . we have infused a luxury living experience with artistic collaborative spaces. Within our walls, you will find an experience like no other. We have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas<>","num_images":3.0,"lat":39.9774,"lng":-75.3106,"attrs":"['1BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T17:08:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561058177.html","post_id":7561058177,"result_date":"Thu Nov 24 2022 21:37:56 GMT+0000 ","title":"Newly Renovated Somerville 2 Bedroom!- Avail Now","description":"New to market and available immediately! You don't want to miss this freshly updated Winter Hill two bedroom apartment. Large modern kitchen with brand new stainless steel appliances, new cabinetry and a separate pantry. Two spacious bedrooms, one with an attached office. One full bath. Hardwood flooring throughout. Laundry in building. Convenient location with easy access to all. 3D tour available upon request! Off Street Parking Available! Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue house have to offer. If you interested please contact:-  show contact info","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T16:33:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560960264.html","post_id":7560960264,"result_date":"Thu Nov 24 2022 15:17:08 GMT+0000 ","title":"Package Receiving System, Fully Equipped Kitchens, Quartz Countertops","description":"Bedrooms: 0Bathrooms: 1Square Feet: 394Address: 1401 Arch StreetLocated in Philadelphia’s historic Center City neighborhood, One City offers modern elegance with timeless grandeur. With views of Philadelphia's City Hall and just steps away from iconic Philly locations such as the Pennsylvania Convention Center, Reading Terminal Market, and Love Park, One City offers sophisticated luxury in the heart of Philadelphia. One City offers the most discerning residents the ultimate living experience. Inside this historic building, located at 1401 Arch Street, each apartment residence holds unique original features coupled with contemporary sophistication. Thoughtful design details include custom built-in storage, stainless steel appliances, and modern connectivity offering luxury and convenience to a range of lifestyles. Control is always at your fingertips with your app-based smart home features including keyless entry. Amenities Include:Programmable via appPet Friendly                                                                                                                                2 pets max; up to 40 lbs. Some restrictions and fees apply.Fitness\/ Wellness Center                                                                                                                                On screen fitness classes provided in private yoga studioRooftop Grilling StationsBike StorageApp based compatibility with all virtual personal assistant systems; Including thermostats and other electrical components.Window CoveringsPet Spa StationPackage Receiving SystemAdditional Storage AvailableFlexible Lease OptionsLuxury Vinyl Tile flooring throughoutCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/irphml4c\/one-cityPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '394ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T10:13:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560959931.html","post_id":7560959931,"result_date":"Thu Nov 24 2022 15:15:52 GMT+0000 ","title":"Three bedroom home in Southwest Philadelphia","description":"Ready to move? Well your just in time for the holidays. This 3 bedroom home features 3 bedroom, 1 bathroom. New carpets throughout second floor. Send a message to do a intake and schedule a tour.","num_images":0.0,"lat":39.950362,"lng":-75.238448,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:11:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560959175.html","post_id":7560959175,"result_date":"Thu Nov 24 2022 15:13:08 GMT+0000 ","title":"Enjoy the Conveniences of City Living from This Sunny 1-bed 1-bath Unt","description":"Enjoy the conveniences of city living from this sunny one bedroom, one bath unit in Society Hill Towers with all utilities included! Located on the 5th floor of the West Tower, this home features hardwood floors, walls of oversized windows, and beautiful treetop views. The kitchen is opened up to the living and dining area and features a convenient breakfast bar, gas range, dishwasher and full-sized refrigerator. A spacious bedroom features an oversized closet, and additional closets off the entryway and hall provide great storage space. Part of the I.M. Pei-designed Society Hill Towers, this home is in an esteemed condo community featuring a 24 hr front desk, renovated common lobby, laundry facilities, and guest parking lot (w\/hourly metered parking). The gym, seasonal pool, and garage parking are available to residents at an additional monthly cost. Perfectly located in the heart of historic Society Hill, this home is steps away from Zahav, Ritz 5 theater, ACME, Independence Hall, Penn's Landing, Headhouse Square, and convenient to public transportation and major thoroughfares. Monthly rent includes all basic utilities (electric, gas, water, heating and cooling) with internet\/cable at an additional $64.00\/m.\n210 Locust St #5HW","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '683ft2', 'available jan 2, 2023', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:09:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560951182.html","post_id":7560951182,"result_date":"Thu Nov 24 2022 15:09:02 GMT+0000 ","title":"2 Bed 1 Bath Furnitured Apartment in Chinatown!","description":"2 Bed 1 bath FURNITURED apartment in Chinatown. Apartment is featured with hardwood floor, granite counter tops, large L shaped kitchen, central air, and laundry in the building. You will enjoy this ultra convenient center city location. Buses and Trains to NYC or D.C. , and Nave Yard Shuttles are just around the corners. It's 2 blocks to Broad Street Line, and surrounded by fantastic eateries and entertainment venues. Apartment is available. Water is included. Check out the YouTube virtual tour first, and call to schedule a showing!\n1211 Race St #2F","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', '6000ft2', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T09:39:02-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560957912.html","post_id":7560957912,"result_date":"Thu Nov 24 2022 15:08:47 GMT+0000 ","title":"Cute, 3 bedroom with 2 bathroom apartment in Philadelphia","description":"Cute, 3 bedroom with 2 bathroom apartment in Philadelphia. Ready for you to move in Asap !Close to Girard College, Washer & Dryer, Dish Washer, Stainless Steel Appliances, Air Conditioning, Wifi, Cable, Electric, Gas, Water, Landscaping, Admin Fees,  background and credit check is also required $30. Rent: $1100 deposit: $1000, If you interested please contact:- lucyeva777gmailcom\nAddress: West Seybert Street, North Central, Philadelphia\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of Raleigh . Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.\n","num_images":8.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T10:04:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560951862.html","post_id":7560951862,"result_date":"Thu Nov 24 2022 15:06:57 GMT+0000 ","title":"Full Floor 2 Bed 1 Bath Rental Unit in the Heart of Graduate Hospital!","description":"Full Floor 2 bedroom 1 Bath rental unit in the heart of graduate hospital. Spacious living space with two ample bedrooms, complete with laundry in the unit! Oversized living space, open to the kitchen. Available immediately.\n1819 Bainbridge St #3","num_images":5.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T09:41:57-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560956223.html","post_id":7560956223,"result_date":"Thu Nov 24 2022 15:03:31 GMT+0000 ","title":"@@- Lovely-spacious-1 bedroom-  Apartment $756\/ 1br@@!","description":"show contact info\nLovely-spacious-1 bedroom- 1 bathroom Apartment . infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize,Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Delaware is the perfect blank canvas. This boutique vintage building has all of the historic charm of a converted brownstone paired with modern updates throughout making for stylish and comfortable living. Enjoy restored hardwood floors and a kitchen with brand new appliances and a huge in unit laundry closet. Upstairs you will find a large bedroom with lots of windows that can accomodate any size bed and perfect for at home office set up. There is also a brand new renovated bathroom. The spiral staircase provides access to both floors but also exterior access to hallways on both floors for easy move in. PETS WELCOME! Many parking garages close by\nshow contact info","num_images":6.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T09:59:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560956151.html","post_id":7560956151,"result_date":"Thu Nov 24 2022 15:03:16 GMT+0000 ","title":"Available Early January, Move in for the New Year!","description":"Available early January, move in for the New Year! Showcasing waterfront and city views from the exclusive vantage of a spacious unit in the Society Hill Towers (designed by IM Pei), this stunning two bedroom condo was designed to impress. Featuring floor to ceiling windows with custom treatments, vinyl plank wood flooring, an open concept living area, modern fixtures, and coveted building amenities including a 24 hour concierge, maintenance, as well as underground Parking, health club, and seasonal pool available for an additional monthly fee, this residence has it all. Rent includes all utilities and basic cable\/ internet. Upon entry through the gracious foyer, you will be entranced by the boundless views and natural light shining through the spacious, open living and dining area. The beautiful kitchen will instantly inspire you to begin preparing meals with features such as stainless steel appliances, granite countertops, and upper and lower cabinetry. The main bedroom is complete with a walk-in cedar closet, tons of space, and stunning views of the river. The second bedroom also includes ample closet space, river views, and tons of opportunity for a home office, guest suite, and more. Tiled hall bath just off the hall and across from both of the two bedrooms. The conveniences continue with a small supermarket on site with delivery service, as well as a dry cleaners and the well regarded Zahav Restaurant. Building has a $250 move in fee, and a $50 application fee for required credit and criminal background check. The building is non smoking and restricts pets.\n220 Locust St #15AS","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', '1201ft2', 'available jan 6, 2023', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T09:59:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560951048.html","post_id":7560951048,"result_date":"Thu Nov 24 2022 15:01:23 GMT+0000 ","title":"Cozy 1 bedroom apartment located right next to the Italian market","description":"Bella Vista, which in Italian means “beautiful sight,” gets its name from the picturesque Philly skyline that can easily be seen from the community. Southwark is commonly referred to as Queen Village.\nTogether, the Bella Vista-Southwark community lies two miles southeast of Downtown Philadelphia, and encompasses many blocks between two of its liveliest commercial roads: South Street and Washington Avenue.\nOld-world Italian influences play a major role in the charm of the community, and remains one of the main attractions to the area. Visitors and residents alike look forward to spending a couple of hours at the 9th Street Italian Market, where rich aromas of strong espresso, fresh seafood, and homemade pastas fill the room. Every year, a festival in honor of the market is held and features family-friendly entertainment and of course, delicious foods and treats!\n","num_images":5.0,"lat":39.938808,"lng":-75.157229,"attrs":"['1BR \/ 1Ba', '400ft2', 'available now', '\\nthursday 2022-11-24\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'carport', 'rent period: monthly']","posted_date":"2022-11-24T09:38:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560950042.html","post_id":7560950042,"result_date":"Thu Nov 24 2022 14:53:54 GMT+0000 ","title":"Magnificent 4-beds 5-baths, Townhome Equipped With an Elevator!","description":"Welcome to Northbank, Fishtown's newest development. 3203 Parkview Walk is a magnificent 4-bedroom 5-baths, 3844 sq. ft. townhome equipped with an elevator! It features an open, spacious floorplan, 500 sq. ft. rooftop terrace and beautiful gourmet chef's kitchen that is perfect for entertaining! The owners floor features a patio with view of the water, walk in closet, huge walk-in shower, and soaking tub. The ground floor has a 2 car garage an and a generously sized study that can be used as a home office or an additional bedroom, and private garage parking. The open kitchen includes a large island, separate pantry, and half bath. Features include: - Smart home technology - Energy Star certification - Elevator - 2 car garage - Pella windows - Private rooftop balcony - Chef's kitchen - Open floor plan\n3203 Parkview Walk","num_images":5.0,"lat":39.9788,"lng":-75.1262,"attrs":"['4BR \/ 5Ba', '3488ft2', 'available nov 30', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T09:33:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560953097.html","post_id":7560953097,"result_date":"Thu Nov 24 2022 14:51:04 GMT+0000 ","title":"Two bedroom apartment in Graduate Hospital area","description":"Beautiful two bedroom apartment located in the Graduate Hospital area of Philadelphia. This unit has new hardwood flooring throughout,  modern amenities such as stainless steel appliances. Modern bathroom and laundry room in the unit. Rent is $1,800\/mth plus utilities. Call Darryl for a showing  show contact info","num_images":8.0,"lat":39.944003,"lng":-75.175516,"attrs":"['2BR \/ 1Ba', '800ft2', 'available nov 26', 'air conditioning', 'application fee details: 40.00 application fee', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T09:47:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560949462.html","post_id":7560949462,"result_date":"Thu Nov 24 2022 14:48:25 GMT+0000 ","title":"Midtown Village Loft Style Apartments and Duplexes in Center City!","description":"Midtown Village Loft Style Apartments and Duplexes In Center City Philadelphia. At The Collins, you are in the heart of Midtown Village where it's all happening, from street festivals to cocktail hours to art openings. Stake your claim to insider status in the neighborhood's newest shopping-and-dining destination, home to Target Express, Starbucks, Planet Fitness and all of your neighborhood essentials. Indulge in luxury loft living steps from the Blue and Orange lines near the best of downtown. Get into The Collins, and live all in. Whether you need a 1 or 2 bedroom home, The Collins has a variety of loft style floor plan layouts and spacious 2 bedroom duplex options. The Collins is ideally located just moments from University of the Arts (UARTS) and Thomas Jefferson University (Center City Campus). It's also a perfect location for Drexel University, Temple University and University of Pennsylvania (UPENN). ** Photos are of model units ** Pricing and availability subject to change on a daily basis ***\n1125 Sansom St #2B-621","num_images":5.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '1597ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T09:31:25-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560950536.html","post_id":7560950536,"result_date":"Thu Nov 24 2022 14:48:13 GMT+0000 ","title":"BRIGHT & CHEERY STUDIO AT THE DORCHESTER, LOCATED ON RITTENHOUSE SQ!","description":"Bright and cheery studio at The Dorchester, located on Rittenhouse Square! The Dorchester, Unit 402 is a perfectly sized studio with parquet wood floors, great natural light and excellent storage space. Features include a sun-lit living area with oversized windows; a fully-equipped kitchen; and a dressing area that leads to a full bathroom with a single vanity and shower\/tub combination. The Dorchester is located directly on Rittenhouse Square, ranked the 6th best neighborhood in North America. Residents of The Dorchester enjoy a 24-hour doorman, fitness center, all utilities, and basic cable for TV. There is an additional fee for use of the seasonal rooftop pool. Parking is available for rent through the building for an additional fee, subject to availability.\n224-30 W Rittenhouse Sq #402","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '573ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-11-24T09:36:13-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560951702.html","post_id":7560951702,"result_date":"Thu Nov 24 2022 14:45:16 GMT+0000 ","title":"Nice & Spacious 2 bed, 2 bath Apartment in Philadelphia","description":"Nice & Spacious-2 bedroom- 2 bathroom Apartment in Philadelphia. At Philadelphia, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, Philadelphia is a unique community that allows you to get the best, and the most, out of St. Philadelphia. Philadelphia has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Delaware is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District For more information please text:  show contact info","num_images":4.0,"lat":39.986723,"lng":-75.130613,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T09:41:16-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560945330.html","post_id":7560945330,"result_date":"Thu Nov 24 2022 14:40:22 GMT+0000 ","title":"The Best Location in Rittenhouse Square is Available to Rent!!","description":"Half a block way from Rittenhouse Square Park. Roof top deck with spectacular view of the park as seen in the photos. This rental has two generously size bedrooms (11x11 and 19x8) with two full bathrooms. A garden walkway welcomes you as you enter the property through a private gated entrance. The updated kitchen boasts granite counter tops, newer stainless steel appliances and a charming back splash. The second level offers a full bath with subway tiles and pedestal sink as well as a large bedroom (19x8) with more than ample closet space and built-in shelving - this level has plenty of natural light shining through the windows. The third level features a nicely updated full bathroom with an 11x11 bedroom and plenty of natural light. The lower level has a nice sized unfinished basement with a full-size washer and dryer (included with rental). This home is just steps from Rittenhouse Square restaurants, shops, fabulous nightlife, parking garages, public transportation and everything Center City has to offer. Schedule your private showing today. Make yourself at home with 2 very nice size bedrooms (11x11) and (19x8) each with their own full bath. Ask about including your friendly pet or including utilities.\n1830 Manning St","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-24T09:13:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560946504.html","post_id":7560946504,"result_date":"Thu Nov 24 2022 14:39:34 GMT+0000 ","title":"STUNNING, COMPLETELY RENOVATED 2 BEDROOM, 2 BATHROOM RESIDENCE!","description":"Stunning, completely renovated two bedroom, two bathroom residence located on the 19th floor of The Academy House along the Avenue of the Arts! Enter into the foyer with black tile floors and coat closet. The large eat-in kitchen has granite countertops, a peninsula, breakfast nook, modern wood cabinets, subway tile back splash and stainless steel appliances including a Frigidaire electric range, oven and microwave, a Kitchenaid refrigerator, and a Whirlpool dishwasher. The adjacent great room has hardwood floors and city views to the south and east from a private Juliet balcony which can be accessed from each room. The primary suite has great closet space and a spacious ensuite bathroom which features a shower\/tub with subway tile and a double vanity. The second bedroom is spacious and also has a large amount of closet space. Directly across is the hall bathroom which has tile flooring, a contemporary glass vanity, and a shower\/tub. There is a Maytag stackable washer\/dryer in the unit. No detail was left undone in this showplace condominium. The terrace doors were pushed out to increase interior square footage. Residents of Academy House enjoy a 24-hour doorman and a state-of-the-art fitness and aquatic center. There is valet parking in the building's garage for an additional monthly fee, subject to availability. The Academy House is located in the heart of Center City and within close walking distance to Rittenhouse Square, Washington Square, and the Broad Street and Market Street office corridors. The Philadelphia International Airport and Amtrak's 30th Street Station are easily accessible.\n1420 Locust St #19F","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T09:18:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560941993.html","post_id":7560941993,"result_date":"Thu Nov 24 2022 14:32:46 GMT+0000 ","title":"2 Bed 1 Bath Townhouse","description":"Hey, up for lease is the first floor of this beautiful 3-story house.The property is located near Front st and Wyoming ave, in the Feltonville section of Philadelphia.The owner currently lives upstairs. So, the kitchen, washer, and dryer will be shared. You’ll also have access to the basement; that’s where the appliances are and there’s a half bathroom. He’s offering a short term lease(month to month). The rent will be $1200\/monthly. First month + Second month+ security deposit will be required. Application fees will be $20 each person. No prior evictions! Come schedule your tour today, don’t miss out!","num_images":5.0,"lat":40.0118,"lng":-75.1456,"attrs":"['2BR \/ 1Ba', 'available now', 'air conditioning', 'application fee details: $20', 'furnished', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T08:58:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560948486.html","post_id":7560948486,"result_date":"Thu Nov 24 2022 14:31:18 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560948418.html","post_id":7560948418,"result_date":"Thu Nov 24 2022 14:31:05 GMT+0000 ","title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560947234.html","post_id":7560947234,"result_date":"Thu Nov 24 2022 14:25:46 GMT+0000 ","title":"Renovated generously sized three bedrooms two bathrooms","description":"renovated, generously sized three bedrooms, two bathrooms. Separate kitchen, separate dining room and separate living room (double parlor). Each room is well-sized and gets substantial natural light. Also included is one garage parking spot. Modern finishes have been blended with classic luxury to provide the setup for an exquisite home. Stainless steel appliances include a gas stove, dishwasher, microwave, and refrigerator. A beautiful backsplash, a single hole faucet with sprayer and granite countertops complement the freshly painted kitchen cabinets. Both bathrooms are finished with porcelain tile, new shower fixtures including rainfall shower heads, new vanities, new light fixtures and new toilets. Both the en-suite bath and the common bath have tubs, windows, rainfall shower heads and hand showers. The common bath also features a linen closet. Laundry exclusive to this unit can be found in the bathroom, and is free of charge (not coin op). Chandeliers and refinished hardwood floors preserve the character of the building, which has high ceilings throughout. Pets may be allowed subject to monthly fee. No smoking. 1 garage parking spot included.\n.\n.\n.\n.\n.\n.\n..\n.\n.\n.\n.\n.\n.\n.\n.\n.\n..\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of St. Petersburg. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.","num_images":3.0,"lat":40.0596,"lng":-75.0818,"attrs":"['3BR \/ 2Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T09:21:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560947232.html","post_id":7560947232,"result_date":"Thu Nov 24 2022 14:25:45 GMT+0000 ","title":"Efficient Appliances, Hardwood Floors, Bike Room","description":"Bedrooms: 1Bathrooms: 1.5Square Feet: 851Date Available: 2022-11-22Address: 631 N Broad St\nThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past.\nAmenities Include:\nClementine's Stable Cafe\nNEST Learning Thermostats\nHistoric Building\nHardwood Floors\nEfficient Appliances\nOn-Site Management\nRoof Deck\nExposed Brick & Spiral Ductwork\nPeloton Room\nRecycling\nControlled Access\/Gated\nLatchOS technology lock system\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/73hug4ej\/stable-loftsPricing and availability are subject to change.\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['1BR \/ 1.5Ba', '851ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T09:21:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560944246.html","post_id":7560944246,"result_date":"Thu Nov 24 2022 14:25:40 GMT+0000 ","title":"Experience all of Center City's Comforts at Riverloft Apartments","description":"Experience all of Center City's Comforts at Riverloft Apartments. Let our 24-hour front desk attendant receive your guests, your deliveries, dry cleaning, or anything else you may need. Our high-rise apartment building also offers an on-site ATM and controlled access guest parking and garage parking for an additional fee. Relax in your loft-style apartment with 16-foot ceilings, 12-foot windows and stainless steel kitchen appliances. There are high-tech touches throughout Riverloft - tech bars with data and charging ports provide convenient pit stops, plus there is a tech lounge with pod seating, a gas fireplace and a Smart TV. Riverloft has free Wi-Fi in all common areas, and iPads are available for check-out at the tech bar. Work out in our 24-hour Resort-Style Fitness with state-of-the-art equipment featuring personal TVs and iPod jacks. There are also weight machines and free weights for a lower-impact workout. Located steps from Rittenhouse Square surrounded by world class dinning and shopping. Monthly rent amount varies based on move-in date, and prices subject to change on daily basis. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n2302 Walnut St #0B1BA","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T09:08:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560945994.html","post_id":7560945994,"result_date":"Thu Nov 24 2022 14:20:18 GMT+0000 ","title":"Furnished Studio - 02 Months Minimum","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Furnished Studio - Only 2 Month Minimum!Take advantage of our special discounted rate! All utilities are included! show contact info\nwww.esa.com\/craigslistLooking for a place to call home for a couple months or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryPicnic & Grilling AreaIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 2 months?  We also have great nightly, weekly, and 30-night rates.  Call for details.Minimum 60-night length of stay required. Booking conditions apply, including a nonrefundable deposit. Rates and availability subject to change. Rate will vary by room type and stay dates. Rate not inclusive of taxes and fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 8880 Bartram Ave., Philadelphia, PA 19153    Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryOn-Site Fitness FacilityIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeOvenMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America - 8880 Bartram Ave., Philadelphia, PA 19153","num_images":4.0,"lat":39.889516,"lng":-75.246169,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T09:16:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560941501.html","post_id":7560941501,"result_date":"Thu Nov 24 2022 14:18:08 GMT+0000 ","title":"Spectacular & Grand 2-story\/2 Bedroom, 2 Bathroom Renovated Apts!","description":"Spectacular & Grand 2-story\/2 bedroom, 2 bathroom renovated apartment filled with charming old-world architectural details that features a private rear garden and PARKING located on beautiful Green Street in the heart of the Art Museum Area! First month's rent, last month's rent, and one month's security deposit is sue at lease signing. $50 application fee per applicant.\n1838 Green St #1","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', '4040ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T08:56:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560944729.html","post_id":7560944729,"result_date":"Thu Nov 24 2022 14:14:40 GMT+0000 ","title":"SUN SOAKED, FRESHLY PAINTED, NO CARPET, 1BED 1BATH HOME!","description":"Sun soaked, freshly painted, no carpet, 1bed 1bath home located on the grounds of a gated community on the Delaware River. This Waterfront Square Condominium, located in the desired Regatta Building, offers views and amazing amenities, to INCLUDE PARKING, fitness center with indoor pool and a surrounding deck right on top of the river, 3 dog parks, 2 massive green space areas, Center City shuttle service, 24 hour concierge and 24 hour gated security and so much more. The unit features all hardwood floors, stainless steel appliances and in unit laundry. Working from home? The Regatta Community room provides reservable space for any conference, work or social need. Within a few minutes of walking, enjoy all the hotspots of Fishtown, Northern Liberties and the “Del Ave” bars and restaurants. Located just steps to the Spring Garden Elevated Station, bus lines and I95 for quick transit. Don’t wait, enjoy luxury living today! Sorry - No Cats.\n901 N Penn St #R605","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '738ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T09:10:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560943732.html","post_id":7560943732,"result_date":"Thu Nov 24 2022 14:10:27 GMT+0000 ","title":"HIGH SOARING CEILINGS WITH UNIQUE FLOOR PLAN!! AWESOME 1BED 1BATH","description":"Over 1100 sq ft in desirable MetroClub Condominiums! ! HIGH SOARING CEILINGS with unique Floor Plan!! Awesome 1Bed 1Bath condo & assigned gated parking space for additional cost ! Great kitchen w\/granite countertops & stainless steel appliances. Open liv & din room w\/dark hardwood fl's & beautiful N views fr HUGE windows for TONS of light! Bedroom with large w\/big closet! Bathroom has DOUBLE sinks & all marble. W\/D in UNIT. Building has a ton to offer, including total Renoved Beautiful New designed Hallways Coming Soon on each Floor!! 24 hr security\/concierge, Outdoor POOL and Hot Tub with Cabana Area including Grills and Firepit as well as beautiful GYM, Bike Room ! easy access highways - 95,76 and 676 and short walking to awesome restaurants and city attractions! $1825 deposit due with application, and first and last month due at signing of lease!\n201-59 N 8th St #211","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '1119ft2', 'available dec 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T09:06:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560943231.html","post_id":7560943231,"result_date":"Thu Nov 24 2022 14:07:58 GMT+0000 ","title":"Spacious 2 bedroom 1 bathroom apartment in a beautiful gated community","description":"ADDESS: 1816, North Van Pelt Street, Sharswood, Philadelphia\nSpacious 2 bedroom 1 bathroom apartment in a beautiful gated community. This unit offers ample furniture space and lots of natural light. Amenities include covered parking and a floor to ceiling storage bin in the secured underground parking garage, a landscaped courtyard, rock gardens and a community pool and spa. This community is in close proximity to shopping, restaurants, public transit, background and credit check is also required!, application fee $30. Rent: $800 deposit: $600, If you interested please contact:- jesy7755𝐆𝐦𝐚𝐢𝐥com\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of Raleigh . Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.\n","num_images":8.0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T09:03:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560943164.html","post_id":7560943164,"result_date":"Thu Nov 24 2022 14:07:39 GMT+0000 ","title":"Pin code or app access, Quartz Countertops, European style","description":"Bedrooms: 0Bathrooms: 1Square Feet: 339Address: 1401 Arch StreetLocated in Philadelphia’s historic Center City neighborhood, One City offers modern elegance with timeless grandeur. With views of Philadelphia's City Hall and just steps away from iconic Philly locations such as the Pennsylvania Convention Center, Reading Terminal Market, and Love Park, One City offers sophisticated luxury in the heart of Philadelphia. One City offers the most discerning residents the ultimate living experience. Inside this historic building, located at 1401 Arch Street, each apartment residence holds unique original features coupled with contemporary sophistication. Thoughtful design details include custom built-in storage, stainless steel appliances, and modern connectivity offering luxury and convenience to a range of lifestyles. Control is always at your fingertips with your app-based smart home features including keyless entry. Amenities Include:LVT FlooringQuartz CountertopsCustom Built-In & Historic DetailingRooftop Grilling StationsKeyless EntryIn Unit Washer & DryerConference RoomEuropean stylePenthouse Hideaway                                                                                                                                Fully furnished bar and lounge area for BYO entertainment.                                                                                                                            Photo                                                                                                                                 Featured amenityPackage Receiving SystemStainless Steel AppliancesPin code or app accessCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/kylt3cuy\/one-cityPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '339ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T09:03:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560943074.html","post_id":7560943074,"result_date":"Thu Nov 24 2022 14:07:15 GMT+0000 ","title":"Bike Storage, Dishwasher, Electronic Thermostat","description":"Bedrooms: 0Bathrooms: 1Square Feet: 530Date Available: 2022-11-23Address: 2601 Poplar St\nFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive.\nAmenities Include:\nElectronic Thermostat\nElevator\nOn-Site Maintenance\nExtra Storage\nLatch Security System\nDishwasher\nHardwood Floors\nCentral Air Conditioning\nRoof Deck\nQuartz Countertops\nMicrowave\nRecycling\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/cbhjd3yg\/fairmount-northPricing and availability are subject to change.\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['0BR \/ 1Ba', '530ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T09:03:15-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560942975.html","post_id":7560942975,"result_date":"Thu Nov 24 2022 14:06:49 GMT+0000 ","title":"WELCOME TO BRIDGEVIEW! LOCATED IN BUSTLING OLD CITY!","description":"SHORT TERM 6 MONTH LEASE. Welcome to Bridgeview! Located in bustling Old City, on a quiet cobblestone street, is a renovated, top floor loft for you to call home. The building features high quality amenities including roof deck, garage parking, 24 hour concierge service, and a thriving association of owners. Your new home, unit 616, is bathed in natural light and features the high ceilings and exposed brick walls of your dreams. Enter the unit and find ample storage by the door before moving toward the kitchen, notice the hardwood floors throughout. You’ll first find an updated kitchen with a fresh new backsplash, stainless steel appliances and tons of storage. From here, you’ll enter the open living space with plenty of room for a dining table and living room set. Notice the size of these windows! You’ll find more closet storage on the way to the full bath that features stone tile and radiant heating in the floors. Next, is the large primary bedroom with two huge windows and more exposed brick. Another closet here for additional storage. Lastly you’ll find a BONUS room that is perfect for a nursery, home office, gym, dressing room, yoga room, guest bedroom or whatever you desire to make of it! Unit 616 comes with a 3x6 storage unit on the 6th floor (near the elevator and unit). GARAGE PARKING AVAILABLE FOR ADDITIONAL $250\/ MO. Easy access to the Market Frankford Line, I-95 and the Ben Franklin Bridge make this a commuter's dream and on the evenings and weekends you are in the heart of everything that Old City has to offer including tons of boutiques, coffee shops, restaurants and museums. Don’t miss your opportunity to claim this stylish home for yourself!\n315 New St #616","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '790ft2', 'available dec 5', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T09:02:49-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560941865.html","post_id":7560941865,"result_date":"Thu Nov 24 2022 14:02:03 GMT+0000 ","title":"Wonderful 3 Bedroom, 2.5 Bath Townhouse With a Dedicated Parking Spot","description":"Wonderful 3 bedroom, 2.5 bath townhouse with a dedicated parking spot right in front of this house! Located in Logan Square, Nectarine Street is between 19th & 20th, Spring Garden and Hamilton Streets. Main Floor offers an open floor plan with a spacious dining room and living room with hardwood floors and a charming balcony\/deck. Also on this floor is an exceptional kitchen with beautiful custom wood cabinetry and stainless steel appliances, and a modern half-bath and a laundry area. Upper level offers an amazing main bedroom with an upscale ensuite bathroom, a cathedral ceiling, huge closets, and the most beautiful natural light! There are also 2 more bedrooms with good closets and a fabulous hall bathroom. This townhouse has every amenity! Convenient to shopping, the Art Museum, and Fairmount Park. Available as of 12\/1\/22.\n1924 Nectarine St","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2.5Ba', '1694ft2', 'available dec 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T08:58:03-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560936230.html","post_id":7560936230,"result_date":"Thu Nov 24 2022 13:51:37 GMT+0000 ","title":"Large 2 Bed\/2 Bath Available for Rent in the Becker Building!","description":"Large 2 bedroom\/2 bathroom unit(s) available for rent in The Becker Building with PARKING for some units. A classic turn of the century converted warehouse in Philly's trendy Northern Liberties, The Becker Building is just steps from the shops\/restaurants on Liberty's Walk and 2nd Street, one block from the ACME Grocery Store, 2 blocks from the Frankford EL and just 3 blocks from uber hip Frankford Avenue in Fishtown. BECKER BUILDING AMENITIES INCLUDE: INTERCOM , FITNESS CENTER , LARGE OUTDOOR ROOF DECK FOR ENTERTAINING, KEYLESS ENTRY, HIGH CEILINGS, ELEVATOR IN BUILDING, CENTRAL AIR, IN-UNIT WASHER & DRYER, PET FRIENDLY, FRIENDLY 24 HOUR MAINTENANCE, HARDWOOD FLOORS, TRASH INCLUDED, CABLE READY, 24 HOUR SECURITY SYSTEM, PRIVATE PARKING AVAILABLE FOR SOME UNITS FOR AN ADDITIONAL CHARGE.\n1151-61 N 3rd St","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T08:26:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560936758.html","post_id":7560936758,"result_date":"Thu Nov 24 2022 13:50:47 GMT+0000 ","title":"Stop!! Take the Opportunity and See This Beautifully Done 2 Bed\/1 Bath","description":"Take the opportunity to stop by and see this beautifully done 2 bedroom\/1 bath apartment in one of the best locations in the city. Close to the Business District University City Major highways and The Art Museum this apartment provides proximity to everything. The hardwood floors flow throughout the entire apartment; the newly renovated kitchen boasts high end cabinetry and a lot of storage space; the wood-burning fireplace provides the warm cozy feeling during harsh winters and the deck provides the outdoor space for grilling and planting in the spring and summer. This is a must see apartment! Listing agent is related to the owner\n133 N 21st St #3","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-24T08:29:47-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560939400.html","post_id":7560939400,"result_date":"Thu Nov 24 2022 13:48:45 GMT+0000 ","title":"WELCOME TO UNIT 15A IN THE FABULOUS ELLINGTON BUILDING!","description":"Welcome to Unit 15A in the fabulous Ellington building! Unit 15A is a light-filled, south facing corner unit in one of the more spacious layouts of the building. High up on the 15th floor, you have views of South Philadelphia as well as the iconic Comcast building! High ceilings and oversized windows make for a comfortable living & dining space. The kitchen has plenty of cabinet and counter space plus stainless steel appliances. Storage is not an issue in this unit - the hall is lined with deep closets for all of your belongings and both bedrooms have ample closet space. The primary bedroom is complete with an en-suite bathroom. Stackable washer\/dryer is located right off the kitchen. The Ellington is a secure, convenient building with a 24-hour concierge, fitness center, meeting & party rooms, and a library. Several parking garages with monthly options are within a block of the front door. No pets. First, last, and security deposit due prior to move-in. $300 non-refundable move-in fee required by the building. All utilities included except cable\/internet.\n1500 Chestnut St #15A","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 2Ba', '1096ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T08:44:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560938963.html","post_id":7560938963,"result_date":"Thu Nov 24 2022 13:46:23 GMT+0000 ","title":"GORGEOUS AND HUGE NEW CONSTRUCTION HOME IN THE HEART OF FISHTOWN!","description":"Absolutely GORGEOUS and HUGE new construction home in the heart of Fishtown available for rent. This property has so much space! There are living rooms on the first and 2nd floors, a fully finished basement, 4 large bedrooms, 2 full bathrooms and a powder room on the first floor. The kitchen has been perfectly updated with lots of cabinets and a gleaming granite island. The kitchen leads to the backyard, a private outdoor oasis with room to play and relax. This home has more windows than the average row home, and each room is filled with a lovely natural light. The location cannot be beat-- super walkable to shops, restaurants bakeries, music venues, breweries, parks, public transportation, shopping, gyms, salons, truly the best of city living at your fingertips! Pets are ok on a case-by case- basis. Easy online application-- available for immediate move-in!\n1212 E Oxford St","num_images":5.0,"lat":39.9788,"lng":-75.1262,"attrs":"['4BR \/ 2.5Ba', '2224ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T08:42:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560936412.html","post_id":7560936412,"result_date":"Thu Nov 24 2022 13:31:39 GMT+0000 ","title":"Bike Storage, State-of-the-Art Fitness Center, Electronic Thermostat","description":"Bedrooms: 0Bathrooms: 1Square Feet: 512Date Available: 2022-11-23Address: 2601 Poplar StFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive. Amenities Include:Hardwood FloorsOn-Site ManagementAmazon Package Locker SystemRecyclingMicrowaveBike StorageQuartz CountertopsState-of-the-Art Fitness CenterCentral Air ConditioningExtra StorageOn-Site MaintenanceRoof DeckCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/wgpn2sx5\/fairmount-northPricing and availability are subject to change.\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['0BR \/ 1Ba', '512ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T08:27:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560936300.html","post_id":7560936300,"result_date":"Thu Nov 24 2022 13:30:59 GMT+0000 ","title":"FULL KITCHEN, FULLY FURNISHED MOVE IN READY!!!","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryOn-Site Fitness FacilityIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 3216 Tillman Dr., Bensalem, PA 19020","num_images":4.0,"lat":40.116742,"lng":-74.960137,"attrs":"['0BR \/ 1Ba', 'available now', '\\nfriday 2022-11-25\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T08:26:59-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560936234.html","post_id":7560936234,"result_date":"Thu Nov 24 2022 13:30:37 GMT+0000 ","title":"Lovely-spacious-1 bedroom- 1 bathroom Apartment in South Philadelphia","description":"ADDESS:  1279, Emily Street, Wharton, South Philadelphia\n1bd 1ba 553sft\nRent: $600 deposit: $600\ntext: evamery53𝐆𝐦𝐚𝐢𝐥com\nAll utilities included. Attached garage. yard is included!! pets OK. Close to schools, stores, buses, Philadelphia. please serious inquires only!! Heat, internet(Wi-Fi), water, laundry included in rent. Tenants responsible for electric. First month rent and security deposit is required upon moving in. background and credit check is also required!! Available December 15 Or Jan 1st 2023. Just contact the E-mail: evamery53𝐆𝐦𝐚𝐢𝐥com\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of Raleigh . Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.\n","num_images":3.0,"lat":39.9207,"lng":-75.1595,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T08:26:37-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560935799.html","post_id":7560935799,"result_date":"Thu Nov 24 2022 13:28:01 GMT+0000 ","title":"SPREAD OUT IN THIS LUXE 2 BEDROOM, 2 BATHROOM !!","description":"Spread out in this luxe 2 bedroom, 2 bathroom located on a shaded Society Hill block offering solitude. This fully renovated bi-level apartment includes a cooks kitchen with stainless steel appliances (including a dishwasher), in-unit laundry, central air, 2 modern bathrooms, and more. Convenient to TJUH, Pennsylvania Hospital, historic parks, top-rated restaurants, and food markets. Available for immediate occupancy. The building is not dog friendly.\n317 S 6th St #1F","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-24T08:24:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560935650.html","post_id":7560935650,"result_date":"Thu Nov 24 2022 13:26:56 GMT+0000 ","title":"**Completed  - Apartment for rent.**","description":"Experience the charm and history of Graduate Hospital from the comforts of your own apartment in one of Center City's most sought-after neighborhoods. Completed in January 2016, the 1430 South apartment building offers amenities such as tenant parking, a bicycle storage room, a video intercom system, and unobstructed 360 degree views of Philadelphia.\nCall Or Text  show contact info\nTo Schedule A Showing.\nThank You","num_images":3.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T08:22:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560931239.html","post_id":7560931239,"result_date":"Thu Nov 24 2022 13:26:52 GMT+0000 ","title":"Blue Bell Wood 3 Bedrooms 2.5 baths House","description":"Welcome to Blue Bell Woods, a highly sought and best value community in the heart of Blue Bell with tennis courts, swimming pool, playground and beautifully landscaped surroundings in the award winning Wissahickon School District. You will be impressed with this 3Br, 2.5 bath Townhome situated in one of the best locations in the entire community, A sliding doorsteps out to a brick patio and attached 1-car garage, Upstairs, the spacious master bedroom with large sitting room, and walk in closet. The full basement features a separate room for an abundance of storage space. The owner pays the HOA, the HOA also includes lawn maintenance, driveways, trash, and snow removal. Fabulous neighborhood and in one of the most convenient spots in Blue Bell, very short walk to community amenities, short drive to major highways for easy commute to center city Philadelphia or the airport, Plymouth Meeting Mall, King of Prussia Mall, Chestnut Hill and downtown Ambler with terrific restaurants.\nPlease Call Me Now at:  show contact info","num_images":1.0,"lat":40.0118,"lng":-75.1456,"attrs":"['3BR \/ 2.5Ba', 'air conditioning', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-24T07:54:52-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560935606.html","post_id":7560935606,"result_date":"Thu Nov 24 2022 13:26:40 GMT+0000 ","title":"**Completed  - Apartment for rent.**","description":"Experience the charm and history of Graduate Hospital from the comforts of your own apartment in one of Center City's most sought-after neighborhoods. Completed in January 2016, the 1430 South apartment building offers amenities such as tenant parking, a bicycle storage room, a video intercom system, and unobstructed 360 degree views of Philadelphia.\nCall Or Text  show contact info\nTo Schedule A Showing.\nThank You","num_images":3.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T08:22:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560935087.html","post_id":7560935087,"result_date":"Thu Nov 24 2022 13:23:35 GMT+0000 ","title":"LIGHT-FILLED 3 BED PLUS DEN BI-LEVEL APTS IN THE HEART OF QUEEN VILLAG","description":"JUST RENOVATED WITH A BRAND NEW KITCHEN!! Light filled 3 bedroom plus den bi-level apartment in the heart of QUEEN VILLAGE! Enormous living and dining area with 15 ft ceilings. Kitchen with MARBLE floor and tons of cabinet and counter space. Each bedroom is well proportioned, with fantastic closets. Additional den\/ in home office is a fantastic bonus, located just off of the living area. New HARDWOOD floors throughout. Central air and gas heat, laundry in building, as well as a charming shared court yard.\n234 Bainbridge St #G3","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 1Ba', '1275ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-24T08:19:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560931226.html","post_id":7560931226,"result_date":"Thu Nov 24 2022 13:15:48 GMT+0000 ","title":"Spacious Three Bedroom Home for Rent Next to Police Station","description":"Classically restored, charming, spacious three bedroom home for rent in University City \/ Powelton Village. Large, high ceiling living room and dining room. Two additional rooms for office\/study\/closet space. Harwood floors throughout. Enjoy the outdoors on the front porch or in the backyard. Two full baths. Washer and dryer in basement. Plenty of storage room. Upenn, Drexel, Acme Supermarket, Aldi Market, Presbyterian Medical Center all less than 5 minutes walking distance. 16th District Phila Police Department directly next door. Convenient to all public transportation (subway, trolley, bus). Rent is $950 per month. Tenants responsible for all utilities.\nPlease Call Me Now at:  show contact info","num_images":4.0,"lat":40.0118,"lng":-75.1456,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T07:54:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560933508.html","post_id":7560933508,"result_date":"Thu Nov 24 2022 13:13:12 GMT+0000 ","title":"Controlled Access\/Gated, Hardwood Floors, Recycling","description":"Bedrooms: 1Bathrooms: 1.5Square Feet: 851Date Available: 2022-11-22Address: 631 N Broad St\nThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past.\nAmenities Include:\nLatchOS technology lock system\nGas Range\nNEST Learning Thermostats\nRecycling\nBike Room\nHistoric Building\nControlled Access\/Gated\nRoof Deck\nLuxer Package Room\nElectronic Thermostat\nHardwood Floors\nClementine's Stable Cafe\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/fy6sxa36\/stable-loftsPricing and availability are subject to change.\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['1BR \/ 1.5Ba', '851ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T08:09:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560931536.html","post_id":7560931536,"result_date":"Thu Nov 24 2022 13:00:50 GMT+0000 ","title":"Wanamaker House Studio 2020 Walnut St $1485","description":"Wanamaker House Studio Unit 8G - 543 square feet. Available now. Wanamaker House is a full service high rise Doorman building with 24\/7 Security. Wanamaker House residents enjoy luxury amenities including 24 hour doorman, state of the art Fitness Center, and a seasonal rooftop swimming pool, all included in rent,  and parking in the garage (fee when available) 8G has a full sized, fully equipped kitchen with frost free frig, self cleaning range, dishwasher, garbage disposal, and a ton of cabinets. There are 3 huge clothes closets, and a linen closet, 21 foot living room with bay window with City Skyline views, individually controlled HVAC. Washer\/dryer on each floor of building. Easy walk to Upenn, Chop, and HUP. Half block walk to all Rittenhouse Square has to offer. Floor plan available. Yearly lease, no pets, non smoking building. $50 non refundable application fee. Landlord is a licensed realtor in the state of PA.","num_images":24.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '543ft2', 'available now', 'apartment', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T07:56:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560931234.html","post_id":7560931234,"result_date":"Thu Nov 24 2022 12:58:50 GMT+0000 ","title":"CHARMING 3BEDROOM COMFORT ZONE IN PHILADELPHIA","description":"Newly Renovated 3 bedroom 2 bathroom home. At Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown Philadelphia. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a cowering space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of St. Petersburg. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.\nPlease Call Me Now at:  show contact info","num_images":3.0,"lat":40.0118,"lng":-75.1456,"attrs":"['3BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T07:54:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560928713.html","post_id":7560928713,"result_date":"Thu Nov 24 2022 12:38:51 GMT+0000 ","title":"huge 3 bed 1.5 bath with hardwood flooring","description":"huge 3 bed 1.5 bath with hardwood flooring and centrall air and laundry. avail Dec 1.FIRST FLOOR; living room,dining room and kitchen with dishwasher and frige.door to spacious rear yard,half bath off dining area.2 nd fl: 3 good sized bedrooms,full bath with tub. basement: laundry,with good height and storage\/ avail dec 1. minimum requirments: first\/last and 1 month deposit,three month upfront,credit score above 650 and income three times of rent with criminal and eviction history. If you interested Contact Me:  show contact info\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of Raleigh . Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.\n","num_images":3.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-24T07:34:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560924473.html","post_id":7560924473,"result_date":"Thu Nov 24 2022 12:22:19 GMT+0000 ","title":"Available NOW | Welcome to 2037 N College Ave #A! This is a gorgeous 3","description":"Available NOW | Welcome to 2037 N College Ave #A! This is a gorgeous 3 bedroom \/ 3 bathroom bi-level apartment featuring hardwood floors, recessed lighting, central a\/c, in-unit laundry, walk-in closets, outdoor space, and more! The contemporary kitchen boasts cabinetry above & below, subway tile backsplash, and a full lineup of sleek stainless steel appliances. Your living area is right off the kitchen - perfect for entertaining! Head through the apartment to view your 3 bedrooms and 3 full bathrooms. The bedrooms are all spacious with hardwood floors and windows for sunlight. Your bathrooms are beautiful, equipped with contemporary vanities and subway tiled showers or bathtubs with sleek sliding glass doors. There's stacked washer & dryer in a hall closet for added convenience and incredible closet space for storage throughout the entire unit. Enjoy a private back patio in the warmer months and mini-split a\/c system installed inside for year long comfort. This is the perfect home for roommates - call us today!About The Neighborhood:Located in the beautiful Sharswood neighborhood, close to Fairmount and Brewerytown. You'll be nearby Girard College and surrounded by convenient shops and eateries as well as public transportation options to easily get around the city. Local attractions include the Liacouras Center, Eastern State Penitentiary, Columbia North YMCA, and AMC movie theater. Check out local favorites including Cambridge Street Coffee House, Bold Coffee Bar, Bar Hygge, Thirsty Dice, Athletic Square Park, and tons more!Lease Terms:Generally, first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord. $55 application fee per applicant. Pets are conditional on owner's approval and may require an additional fee and\/or monthly pet rent, if accepted. (Generally, $500\/non-refundable pet fee & $50\/month pet rent). Cold water is included in the monthly rent. Tenants responsible for: electricity, gas, and cable\/internet. Landlord Requirements: Applicants to make 3x the monthly rent in verifiable net income, credit history to be considered (i.e. no active collections), no evictions within the past 4 years, and must have a verifiable rental history with on-time rental payments.","num_images":7.0,"lat":39.9811,"lng":-75.174,"attrs":"['3BR \/ 3Ba', '1500ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T06:54:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560926664.html","post_id":7560926664,"result_date":"Thu Nov 24 2022 12:20:38 GMT+0000 ","title":"Exposed Brick & Spiral Ductwork, On-Site Management, Pet friendly","description":"Bedrooms: 1Bathrooms: 1Square Feet: 711Date Available: 2022-11-22Address: 631 N Broad StThe Stable Lofts features 41 spacious and thoughtfully designed luxury apartment homes. Each uniquely designed apartment incorporates the original unique Italianate architecture of the building into a modern, comfortable living space. Reclaimed wood from the original portion of the building was repurposed into the construction of the Stable Lofts, creating a timeless aesthetic, while also promoting sustainability and maintaining the historic architecture of Philadelphia’s past. Amenities Include:Gas RangeClementine's Stable CafeNEST Learning ThermostatsPeloton RoomOn-Site ManagementEfficient AppliancesRoof DeckElevatorRecyclingHistoric BuildingControlled Access\/GatedHardwood FloorsCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/4nfh3scs\/stable-loftsPricing and availability are subject to change.\n","num_images":9.0,"lat":39.964532,"lng":-75.160512,"attrs":"['1BR \/ 1Ba', '711ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T07:16:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560925848.html","post_id":7560925848,"result_date":"Thu Nov 24 2022 12:17:30 GMT+0000 ","title":"Great 1 bedroom, 1 bath ranch in Philadelphia","description":"Great 1 bedroom, 1 bath ranch in Three Colonies, a gated\/guarded community, featuring vaulted ceiling in sunken great room with fireplace, dining area open to kitchen and great room, which opens to a beautiful and private fenced in patio area.\nCall\/Text Andy:  show contact info\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of St. Petersburg. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.\n","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '606ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T07:08:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560924738.html","post_id":7560924738,"result_date":"Thu Nov 24 2022 12:11:22 GMT+0000 ","title":"This is a stunning 3 bedroom \/ 3 bathroom single family home featuring","description":"Available NOW | Welcome to 1914 E Harold St! This is a stunning 3 bedroom \/ 3 bathroom single family home featuring hardwood floors, recessed lighting, central air, rooftop deck, in-unit laundry, and more! Enter into the main level common area with a large window at the front and great space for living room furniture. The common area is open to the kitchen, separated by counter seating and providing an easy floor plan for entertaining! Kitchen features include gray shaker cabinets, gorgeous tile backsplash, and a full lineup of stainless steel appliances. Behind the kitchen is your staircase with iron metal rail and access to your private back patio. This lovely outdoor space offers a concrete area for patio furniture and some grass by the fence for flowers. Continue through the home to view your 3 bedroom and 3 full bathrooms. The bedrooms are spacious and bright, with great natural light and good closet space. Your full bathrooms are luxurious, boasting beautiful tiling, modern vanities, and bathtub \/ shower combos with sleek sliding glass doors. There is central air & in-unit laundry for added convenience, plus a breathtaking rooftop deck that spans the length of the home - call today to claim this gem as your own!Please note: some items may remain with the home: grill, backyard furniture, & rooftop storage (not pictured).About the Neighborhood:Located in East Kensington, Philadelphia’s fastest growing neighborhood. Walkable to Hagert Street Playground, POPS Skatepark, Urban Axes Throwing, and the Kensington Community Food Co-op. Surrounded by great public transportation options including bus routes and the Market Frankford Line for an easy commute throughout the city. Incredible neighborhood favorite places include Franny Lou’s Porch, Martha, Atlantis: The Lost Bar, Silvia Bakery, Halftime Goodtimes, and more!Lease Terms:Generally, first month, last month, and one month security deposit due at, or prior to, lease signing.","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 3Ba', '1738ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T06:57:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560924533.html","post_id":7560924533,"result_date":"Thu Nov 24 2022 11:58:56 GMT+0000 ","title":"Great 1 bedroom, 1 bath ranch in Philadelphia","description":"Great 1 bedroom, 1 bath ranch in Three Colonies, a gated\/guarded community, featuring vaulted ceiling in sunken great room with fireplace, dining area open to kitchen and great room, which opens to a beautiful and private fenced in patio area.\nCall\/Text Andy:  show contact info\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of St. Petersburg. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n..\n.\n.\n.\n..\n.\n.\n.\nTEXT OR CALL:  show contact info\nFeatures:\nPrivate Balconies, In-Unit Washer & Dryer, Drop Down Lighting Over Island, Walk-In Closet in Master Bedroom (all units except for studios.. Pop & Minimalist units), Key Fob Entry, Sleek Bathrooms with Walk-In Shower, Designer Lighting Fixtures, Digital Programmable Thermostats, In-Wall USB Ports, Kitchens with Spacious Islands, Quartz Countertops, Pull-Down Faucets, Deep Sinks, Subway Tile Backsplash, Energy Efficient Appliances, Energy Efficient Appliances, Modern, Wood Style Flooring, Full-Sized Coat Closet, Open Concept Floor Plan, 9' Ceilings\nCommunity Amenities:\nRooftop Deck (with firepit, grills, & a ping pong table), Rotating Art Gallery, Bike Parking & Storage, Maker's Space, Co-Working Space, Professionally Managed by On-Site Staff, Coffee & Tea Bar, 24- Hour Emergency Maintenance, Online Rent Payment and Maintenance Requests via Resident App, Clubroom, Private Conference Room, Community Courtyard, Bark Park & Pet Washing Station, Flexible Lease Terms, 24\/7 Fitness Center, Exclusive Access to Community Networking App, Cobu, Sparkling Swimming Pool\nPet Policy\nFee: $400 per pet\nMonthly Pet Rent: $25 per pet\nIncome Requirements:\n2.5x the monthly rent Great 2 bedroom, 2 bath ranch in Three Colonies, a gated\/guarded community, featuring vaulted ceiling in sunken great room with fireplace, dining area open to kitchen and great room, which opens to a beautiful and private fenced in patio area.\nCall\/Text Andy:  show contact info\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of St. Petersburg. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n..\n.\n.\n.\n..\n.\n.\n.\nTEXT OR CALL:  show contact info\nFeatures:\nPrivate Balconies, In-Unit Washer & Dryer, Drop Down Lighting Over Island, Walk-In Closet in Master Bedroom (all units except for studios.. Pop & Minimalist units), Key Fob Entry, Sleek Bathrooms with Walk-In Shower, Designer Lighting Fixtures, Digital Programmable Thermostats, In-Wall USB Ports, Kitchens with Spacious Islands, Quartz Countertops, Pull-Down Faucets, Deep Sinks, Subway Tile Backsplash, Energy Efficient Appliances, Energy Efficient Appliances, Modern, Wood Style Flooring, Full-Sized Coat Closet, Open Concept Floor Plan, 9' Ceilings\nCommunity Amenities:\nRooftop Deck (with firepit, grills, & a ping pong table), Rotating Art Gallery, Bike Parking & Storage, Maker's Space, Co-Working Space, Professionally Managed by On-Site Staff, Coffee & Tea Bar, 24- Hour Emergency Maintenance, Online Rent Payment and Maintenance Requests via Resident App, Clubroom, Private Conference Room, Community Courtyard, Bark Park & Pet Washing Station, Flexible Lease Terms, 24\/7 Fitness Center, Exclusive Access to Community Networking App, Cobu, Sparkling Swimming Pool\nPet Policy\nFee: $400 per pet\nMonthly Pet Rent: $25 per pet\nIncome Requirements:\n2.5x the monthly rent\n","num_images":4.0,"lat":40.013,"lng":-75.132,"attrs":"['1BR \/ 1Ba', '606ft2', 'available now', '\\nthursday 2022-11-24\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-24T06:54:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560921923.html","post_id":7560921923,"result_date":"Thu Nov 24 2022 11:50:46 GMT+0000 ","title":"Newly Renovated Studio Apt.   700","description":"Brand new  vinyl floors new appliances full studio  walk in shower 3rd floor apt privacy quiet block laundry on premises u will be more than satisfied 3 months to move in","num_images":9.0,"lat":40.0178,"lng":-75.0895,"attrs":"['1BR \/ 1Ba', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T06:18:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560921473.html","post_id":7560921473,"result_date":"Thu Nov 24 2022 11:16:11 GMT+0000 ","title":"Rooftop Grilling Stations, Stainless Steel Appliances, Bike Storage","description":"Bedrooms: 0Bathrooms: 1Square Feet: 394Address: 1401 Arch StreetLocated in Philadelphia’s historic Center City neighborhood, One City offers modern elegance with timeless grandeur. With views of Philadelphia's City Hall and just steps away from iconic Philly locations such as the Pennsylvania Convention Center, Reading Terminal Market, and Love Park, One City offers sophisticated luxury in the heart of Philadelphia. One City offers the most discerning residents the ultimate living experience. Inside this historic building, located at 1401 Arch Street, each apartment residence holds unique original features coupled with contemporary sophistication. Thoughtful design details include custom built-in storage, stainless steel appliances, and modern connectivity offering luxury and convenience to a range of lifestyles. Control is always at your fingertips with your app-based smart home features including keyless entry. Amenities Include:Lobby Lounge                                                                                    Photo                                                                                                                                 Featured amenityPackage Receiving SystemSmart ThermostatKeyless EntryLVT FlooringAdditional Storage AvailableApp based compatibility with all virtual personal assistant systems; Including thermostats and other electrical components.Pin code or app accessTech- Connected LivingPenthouse Hideaway                                                                                                                                Fully furnished bar and lounge area for BYO entertainment.                                                                                                                            Photo                                                                                                                                 Featured amenityQuartz CountertopsEuropean styleCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/2jxrnn5g\/one-cityPricing and availability are subject to change.\n","num_images":9.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '394ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T06:12:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560919671.html","post_id":7560919671,"result_date":"Thu Nov 24 2022 10:47:32 GMT+0000 ","title":"CHARMING 3BEDROOM COMFORT ZONE IN PHILADELPHIA","description":"TEXT OR CALL: ( 7 1 6 ) 3 0 3- 3 7 5 3\nNewly Renovated 3 bedroom 2 bathroom home. At Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown Philadelphia. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of St. Petersburg. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike. !If you interested TEXT OR CALL: ( 7 1 6 ) 3 0 3- 3 7 5 3\n","num_images":5.0,"lat":40.0018,"lng":-75.1179,"attrs":"['3BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T05:43:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560913029.html","post_id":7560913029,"result_date":"Thu Nov 24 2022 10:08:06 GMT+0000 ","title":"Lovely 3 bedroom, 1 bath home, Apply now","description":"Spacious and bright, 2 story, 3 bedroom, 1 bath, 1128 square foot home. Dog Friendly.\nPRIME LOCATION!! Close to Parkway, shopping, restaurants, parks & trails.\nMove-in ready with upgraded kitchen and baths. All appliances included (refrigerator, microwave, dishwasher, washer, dryer). Fireplace with spacious great room and dining nook. Tiled throughout entire first floor. Large master with en suite master bath. Master bedroom has his & her closets; one walk in, and one with sliding doors. Huge backyard with utility storage shed. Deep 2 car attached garage. Two tone paint.\nLonger term lease & immediate move-in will be given preference.\nSorry, no smokers or cats permitted.\nSchedule viewing with Jesse will be available for pre-qualified tenants only..\nApplication fee is refundable $75.\nCALL:  show contact info","num_images":7.0,"lat":39.94269,"lng":-75.226487,"attrs":"['3BR \/ 1Ba', '1128ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-24T03:29:06-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560912871.html","post_id":7560912871,"result_date":"Thu Nov 24 2022 09:03:45 GMT+0000 ","title":"Located in Logan Square steps away from 30th St Station and University City","description":"Located in Logan Square, 2200 Arch St is an award winning New York style loft building with fitness center and is pet friendly. This expansive 1 bedroom\/ 1 bathroom condominium, with covered garage parking, has unobstructed city views. The oversized windows face south so there is always an abundance of natural light. The living and dining area have 14 foot ceilings and beautiful hardwood flooring. This condo is set apart from other 1 BR's as it has a spacious private bedroom with transom windows that allow natural light into the room. The kitchen has stainless steel appliances, an abundance of cabinet space and granite countertops. The generously sized bathroom has a utility closet which includes a full sized washer\/dryer, the hot water heater and storage. 2200 Arch enjoys incredible location and is steps away from Rittenhouse Square, Trader Joe's. Flagship Giant, the Schuylkill trail, 30th St Station and University City.","num_images":6.0,"lat":39.954,"lng":-75.176,"attrs":"['1BR \/ 1Ba', '966ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T03:25:45-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560913199.html","post_id":7560913199,"result_date":"Thu Nov 24 2022 08:55:24 GMT+0000 ","title":"Recently renoveated 1 bed, 1 bath located on bustling Girard Ave","description":"Details\nIntroducing 515 W Girard Ave #1R! Recently renoveated 1 bed, 1 bath located on bustling Girard Ave includes updated finishes, wood flooring, in unit laundry and central air! The kitchen has ample counter space, microwave and full-sized fridge, and oven. Off to the right is additional countertop space perfect for a kitchen nook with room for a bar stool! Beyond the kitchen is a spacious living area with room for a couch, TV, and dining table. The open floor plan allows for plenty of living space and versatility! Not to mention, this home comes with a bonus room perfect for a cozy office space! The bathroom has floor-to-ceiling tile, modern finishes, and a sizeable tub. Tenant pays $35\/month flat water fee, electric and gas.\n* Prices and availability subject to change without notice.\n* Square footage definitions vary. Displayed square footage is approximate.\n515 W Girard Ave Unit 1R\nProperty Management Company Logo\nAbout This Property\nIntroducing 515 W Girard Ave #1R! Recently renoveated 1 bed, 1 bath plus a den, located on bustling Girard Ave includes updated finishes, wood flooring, and central air! The kitchen has ample counter space, microwave and full-sized fridge, and oven. Off to the right is additional countertop space perfect for a kitchen nook with room for a bar stool! Beyond the kitchen is a spacious living area with room for a couch, TV, and dining table. The open floor plan allows for plenty of living space and versatility! Not to mention, this home comes with a bonus room perfect for a cozy office space! The bathroom has floor-to-ceiling tile, modern finishes, and a sizeable tub. Coin-operated laundry is located in the basement. Tenant pays a $35\/month flat water fee. Reach out to Philly Home Advisors today to schedule a tour!\nCall or Text us at  show contact info","num_images":18.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T03:32:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560912174.html","post_id":7560912174,"result_date":"Thu Nov 24 2022 08:36:14 GMT+0000 ","title":"Temple university has seen incoming freshman increase year after year","description":"Welcome to 1829 Fontain street! A unique house that has 4 bedrooms, 2 bathrooms, big backyard, finished basement and TWO KITCHENS which make it a hit for temple students consistently renting year after year. Currently rented for a month with tenants paying all utilities until the end of July 2023. Temple university has seen incoming freshman increase year after year for the past decade making temple one of the best places to invest in the city. This property has potential with it being 4 bedrooms to rent at least a month. COME LOOK AT THE BEST DEAL AT TEMPLE TODAY","num_images":5.0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 2Ba', '1300ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T03:10:14-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560876417.html","post_id":7560876417,"result_date":"Thu Nov 24 2022 03:32:22 GMT+0000 ","title":"Conveniently Located Near Major Roads, shopping Centers","description":"Desirable Westtown Mews! This well-maintained one bedroom one bathroom is ready for you to move right in. Walk up the steps and enter the main living room area with tons of natural light coming through. Have your morning coffee or relax after a long day on your private deck right off of the living room. The kitchen offers plenty of cabinet space with stainless steel appliances. The bedroom is spacious with a large walk-in closet. You will find another closet across from the bathroom. Newer appliances, carpet, and roof! Westtown Mews is conveniently located near major roads and offers a walking path to the near-by shopping center. This one will not last!","num_images":11.0,"lat":39.966455,"lng":-75.53007,"attrs":"['1BR \/ 1Ba', '1034ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-23T21:32:22-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561057015.html","post_id":7561057015,"result_date":"Thu Nov 24 2022 21:32:30 GMT+0000 ","title":"Professional 2 Bedroom\/1 bath Apartment for rent in Philadelphia","description":"Professional 2 Bedroom\/1 bath Apartment for rent in Philadelphia showing without application submitted. we have infused a luxury living experience with artistic collaborative spaces. Within our walls, you will find an experience like no other. We have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space & a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. You must qualify on income and good history of past tenancy is must. has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, is the perfect blank canvas. Just contact the E-mail::::: marinawhite996𝐆𝐦𝐚𝐢𝐥com","num_images":1.0,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 1Ba', 'available now', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T16:28:30-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561046366.html","post_id":7561046366,"result_date":"Thu Nov 24 2022 20:42:12 GMT+0000 ","title":"Located in the highly desirable Pennsport section of Philadelphia.","description":"Spacious 1 bedroom \/ 1 bathroom Apartment in PHILADELPHIA, PA. At Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown Syracuse. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of St. Bellingham . Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.\n*If you are interested please send me your number. I will contact you soon.\n","num_images":8.0,"lat":39.9207,"lng":-75.1595,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T15:38:12-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561045602.html","post_id":7561045602,"result_date":"Thu Nov 24 2022 20:38:24 GMT+0000 ","title":"Welcome to this newly rehabbed 2nd floor apartment","description":"Lovely-spacious-3 bedroom- 1 bathroom Apartment in PHILADELPHIA, PA, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, New Hampshire is a unique community that allows you to get the best, and the most, out of St. Lexington has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Lexington is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue house have to offer. Large bath with ceramic tile and full tub.\n*If you are interested please send me your number. I will contact you soon.\n","num_images":7.0,"lat":39.9207,"lng":-75.1595,"attrs":"['3BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T15:34:24-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561044237.html","post_id":7561044237,"result_date":"Thu Nov 24 2022 20:31:46 GMT+0000 ","title":"2 bedroom 1 bath rowhouse in South Philadelphia.","description":"Update Duplex 2 bedroom and 1 full bath Apt for rent in PHILADELPHIA, PA  !! must qualify on income and good history of past tenancy is must.If you interested please contact:- Rate has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue house have to offer. The is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and If you interested please contact:-\n*If you are interested please send me your number. I will contact you soon.\n","num_images":8.0,"lat":39.9207,"lng":-75.1595,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T15:27:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561036257.html","post_id":7561036257,"result_date":"Thu Nov 24 2022 19:56:58 GMT+0000 ","title":"Great 1 bedroom available now at 2254 Bryn Mawr ave!","description":"Great 1BR\/1BA apartment in Wynnefield available NOW! This unit features hardwood floor, full kitchen with granite countertop, microwave and dishwasher, big living room, a couple closets, tiled bathroom, a lot of natural light. Shared laundry. Secured entry. Pets are allowed with landlord's approval ($250 pet fee plus $25 pet rent). Free parking street parking. Call or text NOW at  show contact info\n( I usually respond on text messages within 10 min!) City Wide Realty 808 N 4th str Suite 1, Philadelphia, PA, 19123\n","num_images":14.0,"lat":39.992777,"lng":-75.226573,"attrs":"['1BR \/ 1Ba', 'application fee details: 50', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T14:52:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561034843.html","post_id":7561034843,"result_date":"Thu Nov 24 2022 19:50:19 GMT+0000 ","title":"Great 1 bedroom available now at 5100 Walnut street!","description":"Great location! Cozy 1 bedroom available after September 15th. Laundry room is in the building. Tenant pays for all utilities. 1 year lease. $50 application fee. 3 months to move in. Must to have a good credit score and monthly income 3 times rent.\nCall Alena for showing at  show contact info","num_images":12.0,"lat":39.956707,"lng":-75.223538,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T14:46:19-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561033433.html","post_id":7561033433,"result_date":"Thu Nov 24 2022 19:43:58 GMT+0000 ","title":"Studio Apartment w\/Kitchenette and Work Space","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryOn-Site Fitness FacilityMeeting RoomFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 437 Irwins Lane, Plymouth Meeting, PA 19462","num_images":5.0,"lat":40.1077,"lng":-75.2796,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T14:39:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561033408.html","post_id":7561033408,"result_date":"Thu Nov 24 2022 19:43:53 GMT+0000 ","title":"Great 1 bedroom available now at 4537 Osage ave!","description":"Cozy, affordable 1 bedroom available now at 45th and Osage. Great location! Building comes with shared backyard. Laundry room in the building.\n$50 application fee, 3 months to move in. 1 year lease.\nCall or text at  show contact info\nto schedule your showing today\n","num_images":13.0,"lat":39.951144,"lng":-75.213282,"attrs":"['1BR \/ 1Ba', 'application fee details: 55', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T14:39:53-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561032725.html","post_id":7561032725,"result_date":"Thu Nov 24 2022 19:40:54 GMT+0000 ","title":"Studio Apartment w\/Kitchenette and Work Space","description":"Furnished Studio - Great Monthly Rates!Take advantage of our special discounted rate! All utilities are included! show contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.Property AmenitiesAll Rooms Non-SmokingPet-Friendly Rooms AvailableWeekly Housekeeping IncludedFree Grab-and-Go BreakfastOn-Site Guest LaundryOn-Site Fitness FacilityMeeting RoomFree Off-Street ParkingIn-Room AmenitiesFully Equipped KitchensFull-Size RefrigeratorElectric RangeMicrowaveFree In-Room Wi-FiFlat Screen TVsFree Cable with Premium ChannelsIron & Ironing BoardStaying less than 1 month?  We also have great nightly and weekly rates.  Call for details.Booking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.Pets are always welcome at Extended Stay America. A maximum of two pets are allowed in each suite. Pet fees vary by location to cover the cost of cleaning and guest room fumigation. Service animals will be exempt from this charge. Height and length restrictions apply: pets can be no longer than 36 inches and no taller than 36 inches. Larger, or more than two pets requires property manager’s approval. Please contact the property for questions.This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.Extended Stay America Suites - 437 Irwins Lane, Plymouth Meeting, PA 19462","num_images":6.0,"lat":40.1077,"lng":-75.2796,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T14:36:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561030554.html","post_id":7561030554,"result_date":"Thu Nov 24 2022 19:32:11 GMT+0000 ","title":"WOW Update Duplex 2 bedroom and 1 full bath Apt for rent","description":"Update Duplex 2 bedroom and 1 full bath Apt for rent in Philadelphia !! must qualify on income and good history of past tenancy is must. Please Text for appointment to view.  show contact info\nIf you interested please contact:- Rate has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue house have to offer. The is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and If you interested please contact:-","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T14:28:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561029330.html","post_id":7561029330,"result_date":"Thu Nov 24 2022 19:26:58 GMT+0000 ","title":"Adorable ranch style home with 2 bedrooms@@","description":"Amazing 2 bedroom 2 bath home offering 1509 sq ft of living space, recently updated home. Beautiful home featuring a spacious floorplan. Great location in a great community. Heat and hot water. Pet-friendly, No Smoking. TEXT OR CALL;(8 8 8) 3 0 2-5 5 5 3\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of Raleigh . Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.TEXT OR CALL;(8 8 8) 3 0 2-5 5 5 3\n","num_images":10.0,"lat":40.0338,"lng":-75.1731,"attrs":"['2BR \/ 2Ba', '1297ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T14:22:58-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561024040.html","post_id":7561024040,"result_date":"Thu Nov 24 2022 19:05:38 GMT+0000 ","title":"!!!!Gorgeous 1 Bed 1 Bath apartment  Available!!!!","description":"show contact info\nGorgeous 1 Bed 1 Bath House Available for Rent $750 month. Apartment features a fully equipped kitchen, coat closet, washer\/dryer, insite bathrooms, walk-in closets, and a patio\/balcony. The kitchen features new appliances, including a gas stove and a stainless steel fridge and wall-mounted microwave.. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment! If you interested please text me\nshow contact info","num_images":6.0,"lat":40.1166,"lng":-75.0198,"attrs":"['1BR \/ 1Ba', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T14:01:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561023147.html","post_id":7561023147,"result_date":"Thu Nov 24 2022 19:02:28 GMT+0000 ","title":"Award Winning Methacton District w\/Appliances, AC\/Heat, walk-up attic","description":"End unit townhouse with hardwood floor throughout. First floor with a living room, kitchen, dining\/family room, and a half bath. Kitchen with brand new stainless steel appliances. The sunny dining\/family room is back to a large deck. The three bedrooms are on the second floor, with a master bedroom on the front, a private full bath and a finished walk-up attic, and two smaller bedrooms with a full bath in the back. The walkout basement is half-finished with a large capacity washer\/dryer and a half bathroom. A new AC\/heater was installed in the summer of 2022. The house is located in the Award Winning Methacton District and conveniently situated with easy access to KOP, Audubon, Collegeville, and Philadelphia.\nThe tenant Pays for water, electricity, heat, and internet. Please complete the application. Viewing by appointment only. Thank you for looking.\nThe tenant pays utilities, including water, electricity (AC\/heating), and the Internet. The tenant is responsible for lawn care (front, side, and back)\n","num_images":17.0,"lat":40.156517,"lng":-75.409118,"attrs":"['3BR \/ 2.5Ba', '1290ft2', 'available now', '\\nmonday 2022-11-28\\n', '\\ntuesday 2022-11-29\\n', '\\nwednesday 2022-11-30\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T13:58:28-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561020083.html","post_id":7561020083,"result_date":"Thu Nov 24 2022 18:50:01 GMT+0000 ","title":"Available now 2 bed 1 bath for rent","description":"Available now 2 bed 1 bath for rent. For more information please text:  show contact info\nWithin our walls, you will find an experience like no other. Heat and hot water included. Arte has an abundance of amenities for you to live your most convenient and creative life. Handy to transit and essentials! Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District For more information please text:  show contact info","num_images":3.0,"lat":39.9375,"lng":-75.2637,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2022-11-24T13:46:01-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561017342.html","post_id":7561017342,"result_date":"Thu Nov 24 2022 18:39:38 GMT+0000 ","title":"#$#Beautifully updated 2 BR\/2 BA in Philadelphia >","description":"Amazing 2 bedroom 2 bath Apartment offering 1200 sq ft of living space, recently updated home. Beautiful home featuring a spacious floorplan. Great location in a great community. Heat and hot water. Pet-friendly, No Smoking. TEXT OR CALL;(7 1 6) 3 0 3-3 7 5 3\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of Raleigh . Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.TEXT OR CALL;(7 1 6) 3 0 3-3 7 5 3\n","num_images":6.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T13:35:38-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561017329.html","post_id":7561017329,"result_date":"Thu Nov 24 2022 18:39:35 GMT+0000 ","title":"HOUSING OFFERED !!!!!!!!!!! @Great Location Fully Renovated###","description":"Amazing 3 bedroom 2 bath home offering 1509 sq ft of living space, recently updated home. Beautiful home featuring a spacious floorplan. Great location in a great community. Heat and hot water. Pet-friendly, No Smoking. TEXT OR CALL;(7 1 6) 3 0 3-3 7 5 3\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\nAt Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown St. Pete. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of Raleigh . Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.TEXT OR CALL;(7 1 6) 3 0 3-3 7 5 3\n","num_images":5.0,"lat":40.0018,"lng":-75.1179,"attrs":"['3BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T13:35:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561017086.html","post_id":7561017086,"result_date":"Thu Nov 24 2022 18:38:39 GMT+0000 ","title":"!!!!NEWLY RENOVATED 2 BEDROOM 2 BATHROOM HOME","description":"CHARMING HOME HAS AN OPEN CONCEPT AND INCLUDES 2 BEDROOMS AND A STUDY. THE OPEN KITCHEN OVERLOOKS THE LIVING AREA WITH A LARGE BREAKFAST BAR. IT ALSO INCLUDES WOOD CABINETS, BLACK APPLIANCES, AND A FRIDGE IS INCLUDED. NEW HVAC, TILE FLOORING IN WET AREAS, FIXTURES, CABINETS, SINKS, BATHROOM FEATURES INCLUDING TILED SHOWER, HOT WATER HEATER. SEE THE BONUS ROOM SET UP AS AN EFFICIENCY APARTMENT IN THE BACKYARD, DISCONNECTED FROM THE MAIN HOUSE. USE IT AS A TRUE MOTHER-IN-LAW SUITE OR A ROOM FOR A FAMILY MEMBER, OR RENT IT OUT FOR SOME EXTRA MONEY. 2 SETS OF ALL NEW KITCHEN APPLIANCES.\nCALL ME ONLY:-(8 4 4) 7 5 7-1 8 1 5\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\nNewly Renovated 2 bedroom 2 bathroom home. At Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown VA. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of St. Petersburg. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike. !If you interested ONLY CALL:(8 4 4) 7 5 7-1 8 1 5\n","num_images":5.0,"lat":39.9772,"lng":-75.2545,"attrs":"['2BR \/ 2Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T13:34:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561014889.html","post_id":7561014889,"result_date":"Thu Nov 24 2022 18:30:56 GMT+0000 ","title":"Gorgeous 2 Bedroom and 1 full Bath apt in Philadelphia","description":"Gorgeous 2 Bedroom and 1 full Bath apt in Philadelphia, If you interested please contact:-denny21412gmailcom huge 2bd 2ba upgraded kitchen and baths, crown molding and beautiful trim, fireplace, washer\/dryer in unit, only $675, option to renew, best deal in most popular area! 1 block from Gold Coast Market and Cafe, Whole Foods, Etta, 10 minutes to Michigan Ave, Kinzie and Hubbard great restaurants and shopping. Walk to Museums, Navy Pier, Downtown and Millenium Park. Low utilities, tenant pays electric and gas, central heat and AC. PETS WELCOME. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue house have to offer. If you interested please contact:- denny21412@_GmAil^cOm","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'carport', 'rent period: monthly']","posted_date":"2022-11-24T13:26:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561010825.html","post_id":7561010825,"result_date":"Thu Nov 24 2022 18:30:50 GMT+0000 ","title":"amazing one bedroom one bathroom apartment with one free parking spot!","description":"This is a great apartment among all the action on Main Street. There's a single carport and a single bedroom\/bathroom in this place. near proximity to excellent dining establishments, nightlife venues, and outdoor recreational opportunities.","num_images":11.0,"lat":40.028156,"lng":-75.226791,"attrs":"['1BR \/ 1Ba', 'available now', '\\nthursday 2022-11-24\\n', '\\nfriday 2022-11-25\\n', '\\nmonday 2022-11-28\\n', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T13:11:50-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561014047.html","post_id":7561014047,"result_date":"Thu Nov 24 2022 18:27:48 GMT+0000 ","title":"Spacious fully 1 bedroom 1 bathroom apt available In Philadelphia !!!","description":"Spacious fully 1 bedroom 1 bathroom apt available In Philadelphia !!! At Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown Albany. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a cowering space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug.  Upgraded kitchen with Quartz countertops and subway tile and backsplash. There is a separate dining area off the kitchen with a sliding glass door out to the deck with warp around porch. Main entrance walks into a large L-shaped living room with separate area that can be used for private sitting area. Large master bedroom has an extra-large closet with mirrored doors. Master bath has luxurious tub with separate shower. Second bedroom also has a large closet. Send me your phone number and email address then i will provide more information to you ASAP!!!","num_images":4.0,"lat":40.7195,"lng":-76.1158,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T13:23:48-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561010892.html","post_id":7561010892,"result_date":"Thu Nov 24 2022 18:16:05 GMT+0000 ","title":"ATTENTION Beautiful Two Bedroom Duplexhouse deals ANYTIME.","description":"ATTENTION Beautiful Two Bedroom Duplexhouse deals ANYTIME. 2 bedrooms, 2 bath, well-maintained home has been updated with luxury vinyl plank flooring, smooth ceilings and fresh paint. THE KITCHEN HAS GRANITE COUNTERTOPS, NEW CABINETS, AND NEW APPLIANCES. THE HUGE FENCED BACKYARD IS A PERFECT PLACE TO UNWIND. Great neighborhood and awesome neighbors. the airport, and I-526, you will feel right at home in this lovely oasis in the center of town! Come see it today! Contact by text+++  show contact info\n+++\nOwner pays for water and trash. Tenant responsible for electric and internet. Pets are negotiable. No smoking. 2 parking spaces provided. At Arte, we have infused a luxury living experience with artistic collaborative spaces. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of st. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas.\n","num_images":4.0,"lat":40.0634,"lng":-74.999,"attrs":"['2BR \/ 2Ba', '1150ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T13:12:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561008679.html","post_id":7561008679,"result_date":"Thu Nov 24 2022 18:08:34 GMT+0000 ","title":"Great place to live","description":"Furnished Studio - Great Monthly Rates!\nTake advantage of our special discounted rate! All utilities are included!\nshow contact info\nLooking for a place to call home for a month or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.\nProperty Amenities\nAll Rooms Non-Smoking\nPet-Friendly Rooms Available\nWeekly Housekeeping Included\nFree Grab-and-Go Breakfast\nOn-Site Guest Laundry\nFree Off-Street Parking\nIn-Room Amenities\nFully Equipped Kitchens\nFull-Size Refrigerator\nElectric Range\nMicrowave\nFree In-Room Wi-Fi\nFlat Screen TVs\nFree Cable with Premium Channels\nIron & Ironing Board\nBooking conditions apply. Advertised rate is for a 30-night stay, and will vary by room type and stay dates. Rates and availability subject to change. Rate not inclusive of taxes or fees. Actual room may vary from those shown.\nPet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.\nThis site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.\n","num_images":6.0,"lat":40.056081,"lng":-75.653364,"attrs":"['1BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T13:04:34-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561007700.html","post_id":7561007700,"result_date":"Thu Nov 24 2022 18:05:26 GMT+0000 ","title":"two bedroom one bathroom apartment with amazing location!","description":"Two bedrooms, one bathroom, and one parking space in a prime location among the city's best eateries, pubs, and hiking path are all yours for the asking.","num_images":9.0,"lat":40.028156,"lng":-75.226791,"attrs":"['2BR \/ 1Ba', 'available now', '\\nfriday 2022-11-25\\n', '\\nsunday 2022-11-27\\n', '\\nmonday 2022-11-28\\n', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T13:01:26-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560992486.html","post_id":7560992486,"result_date":"Thu Nov 24 2022 17:57:33 GMT+0000 ","title":"🔥Nicetown | Tioga  Rent to Own Home For Sale🔥","description":"🔥Nicetown | Tioga  Rent to Own Home For Sale🔥\n3927 Donath St, Philadelphia, PA 19140\nPoor Credit\/No Credit Doesn't Matter\nDown-payment & proof of income is your qualification to homeownership\n$3,999 down\n$999\/ mo for 30yrs\nCall\/text Mike at  show contact info\nfor more info, pics, or to schedule viewing\n3B\/1B\n1,320 sqft\nStreet Parking\nLot size: 1,005 sqft\nBuilt: 1940\nBrand new heating and Air Conditioning System\nNew Hot Water Tank\nTaxes: $668\/yr\nClearance is the basement is about 7ft\nIn the very back section of the house, there is a 4ft leakage, just needs a patch on the roof, quoted $1,500\nThere is a leaking in the bathroom, but its because the tub hasn't been replaced\nClean title\nTaxes up to date\nWelcome to 3927 Donath Street!  Brand new heating and Air Conditioning System put in the home!  This large 3 Bedroom, 1 Bathroom home in the Nicetown section of Philadelphia has tons of potential.  The home is located on a quiet private street with homes just on the one side of the street and tons of on street parking.  Walk up to a large front porch.  Inside the home on the main level is a large living room as well as a large dining room before you enter the kitchen.  The laundry machines are located on the first floor.  There is also a fenced in backyard which needs to be cleaned up.  The upper level has 3 spacious bedrooms and a full bathroom.  Original hardwood floors that could use refinishing throughout the home   The home is located near tons of buses and the subway. Center City, Temple University ,and Temple Hospital are just minutes away.   Drive by and make an offer today!\nWe cannot confirm the condition of the home, please do your own inspection\nLike my FB page here for other properties when I get more https:\/\/www.facebook.com\/pasellerfinancehomes & see more here https:\/\/5minvestments.managebuilding.com\/Resident\/public\/home\n","num_images":4.0,"lat":40.0118,"lng":-75.1456,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T12:07:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561004990.html","post_id":7561004990,"result_date":"Thu Nov 24 2022 17:55:18 GMT+0000 ","title":"Spacious-2 bedroom- 2 bathroom Apartment in philadelphia","description":"Lovely-spacious-2 bedroom- 2 bathroom Apartment in philadelphia . we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown philadelphia . Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of Montana. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike. Text me if interested:~(646) 470-76 28‬","num_images":6.0,"lat":40.0568,"lng":-75.1379,"attrs":"['2BR \/ 2Ba', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T12:51:18-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561004031.html","post_id":7561004031,"result_date":"Thu Nov 24 2022 17:51:43 GMT+0000 ","title":"This is a great one bedroom one bathroom apartment in a great location","description":"This is a great apartment among all the action on Main Street. There's a single carport and a single bedroom\/bathroom in this place. near proximity to excellent dining establishments, nightlife venues, and outdoor recreational opportunities.","num_images":9.0,"lat":40.028156,"lng":-75.226791,"attrs":"['1BR \/ 1Ba', 'available now', '\\nfriday 2022-11-25\\n', '\\nsunday 2022-11-27\\n', '\\nmonday 2022-11-28\\n', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T12:47:43-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7561001957.html","post_id":7561001957,"result_date":"Thu Nov 24 2022 17:44:04 GMT+0000 ","title":"Seeking subletter ASAP","description":"LOOKING FOR SUBLETTER ASAP @ 535 N BUDD ST - PHILADELPHIA PA, 19104 - LEASE ENDS JULY 2023!\n1st Month ($1,036 with utilities included at flat rate) + Security Deposit ($850) for a total of $1,886 to move in.\nBonus: Free last months rent!\nGreat studio in a newly constructed building, located In University city very close to Drexel and UPenn. The building is close to campus and schools - perfect location for students! Just a few minutes from 40th St. subway station. Each unit has double burner, microwave, and small refrigerator. There is a $75 monthly flat fee (already included in rent above) for WI-FI, electricity, water, and washer\/dryer use.\nPet Policy: small pets with $250 pet fee\/ one per apartment.\nRequirements: There is a $50 non-refundable application fee. Good credit 650+ (no prior evictions, judgements, or collections). Proof of income (co-signer for students if needed).\n","num_images":5.0,"lat":39.961851,"lng":-75.204693,"attrs":"['0BR \/ 1Ba', 'available now', 'air conditioning', 'application fee details: $50 Application Fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T12:40:04-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560996093.html","post_id":7560996093,"result_date":"Thu Nov 24 2022 17:22:33 GMT+0000 ","title":"Cozy Update Duplex 2 bedroom","description":"cozy Update Duplex 2 bedroom and 1 full bath Apt for rent in Philadelphia,PA!! furnished apartment.\nText me if interested:~ clarencejohnnie761 ~G~M~A~I~L.com\nWe have infused a luxury living experience with artistic collaborative spaces. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create. Text me if interested:~ clarencejohnnie761 ~G~M~A~I~L.com\n","num_images":1.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T12:18:33-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560990845.html","post_id":7560990845,"result_date":"Thu Nov 24 2022 17:17:35 GMT+0000 ","title":"this amazing one bedroom one bathroom in this amazing location","description":"This is a great apartment among all the action on Main Street. There's a single carport and a single bedroom\/bathroom in this place. near proximity to excellent dining establishments, nightlife venues, and outdoor recreational opportunities.","num_images":8.0,"lat":40.028156,"lng":-75.226791,"attrs":"['1BR \/ 1Ba', 'available now', '\\nthursday 2022-11-24\\n', '\\nfriday 2022-11-25\\n', '\\nsunday 2022-11-27\\n', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T12:02:35-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560993391.html","post_id":7560993391,"result_date":"Thu Nov 24 2022 17:14:17 GMT+0000 ","title":"Spacious fully 1 bedroom 1 bathroom apt available In Philadelphia","description":"Spacious fully 1 bedroom 1 bathroom apt available In Philadelphia !!! At Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown . Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a cowering space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of St. Enjoy spacious living with your massive 1040 sf family room that boasts an amazing wood burning fireplace and two sliding doors to access your full-width rear deck and fenced yard. Eat-in kitchen with barstool seating on each side of the Philadelphia . New roof in 2020. Heated 2-car garage with workbench. Availability and Scheduling Your Tour! TEXT NOW (Robert) :-  show contact info","num_images":3.0,"lat":40.0018,"lng":-75.1179,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T12:10:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560983849.html","post_id":7560983849,"result_date":"Thu Nov 24 2022 16:52:08 GMT+0000 ","title":"incredible three-bedroom, one-bathroom apartment in an incredible loc","description":"This spectacular apartment has three bedrooms, one bathroom, and a parking space all to itself. It's in close proximity to the Main treet, where you can find shops, bars, and walking, biking and running trails.","num_images":14.0,"lat":40.028156,"lng":-75.226791,"attrs":"['3BR \/ 1Ba', '1200ft2', 'available now', '\\nthursday 2022-11-24\\n', '\\nfriday 2022-11-25\\n', '\\nsunday 2022-11-27\\n', 'apartment', 'laundry on site', 'carport', 'rent period: monthly']","posted_date":"2022-11-24T11:37:08-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560986655.html","post_id":7560986655,"result_date":"Thu Nov 24 2022 16:51:54 GMT+0000 ","title":"one bedroom one bathroom apartment in an amazing location!","description":"This is a great apartment among all the action on Main Street. There's a single carport and a single bedroom\/bathroom in this place. near proximity to excellent dining establishments, nightlife venues, and outdoor recreational opportunities.","num_images":6.0,"lat":40.028156,"lng":-75.226791,"attrs":"['1BR \/ 1Ba', 'available now', '\\nthursday 2022-11-24\\n', '\\nfriday 2022-11-25\\n', '\\nsunday 2022-11-27\\n', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T11:47:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560986211.html","post_id":7560986211,"result_date":"Thu Nov 24 2022 16:50:20 GMT+0000 ","title":"@@FuLLy Remodeled DupLex 2 bedrom 1bath Apt for rent in Philadelphia@@","description":"Fully remodeled cozy Duplex 2 bedroom and 1 full bath Apt for rent in Philadelphia,PA!! furnished apartment.\nText me if interested:~ jackanderson0089~G~M~A~I~L.com\nWe have infused a luxury living experience with artistic collaborative spaces. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create. Text me if interested:~ jackanderson0089~G~M~A~I~L.com\n","num_images":4.0,"lat":39.9597,"lng":-75.2024,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T11:46:20-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560980549.html","post_id":7560980549,"result_date":"Thu Nov 24 2022 16:29:39 GMT+0000 ","title":"Gorgeous 3 Bed 2 Bath House Available for Rent $890 month","description":"Beautiful 3 bedroom home for rent. Home will feature a large nice size kitchen, dining and living room along with 3 spacious bedrooms with alot of closet space. New wall to Laminate throughout the first floor, fresh paint, brand new countertops and cabinets with new gray carpets on the stairs and second floor. Minutes away from shopping and public transportation. University of Penn and drexel is about 10 minutes away. Must be employed and have guaranteed income.\nIf you interested please contact:-  📞📞 show contact info\n)\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\n:\nNewly Renovated 2 bedroom 2 bathroom home. At Arte, we have infused a luxury living experience with artistic collaborative spaces mere minutes from downtown Miami. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. Not only do we offer a coworking space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Arte is a unique community that allows you to get the best, and the most, out of St. Petersburg. Arte has an abundance of amenities for you to live your most convenient and creative life. Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, Arte is the perfect blank canvas. We are conveniently located between the Grand Central District and the Edge District, surrounded by the best that this vibrant city and Central Avenue apartments have to offer. The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat, and we provide the ultimate living experience for those new to the city and St. Pete natives alike.\n!If you interested ONLY CALL: show contact info\n)\n","num_images":12.0,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T11:25:39-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560977955.html","post_id":7560977955,"result_date":"Thu Nov 24 2022 16:20:21 GMT+0000 ","title":"Unit Apartment Fantastic Location One Bedroom\/One Bathroom","description":"This is a great apartment among all the action on Main Street. There's a single carport and a single bedroom\/bathroom in this place. near proximity to excellent dining establishments, nightlife venues, and outdoor recreational opportunities.\n","num_images":8.0,"lat":40.028156,"lng":-75.226791,"attrs":"['1BR \/ 1Ba', 'available now', '\\nthursday 2022-11-24\\n', '\\nfriday 2022-11-25\\n', '\\nsunday 2022-11-27\\n', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T11:16:21-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560969899.html","post_id":7560969899,"result_date":"Thu Nov 24 2022 16:07:51 GMT+0000 ","title":"Spacious 1 Bedroom 1 Bath Apt $500 Security Deposit to Move-in!","description":"Just 1st month's rent and $500 security deposit to move-in!!! The Society Hill Building is a beautiful mid-rise community located in the Society Hill\/Washington Square neighborhood of Center City. This building features spacious 1 bedroom 1 bath apartments, overlooking scenic Washington Square Park. The Society Hill Building is within walking distance of historic Old City as well as close to all forms of public transportation. 10 foot high ceilings, controlled access keypad entry, hardwood floors in some units, abundant natural light, dishwasher, microwave, high-efficiency individually controlled A\/C and heat. Laundry on each floor and pet-friendly! Brand new windows in all apartments. Pictures are of a similar unit.\n701 Sansom St #206","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1170ft2', 'available dec 21', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2022-11-24T10:48:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560967756.html","post_id":7560967756,"result_date":"Thu Nov 24 2022 16:04:05 GMT+0000 ","title":"Beautiful Rental in the Heart of Center City is Waiting for You","description":"Beautiful rental in the heart of Center City is waiting for you, a gorgeous sunny one-bedroom, one-bath condominium at the Packard Grande. Totally roomy loft-like open floor plan is south-facing with incredible skyline views which are pretty breathtaking!! High up on the 22nd floor, this unit has an ultimate open layout, southern views which really come to life at night providing an exciting feast for your senses and in the morning energizing sunrises...The open kitchen is huge perfect place for entertaining, stainless steel appliances, granite countertops, and ample cabinet space. Huge Spa-like bathroom features Italian ceramic tile chrome fixtures and a ceramic sink with storage vanity, huge bedroom with ample closet space as well.. be in the heart of Center City Philadelphia, come enjoy your new life.\n111 S 15th St #2209","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '761ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2022-11-24T10:41:05-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560966424.html","post_id":7560966424,"result_date":"Thu Nov 24 2022 16:03:09 GMT+0000 ","title":"Unique Townhomes Offer an Exciting Opportunity to Enjoy Luxury Living!","description":"Introducing SoNo26, a premier living destination in Philadelphia?s Northern Liberties. Our unique townhomes offer an exciting opportunity to enjoy luxury living while being in the center of all the city has to offer. Stroll and shop along Liberty Walk or enjoy a gourmet meal at one of the critically acclaimed restaurants, bars and cafes. The homes at SoNo26 feature all of the high quality finishes you?ve come to expect from a Premier Access property. Step inside your front door and you will be greeted with a spacious open concept living and dining area with beautifully designed windows that offer magnificent natural sunlight. The living area flows nicely into the top of the line gourmet kitchen which features Arctic Quartz countertops, Bosch appliances and custom cabinets making this kitchen the perfect space to entertain friends. Open the sliding glass doors and you will find your back patio where you can enjoy your morning cup of coffee or glass of wine after dinner. Leading off of the kitchen are stairs to take you down to your full finished basement with washer and dryer and half bath giving you a great added space for guests or an entertainment center. Head back up the stairs and continue to the second floor where you will find two spacious bedrooms with large closets and plenty of storage as well as two bathrooms for your convenience. On the upper floor you will enter into the large master suite with incredible walk in closets and master bath with double sinks that will make you feel right at home. On the top floor you will find your unbelievable roof deck that offers spectacular views of the Philadelphia skyline making this a relaxing at home retreat. To add on to all that SoNo26 has to offer, each unit comes with 1 car parking to ensure you never have a problem finding a space for your car. These brand new units will not last long set up your showing today and come home to SoNo26!\n318 Potts Pl","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 3Ba', '2016ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:36:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560970902.html","post_id":7560970902,"result_date":"Thu Nov 24 2022 15:56:15 GMT+0000 ","title":"Perfect 2 bedroom, 1.5 bathroom Apartment In philadelphia","description":"Perfect 2 bedroom, 1.5 bathroom Apartment In philadelphia , Hardwood floors, Abundant Light, Granite Countertops. Easy access to Lake Shore Drive, Windows Galore. Walking distance to Montrose Harbor.. The kitchen features new appliances, including a gas stove and a stainless steel fridge and wall-mounted microwave.. Within our walls, you will find an experience like no other. The community we have built has something to nurture the creativity in each and every one of our residents, no matter their passion. space and a private conference room to collaborate with colleagues or friends, but we also offer a beautiful Makers Space, a rotating art gallery featuring work from local artists, and a fitness center to refresh, re-energize, or to simply unplug. To put it simply: Spend some time working or winding down in our lustrous lounge adorned with artwork, bike to your favorite local coffee shop, go for a swim in our pool, host your friends on the rooftop deck whatever you want to accomplish or to create, The Central Avenue Trolley is easily accessible, and there are plenty of great biking and walkability options as well for you to grab some local food or enjoy an afternoon of shopping and entertainment Artes location cannot be beat. Pete natives alike.! If you would like to rent this townhouse of mine, please contact me here- show contact info","num_images":4.0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1.5Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T10:52:15-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560970643.html","post_id":7560970643,"result_date":"Thu Nov 24 2022 15:55:23 GMT+0000 ","title":"Renovated Bi-level 1 bedroom apartment in the heart of Rittenhouse Squ","description":"Renovated Bi-level 1 bedroom apartment in the heart of Rittenhouse Square!! This boutique vintage building has all of the historic charm of a converted brownstone paired with modern updates throughout making for stylish and comfortable living. Enjoy restored hardwood floors and a kitchen with brand new appliances and a huge in unit laundry closet. Upstairs you will find a large bedroom with lots of windows that can accomodate any size bed and perfect for at home office set up. There is also a brand new renovated bathroom. The spiral staircase provides access to both floors but also exterior access to hallways on both floors for easy move in. PETS WELCOME! Many parking garages close by. Only first month and 1 month security needed at signing.\n2015 Walnut St #201","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:51:23-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560963101.html","post_id":7560963101,"result_date":"Thu Nov 24 2022 15:52:11 GMT+0000 ","title":"LUXURY AND BEAUTIFUL, NEW CENTER CITY PHILADELPHIA APARTMENTS!!","description":"Luxury Apartments In Center City Philadelphia. Beautiful, new center city Philadelphia apartments; our building has innovative, efficiently designed spaces that take advantage of every square inch for your comfort and convenience. The modern approach allows us to make your wish list achievable not as a dream in the future but right now when you need it most. Center City apartments at its best! Offering studios, 1 bedroom, and 2 bedroom apartment homes. Conveniently located just a few blocks from Rittenhouse Square, and is near the University Of The Arts (UARTS), Peirce College, Moore College of Art and Design, and Drexel College of Nursing. Be in the center of everything! Walk outside your front door and be steps away from Dilworth Park, Rittenhouse Square, the Avenue of the Arts, and countless restaurants, cafes, bars, and shops. See why Avenir is your ideal Center City apartment. People who participate in group fitness make it to the gym 45% more often! Experience the community within your community. Take a virtual spin class when it s convenient. Plan a Friday night workout with old friends or welcome a new neighbor to the community. Work out on your schedule, not someone else's! ** Photos are of model units * Prices and availability subject to change on daily basis **\n42 S 15th St #0B1BA","num_images":4.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '314ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:24:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560969308.html","post_id":7560969308,"result_date":"Thu Nov 24 2022 15:50:27 GMT+0000 ","title":"LIGHT ,BRIGHT, SOUTH FACING UNIT READY FOR YOU TO CALL HOME!!","description":"Washington Square| Hopkinson House - Light ,Bright, South facing unit ready for you to call HOME. Short or Long term unfurnished Lease welcome. This open floor plan has an abundance of storage, character and charm. WASHER & DRYER in unit, Garage Parking available for lease below , private outdoor space and a rooftop POOL (additional fee) are just a few amenities in this amazing, well managed building. Wood floors, spacious balcony, glass double doors, generous built ins and delightful, soothing VIEWS of the Delaware River and Cityscape await! Retail, Restaurants and Historic sites are all within minutes of your front door! Universities, Hospitals, Major Public transportation all near by. Easy Airport & Train accessibility. Enjoy Washington Square Park as your front yard!\n604-36 S Washington Sq #1209","num_images":5.0,"lat":39.9474,"lng":-75.1473,"attrs":"['1BR \/ 1Ba', '778ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:46:27-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560947405.html","post_id":7560947405,"result_date":"Thu Nov 24 2022 15:48:40 GMT+0000 ","title":"2 Beds | 1 Baths !! 1517 W NORRIS STREET, PHILADELPHIA, PA 19121","description":"Apartment - PHILADELPHIA, PA  show contact info\nConveniently located apartment close to Temple nice views of the Campus and recently updated units available\n","num_images":8.0,"lat":39.9811,"lng":-75.174,"attrs":"['1BR \/ 1Ba', '2262ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'detached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T09:22:40-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560963800.html","post_id":7560963800,"result_date":"Thu Nov 24 2022 15:44:54 GMT+0000 ","title":"Efficiently Designed Spaces Luxury Apartments in Center City Philadelp","description":"Luxury Apartments In Center City Philadelphia. Beautiful, new center city Philadelphia apartments; our building has innovative, efficiently designed spaces that take advantage of every square inch for your comfort and convenience. The modern approach allows us to make your wish list achievable not as a dream in the future but right now when you need it most. Center City apartments at its best! Offering studios, 1 bedroom, and 2 bedroom apartment homes. Conveniently located just a few blocks from Rittenhouse Square, and is near the University Of The Arts (UARTS), Peirce College, Moore College of Art and Design, and Drexel College of Nursing. Be in the center of everything! Walk outside your front door and be steps away from Dilworth Park, Rittenhouse Square, the Avenue of the Arts, and countless restaurants, cafes, bars, and shops. See why Avenir is your ideal Center City apartment. People who participate in group fitness make it to the gym 45% more often! Experience the community within your community. Take a virtual spin class when it s convenient. Plan a Friday night workout with old friends or welcome a new neighbor to the community. Work out on your schedule, not someone else's! ** Photos are of model units * Prices and availability subject to change on daily basis **\n42 S 15th St #1B1BA","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '522ft2', 'available dec 2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:26:54-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560967595.html","post_id":7560967595,"result_date":"Thu Nov 24 2022 15:44:31 GMT+0000 ","title":"Outdoor Grilling Stations, Contact us Today, Modern Amenities","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* Easy Freeway Access\n* Minutes from Restaurants, Shopping, and Much More\n* Pet Salon\n* Professionally Managed\n* Fitness Studio\n* Spa\n* TV Lounge\n* Swimming Pool\n* Sun Deck\n* Community Lounge\n* Outdoor Grill Area\n* Bark Park\n* Yoga Lounge\n* Billiards","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '758ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:40:31-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560967168.html","post_id":7560967168,"result_date":"Thu Nov 24 2022 15:42:56 GMT+0000 ","title":"SPACIOUS CORNER 2 BED, 1 BATH IN NORTHERN LIBERTIES","description":"Spacious corner 2 bed, 1 bath in Northern Liberties and just steps from Fishtown! MOVE IN SPECIAL! Only 1st month's rent and HALF month's security deposit due at lease signing. This second floor apartment in newly constructed 18 W. Girard comes with washer dryer in unit, stainless steel appliances, lots of storage, hardwood floors, juliet balcony and an open floorplan with an elevator in the building, bike storage and pet friendly for $25\/month and a one time $250 deposit! Come and check it out before it's gone! Available December 10th. Please note we have the same layout on the 4th floor coming for a mid January move in date if that timing is preferable.\n18 W Girard Ave #204","num_images":5.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '875ft2', 'available dec 10', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:38:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560961339.html","post_id":7560961339,"result_date":"Thu Nov 24 2022 15:41:09 GMT+0000 ","title":"LIVE AT PARK TOWNE PLACE APARTMENT HOMES IN CENTER CITY!!","description":"Live at Park Towne Place Apartment Homes in Center City Philadelphia, and you'll be blocks from the center of nightlife in Logan Square and Rittenhouse Square. Unit features modern kitchens, quartz countertops, stainless steel appliances, in-unit washers and dryers, breakfast bars, pendant lighting, tile backsplashes, wood plank flooring throughout, walk-in closets. Stunning city and museum views are offered in a variety of floor plans! Mainstreet Market and Caf , featuring gourmet coffee and tea and much more! Fitness center with Technogym equipment, Queenax boxing gym, yoga\/spin studio with indoor\/outdoor workout space. It boasts Philadelphia's largest pools, an art studio, fitness center with boxing gym, yoga\/spin studio, social lounge with demonstration kitchen, gourmet market and cafe, outdoor lounge with fire pit, 24-hour concierge, 24\/7 package acceptance, resident shuttle service to Center City and University City and more. Make Whole Foods as your second kitchen conveniently located just 1 block away. Our apartments are within one mile of several institutions of higher education: Drexel University, Temple University, University of Penn, CHOP, Moore college of Arts, Community College of Philadelphia. You won't find a better building to live with amenities in the Fairmount Area. Park Towne Place includes 948 apartment and penthouse homes within four high-rise towers. The community is nestled between green acres on the Benjamin Franklin Parkway in the heart of Center City Philadelphia's Museum District. Park Town. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n2200 Benjamin Franklin Pkwy #0B1BA","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['0BR \/ 1Ba', '425ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:17:09-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560964874.html","post_id":7560964874,"result_date":"Thu Nov 24 2022 15:34:46 GMT+0000 ","title":"Sunny 1 bedroom full floor apartment in Rittenhouse Area","description":"Sunny 1 bedroom full floor apartment in Rittenhouse Area. 2nd floor walk up in bright corner building. Wood floors, New kitchen in 2018 including wood cabinetry, appliances and washer\/dryer. Full tile bath with tub\/shower combination. Wood burning fireplace in spacious bedroom. Just blocks to Rittenhouse Square in the heart of everything! Close to shopping, theater, galleries, parks. Easy access to public transportation. and major highways. Owner supplies 2 window A\/C units. Owner pays heat, water, hot water. Tenant pays electric. 1st, last and 1 month security deposit. $50 application fee per person on lease. Pets and any pet fees are at sole discretion of owner. 3 blocks to Rittenhouse Square. Close to Restaurants, Theatre and shopping. Easy access to SEPTA, PATCO, AMTRAK and major highways.\n1701 Pine St #1","num_images":5.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '800ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:30:46-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560958424.html","post_id":7560958424,"result_date":"Thu Nov 24 2022 15:27:32 GMT+0000 ","title":"LARGE 1ST FLOOR 1 BED APARTMENT WITH AN HISTORIC TOWNHOUSE FEEL!!","description":"Large 1st floor one bedroom apartment with an historic townhouse feel. This unit features a light filled living area with kitchen featuring stainless steel appliances with Gas cooking! Hardwood flooring throughout! Central Air! Unit door leads right into a shared common space perfect for grilling and entertaining. Terrific Art Museum location make this an amazing value. Shared laundry and storage in basement. Dogs and cats under 35 lbs ok.\n1504 Mount Vernon St #1\n","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '667ft2', 'available now', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2022-11-24T10:06:32-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560962597.html","post_id":7560962597,"result_date":"Thu Nov 24 2022 15:26:10 GMT+0000 ","title":"Make This Fabulous Apartment in a Great Location Your New Home!","description":"Newer high end rehab in Fitler Square Area. This Loft Like 2 bedroom with wonderful light (Northern & Southern Exposure) has it all. Gorgeous kitchen open to living area with granite countertops, stainless appliances, gas range and built-in microwave. Central Air, recessed lighting, high ceilings and hardwood floors add beauty and convenience. The Bathroom has double sinks and stone floors and the bedrooms have Berber carpeting, one with a built in armoire. Other amenities include, free wireless internet and washer and dryer in the apartment. Make this fabulous apartment in a great location your new home! This is a Non Smoking Apartment in a Non Smoking Building. Street Parking Only. Available January 1st 2023\n2227 Kater St #3RD FL","num_images":6.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available jan 1, 2023', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:22:10-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560962333.html","post_id":7560962333,"result_date":"Thu Nov 24 2022 15:25:17 GMT+0000 ","title":"Large 4 bedroom house for rent","description":"Ready to move? Well your just in time for the holidays. This 4 bedroom home features 4 bedroom, 1 bathroom. Fully renovated, new flooring, finished basement and backyard. Send a message to do a intake and schedule a tour.","num_images":0.0,"lat":39.956086,"lng":-75.23474,"attrs":"['4BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:21:17-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560957764.html","post_id":7560957764,"result_date":"Thu Nov 24 2022 15:25:11 GMT+0000 ","title":"PARKING IS INCLUDED WITH THIS FANTASTIC AND SPACIOUS 2 BED, 2 BATH!","description":"PARKING INCLUDED with this fantastic and spacious 2 Bedroom, 2 Bathroom Bi-Level Apartment w\/Garden In The Heart Of The Art Museum Area! Hardwood Floors, Upgraded Kitchen w\/Dishwasher + Washer\/Dryer. No Pets Allowed. First month, last month & security deposit due at lease signing. $50 application fee per applicant.\n2307 Fairmount Ave","num_images":5.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1.5Ba', '1164ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:04:11-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560958543.html","post_id":7560958543,"result_date":"Thu Nov 24 2022 15:23:56 GMT+0000 ","title":"Ready to move?","description":"We have multiple properties available for rent from the range of $1,250-$2,300 monthly. Properties are located in west and Southwest Philadelphia. Bad or no credit (NO PROBLEM). Reply to this message with your price range, how many occupants and the size house or apartment you are looking for. Don't miss out on this opportunity. Serious inquiries only.","num_images":0.0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:06:56-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560961602.html","post_id":7560961602,"result_date":"Thu Nov 24 2022 15:22:07 GMT+0000 ","title":"Newly renovated house for rent","description":"Ready to move? Well your just in time for the holidays. This 3 bedroom home features 3 bedroom, 1 bathroom. New Laminate flooring throughout, new kitchen, deck, finished basement and garage. Send a message to do a intake and schedule a tour.","num_images":0.0,"lat":39.936534,"lng":-75.232002,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2022-11-24T10:18:07-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560960738.html","post_id":7560960738,"result_date":"Thu Nov 24 2022 15:18:51 GMT+0000 ","title":"Three bedroom home in west Philadelphia","description":"Ready to move? Well your just in time for the holidays. This 3 bedroom home features 3 bedroom, 1 bathroom. Laminate flooring throughout first and second floor, partially finished basement. Send a message to do a intake and schedule a tour.","num_images":0.0,"lat":39.9612,"lng":-75.2303,"attrs":"['3BR \/ 1Ba', 'available dec 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2022-11-24T10:14:51-0500"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/7560960568.html","post_id":7560960568,"result_date":"Thu Nov 24 2022 15:18:12 GMT+0000 ","title":"Hardwood Floors, On-Site Maintenance, Dishwasher","description":"Bedrooms: 1Bathrooms: 1Square Feet: 506Date Available: 2022-11-23Address: 2601 Poplar St\nFairmount North is a brand new apartment building for residents who love Philadelphia and all that the city has to offer. Living at Fairmount North will bring the best public spaces, right to your door. Along with the Fairmount and West Girard Avenue retail corridors, which provide great options for shopping and dining, the building is within walking distance to Fairmount Park, the Schuylkill River Trail, and Kelly Drive.\nAmenities Include:\nOn-Site Management\nAmazon Package Locker System\nDishwasher\nRoof Deck\nHardwood Floors\nState-of-the-Art Fitness Center\nWasher\/Dryer\nElectronic Thermostat\nRecycling\nMicrowave\nElevator\nOn-Site Maintenance\nCall:  show contact info\nFor more information, visit us at: https:\/\/alterrapropertyliving.com\/igohvzr6\/fairmount-northPricing and availability are subject to change.\n","num_images":9.0,"lat":39.972839,"lng":-75.17923,"attrs":"['1BR \/ 1Ba', '506ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2022-11-24T10:14:12-0500"}]