[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/glen-mills-meticulously-maintained\/7634096617.html","post_id":7634096617,"title":"Meticulously maintained upgraded home in the community of FoxHill Farm","description":"Meticulously maintained and lovingly upgraded home in the community of Fox Hill Farms.  This home has been enhanced with beautiful  hardwood floors throughout the main level.  The entry way welcomes you into the expansive light filled living room.  To the right you will find the updated kitchen with large island, tons of cabinet storage, granite countertops, stainless steel appliances and breakfast room all leading to the screened in sunroom.  Sit out in the sunroom and enjoy the peaceful views while drinking your morning coffee or sipping wine at the end of the day without worrying about critters.  The kitchen overlooks the family room featuring a gas fireplace  to keep you warm on those chilly days and nights and lots of windows bringing in natural light.  Off the family room you will find the primary suite with dual closets, built in safe, attached primary bath boasting double sinks, walk-in shower and linen closet.  On the other side of the home you will find an additional bedroom with dual closets and an additional full bath just steps away. You will also find  a laundry room and access to the attached garage.  Another feature of this home is a generously sized finished basement with walk out access to the yard.  This finished area features built in bookshelves and plenty of room for entertaining, hobbies, or just hanging out.  Amenities in this superior neighborhood include a Clubhouse, Community Activities, Indoor and Outdoor Pools, Walking Trails, Library, Tennis courts, Bocce Ball courts, Gym and Game Room.  The HOA covers all your lawn maintenance and landscaping, snow removal and trash pickup.  This home is ready for it's new occupant to move right in and start enjoying carefree living.","num_images":9,"lat":39.9015,"lng":-75.5049,"attrs":"['2BR \/ 2Ba', '2743ft2', 'available now', '\\nsunday 2023-06-18\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T22:25:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedrooms-great\/7634097874.html","post_id":7634097874,"title":"Beautiful 2 bedrooms, great location, available august 1st.","description":"Available August 1st .\n2 bedroom\/1 bath 2nd floor unit. Apartment features 2 bedrooms, living room, kitchen, hardwood floors, bathroom with a bathtub. Washer and dryer in unit.\nGreat location: Walking distance from UPENN, UPENN Vet, HUP, CHOP, USP. Around\nthe corner from Clark Park. Trolley stop on the corner for easy access to Center City.\nClose to shopping and various restaurants. Within Penn Alexander School catchment.\nTenant pays electricity and gas bill. Yearly lease. $30 application fee. Three months'\nrent required to move in. Please call or text to schedule a showing.\n","num_images":9,"lat":39.950434,"lng":-75.209282,"attrs":"['2BR \/ 1Ba', 'available aug 1', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T22:32:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-riverwest-studio-with\/7634092455.html","post_id":7634092455,"title":"COZY RIVERWEST STUDIO WITH NEW KITCHEN & BATHROOM – FULLY FURNISHED","description":"Bright, cozy studio apartment for rent at the Riverwest Condominium with good light and views, that comes fully furnished. Large studio unit with functional layout, with a separate study room, and great closet space. Completely renovated kitchen, with black granite countertops, stainless steel sink, backsplash and deep cherry cabinets, stainless steel frig and grey kitchen tile. Renovated bathroom with new vanity, grey tiled floor, wraparound subway tile and bathtub with shower.  Rent is $1,300 per month and includes all utilities. Durable oak hardwood floors and large air conditioning unit. Great building and apartment for graduate students and young professionals. Centrally located, on the Penn shuttle route, with deluxe gym on 2nd floor & restaurant scene at your doorstep.  Apartment is available September 1, 2023 for a 1 or 2-year lease. Apartment is north-facing, with little street noise. Apartment comes fully furnished and is move-in ready, with small rental fee for use of the furniture. (Full furniture list is available). Please text or e-mail Doug for more information.\n•Large bright studio (450 Sq. Ft.) with good light & views of the Murano\n•ALL UTILITIES INCLUDED in rent (electric, water, heating, air conditioning)\n•Comcast equipped -- 7 premium channels, including HBO, included in the rent. 32’’ inch TV included.\n•State-of-the-art renovated fitness center\n•24 Hour lobby attendant \/ Security with controlled key access\n•Great Center City location, with a great restaurants in the building (Mix) and across the street\n•Convenient dining, shopping and entertainment locale (3 blocks from Rittenhouse Square, 1.5 blocks to Trader Joe’s, less than a block from the Stephen Starr restaurant El Rey, Jose Garces’ Village Whiskey and Tinto and the Mutter Museum)\n•5 minute commute to Penn\/Drexel & Penn Hospital via Penn\/Drexel shuttle route\n•Walking distance to Jefferson Hospital, Art Institute, SEPTA’s Suburban Station and Amtrak \/SEPTA 30th St. Station\n•2 Blocks from the fabulous and packed Schuylkill River Banks Running\/Walking Path\n•Business center with high-speed Internet access with common areas for study sessions\n•Large laundry facilities in building\n•Minutes to public transportation and major highways\n•Contemporary renovated grand lobby & complete on-site management\n•Adjacent parking garage available, with discounted monthly charge. Monthly parking garage across the street for roughly $200.\nAvailable September 1, 2023.\nOwner lives in Philadelphia; always accessible; this is the only apartment he manages. Additional photos and videos of the building and apartment are available upon request.","num_images":11,"lat":39.952291,"lng":-75.175407,"attrs":"['0BR \/ 1Ba', '450ft2', 'available sep 1', 'air conditioning', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T22:02:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-story-condo-in\/7634082185.html","post_id":7634082185,"title":"Beautiful 2-story condo in the historic Washington Mews","description":"Beautiful 2-story condo in the historic Washington Mews, the most sought-after address in Washington Square West, is available for rent! This gated community with lovely courtyards, gardens and paver pathways throughout makes it a joy to come home where you can get to know your neighbors or enjoy a summer afternoon in your private patio. This condo is freshly painted and features hardwood floors throughout, an open floor plan with a large living\/dining area with wood-burning fireplace, a fully equipped kitchen with quartz counter-tops, main-floor laundry with front-loading washer and dryer, 2 large bedrooms, a guest bathroom on the main level and a full bathroom upstairs. Outdoor patio furniture is provided for your use. This is the best location with public transportation, groceries, restaurants and amenities within the best neighborhoods in Center City, including Rittenhouse Square, Queen Village\/Bella Visa, Passyunk, and of course, Washington Square. Pets considered on a case-by-case basis. Schedule your tour now!","num_images":24,"lat":39.944071,"lng":-75.16052,"attrs":"['2BR \/ 2Ba', '1140ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T21:08:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-for-rent\/7634070891.html","post_id":7634070891,"title":"House for Rent","description":"Three bedroom House,  Living Room, Dining room, Breakfast room, Kitchen,  Washer and Dryer Fridge, Stove\n1 \/1\/2 Bathroom,  Basement, Backyard  hardwood floors.\n","num_images":0,"lat":39.9612,"lng":-75.2303,"attrs":"['3BR \/ 1.5Ba', 'available jun 26', '\\ntuesday 2023-06-27\\n', '\\nwednesday 2023-06-28\\n', '\\nthursday 2023-06-29\\n', 'house', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T20:15:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bi-level-new-2br\/7634067569.html","post_id":7634067569,"title":"Beautiful Bi Level New 2BR 2BA w\/ H\/W Floors, Central Air, Gym","description":"Welcome to The Haven! A Beautiful Brand Self Sustaining North Brewerytown Community Featuring 5 Stunning Buildings.\nThis Spacious Bi-Level 2BR 2BA New Construction Features W\/D In Unit, Open Living Room\/Kitchen Combo, D\/W, Central Air, Stainless Steel Appliances, H\/W Floors, and Natural Light.\nAvailable Now For Lease w\/ Luxury Amenities i.e Spacious Gym w\/ Lululemon Studio Mirror, Yoga Room\/Studio w Lululemon Studio Mirror, Lounge, Elevated Study, and Private Storage Units at $49\/month.\nAn Ideal Location with Easy Access to Public Transportation, and Access to Major Highways. Conveniently Located Close to Everything Girard Ave Has to Offer; Crime and Punishment Brewing Co.. Green Eggs Cafe, Rybrew, Gyms, Yoga Studios, Coffee Shops, etc. The Other Buildings Feature Community Work Spaces, Close Proximity to Temple. Call For Availability Today and Set Up a Tour.\n","num_images":24,"lat":39.980372,"lng":-75.170892,"attrs":"['2BR \/ 2Ba', '1031ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T20:02:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-church-renovation\/7634063364.html","post_id":7634063364,"title":"Gorgeous Church Renovation 1BR Loft w\/ W\/D In Unit, Central Air","description":"This Beautiful Bi-Level 1BR Loft Features Hardwood Floors, Central Air, Exposed Brick, Washer and Dryer in Unit, Pin Code Entry, Natural Light, and High End Finishes Throughout.\nThese Gorgeous, One of a Kind Units are the Perfect Combination of Antiquity and Modernism, Featuring Stained Glass Windows, and Original Woodwork to Open Layouts, Calacatta Quartz Countertops. Exposed Brick, Luxury Shower Towers, Stainless Steel Appliances, and High-End Finishes Throughout.\nAvailable For Lease w\/ Luxury Amenities i.e Spacious State of the Art Gym w\/ Peloton, Yoga Room\/Studio w\/ Lululemon Studio Mirror, Entertainment Lounge w\/ TV, Game Room and Fireplace, Elevated Study, and Private 5 x 5 Storage Units at $49\/month!\nAn Ideal Location with Easy Access to Public Transportation, and Access to Major Highways. Conveniently Located Close to Everything Girard Ave Has to Offer; Crime and Punishment Brewing Co.. Green Eggs Cafe, Rybrew, Gyms, Yoga Studios, Coffee Shops, etc.\nCall For Availability Today and Set Up a Tour!\n","num_images":18,"lat":39.980372,"lng":-75.170892,"attrs":"['1BR \/ 1Ba', '600ft2', 'available jun 20', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T19:44:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-new-2br-2ba\/7634065085.html","post_id":7634065085,"title":"Spacious New 2BR 2BA w\/ Private Roof Deck","description":"Welcome to The Haven! A Beautiful Brand Self Sustaining North Brewerytown Community Featuring 5 Stunning Buildings.\nThis Spacious 2BR 2BA New Construction Features an Open Layout w\/ W\/D In Unit, D\/W, Central Air, Kitchen Island, Stainless Steel Appliances, H\/W Floors, Private Roof Deck, and Natural Light.\nAvailable For Lease w\/ Luxury Amenities i.e Spacious Gym w\/ Peloton, Yoga Room\/Studio w\/ Lululemon Studio Mirror, Lounge, Elevated Study, and Private Storage Units at $49\/month.\nAn Ideal Location with Easy Access to Public Transportation, and Access to Major Highways. Conveniently Located Close to Everything Girard Ave Has to Offer; Crime and Punishment Brewing Co.. Green Eggs Cafe, Rybrew, Gyms, Yoga Studios, Coffee Shops, etc. The Other Buildings Feature Community Work Spaces, Spacious Private Balconies and Roof Decks Overlooking a Beautiful Park. Close Proximity to Temple. Call For Availability Today and Set Up a Tour.\n","num_images":24,"lat":39.980372,"lng":-75.170892,"attrs":"['2BR \/ 2Ba', '800ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T19:52:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-watch-the-planes-land\/7633941490.html","post_id":7633941490,"title":"WATCH THE PLANES LAND!","description":"FOR RENT AUGUST, 2023\nCENTER CITY ONE\n1326 SPUCE ST.\nLARGE 29TH FLOOR ONE BEDROOM\nBroad & Spruce\nCUSTOMIZED APARTMENT WITH\nSWEEPING EAST AND SOUTH VIEWS!\n29th floor views across the City as you watch the planes land.\nWatch fireworks from the stadiums at Center City’s very best location—Broad & Spruce close to everything Center City offers—Walk to Office District, Rittenhouse, Midtown Village\/Gayborhood, Society Hill, Passyunk and hundreds of restaurants + theater, fitness and shopping with instant access to all public transportation! 1 bedroom (approx. 800 square feet) with spacious living room PLUS dining area, custom kitchen and bath plus double pane bedroom windows for ultra-quiet and 2 balconies and built-out closets throughout.  Newly decorated hallways!\nTHIS IS A TOTALLY SMOKE-FREE BUILDING.\nAll contemporary amenities including D\/W, heavy-duty W\/D in your apartment, wall-to-wall carpet, ceramic tile in foyer, kitchen and bath; new central AC\/Heat (you control), generous closet space, specially sound-conditioned bedroom, PLUS an available and responsive landlord. INCLUDES 1-2 FULL PRIVILEGE GYM MEMBERSHIPS.\n(Rent includes cable, gas and heat.)\nPriced at only $2,150\/month to rent quickly to quality tenants.\n1-2 year lease (extended lease may be available).\nNo dogs and no smoking please; first, last and security deposit required. Ideal for a quiet, upscale professional or couple.\nAVAILABLE FOR AUGUST 15, 2023 OCCUPANCY.\nEmail or text\/call Rick (owner) at  show contact info\nfor immediate viewing.","num_images":15,"lat":39.946892,"lng":-75.164089,"attrs":"['1BR \/ 1Ba', '800ft2', 'available aug 15', 'cats are OK - purrr', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T12:48:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/oreland-large-bedroom-apartment-2nd\/7633936799.html","post_id":7633936799,"title":"Large 2 Bedroom Apartment - 2nd Floor","description":"Large 2 bedroom 1 bath apartment for rent. 2nd Floor.\nJust painted. Nice size rooms, real hardwood floors throughout, tilt-in windows, refrigerator, dishwasher, basement with washer\/dryer hookup, and storage. Off-street parking. Dead end street.\nConveniently located close to Route 309, PA Turnpike (Fort Washington), and within walking distance of Oreland Train Station, bus & shopping area.\nNo Smoking. No Pets.\n$1,600\/month plus electric, gas & water. The owner pays for sewer and trash. Available now. First month, last month and 1 month security deposit required.\n","num_images":7,"lat":40.115857,"lng":-75.189142,"attrs":"['2BR \/ 1Ba', '960ft2', 'available now', 'apartment', 'w\/d hookups', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T12:33:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-laundry-in-unit-central\/7633936620.html","post_id":7633936620,"title":"Laundry in Unit, Central Location, Ideal Location","description":"The Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nCommunity Features\n* Professionally Managed\n* Fitness Studio\n* Yoga Lounge\n* Community Lounge\n* TV Lounge\n* Billiards\n* Pet Salon\n* Spa\n* Outdoor Grill Area\n* Sun Deck\n* Swimming Pool\n* Minutes from Restaurants, Shopping, and Much More\n* Easy Freeway Access\n* Bark Park","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1110ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T12:33:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fitness-center-incredible\/7633936249.html","post_id":7633936249,"title":"Fitness Center, Incredible Features, Central Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nBe the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '815ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T12:32:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/oreland-very-nice-bedroom-bath-home-for\/7633926128.html","post_id":7633926128,"title":"Very Nice 3 Bedroom 1 Bath Home For Rent!  Nice Yard!","description":"Beautiful Home located on a quiet block in the Heart Of Oreland! First floor: Large Living room w\/recessed lighting, Oak floors and Neutral decor. Eat in Kitchen boast ceramic floors, stainless steel appliances and plenty of room for the Chef of the house! Exit Kitchen to patio and large back yard...just in time for the Summer BBQ! Second floor: 3 bedrooms w\/ample closet space , ceiling fans throughout and hall bathroom! Finished basement is great for entertaining or just watching the game! House is located in Award Winning Springfield School District! Home is walking distance to Oreland train station and the center of Town!","num_images":12,"lat":40.1132,"lng":-75.1869,"attrs":"['3BR \/ 1Ba', '1102ft2', 'available aug 1', 'air conditioning', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T12:02:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedroom-apartment-in\/7633922805.html","post_id":7633922805,"title":"Two bedroom apartment in South Philly","description":"Sunny two bedroom apartment in nice and safe South Philly area. Close to public transit and subway. Walking distance to supermarket and many shops and restaurants. Hardwood floor, tiled kitchen and bathroom. Marble counter top. Both bedrooms and living have ceiling fans. Unit is on second floor. There is a large balcony for the unit! Heat, hot water and water are included! Apartment is for the entire second floor. No pets.  Available Aug. 1. Yearly lease. No corporate leasing or AirBNB. Need $45 for credit check. Need first month, last month and one month deposit to move in.","num_images":8,"lat":39.935317,"lng":-75.161798,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available aug 1', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T11:51:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-you-will-love-this-bed-bath\/7633916380.html","post_id":7633916380,"title":"You will love this 1 bed \/ 1 bath. A Higher Quality of Living!","description":"Silk Factory Lofts 200 S Line St Lansdale, PA 19446  show contact info\nUnit Information: 1 Bedroom | 1 Bath  Unit Size: 815 sq ft  Monthly Rent: $1940 Lease Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-Month Unit Includes:✓ Cable & Hi-Speed Internet Ready✓ Central Air Conditioning✓ Dishwasher✓ Full Size Washer & Dryer✓ Large Windows✓ Range \/ Oven✓ Refrigerator\/Freezer✓ Secured Building Access✓ Storage Spaces✓ Upgraded Kitchens in Select ApartmentsProperty Description: SEE WHAT YOU'VE BEEN MISSING  Live the luxurious lifestyle you're looking for in a building rich with history enhanced with modern amenities at Silk Factory Lofts. Our Lansdale, PA apartments feature open-concept loft-style layouts with high ceilings, chic kitchens, and oversized windows that make each home bright and welcoming. Communal spaces are designed with residents' comfort and convenience in mind at our Lansdale apartments. Residents can hang out in our upscale lounge, maintain work out goals at the on-site fitness center, and so much more at our apartments in Lansdale, PA.Property Amenities: ✓ 18' Long Shuffle Board✓ 2 Weber Propane Grills✓ Dog Wash Room✓ Elevator✓ Game Room & Free Wi-Fi✓ Laundry Facilities✓ Monthly Community Events✓ Package Service✓ Pool Table✓ Vintage Building✓ Beautifully Landscaped Grounds with Access to Local Businesses✓ Close to Montgomeryville Mall and Routes 202 & 309✓ Courtyard featuring tasteful Outdoor Seating and Fire Pits✓ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting✓ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi✓ Free Parking - 2 Spaces per Apartment Home + Guest Parking✓ Lobby Area with Complimentary Coffee✓ Maintenance-Free Lifestyle✓ Professional On-Site Management Team✓ Within Walking Distance to Trains Website: https:\/\/www.silkfactoryapts.com\/Call us today!  show contact info\nMon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMPet Ownership Policy: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephIncome requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITYDD359858249845\n","num_images":17,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '815ft2', 'available jul 26', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T11:30:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-amazing-bed-bath-at-silk\/7633915164.html","post_id":7633915164,"title":"Amazing 2 bed, 1 bath at Silk Factory Lofts! Washer\/dryer included!","description":"Silk Factory Lofts200 S Line St Lansdale, PA 19446Pricing: $2290\/Month*Bedrooms: 2  Bathrooms: 1 Square Footage: 1060 sq ft show contact info\nFeatures in this apartment home:❖ Cable & Hi-Speed Internet Ready❖ Courtyard View in select apartments❖ Dishwasher❖ Full Size Washer & Dryer❖ Large Windows❖ Range \/ Oven❖ Refrigerator\/Freezer❖ Secured Building Access❖ Storage Spaces❖ Upgraded Kitchens in Select ApartmentsAbout the community:  SEE WHAT YOU'VE BEEN MISSING  Discover an upscale lifestyle at Silk Factory Apartments. Our landmark historic building features a brick exterior, soaring ceilings, large windows, and a beautiful courtyard with outdoor lounge seating and firepits, a picnic and grilling area with gas grills, and a community herb garden. Inside your spacious loft-style apartment you'll find modern style from your updated kitchen with dishwasher, stove, refrigerator, and microwave, to central air conditioning, and a private in-home washer and dryer. Call us today for a tour! Amenities at our property:❖ 18' Long Shuffle Board❖ Dog Wash Room❖ Elevator❖ Game Room & Free Wi-Fi❖ Laundry Facilities❖ Monthly Community Events❖ Package Service❖ Pet-Friendly Community❖ Pool Table❖ Smoke-Free❖ Beautifully Landscaped Grounds with Access to Local Businesses❖ Courtyard featuring tasteful Outdoor Seating and Fire Pits❖ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting❖ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi❖ Free Parking - 2 Spaces per Apartment Home + Guest Parking❖ Lobby Area with Complimentary Coffee❖ Maintenance-Free Lifestyle❖ Professional On-Site Management Team❖ Storage Locker - $75\/$100❖ Within Walking Distance to TrainsAdditional information:Terms: 3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-MonthPets: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephWebsite: https:\/\/www.silkfactoryapts.com\/Phone:  show contact info\n*Prices are subject to change without notice Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY698DFD5ABD1C495\n","num_images":24,"lat":40.237106,"lng":-75.280919,"attrs":"['2BR \/ 1Ba', '1060ft2', 'available aug 18', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T11:26:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-the-perfect-loft-is-waiting\/7633914186.html","post_id":7633914186,"title":"The perfect loft is waiting for you at Silk Factory Lofts","description":"Community Location: 200 S Line St - Lansdale, PA 19446 Rental Information: $1828\/Month | 1 Bedroom 1 Bath | 729 sq ftLeasing Options:  3-Month, 4-Month, 5-Month, 6-Month, 7-Month, 8-Month, 9-Month, 10-Month, 11-Month, 12-Month, 14-Month show contact info\nApartment Amenities:  ✓ Cable & Hi-Speed Internet Ready✓ Central Air Conditioning✓ Dishwasher✓ Full Size Washer & Dryer✓ Large Windows✓ Range \/ Oven✓ Refrigerator\/Freezer✓ Secured Building Access✓ Storage Spaces✓ Upgraded Kitchens in Select ApartmentsProperty Features: ✓ 18' Long Shuffle Board✓ Business Center✓ Elevator✓ Game Room & Free Wi-Fi✓ Laundry Facilities✓ Monthly Community Events✓ Package Service✓ Pet-Friendly Community✓ Smoke-Free✓ Vintage Building✓ Beautifully Landscaped Grounds with Access to Local Businesses✓ Community Lounge featuring free Verizon Fios TV\/Wi-Fi✓ Dining Courtyard with 21 ft Long Maple Al Fresco Dining Table and Edison Style Lighting✓ Fitness Center with Free Weights, Verizon TV and Free Wi-Fi✓ Free Parking - 2 Spaces per Apartment Home + Guest Parking✓ Lobby Area with Complimentary Coffee✓ Maintenance-Free Lifestyle✓ Professional On-Site Management Team✓ Storage Locker - $75\/$100✓ Within Walking Distance to Trains Description: SEE WHAT YOU'VE BEEN MISSING  Silk Factory Lofts Apartments offers unique one bedroom, two bedroom, and three bedroom apartment homes in a beautiful setting that combines the comfort of home with exceptional resident services and outstanding community amenities. Options like large windows and storage spaces help you choose one of the apartment homes and create a style that is perfect for you. You will enjoy the convenience of living just minutes from major highways (1-476) and having easy access to transportation, employers, fine dining, parks and recreational areas, cultural events, historic attractions and shopping! By living luxuriously with a maintenance free lifestyle, you will find the serenity and convenience of Silk Factory Lofts Apartments to be your refreshing paradise. Schedule a tour of our beautiful Lansdale apartments today and see why residents love coming home to Silk Factory Lofts.Pets: Cats and Dogs Allowed. A limit of two pets per household is permitted. Pets must have current shots. BREED RESTRICTIONS APPLY. Breed Restrictions include, but are not limited to, pure breeds and\/or mixes of the following breeds: Akita, American Staffordshire Terrier (a.k.a. Pit Bull Terrier), Canario, Chow Chow, Doberman Pinscher, German ShephCall: Silk Factory Lofts at  show contact info\nFacebook: https:\/\/www.facebook.com\/200SilkFactoryLofts\/ Twitter: https:\/\/twitter.com\/SilkFactoryLP Website: https:\/\/www.silkfactoryapts.com\/Income requirements: 3x the monthly rent. Application Fee: $60.00. Amenity Fee: $350.00\nAll pricing and availability is subject to change. The information is to be used as a point of reference and not a binding agreement.EQUAL HOUSING OPPORTUNITY5B53DF9B2A4041\n","num_images":21,"lat":40.237106,"lng":-75.280919,"attrs":"['1BR \/ 1Ba', '729ft2', 'available jul 20', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T11:22:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-home-for\/7633884127.html","post_id":7633884127,"title":"Beautiful 3 Bedroom Home for Rent","description":"Beautiful 3 Bedroom Home wt Hardwood Floors - Nicely renovated 3br with short 7min walk to Broad Street Orange Line. Property features:*w\/d hookup in shed kitchen*Beautiful wood floors*Small yard*Stainless appliances Come take a look today!!Please don't forget to insert your phone number. I will tell you more specific about this property.","num_images":1,"lat":39.989321,"lng":-75.16156,"attrs":"['3BR \/ 1Ba', 'available now', 'application fee details: $25', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-18T09:25:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-clean-1000sqft\/7633912049.html","post_id":7633912049,"title":"\"Nice\/Clean 1000sqft. Apartment\"","description":"Brownstone Nice\/Clean 1000sqft. New Apartment\n1\/Bedroom, Living\/rm. Huge Kitchen, Large Bath,\nNew Appliances, A\/C, Washer\/Dryer, Closet space,\nHigh Ceilings, Storage space, N\/pets.  show contact info\nPlease leave message return all call within 15\/min.\nShowing 7\/days a wk. [Open House] all day Sat\/Sun.\nBella Vista\/Wash Sq.\/Passyunk Square area.\n","num_images":0,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '1000ft2', 'available now', 'air conditioning', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T11:15:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1br-bath-1010-race-st\/7633897911.html","post_id":7633897911,"title":"1BR 1 Bath 1010 Race St","description":"Location, location, location!\n-Located between 10th and 11th on Race in Chinatown, convenient to the Philadelphia Convention Center, Reading Terminal Market and Center City. Close to PATCO, the Broad Street Line, Jefferson Station for Regional Rail and the Greyhound bus station.\n-Secure entrance\n- secure bike room\n-Some utilities included\n-great kitchen with stainless steel appliances and modern bathroom\n-washer and dryer in unit\n-Loft storage\n- new A\/C\n-Must see condo!\nGarage for parking available nextdoor - Good deals for residents available. There is also paid street parking and permit parking.\nRent is $1575\/month. First month, last month and security deposit required. Minimum one year lease is required.\nWalking score 100\n1010 Race Street\nTENTEN\nChinatown\nCondo\nApartment\nFranklin Park\nCenter City\nTemple Podiatry\nTJUH - Thomas Jefferson University\nPerfect for residents or fellows or med students!","num_images":7,"lat":39.9554,"lng":-75.1564,"attrs":"['1BR \/ 1Ba', '700ft2', 'available now', '\\nsunday 2023-06-18\\n', 'air conditioning', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T10:23:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1br-apt-for-rent\/7633878238.html","post_id":7633878238,"title":"1BR apt for rent","description":"Private 3rdfl1brapt for rent in North Philly (19140)multi-unit building\nUnit has 4 total rooms (living room bedroom kitchen bathroom + lg coat & pantry closet\nShared entrance\nLight facelift to property 6 months ago to include floors paint windows\nLandlord provides electric cooktop fridge & pays heat (electric basebaord) water & lights\nTenant pays cable tv, wifi,landline telephone + $770 monthly rent after fulfilling required move-in costs of 1month security deposit & first months rent ($1540) and filling out a rental application (Personal Info Employment History Rental History References Credit & Criminal History) & paying the associated $40 NON-REFUNDALE APPLICATION FEE\nNOTE: Credit scores under 550 will not be disqualified but will require an additonal month paid in full in advance, prior to move in\nIf you are interested in a walk-thru viewing of the property reply to this ad to set up a date & time and receive a rental application\nApplication & fee are due at the time of showing\nSmoking on-premises ✅\nPets welcome ✅ (Cats & Dogs, $30 Pet Deposit, +$10\/month for each pet up to 2)\nOff-street parking ❌\nLaundry on-site or W\/D hookups ❌ (Laundromat 2 blocks away)\nMonth to month 6 month or 1 year auto renewing lease available  ✅\nUtilities included ✅\nPublic Transportation ✅\n","num_images":0,"lat":40.0095,"lng":-75.1245,"attrs":"['1BR \/ 1Ba', '425ft2', 'available now', 'application fee details: $40 non refundable app fee to cover costs of background & credit inquiries, etc', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T08:57:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-room-for-rent\/7633889994.html","post_id":7633889994,"title":"Room For Rent","description":"Address: 528-40 W Oxford St\nPhiladelphia, PA 19122\nRent: $500\nCozy 1 bedroom, 1 bathroom room available for rent in the vibrant Kensington neighborhood of Philadelphia. This affordable living space offers a comfortable bedroom and a well-maintained bathroom. Nearby amenities, shops, and restaurants are within easy reach. Utilities are included.\nFor more information or to schedule a viewing, Contact Jeremy at  show contact info","num_images":3,"lat":39.978,"lng":-75.1459,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T09:52:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-redefining-luxury-at-park\/7633892035.html","post_id":7633892035,"title":"Redefining Luxury at Park Lane!!","description":"Apt. 5111 — Ascott floor plan — 1,230 sq. ft. — $3,275\nThis 1st floor corner-unit apartment has so much to offer! Our brand-new construction includes white quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This Ascott also features spacious walk-in closets with custom shelving and ample living\/dining room space. This beautiful apartment home is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1230ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T10:01:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-conducive-family-home\/7633883450.html","post_id":7633883450,"title":"Conducive Family Home Ready Now - Philadelphia, PA","description":"This new construction home includes 3 bedrooms and 3 full baths, finished basement, 3rd floor master suite, wet bar and roof deck! First floor open floor plan flows upon entry with hardwood floors throughout the large living and dining area leading to the eat-in kitchen. Kitchen features white shaker style cabinetry, soft-close drawers, granite countertops and stainless steel appliances. Continue to the second floor to 2 bedrooms, full bath and laundry. The spacious third floor master suite has a modern bath with dual vanity, and tile floor. Enjoy the convenience of the 3rd floor wet bar before exiting to roof deck - perfect for entertaining. A full finished basement with full bath completes the home with additional storage and living space. Apply Now at  show contact info\nto schedule appointments now.","num_images":10,"lat":39.932414,"lng":-75.179199,"attrs":"['3BR \/ 2Ba', '1456ft2', 'available now', '\\nsunday 2023-06-18\\n', '\\nmonday 2023-06-19\\n', '\\ntuesday 2023-06-20\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry on site', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-18T09:22:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-full-bathroom-on-the-far\/7633875671.html","post_id":7633875671,"title":"full bathroom. On the far side of the bedroom","description":"An opportunity to rent this truly delightful 2 story, one1114 N 4th St #B, Philadelphia, PA 19123 The house was tastefully renovated within the past 2 years whilst retaining its unique appeal and charm. Enter into a nice bright living room with an adjacent kitchen with granite counter tops, dishwasher etc-the tiled kitchen floor has separate radiant heat and the house has hardwood floors throughout. Trinity style stairs lead to a wonderful large open plan bedroom with a vaulted beamed ceiling and a nice size full bathroom. On the far side of the bedroom a french door opens to a terrific large deck which overlooks the private neighborhood gardens. There is a private entrance at the outside of the house to these gardens where you can plant, grow, cook, sit and relax for just $30 PER YEAR! There is a small finished basement which houses the washer and dryer and plenty of extra storage space. This is a real gem of a house in a great location, near the Piazza and a short walk to Honeys and all the great local shops, cafes and restaurants this neighborhood has to offer. Easy street parking and on the bus route to center city. The house has new windows, central air\/heat. AVAILABLE MID AUGUST. $1,550 per month + utilities. Pets are at the owners discretion', cats are ok, sorry NO DOGS PLEASE. SHOWINGS COMMENCE TUESDAY, JUNE 20TH.","num_images":1,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T08:42:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-6000ft2-come-and-enjoy\/7633863943.html","post_id":7633863943,"title":"6000ft2 - Come and enjoy center city living at this prime location! (P","description":"Welcome to 104 S. 13th Street in Washington Square! Come and enjoy center city living at this prime location!! Private electronic coded front door. This beautiful top floor contemporary 1 bedroom apartment has a large open floor plan, exposed brick walls, beautiful hardwood floors, and 3 skylights which give plenty of natural light in the living room and kitchen areas. This unit includes all stainless appliances: Refrigerator, Dishwasher, Stove, Microwave and has Washer and Dryer in the unit as well. Kitchen has very nice upgraded cabinets with granite counters. There is access to your own outside terrace. Steps away from all the action. Comes with use of fitness facility. Outside your door you will find El Vez, Tiki Bar, Opa, Bru, McGillin's and many other local area favorites. Add this one to your must see list if wanting to live in Center City!","num_images":0,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 3Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-18T07:15:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/immaculata-including-to-the-kitchen-and\/7633873793.html","post_id":7633873793,"title":"including to the kitchen and bathrooms","description":"A convenient, easy lifestyle beckons you to this exceptional home in Hershey Mill. Home was two bedroom, renovated and converted to a one bedroom with den. (Floor plan can be adjusted to suit your needs). The many updates and renovations, including to the kitchen and bathrooms, make this home a pretty, welcoming oasis. While summer days may seem far now, the private pool at Eaton Village is a wonderful plus during warm weather, as is the patio. Close to everything, and located within historic Chester County, Hersheys Mill has so much to offer, with its low-maintenance, carefree lifestyle a real draw.","num_images":24,"lat":40.005376,"lng":-75.563257,"attrs":"['1BR \/ 1Ba', '1155ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T08:30:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxurious-2br-2ba-historic\/7633866251.html","post_id":7633866251,"title":"Luxurious 2BR\/2BA Historic Building Apartment - Heat & Utilities Inclu","description":"Experience the epitome of luxury living in this recently renovated 2 bedroom, 2 bathroom apartment situated in a historic building. With a host of impressive features and amenities, this apartment offers a truly exceptional living experience.\nStep into the stylish kitchen, boasting wood cabinets, tile floors, and granite countertops. The high-end appliances make cooking a delight, while the breakfast bar seamlessly connects the kitchen to the living room, creating an ideal space for entertaining guests.\nThe bathroom features a tiled floor and modern fixtures, adding a touch of elegance to your daily routine. Throughout the apartment, you'll find beautiful hardwood floors, with cozy carpeting in the bedrooms for added comfort.\nStay comfortable year-round with the convenience of central heating and air conditioning. An intercom system provides an extra layer of security and convenience.\nForget about the hassle of parking as this apartment offers free parking for residents. Additionally, the building is conveniently located near public transportation, the BF Bridge, and major highways, ensuring easy access to all the amenities and attractions of the city. Colleges and universities are also within reach, making this an ideal location for students and professionals alike.\nHeat, hot water, and cooking gas are included in the rent, allowing for worry-free living. Don't miss out on this opportunity to reside in a great building in a prime location. For more information or to schedule a viewing, please text  show contact info\n.\n","num_images":6,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-18T07:37:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-where-luxury-meets\/7633866378.html","post_id":7633866378,"title":"Where Luxury Meets Convenience!!","description":"Apt. 1110 — Manchester floor plan — 1,149 sq. ft. — $3,238\nLocated on the 1st floor, this 2-bedroom\/2-bath corner apartment home has so much to offer! This beautiful apartment home comes with central air and heat, a full-size front-load washer & dryer, and stainless-steel appliances. The large master bedroom is equipped with a private balcony, a walk-in closet, and a spacious bathroom with double sink vanity & walk-in shower. The second bedroom\/bathroom are spacious as well!  This gorgeous apartment has a prime view of our clubhouse, featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T07:38:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-renovated-2br-family-home\/7633858859.html","post_id":7633858859,"title":"Renovated 2BR Family Home","description":"Totally renovated and ready for you to move right in! This cozy ranch home is in a quiet neighborhood with tree lined streets and plenty of sidewalks. As you enter the home you are greeted by a large, open, and bright living room which adjoins the kitchen. The kitchen is the perfect size to fit a small table, has new stainless-steel appliances, and plenty of cabinet and counter space. Moving through the kitchen next up is the spacious family room addition with a bow window overlooking the backyard. The laundry room, with brand new washer and dryer and another refrigerator, is located off the family room and has an exit to the rear yard. Completing the home are the two brand new bathrooms, two bedrooms with ceiling fans a home office and hardwood floors throughout. There is also a full unfinished basement for all your storage needs and a shed in the backyard perfect for storing bikes and gardening tools. Great location, close to shopping, schools, farmers market, YMCA, Valley Forge Park and King of Prussia Mall.","num_images":16,"lat":40.1267,"lng":-75.5272,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-06-18T06:12:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-picturesque-family-3br\/7633853558.html","post_id":7633853558,"title":"Picturesque family 3br townhouse","description":"Welcome to 4317 Pechin Street, located in the charming neighborhood of Manayunk in Philadelphia. This meticulously kept twin home is an absolute delight and is ready for you to move in and make it your own. As you approach the home, you'll be greeted by a picturesque front porch, perfect for enjoying a cup of coffee or relaxing with a book. Step inside, and you'll be welcomed into a spacious living room adorned with beautiful hardwood floors that flow throughout the main level, creating an elegant and inviting ambiance. Make your way to the sun filled living room which leads you to your own private dining area. The newly updated kitchen is features stunning granite countertops, sleek stainless steel appliances, and ample cabinet space. This modern kitchen is both functional and stylish, making meal preparation an absolute joy. Conveniently located off the dining room, you'll find a half bathroom, adding to the overall ease and functionality of the home. The backyard space is a true oasis, offering a private and serene setting for outdoor entertaining or simply enjoying warm summer nights. Upstairs, you'll discover three generously sized bedrooms, each offering comfort and tranquility. The full bathroom on this level is complete with a bathtub and a stand-up shower stall. This home is in high demand and is expected to rent quickly, so don't miss out on the opportunity to make it yours.","num_images":16,"lat":40.0402,"lng":-75.2231,"attrs":"['3BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-06-18T04:15:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-stunning-3bd-for-rent\/7633853932.html","post_id":7633853932,"title":"Stunning 3BD for rent","description":"Welcome home to 621 Chruch Lane in Upper Darby. This newly renovated, move-in ready rowhome is sure to impress, and offers 3 bedrooms, 1.5 bathrooms, and a finished basement. Step inside to a spacious living room with beautiful parquet flooring that flows seamlessly to the dining room. The dining room is bright and cheerful and opens to the new kitchen. The chef of the house will love cooking in this fabulous space offering raised panel maple cabinets, granite countertops, custom backsplash, stainless steel appliances, and tile flooring. There's even space for a bistro table to enjoy your morning coffee. Upstairs are three bedrooms all with pristine hardwood floors and fresh neutral paint. The primary bedroom includes a ceiling fan and plenty of closet space. The rooms share a full hall bathroom with tub\/shower combination and tile surround. The finished lower level offers additional living space, a laundry area, a powder room, and access to the one-car garage. Close to schools and 69th Street Recreation Center.","num_images":12,"lat":39.9579,"lng":-75.2681,"attrs":"['3BR \/ 2Ba', '1248ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-06-18T04:25:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studio-available-on-august\/7633849758.html","post_id":7633849758,"title":"Studio available on August in University city,Upenn,Drexel","description":"A studio will be available on August 1st. Located on 42nd street and Market street.\nRent is 800\/month. Water and Internet are included. Tenant pays electricity.\nIt has a bedroom, a bathroom and a kitchen. The bedroom has basic furniture. Hardwood floor.\nLaundry room is in the house.\nClose to universities, subway stations and supermarkets.\nRequirements:\n- one person\n- has a full-time job or full-time student\n- don't smoke\n- one cat is okay. No other or more pets\n- Move in cost is $2400. (pay a deposit of 800 when lease is signed. Pay the first and last month rent 1600 when moving in).\nWelcome to take a look.","num_images":6,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', '250ft2', 'available aug 1', 'air conditioning', 'cats are OK - purrr', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T02:50:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-bedroom-bathroom\/7633843741.html","post_id":7633843741,"title":"+@@+Charming 3 bedroom 1 bathroom home+@@@+","description":"Call Or Text LANDlord (313) 365-097^9\n..:....**.........Stunning 3 Bed, 1 Bath Condo in Naval Square's Governor’s Mansion..:....**......... Unparalleled Luxury and Privacy. Welcome to 552 Easy St #C123 Court,..:....**...........:....**......... an exquisite 1st floor residence within the prestigious Naval Square community,.... nestled in the highly sought-after Graduate Hospital neighborhood.....:....**.......... of Philadelphia, PA. This impeccably maintained condo offers a perfect blend of elegance, modern design, and privacy.......:....**......... Step inside to discover an inviting open concept layout that effortlessly combines functionality and style........:....**......... The spacious living area is bathed in natural light, courtesy of an impressive.... windows along three exterior facing walls........ ..:....**.........This gorgeous condo boasts a semi-private side entrance,........:....**............. offering a sense of exclusivity. Additionally, the property includes a parking.......:....**......... spot for your convenience, ensuring easy access and peace of mind.........:....**......... Adorned with gorgeous hardwood floors throughout, this home exudes timeless charm. .........:....**.........The white kitchen, featuring Bosch stainless steel appliances and quartz countertops, is a culinary enthusiast's dream come true. Prepare meals in style and entertain guests in the heart of your home. Indulge in the spa-like bathrooms, complete with frameless glass shower,..........:....**..........offering a tranquil oasis for relaxation and rejuvenation.,........:....**............. The attention to detail extends to every corner of this residence,........:....**.......... providing an elevated living experience. For added convenience,..:....**......... the condo includes an office nook that can serve as a dedicated workspace...,........:....**................., as well as a laundry room for ultimate functionality. ,........:....**.............Residents of Naval Square enjoy access to a range of exceptional amenities within the 20-,........:....**.............acre gated community, including landscaped grounds,.......:....**.......... a fitness center, outdoor pool, and 24-hour security. Additionally, basement storage provides ample space for your belongings.........:....**......... Located in the vibrant Graduate Hospital neighborhood, you'll have easy access to renowned dining, shopping, and,........:....**............. entertainment options. Enjoy the convenience of nearby parks and recreational areas,......:....**............ as well as seamless access to major transportation routes. ..:....**...........:....**.........Don't miss this incredible opportunity to live in the Governors Mansion within the esteemed Naval Square community. Schedule a viewing today and experience the ..:....**...........:....**.........epitome of luxurious living in Philadelphia.......:....**...........:....**.........\nXSW2\n#@~~~1238 E STAFFORD ST,~~#@\n..:....**...........:....**...........:....**...........:....**...........:....**...........:....**...........:....**...........:....**...........:....**...........:....**...........:....**...........:....**...........:....**...........:....**...........:....**...........:....**.........!!!!!!THANKS\/\/\/**\n","num_images":5,"lat":40.0568,"lng":-75.1569,"attrs":"['3BR \/ 1Ba', '950ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-18T01:22:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fairly-new-bed-bath\/7633830012.html","post_id":7633830012,"title":"FAIRLY NEW 3-BED, 3-BATH APARTMENT, $2100, NEAR DREXEL AND UPENN, AVAI","description":"Our properties in University City Philadelphia are conveniently located within walking distance to University of Pennsylvania, Drexel University; public transportations, including Drexel-Penn Bus transport; restaurants, coffee shops, grocery stores, shopping, entertainment, parks, and more. Downtown Philadelphia, Museums, and King of Prussia are minutes away by public transport or private car. The properties are newly constructed, affordable, and located in a safe and secure neighborhood. They are within the University City District patrol area, and our tenants can take advantage of walking escorts and other services such as vehicle lock-outs and jumpstarts. The buildings have security cameras and the units have smoke detectors, security alarm, fire alarms, indoor sprinklers, doorbell with camera with intercom, hardwood floors, in-unit washer and dryer, and central AC. We understand our tenants’ needs and so we provide the convenience of the tenant portal system, e-leasing, and subletting\/lease transfer for those who cannot stay due to Drexel co-op. Our staff make frequent rounds and we respond to tenant requests within 24-72 hours.\nLocations:\n3716 Haverford Ave (2 units left, both units are identical)\nVideo tour:\nHaverford apartments: https:\/\/youtu.be\/dXJSY_vDm84\nBelow are some of the features:\n– keyless entry\n– central AC\n– energy-efficient appliances\n– in-unit washer and dryer\n– doorbell with camera and intercom\n– fire alarms\n– indoor sprinklers (in case of fire)\n– recessed lighting\n– security alarm\n– security cameras\n– shared courtyard\n– landlord pays for private trash collection\n– tenant portal\n– e-leasing\n– easy online application, $50 per applicant\n– free tours\n– no move-in fees\nRent:\nRent is $2100\nPets:\nCats (max 2) or small dog (max 1, 25-lb limit) are allowed.\n","num_images":8,"lat":39.963547,"lng":-75.196194,"attrs":"['3BR \/ 3Ba', '820ft2', 'flat', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T23:21:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/colmar-3br-bath\/7633833677.html","post_id":7633833677,"title":"3BR 1 Bath","description":"Colmar, 3BR 1 Bath. Eat in Kitchen, Balcony, off street parking. Includes heat and electric. Pets allowed with an additional $1,000 security deposit.","num_images":7,"lat":40.2728,"lng":-75.2563,"attrs":"['3BR \/ 1Ba', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T23:49:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-updateded-2br-15\/7633829629.html","post_id":7633829629,"title":"⭐ Newly Updateded 2BR\/1.5 BATH in the NORTHEAST near Franklin Mills -","description":"Property Address\n3333 Comly Rd – Unit 42 | Philadelphia, Pa 19154\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️BEST VALUE APARTMENT! ⭐⭐⭐⭐⭐\n✔️Newly Updated 2 Bedroom & 1 1\/2 bath Condominium\n✔️Bi-level apartment\n✔️Spacious bedrooms\n✔️Large Living room\n✔️Generously sized dining area\n✔️Updated kitchen\n✔️Updated Microwave, new fridge, and Washer\/Dryer hook up\n✔️Newer water-resistant laminate (living room\/dining area\/kitchen)\n✔️Ceiling Fans throughout\n✔️Laminate flooring\n✔️Lots of closet space\n✔️Central heat\n✔️Designer paint throughout\n✔️Spacious patio for entertainment\n✔️Easy access to and from the city\n✔️Easy access to public transportation\n✔️Conveniently located close to major routes\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for all utilities and water fee\nBuild your credit! We report rent payments to Experian!\nAmenities\ncable ready\nall-electric\nopen layout\nconveniently located\nSize\nBeds\/Baths: 2 BD\/1 BA\nSquare Feet: Apx. 900\nRental Terms\nRent: $1800.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $3600.00\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** Do not give anyone cash, we do not collect deposits, rents, or application fees at properties\n*** The property is under video\/audio surveillance. All footage stored off-site and may be made public. By entering the property you agree to be filmed.\n","num_images":12,"lat":40.08825,"lng":-74.982121,"attrs":"['2BR \/ 1.5Ba', '900ft2', 'cottage\/cabin', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-17T23:19:07-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7633827602.html","post_id":7633827602,"title":"SPACIOUS 1 BEDROOM & 1 BATH LOCATED IN WEST OAK LANE!","description":"Property Address\n1526 W Grange Ave – 1F | Philadelphia, Pa 19141\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ UPDATED, 1 BEDROOM & 1 BATH APARTMENT LOCATED IN GARDEN COURT OF WEST OAK LANE\n✔️ OPEN LAYOUT\n✔️ SPACIOUS KITCHEN\n✔️ SPACIOUS BEDROOM\n✔️ LAMINATE FLOORING\n✔️ LARGE CLOSETS\n✔️ LOTS OF NATURAL LIGHT\n✔️ ALL-ELECTRIC\n✔️ CUSTOM BATHROOM TILES\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!!\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for electric and water fee\nBuild your credit! We report rent payments to Experian!\nAmenities\ncable ready\nall-electric\nopen layout\nconveniently located\nSize\nBeds\/Baths: 1 BD\/1 BA\nSquare Feet: Apx. 675\nRental Terms\nRent: $900.00\nAvailable: Now\nApplication Fee: $35.00\nSecurity Deposit: $1,800.00\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** Do not give anyone cash, we do not collect deposits, rents, or application fees at properties\n*** The property is under video\/audio surveillance. All footage stored off-site and may be made public. By entering the property you agree to be filmed.\n","num_images":6,"lat":40.041456,"lng":-75.146421,"attrs":"['1BR \/ 1Ba', '675ft2', 'flat', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-06-17T23:05:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-metropolitan-west-chester\/7634049820.html","post_id":7634049820,"title":"Metropolitan West Chester, Apartment for Rent","description":"I am looking for someone to sublet the remainder of my lease with my roommate at 304 East Marshall Street, Apartment 747 West Chester PA. It is a two bedroom apartment, and each bedroom has its own bath. The  rent is 2105 a month, and this would be split with my current roommate who has a good job and pays bills on time. If interested, contact me at  show contact info\n. This apartment is right across the street from Marshall park and in walking distance of downtown West Chester. Use of a pool, recreation room, and gym are included.","num_images":0,"lat":39.9845,"lng":-75.5962,"attrs":"['1BR \/ 1Ba', 'available aug 1', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T18:48:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-loft-style-bedroom-house\/7634045219.html","post_id":7634045219,"title":"Loft Style 1 Bedroom House Avail Immediately","description":"I am relocating out of state for work and looking to find a renter to take over my lease. If you are available for a July move-in date I will subsidize your first month's rent for up to $600 depending on how quickly you are willing to move in.\nThe house is located on Martha St. in the East Kensington community. It is situated nearby POPs Park which includes basketball courts, a skate park and a dog park. There is a small outdoor space behind the house. There is also a full unfinished basement with lots of storage as well as a washer and dryer.\nPets are allowed with a $50 per month pet rent fee.\nFeel free to respond to this posting directly to schedule a showing.\nSee website for lease terms: http:\/\/www.jg-realestate.com\/listing\/2665-martha-st\/","num_images":5,"lat":39.985143,"lng":-75.12155,"attrs":"['1BR \/ 1Ba', '700ft2', 'available jun 25', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T18:29:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-welcome-beautiful-bd-ba\/7634039681.html","post_id":7634039681,"title":"@Welcome Beautiful _:3\/BD-1\/BA:_ (Markley St) Avail. for rent:$960\/","description":"Welcome home to single level living at it's best!! Take a look at this recently renovated 3 bedroom 1 bath brick Ranch, refinished hardwoods, freshly painted interior, granite counters, subway tile backsplash, stainless appliances, young roof and gas heating system, garage. Minutes to Downtown, Park, highway access, shopping and restaurants. Contact:","num_images":6,"lat":40.127557,"lng":-75.337476,"attrs":"['3BR \/ 1Ba', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-18T18:07:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/huntingdon-valley-unique-modern\/7634041741.html","post_id":7634041741,"title":"UNIQUE MODERN APARTMENT","description":"UNIQUE, MODERN  APARTMENT FOR  RENT\nLocated on 15 acre Country Estate\nSouthampton, Bucks County, PA\nTwo-story apartment for one person available today!\nSecure with private entrance\nCovered, on-site parking for tenant car at apartment door entrance\nCentral Air Conditioning and Heating\nBedroom\/living room combination on second floor includes:\nNew Vinyl flooring\nWindows\nNew double door closet with shelf\nNew bathroom:\nWalk-in stall shower, sink\/vanity, toilet, wall mirror, vinyl floor, ceiling exhaust fan\nFirst Floor with Modern Kitchen:\nDecorator, neutral color cabinets, Corian counters & stainless steel sink\nNew full size, smooth cooktop, with new full size oven and new built-in microwave\nNew Refrigerator\nVinyl windows with screens\nNew keyed door locks with dead-bolts\nONE YEAR LEASE\nNO pets, NO smoking unit\n$1350 month, plus electric\n$1350 deposit\nCALL  show contact info\nafter 7pm to schedule apartment viewing.\nPlease do NOT leave a message on the phone.\n","num_images":0,"lat":40.1284,"lng":-75.0607,"attrs":"['1BR \/ 1Ba', 'available now', '\\nsunday 2023-06-18\\n', '\\nmonday 2023-06-19\\n', '\\ntuesday 2023-06-20\\n', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'carport', 'rent period: monthly']","posted_date":"2023-06-18T18:15:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-one-bedroom-one-bath\/7633989278.html","post_id":7633989278,"title":"Large one bedroom\/one bath available in Fishtown","description":"Large one bedroom\/one bath available in Fishtown. Just blocks from Frankford Ave, this apartment offers easy accessibility to Center City, I-95, 676, and is within walking distance to the Market Frankford Line and all of Fishtown s bars and restaurants.\nThis recently renovated apartment has hardwood floors, a modern kitchen with quartz countertops, dishwasher, garbage disposal, frameless glass shower, large windows and ample closet space. Laundry is available in the apartment.\n","num_images":13,"lat":39.978908,"lng":-75.123404,"attrs":"['1BR \/ 1Ba', '510ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T15:14:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/venice-bedroom-ranch-for-rent\/7634016911.html","post_id":7634016911,"title":"2 bedroom ranch for rent","description":"Two bedroom, 2 bath, single ranch stand-alone villa in Venice, Florida for rent 4 month minimum. Earliest available is September 2023. Open to longer term lease. Enclosed lanai with sliding doors that you can close for privacy and use as a Home Office, Media Room or 3rd Bedroom. Clubhouse, Gym, Game Room, Library, Two Heated Pools, Shuffleboard, Horseshoes, pickleball and Boccie Ball. Development is located 5 minutes from Manasota Key and Venice Beaches, Restaurants, Shopping, and the Legacy Bike Trail. Only 1 pet (medium size) is allowed. Development is a friendly community where you can meet and socialize with neighbors at the clubhouse and make new friends. Explore historic Downtown Venice, enjoy delectable seafood at Sharky's\/Fins, spend a day at Caspersen Beach or Brohard Beach & Paw Park—the only dog-friendly beach in Sarasota County. Discover the beauty of Venice Beach, enjoy community events at the Venice Community Center and performances at the Venice Theatre. Many golf courses nearby for the golfer and some of the best fishing. Non smokers. $3,500 per month and includes utilities.\nCall  show contact info","num_images":0,"lat":27.09,"lng":-82.37,"attrs":"['2BR \/ 2Ba', 'available sep 1', 'application fee details: $100', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-06-18T16:43:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-all-utili-includ-two-bedrmoos\/7634008496.html","post_id":7634008496,"title":"All Utili Includ. 2\/Two BEDRMOOs Apt, One Bath, Kitchen","description":"$900\/Mo, 2 Bedroom Apt, All Utilis Included 1300 Block W. North Ave,  Philadelphia , MD 21217\nTWO BEDROOM\/s, its own private Bath and Kitchen 1300 Block W. North Ave,  Philadelphia , MD 21217 NO PETS!!! NO SMOKING!!!\n**********************************************************************\nCALL  show contact info\n!!!!! CALL   show contact info\n!!!!! CALL   show contact info\n!!!!!\nCALL   show contact info\n!!!!! CALL   show contact info\n!!!!! CALL   show contact info\n!!!!!\n=======================================================\nA- One BEDROOMs\/\/\/STUDIOs Apartments $700 & $750, $800\/Mo, (1st flr), ALL UTILITIES INCLUDED!!!!!, with its own private Bath & Kitchen, 1300 Block W. North Ave,  Philadelphia , MD 21217 , 1600 Block N. Monroe St Short walk to Pen North Subway, CVS, Library and Pennsylvania Ave. NO PETS!!! NO SMOKING!!!\nB- One BEDROOMs Apartments $800\/Mo, (1st flr) & 3rd floor, ALL UTILITIES INCLUDED!!!!!, with its own private Bath & Kitchen, 1300 Block W. North Ave,  Philadelphia , MD 21217 , 1600 Block N. Monroe St Short walk to Pen North Subway, CVS, Library and Pennsylvania Ave. NO PETS!!! NO SMOKING!!!\nC- 2 Bedroom Apt, $900\/Mo,1300 Block W. North Ave,  Philadelphia , MD 21217\nTWO BEDROOM\/s,, Utilis Included, its own private Bath and Kitchen 1300 Block W. North Ave,  Philadelphia , MD 21217 NO PETS!!! NO SMOKING!!!\nD- Near Downtown, 2 Bedroom Apt, $1200\/Mo,, 2 full Baths and Kitchen, Washer\/Dryer, D\/W. HVAC,Short Walk to U of MD, Med Center, (Washington Blvd and Scott St 800 Block),  Philadelphia , MD 21230), Bio Park, Pratt St\/Inner Harbor, M & T, Oriole Camden Yards, Horseshoe Casino, NO PETS !!! NO SMOKING!!! Tenant pays (Submeters) Electric and Water Bill. Available End of July 2023\n","num_images":3,"lat":39.9375,"lng":-75.2637,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T16:15:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bathroom\/7634007605.html","post_id":7634007605,"title":"Beautiful 1 bedroom, 1 bathroom apartment in Pennsport, less than a bl","description":"Beautiful 1 bedroom, 1 bathroom apartment in Pennsport, less than a block from Dickinson Square Park, close to I-95 and shopping on Columbus Blvd! This apartment features a beautiful kitchen complete with a modern stove, oven, refrigerator and garbage disposal. The bedroom is large and has plenty of closet space! With an electric stove and baseboard heating, this apartment is easy to maintain.Pennsport Neighborhood - Home to the Mummers and \"Two Street\", this South Philadelphia neighborhood is full of life and excitement. Bordering neighborhoods include Queen Village, the Italian Market, Passyunk Square, and Delaware Ave area. Pennsport is a great mix of students and professionals seeking affordable South Philadelphia living.","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', '1400ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-18T16:12:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-stainless-steel-appliances\/7634013799.html","post_id":7634013799,"title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nApartment Features\n* Kitchen Island\n* Walk-in Closet\n* Washer and Dryer in unit\n* Linen Closet\n* Private Patio or Private Balcony (on select apartments)\n* Garden Tub\n* Stainless Steel Appliances","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T16:32:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-home-entrepreneurs\/7634008371.html","post_id":7634008371,"title":"Welcome home entrepreneurs and your purpose-driven pursuits. J-centrel","description":"Welcome home entrepreneurs and your purpose-driven pursuits. J-centrel is Philadelphia's civically engaged multi-purpose community that provides affordable quality to residents and businesses who are committed to doing good with their neighborhood. J-centrel is home to community-driven residents and businesses who strive to make their neighborhood, Philadelphia, and society better.","num_images":3,"lat":39.9227,"lng":-75.1812,"attrs":"['1BR \/ 1Ba', '1254ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-18T16:14:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/collegeville-one-bedroom-for-rent\/7634006224.html","post_id":7634006224,"title":"ONE BEDROOM FOR RENT, includes utilities & parking","description":"Hardwood Floors\nCentral Air\nUtilities & Parking Included\nLocated on the Second Floor\nNo Pets\nCALL MR. RUSH AT  show contact info\nif you would like to set up a viewing appointment.","num_images":0,"lat":40.1913,"lng":-75.4373,"attrs":"['1BR \/ 1Ba', 'available aug 15', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T16:08:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/levittown-highly-sought-after-3bd-1ba\/7633969207.html","post_id":7633969207,"title":"Highly sought-after 3bd\/1ba property","description":"Welcome home to this adorable & updated 3 bedroom ranch with central a\/c in Levittown's Goldenridge neighborhood! Enter through the new fiberglass door into the eat in kitchen with recessed lighting. Through the kitchen you will find a large, remodeled mud room with a new door leading to the driveway. The kitchen flows into the large open living room with updated flooring, ceiling fan and fireplace. The living room also has a door to the side yard. A hallway off the living room leads to a master bedroom and two additional bedrooms, all with ceiling fans. A beautifully remodeled bath with glass shower door and marble tiles completes the home. The back and side yard are fenced in with a shed. The lighted carport is great for entertaining and leads to a large patio space. Updated and move-in ready, don't miss this one today! Pets are allowed upon approval for additional fee. Convenient to major highways, shopping and local entertainment.","num_images":12,"lat":40.1434,"lng":-74.8614,"attrs":"['3BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-06-18T14:12:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-bedroom-university\/7633966232.html","post_id":7633966232,"title":"Lovely 1 Bedroom ! University City -west For rent Now","description":"PERFECT FOR , students . singles , or Couple.\nReady to move in .\nStudio \/ 1 Bedroom apartment .\nNow offering brand new apartment in west Philly.\/ University City\n(for very LOW COST in relevant to the aria)\nvery nice block , short walking distance to public transportation, stores, market place and allot more .\n2nd floor apartment , apt. 2R\nin a Triplex setting that include.\n*1 Very Large size Bedroom with windows facing Back yard for plenty of Natural Lights and complete Privecy.\n*Modern tiled bathroom.- bathtub, Vanity sink, toilet.\n* kitchen with tile floors , Gas stove\/ Oven , Microwave, Refrigerator , real wood Kitchen Cabinets.\n*wood floors on Bedroom \/ hallways.\n*Large windows in bedroom, and kitchen ! Plenty Of Natural Light and fresh Air!\n*High ceilings\nUniversity city aria.\nmove in required first and last month rent, + security deposit. (2670.00)\nLooking For responsible \/ reliable tenant ,\nNO SMOKING\nFor More information or to schedule Viewing please reply to this post with your name , phone # ,and the best time to call.\nFor Immediate response.\ncall \/ TEXT\nshow contact info\n-Moses\nwith your Name.\nthis is a good deal ! won't last long !\nserious inquiries Only .\nGood Luck . !!\nP.s-\nto expedite the process , please reply with a request to receive a FREE \/ Basic rental application .\nwe will send one to you ASAP.","num_images":12,"lat":39.955839,"lng":-75.225948,"attrs":"['1BR \/ 1Ba', '675ft2', 'available now', 'cats are OK - purrr', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T14:04:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bd-ba-no-libs-corner-unit\/7633991567.html","post_id":7633991567,"title":"2 bd\/2 ba No Libs corner unit bathed in natural light! 2 weeks free!","description":"We are moving out of the area and looking for someone to take over our fantastic 2 bed, 2 bath apartment in the heart of Northern Liberties just blocks from the restaurants, coffee shops, grocery stores, vets, shopping, and other neighborhood amenities along 2nd Street and a 10-minute walk to the heart of Fishtown's food, nightlife, and shopping district.\nGreat location for public transportation with stops for SEPTA's 57 bus and 15 trolley within 1 block of the building, a 10-minute walk to the Girard stop on the Market Frankford Line, and the Girard stop on the Broad Street Line less than 10 blocks away.\nAnd if you have a dog, the apartment is just 3 blocks from the best dog park in the city, Orianna Hill Park. Our pup Chance has been going there for years and we're all going to miss the community at Orianna! There's permit street parking and we are usually able to park within a few blocks of the intersection of 4th and Cambridge; we've found parking to be much easier here than in places like Fairmount and Francisville. And there is quick access to 95 and 676.\nThe apartment is very comfortable. The master bedroom easily fits a king size bed and has its own bathroom, and the guest room\/second bedroom can also fit a king size bed. We have both been able to work from home easily with dedicated work spaces in each bedroom.\nThere is some flexibility for start date but our preferred is 7\/15. If you move in on 7\/15, we'll cover the rent for the rest of the month! And for the right applicant who wants to move fast, we are willing to consider additional benefits!\nDetails:\n- 2 bedrooms\n- 2 bathrooms\n- Rent: $2050 \/ month\n- 12 month lease\n- Available 7\/15\n- Application fee: $50\n- One-time pet fee: $250 (refundable)\n- Monthly pet fee: $35\n- Monthly water fee: $40\n- Tenant pays gas and electric\nAmenities include:\n- Original exposed brick walls and wood beams\n- Large windows and high ceilings\n- European-style cabinetry\n- Granite countertops in kitchen & bath\n- Stainless steel kitchen appliances\n- Ceramic floors in all bathrooms\n- In-unit washers & dryers\n- Central air-conditioning\n- Pet friendly with a small enclosed dog run\n- Secure indoor bicycle storage\n- Secure building access with video\n- Trash shoots in every floor\n- Elevator and secure package delivery\n","num_images":16,"lat":39.968851,"lng":-75.143332,"attrs":"['2BR \/ 2Ba', '979ft2', 'air conditioning', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T15:22:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedrooms-in-great\/7633983448.html","post_id":7633983448,"title":"Two Bedrooms in a Great Location! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N American St Suite 101\nPhiladelphia Pa 19122\nBedrooms:2\nBathrooms:2\nSquare Footage:1088-1261 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 2BR floor-plans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1,"lat":39.971179,"lng":-75.140092,"attrs":"['2BR \/ 2Ba', '1135ft2', 'available sep 30', '\\nsunday 2023-06-18\\n', '\\nmonday 2023-06-19\\n', '\\ntuesday 2023-06-20\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T14:57:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-professionally-managed\/7633979936.html","post_id":7633979936,"title":"Professionally Managed, Stainless Steel Appliances, Resort Style Pool","description":"When you call The Point at West Chester home you will be just minutes away from the vibrant shops and restaurants of Downtown West Chester. Call us today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Full sized Washer and Dryer in unit\n* Lofty Vaulted Ceilings\n* Pantry\n* Private Patio or Private Balcony (on select apartments)\n* Breakfast Bar\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Roommate Friendly Floor Plan\n* Central Heat and Air\n* Granite Countertops\n* Ceiling Fan\n* Disposal\n* Stainless Steel Appliances\n* High Efficiency Lighting Fixtures\n* Linen Closet\n* Pre-wired for internet and cable\n* Walk-in Closet\n* Garden Tub\n* Window Coverings","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1207ft2', 'available jun 25', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T14:46:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-central-location-upgraded\/7633979731.html","post_id":7633979731,"title":"Central Location, Upgraded Finishes Available, Pet Park","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester offers you the benefits of an unbeatable location just minutes from downtown shops and restaurants and conveniently close to the area's top roadways including Route 202 and West Chester Pike. Tour now!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, walk-in closets, master suite, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1138ft2', 'available jun 25', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T14:45:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-incredible-features-resort\/7633979489.html","post_id":7633979489,"title":"Incredible Features, Resort Style Pool, Upgraded Finishes Available","description":"The Point at West Chester is the perfect location for your new home. Explore our location today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, Den, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":23,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '786ft2', 'available jun 25', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T14:44:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-dont-miss-this-opportunity\/7633970683.html","post_id":7633970683,"title":"Don't miss this opportunity...","description":"Pretty Street with Low Traffic... Is Where You Will Find This....very well kept spacious ranch home with a large full basement and a massive back yard for all those summer barbecue's. Enter home through private side entrance into bright and open living Space. The living rm. is next to the dining area and spacious open beautiful kitchen offers plenty of counter\/cabinet space. The kitchen refrigerator, washer and dryer are included in the sale of the home.  Kitchen offers tile flooring, New SS Refrigerator, Garbage Disposal, Exhaust Fan and Gas Cooking.  Two generously-sized bedrooms with ample closet space and hall bath complete the main level. Down the stairs to the  basement with galore to do as you wish offers power room,  walkout onto huge backyard, laundry rm. 15x14 with interior access into 1.5 over-sized garage. Garage offers new insulated door and remote door opener.","num_images":7,"lat":40.043683,"lng":-75.108178,"attrs":"['2BR \/ 2Ba', '1169ft2', 'available now', '\\nsunday 2023-06-18\\n', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'house', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2023-06-18T14:17:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-where-luxury-meets\/7633976548.html","post_id":7633976548,"title":"Where Luxury Meets Convenience!!","description":"Apt. 1110 — Manchester floor plan — 1,149 sq. ft. — $3,238\nLocated on the 1st floor, this 2-bedroom\/2-bath corner apartment home has so much to offer! This beautiful apartment home comes with central air and heat, a full-size front-load washer & dryer, and stainless-steel appliances. The large master bedroom is equipped with a private balcony, a walk-in closet, and a spacious bathroom with double sink vanity & walk-in shower. The second bedroom\/bathroom are spacious as well!  This gorgeous apartment has a prime view of our clubhouse, featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T14:35:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-bedroom-bathroom\/7633974356.html","post_id":7633974356,"title":"Updated 1 Bedroom 1 Bathroom first floor is Available now","description":"Beautiful 2 bed, 2bath first floor is available now. Off street parking, Washer\/dryer in unit. That's right. Updated\/Painted Walls and Ceilings. New Electrical including Lighting\/Electrical Sockets. Updated Courtyard that includes:. All new doors and windows  This one is truly a magnificent place. In addition, our property is equipped with onsite laundry, secured access, and a management staff onsite to address and handle all of your concerns. All utilities included, For more information, send your number or email...","num_images":4,"lat":39.9811,"lng":-75.174,"attrs":"['1BR \/ 1Ba', '742ft2', '\\nsaturday 2023-07-01\\n', 'application fee details: $40', 'broker fee details: Credit & Background check required', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Equal Housing Opportunity', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T14:29:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-for-rent\/7633969001.html","post_id":7633969001,"title":"House for rent","description":"Furnished 5 Bedrooms and 2.5 Bathrooms house in the heart of university city in a very quiet, serene community with lots of street parking and backyard parking. Aldi grocery, Subway train station, two elementary schools are just within a block. You will love everything about this beautiful little neighborhood. Just come and check it out!!","num_images":9,"lat":39.960038,"lng":-75.211924,"attrs":"['5BR \/ 2.5Ba', 'available jun 20', 'air conditioning', 'cats are OK - purrr', 'furnished', 'house', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T14:12:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-row-avaiable-for-july\/7633973647.html","post_id":7633973647,"title":"3 br row avaiable for July 1st move in!","description":"Wonderfully updated 3 bedroom rowhome available for July 1st move in date. Open concept first floor with powder room, 2 bed rooms on second floor with full bath, Finished basement suite with full bathroom, backyard to enjoy the fresh air. Great neighborhood with great neighbors, close to restaurants, walkable to Frankford ave shops, I-95 for quick access to downtown or anywhere else in the region, and Public Transportation Access (the 25 bus stops right in front!). Comes with washer and dryer in the unit!\nCats and Dogs ok. First\/Last\/Security. Renters insurance will be required. Email back to show.\n","num_images":13,"lat":39.980025,"lng":-75.123876,"attrs":"['3BR \/ 2.5Ba', '1100ft2', 'available jul 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T14:27:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brownstone-apartment\/7633960639.html","post_id":7633960639,"title":"\"Brownstone Apartment 2500sqft.\"","description":"Brownstone Huge 2500sqft., Apartment 3\/flrs.\n2\/Huge Bedrooms, Huge Living\/rm., 2.5\/Baths,\nStainless Steel App., Dishwasher, Washer\/Dryer,\nGarbage Disposal, Central air\/heat, Ceilings fans,\n6\/Multi-Closets, High Ceilings, Hardwood\/floors,\nN\/pets., Showing 7\/days wk. all day Sat\/Sun til.7p.\nLeave message return calls 15\/min.  show contact info\nBella Vista\/Wash Sq.\/Passyunk Square area.","num_images":0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2.5Ba', '2500ft2', 'available now', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T13:46:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-temple-university-area\/7633961364.html","post_id":7633961364,"title":"Temple University Area","description":"Spacious 2 bedroom apartment\/ New construction\/ 1200 Sf- Large living room with wooden flooring- Ultra kitchen with refrigerator, dishwasher, disposal, stone counter tops, ceramic tile backsplash, overhead and lower cabinets. Two large bedrooms each with its' own ceramic tile bathroom-Laundry area with washer and dryer. Security system with 24\/7 camera coverage. Pet friendly. Lots of free parking and private available.","num_images":0,"lat":39.9811,"lng":-75.174,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T13:48:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cute-bd-15-bath-on-family\/7633961258.html","post_id":7633961258,"title":"Cute 2 bd\/1.5 bath on family block= pets considered","description":"Hello, and thanks for looking.\nI have a cute 1100 townhouse for rent. Lived here for many happy years and now remote and between cities.\n* 2 bed and 1.5 bath\n* large den\/family room\/ home office between bedrooms on second floor- typically where a 3rd  tiny bedroom and hallways would be in a home of this size.\n* Updated kitchen and bath, laminate floors.\n* Backyard with access for outdoors.\n* Pets considered.\nLooking for 1600 per month. The usual credit and background checks apply.\n3 blocks or less from Columbus Square Park, Sprouts\/Target, bus and Broad Street Line. Another block to Passyunk Avenue.\nQuiet peaceful block with friendly neighbors.\nPlease send a note to schedule a screen call.\nAvailable immediately but I am not in a hurry.","num_images":9,"lat":39.934888,"lng":-75.173417,"attrs":"['2BR \/ 1.5Ba', '1100ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T13:48:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedrooms-in-great\/7633959062.html","post_id":7633959062,"title":"One Bedrooms in a Great Location! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:760-800 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '767ft2', 'available now', '\\nsunday 2023-06-18\\n', '\\nmonday 2023-06-19\\n', '\\ntuesday 2023-06-20\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T13:41:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-temple-university-area\/7633950968.html","post_id":7633950968,"title":"Temple University Area","description":"New Construction\/Penthouse Apartment\/2100 Sf: Gigantic living room with wooden flooring- Ultra kitchen with refrigerator, dishwasher, disposal, stone counter tops, ceramic backsplash, abundant cabinet space- Four spacious bedrooms each with their own full ceramic tile bathroom- Laundry area with washer and dryer- Advanced security system for the building- Roof top deck with an expansive view of Center City. Private parking available.","num_images":0,"lat":39.9811,"lng":-75.174,"attrs":"['4BR \/ 4Ba', '2100ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T13:16:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studios-in-great-location\/7633947707.html","post_id":7633947707,"title":"Studios in a Great Location! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', '\\nsunday 2023-06-18\\n', '\\nmonday 2023-06-19\\n', '\\ntuesday 2023-06-20\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-06-18T13:06:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-live-the-lifestyle-you\/7633947035.html","post_id":7633947035,"title":"Live the Lifestyle You Deserve!","description":"Apt. 1110 — Manchester floor plan — 1,149 sq. ft. — $3,238\nLocated on the 1st floor, this 2-bedroom\/2-bath corner apartment home has so much to offer! This beautiful apartment home comes with central air and heat, a full-size front-load washer & dryer, and stainless-steel appliances. The large master bedroom is equipped with a private balcony, a walk-in closet, and a spacious bathroom with double sink vanity & walk-in shower. The second bedroom\/bathroom are spacious as well!  This gorgeous apartment has a prime view of our clubhouse, featuring a 24-hour fitness center, theatre room, resort-style swimming pool, and much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1149ft2', 'air conditioning', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-06-18T13:04:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/montgomeryville-woodhollow-condo-for\/7633945549.html","post_id":7633945549,"title":"Woodhollow Condo for rent","description":"Easy living in this nice 1st floor 2 bedroom, 2 bath apartment to rent in Wood Hollow Condominiums in North Wales. Adams Court is located at the back of the development, windows and sliding glass door to porch face open area to wooded tree line. Luxury plank floors in living areas, kitchen, primary bedroom and bath. Updated primary bath with tile shower, tile floor, glass shower door with new vanity. Washer\/dryer, new dishwasher, garbage disposal, stainless steel refrigerator. Fresh paint, modern grey color. Location is close to Montgomery Mall, restaurants, easy access to major roads namely 202, 309, 463 & PA Turnpike. Rent includes trash, water, snow removal, pool, & tennis courts. No smoking and No pets.\n1st month rent due at lease signing, last month rent and security deposit due prior to move-in.\n","num_images":15,"lat":40.247973,"lng":-75.232167,"attrs":"['2BR \/ 2Ba', '960ft2', 'available jul 1', 'air conditioning', 'condo', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-06-18T13:00:36-0400"}]