[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-welcome-to-921-railway-square\/7621239070.html","post_id":7621239070,"title":"Welcome to 921 Railway Square!","description":"Welcome to 921 Railway Square! This upper level, one bedroom condo is located in the popular Exton Station Community. It offers an open living room and dining area, a nicely updated eat-in kitchen, a large master bedroom and full bath on the main level. Take the spiral staircase up to a loft area that is great for an office, den, or maybe even a second bedroom. This condo has been updated with all new windows.","num_images":4,"lat":40.017022,"lng":-75.608115,"attrs":"['1BR \/ 1Ba', '828ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T20:13:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wilmington-townhouse-for-rent-available\/7621246285.html","post_id":7621246285,"title":"Townhouse for rent available June 1st","description":"Charming end unit townhome with 3 beds and 1.5 baths. Fenced in back yard, AC, close to Wilmington brew works and pizzeria metro.","num_images":0,"lat":39.7616,"lng":-75.5386,"attrs":"['3BR \/ 1.5Ba', '1250ft2', 'available jun 1', 'air conditioning', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T20:46:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-bedroom-bath-newer\/7621238234.html","post_id":7621238234,"title":"Updated 2 Bedroom 1 Bath NeWeR ApPlIaNcEs Apartment in Philadelphia!!","description":"Great 2 Bedroom 1 Bathroom for rent in Philadelphia!! Newer appliances, including a Haier washer-dryer. GRANITE COUNTER TOPS, all new stainless appliances, and a breakfast bar! There is access to the patio with a fire pit surrounded by grape vines, as well as access to the private pool. Patio door gives access to large 2 tier deck and landscaped yard. Parking space provided on driveway. THIS IS A QUIET SETTING, perfect for relaxing and getting away from it all. Driveway parking is available lite by period street lamp. Door come with double-sided deadbolts and insulation has been recently updated. New Water Heater, Newer Furnance And Ac, Culligan Water System, And Gutter Guards. Eat pump\/AC great sunset views hot water, sewer & trash pickup included basement laundry Background Check, and Credit Check. Electric baseboard heating. Tile flooring in bathroom, with a full bath and closet for toiletries. (818) 8 5 6-4-9_3-3","num_images":3,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'detached garage', 'rent period: monthly']","posted_date":"2023-05-14T20:10:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-and-beautifully\/7621209977.html","post_id":7621209977,"title":"Spacious and Beautifully Renovated Queen Village Apartment","description":"Welcome to your beautifully renovated apartment in the heart of Queen Village! You will be impressed with the spaciousness and charm of this wonderful home. The unit features stunning original hardwood floors and high ceilings throughout. As soon as you enter, you will be greeted with natural light streaming in from the double-pane windows, illuminating the open living and dining areas.\nThe kitchen is a chef's dream, with top-of-the-line stainless steel appliances, including a dishwasher, microwave, and garbage disposal. There is ample storage space for all your kitchen essentials in the custom cabinetry, and the granite countertops provide plenty of space for meal prep. Adjacent to the kitchen, you will find a cozy breakfast nook, perfect for enjoying your morning coffee.\nThis unit is perfect for those who value their privacy, with the convenience of in-unit washer and dryer. Take advantage of the beautifully landscaped patio to relax and unwind after a long day. The patio is furnished with a table and chairs, providing a perfect setting for outdoor dining or entertaining guests.\nThe bathroom features a bathtub, perfect for a relaxing soak after a busy day. You will also appreciate the convenience of central air conditioning and heating throughout the apartment, ensuring your comfort year-round.\nLocated in the desirable Queen Village neighborhood, you will be in close proximity to all the best restaurants, cafes, and shopping. This apartment is also within walking distance to public transportation, making it easy to get to all parts of the city. Don't miss out on the opportunity to make this stunning apartment your new home!\n","num_images":17,"lat":39.938889,"lng":-75.14617,"attrs":"['1BR \/ 1Ba', '650ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-05-14T18:16:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-kitchen-and\/7621235005.html","post_id":7621235005,"title":"spacious kitchen and living room and 1.5 bathrooms. Stainless steel","description":"3Beds 1.5Baths 1036Sqft with finish basement, spacious kitchen and living room and 1.5 bathrooms. Stainless steel appliances with dishwasher and microwave, central AC and heat and laundry hook ups. Quarts counter tops and beautiful bathrooms.  Contact no;  show contact info","num_images":4,"lat":39.9954,"lng":-75.1698,"attrs":"['3BR \/ 1.5Ba', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T19:57:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-home-has-state-of-the\/7621234570.html","post_id":7621234570,"title":"This home has state of the art mechanicals for maximum comfort.","description":"3 bedroom 1.5 baths 1500 sqft, This home has state of the art mechanicals for maximum comfort. Contact no;  show contact info","num_images":4,"lat":40.0008,"lng":-75.0727,"attrs":"['3BR \/ 1.5Ba', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T19:55:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/north-wales-1bedroom-1bathroom-with\/7621234732.html","post_id":7621234732,"title":"1Bedroom 1Bathroom with Washer\/Dryer, Central Air and Patio","description":"Large 1 Bedroom, 1 Bathroom first floor condo unit. It has a patio with a storage closet, new floors, Washer and a new Dryer in unit, microwave, garbage disposal, an eat-in kitchen, Central Air and off-street parking. The community has an outdoor pool, a tennis court and a basketball court. Trash and snow removal is included with your rent. You get gas for the heat at a discounted rate. Small dogs and cats are welcome with a deposit. This is a quiet community where you'll frequently see deer pass thru.\nTenant responsible for gas for heat (remains in owners name for a discount with the HOA) and electric. Water, trash, sewer and HOA is paid by the owner. Pets may be accepted with an additional deposit. 1 year lease. Credit Check and Paystubs required with application.\nBring your credit report and proof of income to submit your application.\n","num_images":5,"lat":40.22332,"lng":-75.270295,"attrs":"['1BR \/ 1Ba', '725ft2', 'available jul 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'condo', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T19:56:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-cozy-bedroom-for-rent\/7621209674.html","post_id":7621209674,"title":"Cozy 1-bedroom for Rent close to public transportation","description":"Nice and Spacious 1-bedroom Apartment for rent! Close to public transportation, groceries and almost everything you need. It will be available on May 15th, 2023\nLooking for Clean, Quiet and Responsible Tenants.\nRent: $750 plus utilities (Electric only).\nRequirements:\n$50 application fee, require credit score of 600 and good rental history.\n3-month rent for move in (the first, the last and the security)\nNO more than TWO occupant allowed\nNO SMOKE ALLOWED.\nThank you! This unit will not disappoint \/-text your phone number.\n","num_images":0,"lat":39.9523,"lng":-75.1638,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T18:15:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-7501-bd-bathroom-house-for\/7621210100.html","post_id":7621210100,"title":"$7501 bd\/1 Bathroom House for Rent June 3rd","description":"PET FRIENDLY & Washer & dryer in Unit! Parking on this side of Manayunk is very easy too!! Welcome to this roomy 1 spacious bedroom end-row unit in Manayunk. This home is a convenient 5-minute Walk to Main Street and the Wissahickon Train Station. This home gets lots of natural light. and is perfect for 3-4 people. The first floor features a spacious living room and dining room, a galley kitchen that connects to the back patio area, plus a half bath. The second level features a Master Bedroom and a second bedroom with a hallway full bathroom. The third floor has two more large bedrooms! This house has been a well-maintained rental property. Recent improvements include a partial new roof, new siding on the rear upper level, bathroom remodel, two walk-in closets, kitchen remodel, and Powder room addition. Newer energy-efficient replacement windows throughout. Available June 3rd. Tenants pay all utilities.\nPosted by Owner, special deal on Craiglist, can confirm and connect with Realtor if interested.\n","num_images":0,"lat":39.9523,"lng":-75.1638,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T18:17:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-4718-rawle-st-philadelphia\/7621198464.html","post_id":7621198464,"title":"4718 Rawle St. Philadelphia PA, 19135 - HOUSE FOR RENT.@@","description":"Don't miss out on your opportunity to make this single family townhome in the Tacony neighborhood of Philadelphia your family's new home! This lovely home is newly renovated and features 2 bedrooms, 1.5 bathrooms, an All-New Kitchen Appliance package, first floor laundry, a nice backyard, and is within walking distance of shopping, restaurants, schools and more.\n- Pet-friendly. $250 pet fee. Some dog breed restrictions.\n- 600 credit score required. Lower score may be accepted along with a co-signer.\nApplicants with housing vouchers and subsidies, including Housing Choice or “Section 8” Vouchers, are encouraged and accepted.","num_images":4,"lat":40.0018,"lng":-75.1179,"attrs":"['2BR \/ 1.5Ba', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T17:33:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-laundry-in-unit-central\/7621103700.html","post_id":7621103700,"title":"Laundry in Unit, Central Location, Ideal Location","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown is offering brand-new studio, one and two-bedroom apartments in Downingtown, our community connects you to the beauty of the outdoors while also keeping you just a short distance away from both Center City Philadelphia and King of Prussia. Stop by today!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, a mudroom with a washer\/dryer, walk-in closets, master suite, and a balcony!\n[#9680609]","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1100ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T12:20:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-society-hill-bed\/7621098269.html","post_id":7621098269,"title":"Gorgeous Society Hill 1 bed with Laundry in Building!","description":"This spacious apartment is located in the heart of Society Hill just blocks away from the gorgeous Washington Square Park, ACME, Delaware River Trail, and the best restaurants and bars in the city. This apartment features:\n-Original hardwood flooring flowing throughout the unit\n- The bedroom and living room walls are lined with windows that let in a ton of natural light\n- Plenty of closet space\n- Both living areas contain ceiling fans\n- Beautiful private outdoor area that is shared with the other tenants in the building.","num_images":0,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T12:04:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-bath-apt-mo-near\/7621101414.html","post_id":7621101414,"title":"2 BR 1 Bath Apt. - $1150\/mo Near Aramingo\/Castor","description":"Newly Remodeled 2 BR 1 Bath off Frankford & Castor Ave. close to Aramingo. Desirable area close to Shopping Centers & Transportation. 1st Floor.\n- Central Air condition\n- Stove oven and Refrigerator\n- No washer & dryer hookups\n- Flat monthly fee for Water\n- No pets\n$1150 per month rent\n1st month & 2 months security deposit = $3450 total to move in\nCall or text ASI @\nPrime location…This won’t last long!\n37** Frankford Avenue","num_images":7,"lat":39.9999,"lng":-75.0982,"attrs":"['2BR \/ 1Ba', '700ft2', 'apartment', 'no laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T12:12:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-home-on\/7621091050.html","post_id":7621091050,"title":"Newly renovated home on a quiet West Philly block.","description":"Newly renovated home on a quiet West Philly block. Large 2br\/1ba with wood floors throughout, two large bedrooms with good closet space, stainless steel appliances, dishwasher, butcher block counter top, recessed lighting and open floor plan with a large basement for storage. The property also features a large enclosed backyard for your comfort.\nThis is a nice quiet block with easy access to public transportation, shops and more. Don't miss, schedule your tour now.CONTACT :-  show contact info","num_images":3,"lat":39.9612,"lng":-75.2303,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T11:39:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-expansive-furnished\/7621093256.html","post_id":7621093256,"title":"Expansive Furnished Rooftop with Stunning Views. Must see apartments!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Residences at One Brown 1 Brown Street, Philadelphia, PA, 19123See our property details here:https:\/\/archcompanies.aptglance.com\/73t034Call Now -  show contact info\nx 78OR Text 78 to  show contact info\nto text our team.Stunning Apartments in Northern Liberties2 Bedroom, 2 Bath | Approximately 1228 Sq. Ft. 1228Community Info:1 Brown will check off everything on your list of must-haves with stunning luxury apartments in the neighborhood of Northern Liberties. Take a look at the variety of floor plans and choose the perfect spot for your lifestyle. No matter which residence you choose, your home will boast a spacious layout with classic, sophisticated interior finishes.A variety of relaxing amenities await you, including a rooftop with scenic waterfront views and, a fitness center, and a heated resort style pool. Conveniently located in the heart of the Northern Liberties neighborhood of Philadelphia, you’ll be surrounded by historical sites as well as a wealth of restaurants, entertainment options, and shopping. Unit Highlights ✧  Nest Thermostats ✧  Stainless Steel Appliances ✧  9 Ft Ceilings ✧  Quartz Counter Tops ✧  Gourmet Eat-In Kitchens with Cherry Wood Cupboards ✧  Spa Shower System & Jacuzzi Tub ✧  Generous Closet Space ✧  Large Bathrooms ✧  Largest Apartments in the Area ✧  Full Size Washer\/Dryer in unit ✧  Floor to Ceiling WindowsCommunity Highlights ✧  Dry Cleaning Service ✧  24-Hour Concierge Service ✧  Rooftop Walking Track & Dining Areas ✧  Fully Outfitted Fitness Center ✧  Spacious Highrise Living ✧  Spectacular Resort Style Pool Area ✧  Amazing Views and Rooftop LoungeOffice HoursMonday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMPet PolicyPet PolicyCats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today! Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! Equal Housing Opportunity cnnZ04st\n","num_images":16,"lat":39.962145,"lng":-75.137734,"attrs":"['2BR \/ 2Ba', '1228ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T11:47:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-fitness-center-incredible\/7621091065.html","post_id":7621091065,"title":"Fitness Center, Incredible Features, Central Location","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nBe the first to live at The Point at Downingtown. We are a pet friendly community that has it all. Schedule a tour today!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, and a walk-in bedroom closet!\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nApartment Features\n* Kitchen Island\n* Garden Tub\n* Private Patio or Private Balcony (on select apartments)\n* Stainless Steel Appliances\n* Washer and Dryer in unit\n* Walk-in Closet\n* Linen Closet","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['1BR \/ 1Ba', '884ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T11:39:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-making-it-an-ideal-choice\/7621058032.html","post_id":7621058032,"title":"Making it an ideal choice! 1295 square foot 2BR*Very clean!","description":"Making it an ideal choice! This 1295 square foot single family home. Fully renovated 2 Bedroom apartment close to the bus stop. Beautiful kitchen with granite counter top and all brand new stainless steel appliances. Hardwood floors, Heat\/hot water - Gas, Oven \/ range, Refrigerator, Microwave, Dishwasher, Washer\/dryer hookup, No AC, Pet Friendly.\nFeatures:\n- Very clean interior\n- Exterior: Fence\n- Free heat and hot water included\n- Cool open living\/dining room area\n- Updated kitchen and bathroom\n- Freshly painted and Ultra Clean Condition\n- Heating and Cooling: Heat Fuel, Forced Air, Heat\/AC, Central Air\n- Included: Gas Cooking, Stove\n- High-speed internet (WiFI)\n","num_images":4,"lat":39.963006,"lng":-75.195971,"attrs":"['2BR \/ 1.5Ba', '1295ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T09:36:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-bedroom-in-old-city\/7621080969.html","post_id":7621080969,"title":"Modern 2 Bedroom in Old City with Parking Included","description":"This stunning condominium, located in the renowned Nouveau Condominiums, offers a modern and stylish living experience. With 2 bedrooms and 2.5 bathrooms, this home provides a comfortable and spacious environment for you to enjoy.\nStep inside and be greeted by the beautiful natural wood floors that exude warmth and elegance throughout the space adding to the warmth is the modern gas fireplace. The floor to ceiling, insulated and sound reducing windows bring nature into your living room, with lush green gardens, and flowering trees, the living room feels like you're floating in an enchanted garden.\nThe open-concept layout seamlessly connects the living, dining, and kitchen areas, creating a perfect space for entertaining guests or relaxing with loved ones. The kitchen boasts sleek and contemporary features, including Miele appliances, honed soapstone countertops, and ample Poggenpohl cabinet space, allowing you to unleash your culinary creativity. Whether you're preparing a quick meal or hosting a dinner party, this kitchen will exceed your expectations.\nThe two bedrooms provide a tranquil retreat, each with its own private bathroom. The primary bedroom offers a serene sanctuary, complete with an ensuite bathroom featuring modern fixtures and finishes. Just off the primary is a sleek balcony large enough for lounge seating, and a bistro table. The additional bedroom is equally inviting and can be utilized as a guest room, home office, or whatever suits your lifestyle.\nNouveau Condominiums itself is an exceptional building with a host of amenities to enhance your living experience. Enjoy a secure entrance, deeded parking, and tranquil green space. Situated in the heart of Old City, this home grants you unparalleled access to the rich history and culture that surrounds you.\nListing courtesy of Keller Williams Philadelphia","num_images":21,"lat":39.954992,"lng":-75.142204,"attrs":"['2BR \/ 2.5Ba', '1316ft2', 'available jul 6', 'air conditioning', 'application fee details: $50', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T11:04:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cumbola-very-cozy-br-ba-apartment-with\/7621057535.html","post_id":7621057535,"title":"Very Cozy 2 BR \/ 1 BA Apartment With Private Patio.","description":"For IMMEDIATE MOVE-IN. We cannot hold this property for you.\n2 BR \/ 1 BA \/ living room \/ bathroom \/ kitchen \/ private patio\nCozy apartment\nFenced, small outdoor patio (5'7\" x 10\")\nWithin 5-minute walking distance to Safeway, Staff of Life, Staff of Life, Hong Kong Charlie's and 24 Hour Fitness\nShort walk to Soquel Avenue bus stop\nOn-site, coin-operated laundry\nCluster mailbox with personal mailbox key\nUnassigned, off-street parking\n","num_images":4,"lat":40.7195,"lng":-76.1158,"attrs":"['2BR \/ 1Ba', '12000ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T09:34:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-redefining-luxury-at-park\/7621073621.html","post_id":7621073621,"title":"Redefining Luxury at Park Lane!!","description":"Apt. 2310 — Oxford floor plan — 1,203 sq. ft. — $3,235\nThis 3rd floor 2-bedroom\/2-bathroom apartment home has much to offer! It comes with central heat and air, stainless steel appliances, and plush carpeting throughout! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive living area is perfect for hosting! This gorgeous apartment has a beautiful view of the Philadelphia skyline. It is also within close proximity to our Clubhouse — featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T10:37:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stunning-apts-in-northern\/7621070167.html","post_id":7621070167,"title":"Stunning Apts in Northern Liberties - Get 1 Month Free! Call Today!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Residences at One Brown 1 Brown Street, Philadelphia, PA, 19123Call Now -  show contact info\nx 77OR Text 77 to  show contact info\nto text our team.Want more information? Follow this link:https:\/\/archcompanies.aptglance.com\/3zc9krStunning Apartments in Northern Liberties1 bedroom | 1 bath | 675 square feetApartment Features: ✓  Large Bathrooms ✓  Generous Closet Space ✓  Floor to Ceiling Windows ✓  Quartz Counter Tops ✓  Spa Shower System & Jacuzzi Tub ✓  Full Size Washer\/Dryer in unit ✓  Nest Thermostats ✓  Stainless Steel Appliances ✓  Gourmet Eat-In Kitchens with Cherry Wood Cupboards ✓  Largest Apartments in the Area ✓  9 Ft CeilingsCommunity Features: ✓  Fully Outfitted Fitness Center ✓  Spacious Highrise Living ✓  Rooftop Walking Track & Dining Areas ✓  Dry Cleaning Service ✓  Spectacular Resort Style Pool Area ✓  Amazing Views and Rooftop Lounge ✓  24-Hour Concierge ServiceCommunity Info:Residences at 1 Brown offers stunning and spacious studios, one, two, and three bedroom apartments with premium features designed to help you live your best life every day. Each unit has oversized bedrooms and enough living space for both a media center and kitchen table. You will thoroughly enjoy the soaking up the ample space to relax or host guests! Upscale kitchens with cherry wood cupboards are brimming with the latest appliances complemented by granite countertops and ample storage space. Nearby, you can enjoy a spa shower and Jacuzzi tub in your bathroom, take advantage of your personal washer and dryer, and set up a special place for your pets. As you come home to your 1 Brown apartment each day, you're stepping into a place of comfort, convenience and class. Call Today!Pet Policy:Pet Policy:Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today!Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PM Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! Equal Housing Opportunity 9S8JaFH9jmB\n","num_images":14,"lat":39.962145,"lng":-75.137734,"attrs":"['1BR \/ 1Ba', '675ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T10:24:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-totally\/7621057208.html","post_id":7621057208,"title":"Beautiful Totally Remodeled 1 bedroom 1 bathroom unit","description":"1 Bedroom 1 Bathroom for rent !! This is A beautiful neighborhood. Newer appliances, including a Haier washer-dryer. To maximize space there is a new built-in queen size Murphy Bed and custom closet shelving. There is access to the patio with a fire pit surrounded by grape vines, as well as access to the private pool. Parking space provided on driveway. This is a quiet setting, perfect for relaxing and getting away from it all. Driveway parking is available lite by period street lamp.","num_images":4,"lat":40.0568,"lng":-75.1379,"attrs":"['1BR \/ 1Ba', '1200ft2', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T09:32:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-1000-sqft\/7621046561.html","post_id":7621046561,"title":"Renovated (1,000) sqft 2BR*(Move in ready)!!","description":"Location*4941 Walnut St FLOOR 3, Philadelphia, PA 19139\nRent: 1,050 ( A month)\nDescription-\nFully renovated 2 Bedroom, 1 full bathroom (1,000) sqft apartment in University City close to the bus stop. Beautiful kitchen with granite counter top and all brand new stainless steel appliances. Hardwood floors, Heat\/hot water - Gas, Oven \/ range, Refrigerator, Microwave, Dishwasher, Washer\/dryer hookup, Pet Friendly.\nUpdates include:\n*Luxury vinyl plank flooring\n*Full size refrigerator\n*Fresh paint throughout\n(Move in ready)\n","num_images":1,"lat":39.956316,"lng":-75.220391,"attrs":"['2BR \/ 1Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T08:38:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bensalem-bed-bath-story-bensalem-single\/7621055191.html","post_id":7621055191,"title":"3 bed 1 1\/2 bath 2 story Bensalem single is sure not to last long","description":"3 bed 1 1\/2 bath 2 story Bensalem single is sure not to last long. The traditional exterior features classic gable dormers, a custom stone front and an inviting covered front porch. Plus, enjoy the convenience of a private driveway and attached garage with inside access, all on an oversized corner lot. Step through the front door to the heart of the home where you'll be overwhelmed with the sun soaked open concept main living area. The spacious front living area offers premium function and endless possibilities for the use of space. Continue through the main living area to a decorative porcelain fireplace and an additional multi function dining, gaming or work space area.\nPlease Give Your Numebr\n","num_images":4,"lat":40.1109,"lng":-74.9378,"attrs":"['3BR \/ 1.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T09:23:26-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-available\/7621047928.html","post_id":7621047928,"title":"Spacious 3 Bedroom Available For Rent!!!","description":"Spacious 3 bedroom cape cod with walk in closets. Renovations have started, just needs finished or leave as is for additional storage space. Finished lower level for entertaining. Workshop area and exercise area. Laundry with slop sink and toilet. Economical natural gas heat, cooking and hot water. A\/c, attached garage, alley access. Fenced yard with a covered rear patio. Close to schools, shopping and italian lake.\nWITHOUT PROVIDING THE INFORMATION, YOU MAY NOT GET A RETURN OR E-MAIL. Thank you !\ndo NOT contact me with unsolicited services or offers.","num_images":9,"lat":40.0338,"lng":-75.1731,"attrs":"['3BR \/ 2Ba', '1050ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T08:46:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-clean-fully\/7621039265.html","post_id":7621039265,"title":"Spacious, clean, fully renovated unit*Easy access to highways I-95 and","description":"This beautiful, late gothic revival building offers modern-industrial artist lofts inside the historic Daniel Boone School in the Northern Liberties area of Philadelphia. Enter this unit to a hallway that opens into your main living area. There are high ceilings, large windows, and an open floor plan. The kitchenette boasts modern cabinetry, subway tile backsplash, and stainless steel appliances including overhead microwave, electric range, and refrigerator. To the left of your kitchen area are 2 bedrooms that are about the same size and have great natural light. The full bathroom is equipped with slate tile flooring, vanity for storage, and a subway tiled bathtub \/ shower combo.  Easy access to highways I-95 and I-676, as well as public transportation with the Girard station for the Market-Frankford line just a block away. Close proximity to Penn Treaty Park, Piazza Dog Park, The Fillmore, and Brooklyn Bowl. Walking distance to Front Street Cafe, Urban Village Brewing Company, Jerry’s Bar, Barcade, Love & Honey Fried Chicken, Frankford Hall, The Kettle Black, and so many more","num_images":4,"lat":39.967299,"lng":-75.137282,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T07:49:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-gorgeous-bed-home-with\/7621041385.html","post_id":7621041385,"title":"Gorgeous  3 Bed home with a private entrance!","description":"Mill Grove offers all the quality ingredients that you are looking for in a home - comfort and convenience in an elegant country setting. A spacious, landscaped community, Mill Grove is set adjacent to the Audubon Wildlife Sanctuary in Montgomery County -- just minutes from the sophisticated shopping at The Court and The Plaza at King of Prussia, and from the unparalleled recreation facilities of historic Valley Forge National Park. Convenient to major corporate and business centers, Mill Grove is just off Route 422 (the Pottstown Expressway), and only a short drive from Route 476 (the Blue Route), Route 76 (the Schuylkill Expressway) and the Pennsylvania Turnpike.\nApartment Amenities Include:\nCovered Private Entrances\nThree Bedrooms With Den\nGas Range\nEnergy Saving Frost Free Refrigerator\nWalk-In-Closet in Master Bedroom\nPrivate Covered Balcony\nHot and Cold Water Included\nMail Delivery to Your Front Door\nEnjoy Exclusive Access to:\nState of the Art Brand New Renovated Fitness Center\nCrystal Blue Swimming Pool\nBarbecue Grills and Picnic Tables\nCommunity Playground\nWITHOUT PROVIDING THE INFORMATION, YOU MAY NOT GET A RETURN OR E-MAIL. Thank you !\ndo NOT contact me with unsolicited services or offers.\n","num_images":7,"lat":39.9227,"lng":-75.1812,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T08:05:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdowne-available-bedroom-bathroom\/7621038914.html","post_id":7621038914,"title":"Available 2 Bedroom 1 Bathroom for rent in philadelphia !!","description":"Available 2 Bedroom 1 Bathroom for rent in philadelphia !! This is a fantastic STUDIO attached to a private residence in a beautiful neighborhood of philadelphia . This darling studio is new construction with light finishes and white cabinetry. Newer appliances, including a Haier washer-dryer. To maximize space there is a new built-in queen size Murphy Bed and custom closet shelving. There is access to the patio with a fire pit surrounded by grape vines, as well as access to the private pool. Parking space provided on driveway. This is a quiet setting, perfect for relaxing and getting away from it all. Driveway parking is available lite by period street lamp. Door come with double-sided deadbolts and insulation has been recently updated. The building is up to fire code with sprinklers. BACKGROUND CHECKS will be done on evictions. THE TENANT PAYS ALL UTILITIES. per month $750 Reply with your personal Phone number. Tax .Please text me::‪  show contact info","num_images":3,"lat":39.9375,"lng":-75.2637,"attrs":"['2BR \/ 1Ba', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'townhouse', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T07:46:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-where-luxury-meets\/7621037238.html","post_id":7621037238,"title":"Where Luxury Meets Convenience!!","description":"Apt. 2201 — Trafalgar floor plan — 1,452 sq. ft. — $4,033\nThis large 2nd floor corner apartment has so much to offer! This apartment home includes LVT flooring throughout the spacious living area, central heat and air, a spacious laundry room, stainless steel appliances, a large private balcony, and ample storage space. The master bedroom is equipped with a spacious walk-in closet and generously-sized bathroom with double vanity sinks. The guest bedroom and bathroom are spacious, as well! This beautiful apartment is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1452ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T07:32:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-available-bedroom-bathroom\/7621032067.html","post_id":7621032067,"title":"Available 2 Bedroom 1 Bathroom for rent in Philadelphia!!","description":"Available 2 Bedroom 1 Bathroom for rent in Philadelphia!! This is a fantastic STUDIO attached to a private residence in a beautiful neighborhood of Reading. This darling studio is new construction with light finishes and white cabinetry. Newer appliances, including a Haier washer-dryer. To maximize space there is a new built-in queen size Murphy Bed and custom closet shelving. There is access to the patio with a fire pit surrounded by grape vines, as well as access to the private pool. Parking space provided on driveway. This is a quiet setting, perfect for relaxing and getting away from it all. Driveway parking is available lite by period street lamp. Door come with double-sided deadbolts and insulation has been recently updated. The building is up to fire code with sprinklers. BACKGROUND CHECKS will be done on evictions. THE TENANT PAYS ALL UTILITIES. per month $750 Reply with your personal Phone number. Tax .Please text me::‪ show contact info","num_images":4,"lat":39.9579,"lng":-75.2681,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T06:38:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-condo-available\/7621026362.html","post_id":7621026362,"title":"Spacious condo available for move in","description":"Condo is conveniently located near The Shops at Liberty Place and Reading Terminal for shopping. It is a rider's paradise with top-notch public transportation, transit score of 100, and easy access to Suburban Station, 15th Street, and City Hall. Recreational activities include 5 parks within 1.6 miles, while Philadelphia International is just 20 minutes drive away.","num_images":7,"lat":39.954,"lng":-75.176,"attrs":"['1BR \/ 1Ba', '965ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'condo', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T04:39:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/upper-darby-freshly-renovated-bedroom\/7621024006.html","post_id":7621024006,"title":"Freshly renovated 2 bedroom 2 bath house for rent.","description":"Freshly renovated 2 bedroom 2 bath house for rent. This ginger-bread style house has hardwood floors, 10' ceiling with ceiling fans, dining area overlooking rear patio. Bedroom has two large closets for excellent storage. Kitchen comes with electric range, refrig. And washer\/dryer. A spacious bathroom with fiberglass tub and shower. The front porch has porch swing for relaxing swings in the summer breeze and private sitting deck for sunning. Driveway parking is available lite by period street. Door come with double-sided deadbolts and insulation has been recently updated in a quiet building spacious renovated with: new kitchen with granite countertops and stainless appliances dishwasher new flooring throughout new paint high efficiency heat pump\/ac great sunset views hot water, sewer & trash pickup included basement laundry.\nPlease send your phone number for more details.\n","num_images":1,"lat":39.9579,"lng":-75.2681,"attrs":"['2BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T03:37:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-ginger-bread-style-house\/7621023999.html","post_id":7621023999,"title":"Ginger-bread style house has hardwood floors","description":"Freshly renovated 3 bedroom 2.5 bath house for rent. This ginger-bread style house has hardwood floors, 10' ceiling with ceiling fans, dining area overlooking rear patio. Bedroom has two large closets for excellent storage. Kitchen comes with electric range, refrig. And washer\/dryer. A spacious bathroom with fiberglass tub and shower. The front porch has porch swing for relaxing swings in the summer breeze and private sitting deck for sunning. Driveway parking is available lite by period street. Door come with double-sided deadbolts and insulation has been recently updated in a quiet building spacious renovated with: new kitchen with granite countertops and stainless appliances dishwasher new flooring throughout new paint high efficiency heat pump\/ac great sunset views hot water, sewer & trash pickup included basement laundry.\nPlease send your number –I will contract as soon as possible !\n","num_images":1,"lat":39.9474,"lng":-75.1473,"attrs":"['3BR \/ 2.5Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T03:37:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-completely-updated-extra\/7621020871.html","post_id":7621020871,"title":"Completely updated Extra +larger 2 bed 1 bath house in Philadelphia !!","description":"Completely updated Extra larger 2 bed 1 bath house in Philadelphia . Great location, close to downtown. Plank flooring throughout. Vaulted ceilings with exposed beams in the living room. Private patio in the back features your very own lime tree. Mini split A\/C system in the main living area. Off street parking available on driveway. Be the first to live in this beautiful home! The Cherry Lane apartments is a wonderful community with a pool, spa, laundry, and is in a secured building. There are vaulted ceilings, 1 large bedroom, two baths and extra on-site storage. Newer stainless steel appliances, updated kitchen and updated baths along with skylights make this bright home perfect for anyone looking to live in Golden Hill. Cats ok, no dogs please. Top floor unit with amazing downtown views. Walking distance to Downtown, Philadelphia , and all the cool shops and restaurants in Philadelphia . *please contact:  show contact info","num_images":4,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '1620ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'detached garage', 'rent period: monthly']","posted_date":"2023-05-14T02:37:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-recently-renovated-bedroom\/7621021135.html","post_id":7621021135,"title":"Recently renovated 1 bedroom apt features:Open Concept.!!","description":"Recently renovated 1 bedroom apt features:\nOpen concept Living room, Modern kitchen, Modern bathroom, Ample closet space, own separate entrance. All utilities are included in the rent.\nNo smoking.  pets Ok .All utilities are included in the rent, street parking only.\nIf you would like a showing please  show contact info\nSe renta efficiency en el wear de hialeah. Área céntrica y tranquila. Excelentes condiciones, pequeño, perfecto para una persona. Impuesto por una habitación con closet, cocina independiente y baño. Patio cercado con entrada y parque independientes también. Aire acondicionado privado. Todo incluido, internet y Netflix. Listo para mudarse por el precio de $1,050 al mes.\nSe requiere:\n-Primer mes y mes de fondo\n-Personas que trabajen\n-No mascotas","num_images":1,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T02:42:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-build-bi-level\/7621011336.html","post_id":7621011336,"title":"Newly build bi-level structure furnished two bedrooms two full baths","description":"Newly build bi-level structure furnished two bedrooms two full baths. with private access to the roof deck, overlooking the Center City and Reading Viaduct Park. Minutes away from Broad St., Reading Terminal Market, Chinatown, and major highways. Central A.C.\/Heat, hardwood floors throughout the entire unit, stone countertops. stainless appliances, in-unit washer, and dryer. Unit can be furnished . The tenant pay for utilities and cable and water. showing is available upon request.","num_images":3,"lat":39.959982,"lng":-75.158344,"attrs":"['2BR \/ 2Ba', '1300ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T00:30:32-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-townhome4rent1216\/7621009354.html","post_id":7621009354,"title":"*SPACIOUS TOWNHOME*4RENT*1216 Levick St*","description":"Rent*1050\nRefundable Deposit*700\n","num_images":11,"lat":40.063,"lng":-75.08,"attrs":"['3BR \/ 3Ba', '1408ft2', 'available now', '\\nwednesday 2023-05-17\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T00:11:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-nice-looking-towhome1216\/7621010037.html","post_id":7621010037,"title":"*NICE LOOKING TOWHOME*1216 Levick St*","description":"Monthly Payment*1050\nRefundable Deposit*700\n","num_images":11,"lat":40.063,"lng":-75.08,"attrs":"['3BR \/ 3Ba', '1408ft2', 'available now', '\\nwednesday 2023-05-17\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T00:17:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-and-spacious-2br\/7621011120.html","post_id":7621011120,"title":"BEAUTIFUL and SPACIOUS 2BR, 1BA 1st Floor Apartment","description":"BEAUTIFUL and SPACIOUS 1st Floor 2 bedroom, 1 bathroom apartment in Mount Airy near the corner of Germantown Avenue and Springer Street. Here are some of the amenities:\n- HUGE living room with hardwood floors and uniquely beautiful original architectural details\n- Open floor plan, with kitchen open to living room\n- Spacious kitchen with ample counter space, gas stove, fridge, and dishwasher\n- Lots of natural light and newer double-pane windows throughout\n- Good closet space in each room\n- Washer and dryer in unit\n- Central heat and A\/C controlled by the tenant\n- Additional storage space available in basement\nThe 23 bus stop is less than a block away, and Carpenter Lane train station can take you right into Center City.\nThis is a family-owned and managed building--owners live just 2 blocks away.\nThe apartment is currently occupied and is available for move-in on July 15th.\nFirst month, last month, and security deposit are required.\nApplication fee is $40 per person.\n1 year leases only, we don't do month-to-month.\nNo smoking allowed, no pets.\nTenant pays electric, gas, and a $40\/month water fee, along with any other utilities desired by the tenant (internet, cable TV, etc.).\nPlease feel free to e-mail me with any questions or to set up an appointment to see the apartment.\nThanks!\nMax\nMount Airy \/ Mt. Airy \/ Chestnut Hill \/ Germantown\n","num_images":11,"lat":40.051369,"lng":-75.184851,"attrs":"['2BR \/ 1Ba', 'available jul 15', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T00:28:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/valley-forge-high-rise-unit-with\/7621001347.html","post_id":7621001347,"title":"High rise UNIT with spectacular views of King of Prussia","description":"A spacious one bedroom high rise UNIT with spectacular views of King of Prussia & beyond! This is luxury living at its finest in a very desirable 12th floor one bedroom! This efficient UNIT features a warm and inviting kitchen with refrigerator included. The entire living space features neutral colors and has a larger feel with a nicely sized dining room & living room with a slider to a cozy balcony & fantastic 12th floor views! You can access your oversized balcony from both the living room and bedroom! The spacious bedroom has a full bath and plenty of closet space! 1 bath is perfect to accommodate your guests. Want more? How about washer, dryer & refrigerator included, larger closets, same floor storage bay, indoor & outdoor pool, tennis courts, state of the art fitness center & health club, steam room, picnic area, banquet room & retail stores on site! Only minutes from the best shopping & dining in the area, Valley Forge Park, Valley Forge Casino, PA Turnpike, RT 422 & 202.","num_images":10,"lat":40.104201,"lng":-75.412747,"attrs":"['1BR \/ 1Ba', '960ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-13T23:09:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-all-new-bedrooms-bath\/7621003197.html","post_id":7621003197,"title":"⭐⭐⭐ ALL NEW, 2 BEDROOMS & 2 BATH APARTMENT LOCATED IN WEST PHILADELPHI","description":"Property Address\n4130 W Girard Ave | PHILADELPHIA PA 19104\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ NOT YOUR USUAL APARTMENT, CAN YOU SAY OVERSIZED?\n✔️ ALL BRAND NEW! LARGE, BI-LEVEL 2 BEDROOM & 2 BATH APARTMENT LOCATED IN THE BELMONT AREA OF WEST PHILLY!\n✔️ ALL BRAND NEW! STYLISH INTERIOR WALLS DESIGN!\n✔️ LUXURY KITCHEN W\/ CUSTOM DESIGNER BACKSPLASH & STYLISH ISLAND FEATURING GRANITE COUNTERTOPS!\n✔️ VINYL LAMINATE FLOORING THROUGHOUT FOR EASY CLEANING!\n✔️ THE KITCHEN IS EQUIPPED W\/ ALL BRAND-NEW STAINLESS STEEL APPLIANCES!\n✔️ HUGE LIVING ROOM W\/ PLENTY OF SPACE FOR ENTERTAINING GUESTS!\n✔️ DESIGNER BATHROOMS W\/ ALL NEW VANITIES!\n✔️ CENTRAL AIR & CENTRAL HEAT FOR YOUR COMFORT!\n✔️ WASHER & DRYER HOOK-UP FOR ADDED CONVENIENCE!\n✔️ BI-LEVEL APARTMENT\n✔️ LOCATED CLOSE TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO CENTER CITY!\n✔️ APPLY TODAY! REDBLOCK.COM\/APARTMENT\/ THIS WILL NOT LAST LONG!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 2 BA\nSquare Feet: 1100\nRental Terms\nRent: $1400\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":7,"lat":39.973853,"lng":-75.20666,"attrs":"['2BR \/ 2Ba', '1100ft2', 'flat', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-05-13T23:22:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-br-15-bath-home-for-rent\/7621007543.html","post_id":7621007543,"title":"$1250  3br 1.5 bath home for rent 5420 Discher St","description":"3BR\/ 1.5 bath home. well maintained Porch front home with hardwood floors. Finished basement. in good shape. half bath in the basement and newer boiler.This is an estate, Partialiy Furnished, Jump on the Market Frankford Line and you are in Fishtown in 15 minutes or Center City in 20 minutes. I-95, Route 1 and the bridges to NJ are all in close proximity\n2 month deposit,\nSeeking THOUGHTFUL, RESPONSIBLE, and CONSIDERATE tenant(s).\nGas\nElectric in tenant to move in.\n","num_images":13,"lat":40.029231,"lng":-75.080283,"attrs":"['3BR \/ 1.5Ba', '1188ft2', 'available jun 1', 'air conditioning', 'furnished', 'apartment', 'laundry on site', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-13T23:55:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-1bd-1bath\/7621004820.html","post_id":7621004820,"title":"⭐⭐⭐ BRAND NEW 1BD & 1BATH LOCATED IN WEST OAK LANE! ⭐⭐⭐","description":"Property Address\n5800 N 17th Street | PHILADELPHIA PA 19141\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ BRAND NEW EVERYTHING!!!\n✔️ NEW! 1 BEDROOM & 1 BATH APARTMENT LOCATED IN WEST OAK LANE AREA!!!\n✔️ NEW! FULLY EQUIPPED MODERN EAT-IN KITCHEN W\/ GRANITE COUNTERTOPS!!!\n✔️ BRAND NEW APPLIANCES (MICROWAVE, ELECTRIC RANGE, FRIDGE)!!!\n✔️ DESIGNER BATHROOM W\/ NEW VANITIES!!!\n✔️ DESIGNER BATHROOM TILES\n✔️ NEW! LAMINATE FLOORING!!!\n✔️ SPACIOUS BEDROOMS!!!\n✔️ LARGE CLOSETS!!!\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 1 BD\/ 1 BA\nSquare Feet: 500\nRental Terms\nRent: $850\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $1700\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":7,"lat":40.042036,"lng":-75.149086,"attrs":"['1BR \/ 1Ba', '500ft2', 'flat', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-05-13T23:34:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bedrooms\/7621003832.html","post_id":7621003832,"title":"⭐⭐⭐ NEWLY RENOVATED, 2 BEDROOMS & 1 BATH APARTMENT LOCATED AT OLNEY\/OA","description":"Property Address\n5544 N Lawrence Street | PHILADELPHIA PA 19120\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ NEW! BEST VALUE APARTMENT! ⭐⭐⭐\n✔️ NEW! SPACIOUS 2 BEDROOMS & 1-BATH APARTMENT LOCATED IN OLNEY\/OAK LANE AREA!\n✔️ NEW! GRANITE COUNTERTOP KITCHEN\n✔️ NEW! DESIGNER KITCHEN CABINETS\n✔️ NEW! STAINLESS STEEL APPLIANCES\n✔️ NEW! CUSTOM BACKSPLASH\n✔️ NEW! MODERN PARQUET FLOORING\n✔️ NEW! DESIGNER PAINTER COLORS\n✔️ NEW! CUSTOM TILED BATHROOM W\/ ALL-NEW VANITIES\n✔️ NEW! CENTRAL AIR\n✔️ NEW! WASHER\/DRYER HOOKUP\n✔️ ALL ELECTRIC\n✔️ CLOSE TO PUBLIC TRANSPORTATION!\n✔️ EASY ACCESS TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO AND FROM THE CITY!\n✔️ APPLY TODAY!!!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 900\nRental Terms\nRent: $1350\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2700\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":6,"lat":40.035274,"lng":-75.129766,"attrs":"['2BR \/ 1Ba', '900ft2', 'duplex', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-05-13T23:26:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-1bath-apartment\/7621004550.html","post_id":7621004550,"title":"⭐⭐⭐2 BEDROOM & 1BATH APARTMENT | LOCATED IN EAST OAK LANE!⭐⭐⭐","description":"Property Address\n5743 Ogontz Ave | PHILADELPHIA PA 19141\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️RECENTLY UPDATED 2 BEDROOM & 1 BATH APARTMENT\n✔️SPACIOUS LIVING ROOM\n✔️SPACIOUS BEDROOMS\n✔️UPDATED KITCHEN\n✔️NEWER APPLIANCES (stove, fridge, microwave)\n✔️ELECTRIC HEATING\n✔️LAMINATE FLOORING\n✔️EASY ACCESS TO PUBLIC TRANSPORTATION\n✔️MINUTES AWAY FROM LA SALLE UNIVERSITY\n✔️CLOSE TO EINSTEIN MEDICAL CENTER\n✔️FIRST FLOOR UNIT WITH ONLY 1 STEP\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 850\nRental Terms\nRent: $1100\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2200\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":6,"lat":40.041606,"lng":-75.150802,"attrs":"['2BR \/ 1Ba', '850ft2', 'loft', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-05-13T23:32:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-updated-bedroom-and-bath\/7621004252.html","post_id":7621004252,"title":"⭐⭐⭐Updated 3 bedroom and 2 bath house located in Northeast Philly!","description":"Property Address\n5649 Frontenac Street | PHILADELPHIA PA 19124\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️Updated Home!⭐⭐⭐⭐⭐\n✔️Spacious 3 bedrooms and 2 bath.\n✔️Updated Kitchen w\/ newer appliances!\n✔️Spacious Kitchen\n✔️Beautiful hardwood flooring throughout\n✔️Huge Rear Deck for Entertainment\n✔️Parking in rear of the property\n✔️Open layout, plenty of closet space.\n✔️Finished Basement\n✔️CLOSE TO PUBLIC TRANSPORTATION!\n✔️EASY ACCESS TO MAJOR ROUTES!\n✔️Close to shopping\n✔️Short walk to SEPTA\n✔️This property won’t last long, inquire now!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1937\nRental Terms\nRent: $1800\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $3600\nPet Policy\nCats allowed\nDogs allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":14,"lat":40.0178,"lng":-75.0895,"attrs":"['3BR \/ 2Ba', '1937ft2', 'townhouse', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-13T23:29:57-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bedrooms\/7621003521.html","post_id":7621003521,"title":"⭐⭐⭐ NEWLY RENOVATED, 3 BEDROOMS & 1 BATH APARTMENT LOCATED OLNEY\/OAK L","description":"Property Address\n5544 N Lawrence Street | PHILADELPHIA PA 19120\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ NEW! BEST VALUE APARTMENT! ⭐⭐⭐\n✔️ NEW! SPACIOUS 3 BEDROOMS & 1-BATH APARTMENT LOCATED IN OLNEY\/OAK LANE AREA!\n✔️ NEW! GRANITE COUNTERTOP KITCHEN\n✔️ NEW! DESIGNER KITCHEN CABINETS\n✔️ NEW! STAINLESS STEEL APPLIANCES\n✔️ NEW! CUSTOM BACKSPLASH\n✔️ NEW! MODERN PARQUET FLOORING\n✔️ NEW! DESIGNER PAINTER COLORS\n✔️ NEW! CUSTOM TILED BATHROOM W\/ ALL-NEW VANITIES\n✔️ NEW! CENTRAL AIR\n✔️ NEW! BACKYARD\n✔️ NEW! FINISHED BASEMENT FOR ENTERTAINMENT AND STORAGE!\n✔️ NEW! WASHER\/DRYER HOOKUP\n✔️ ALL ELECTRIC\n✔️ CLOSE TO PUBLIC TRANSPORTATION!\n✔️ EASY ACCESS TO MAJOR ROUTES!\n✔️ EASY COMMUTE TO AND FROM THE CITY!\n✔️ APPLY TODAY!!!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 1 BA\nSquare Feet: 1200\nRental Terms\nRent: $1500\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $3000\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":8,"lat":40.035274,"lng":-75.129766,"attrs":"['3BR \/ 1Ba', '1200ft2', 'duplex', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-05-13T23:24:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southampton-corner-townhome-council\/7621002786.html","post_id":7621002786,"title":"Corner Townhome COUNCIL ROCK SCHOOLS \/w 3BR\/2.5 BATHS + BSMT + YARD","description":"Property Address\n3473 E Gate Place | Holland Pa, 18966\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\nWelcome home to this premium location and premium lot townhome offering top-rated and prestigious COUNCIL ROCK SCHOOLS, access to 3 community pools and tennis courts, playgrounds, easy parking, walking path to Neshaminy Creek, ballfield perfect for sports and pets, and private enclosed backyard. Situated in the park-like and beautiful Country Place part of Village Shires. This part of the community is not congested and right across the street from park leading to Neshaminy Creek. This will feel like a Poconos nature escape, with pools and tennis, yet offering the best schools in the area. Home is 3 bedrooms, 2 full baths, powder room for guests, and full basement. Central air, fireplace, and laundry in basement. Come home to nature and peace!\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $50 per person\nYearly leases only\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1520\nRental Terms\nRent: $2900\nAvailable: Now\nApplication Fee: $50\nSecurity Deposit: $6000\nPet Policy\nCats allowed\nDogs allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":24,"lat":40.1868,"lng":-75.0071,"attrs":"['3BR \/ 2.5Ba', '1520ft2', 'townhouse', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-13T23:19:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-famous-maplewood-mall-in\/7621001483.html","post_id":7621001483,"title":"Famous MAPLEWOOD MALL in Germantown - Daycare, Office, Medical, Barber","description":"Property Address\n30 Maplewood Mall | PHILADELPHIA PA 19144\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ SPACIOUS COMMERCIAL SPACE PERFECT FOR OFFICE, DAYCARE, CHURCH ETC!\n✔️ LOCATED IN THE HISTORIC MAPLEWOOD MALL AREA!\n✔️ DESIGNER COLORS\n✔️ DURABLE LAMINATE FLOORING\n✔️ CENTRAL AIR\/HEAT\n✔️ BASEMENT FOR STORAGE\n✔️ CONVENIENTLY LOCATED, CLOSE TO MAJOR ROUTES, EASY COMMUTE TO AND FROM THE CITY\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 0 BD\/ 1 BA\nSquare Feet: 1200\nRental Terms\nRent: $1700\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $3400\nPet Policy\nCats allowed\nDogs allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":12,"lat":40.0338,"lng":-75.1731,"attrs":"['0BR \/ 1Ba', '1200ft2', 'flat', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-05-13T23:10:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7621001090.html","post_id":7621001090,"title":"⭐⭐⭐Spacious 3 Bedroom 2 Bath APARTMENT Conveniently located in East Ge","description":"Property Address\n1554 Beverly Road | PHILADELPHIA PA 19138\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ SPACIOUS KITCHEN\n✔️ SPACIOUS BEDROOMS\n✔️ LAMINATE FLOORING THROUGHOUT\n✔️ 2 BEDROOMS AND 1 BATH ON THE 1ST FLOOR\n✔️ 1 BEDROOM AND 1 BATH ON THE LOWER LEVEL\n✔️ LARGE LIVING ROOM\n✔️ LARGE CLOSETS\n✔️ FINISHED BASEMENT\n✔️ LOTS OF NATURAL LIGHT\n✔️ LAUNDRY HOOK-UP\n✔️ OFF STREET PARKING\n✔️ LARGE FRONT YARD\n✔️ ALL-ELECTRIC\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 3 BD\/ 2 BA\nSquare Feet: 1100\nRental Terms\nRent: $1400\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2800\nPet Policy\nCats allowed\nDogs allowed on case by case basis\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":6,"lat":40.058635,"lng":-75.159974,"attrs":"['3BR \/ 2Ba', '1100ft2', 'duplex', 'w\/d hookups', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-13T23:07:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bedroom-bath\/7621000787.html","post_id":7621000787,"title":"⭐⭐⭐SPACIOUS 2 BEDROOM & 1 BATH LOCATED IN WEST OAK LANE⭐⭐⭐","description":"Property Address\n1440 W Grange Ave | PHILADELPHIA PA 19141\nAvailable for immediate move-in\nOffered By:\nRedblock Realty Inc. |  show contact info\nDescription\n✔️ UPDATED, 2 BEDROOM & 1 BATH APARTMENT LOCATED IN WEST OAK LANE\n✔️ OPEN LAYOUT\n✔️ SPACIOUS KITCHEN\n✔️ SPACIOUS BEDROOM\n✔️ LAMINATE FLOORING\n✔️ LARGE CLOSETS\n✔️ LOTS OF NATURAL LIGHT\n✔️ ALL-ELECTRIC\n✔️ CONVENIENTLY LOCATED\n✔️ CLOSE TO MAJOR ROUTES\n✔️ EASY ACCESS TO SEPTA\n✔️ THIS WILL NOT LAST LONG, APPLY NOW!!! ⭐⭐⭐WWW.REDBLOCK.COM⭐⭐⭐\n*** YOU WILL LOVE TO CALL THIS PLACE A HOME! ***\nDetails\nFull background checks, $35 per person\nYearly leases only\nDetails\nFull background checks.\nYearly leases only.\nAvailable ASAP\n3-months rent to move in\nTenant is responsible for gas, electric, and water\nBuild your credit! We report rent payments to Experian!\nAmenities\ntraditional layout\nconveniently located\ncable ready\nclose to public transportation\nSize\nBeds\/Baths: 2 BD\/ 1 BA\nSquare Feet: 750\nRental Terms\nRent: $1100\nAvailable: Now\nApplication Fee: $35\nSecurity Deposit: $2200\nPet Policy\nCats allowed\nDogs not allowed\nNotice\n*** DO NOT GIVE ANYONE CASH, WE DO NOT COLLECT DEPOSITS, RENTS, OR APPLICATION FEES AT PROPERTIES\n*** APPLY TODAY, REDBLOCK.COM ***\n","num_images":11,"lat":40.041284,"lng":-75.145171,"attrs":"['2BR \/ 1Ba', '750ft2', 'duplex', 'no laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-05-13T23:05:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bathroom\/7621221948.html","post_id":7621221948,"title":"Beautiful 2 Bedroom 1 Bathroom for rent in Philadelphia !!","description":"Beautiful 2 Bedroom 1 Bathroom for rent in Philadelphia !! Newer appliances, including a Haier washer-dryer. To maximize space there is a new built-in queen size Murphy Bed and custom closet shelving. If you interested contact:  show contact info\n!!\nThere is access to the patio with a fire pit surrounded by grape vines, as well as access to the private pool. Parking space provided on driveway. The front porch has a porch swing for relaxing swings in the summer breeze and a private sitting deck for sunbathing. Driveway parking is available by period street lamps. Doors come with double-sided deadbolts and insulation has been recently updated. Newer appliances, including a Haier washer-dryer. 2 Bedroom 1 Bathroom Condo available for Rent in Philadelphia . Laminate floors throughout, in-unit laundry with parking minutes away from the Palace Theater, MVP Area, , Dutch Apple Cruises and Tours, Mohawk Hudson Hike-Bike Trails and more!! Association dues included. No utilities included. To maximize space there is a new built-in queen size Murphy Bed and custom closet shelving. There is access to the patio with a fire pit surrounded by grape vines, as well as access to the private pool. The front porch has porch swing for relaxing swings in the summer breeze and private sitting deck for sunning. Driveway parking is available lite by period street. Door come with double-sided deadbolts and insulation has been recently updated in a quiet building spacious renovated with: new kitchen with granite countertops and stainless appliances dishwasher new flooring throughout new paint high efficiency heat pump\/ac great sunset views hot water, sewer & trash pickup included basement laundry. Allow pets! One month broker fee and Credit check. If you interested contact:  show contact info","num_images":4,"lat":39.9502,"lng":-75.1636,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T19:04:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stunning-1br-1ba-apt-in\/7621197089.html","post_id":7621197089,"title":"Stunning 1BR\/1BA Apt in Prime area in Powelton Village\/University City","description":"Beautiful large 1BA\/1BA apartment on 2nd floor of a Victorian style building in desirable location on a lovely tree lined block in Powelton Village in University City. High ceilings and hard wood floor through out; Decorative fire place; New bathroom with tile flooring; Newer kitchen with granite counter top and new cabinets. Newer windows. Large private porch, lovely for reading and eating breakfast in spring.\nCoin operated washer\/dryer in basement.\nWalking distance to Drexel University Campus, University of Pennsylvania ( Upenn) , Hospital of University of Pennsylvania ( HUP), Children's Hospital of Philadelphia (CHOP) and Penn Presbyterian Medical Center. Close to public transportation (Bus, Subway and Trolley) and 30th St station. plenty of shopping venues and eateries.\nHeat and water are included. Tenant pays electricity and cooking gas.\nWe accept cats but no dogs.  There is a one time non-refundable pet fee of $300.\nAvailable Sep 1, 2023 for a 1-year lease. Prospective tenants must be credit worthy, with income\/co-signer and good references. E-mail with questions\/to set up a showing. Photos are from previous tenants. Current tenant's photo will be uploaded later.\nRent details\n","num_images":9,"lat":39.962172,"lng":-75.191279,"attrs":"['1BR \/ 1Ba', '700ft2', 'available sep 1', 'application fee details: $27.50 application fee for credit check', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T17:28:28-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/ardmore-main-line-townhouse\/7621220637.html","post_id":7621220637,"title":"Main Line Townhouse","description":"A fabulous starter home in the most livable and walkable town on the Main Line!! Great neighbors, great location!\n5 minute walk to Suburban Square’s fine shops, restaurants, Trader Joe’s and Farmers Market\n• 5 minute walk to Ardmore Train Station, R-5 line to Philly, AMTRAK to NYC\n• 2 doors from Ardmore Library, half a block to the Ardmore Post Office\n• Desirable small. quiet, and safe community\n• Private entrance to home, like having your own house\n• Lower Merion School District\n• Easy commute to Bryn Mawr College, Haverfird College, Villanova University, and trains to UPenn and Drexel\nAMENITIES\n• Large living\/dining , powder room and kitchen with appliances on first floor\n• 2 generously sized bedrooms and master bathroom on second floor, with large closets\n• 1200 square feet living space PLUS 600 square feet dry basement for gym\/playroom\/lots of storage PLUS attic for light storage\n• Dishwasher, Washer, & Dryer\n• Central air-conditioning\n• Assigned off-street Parking Space plus off-street guest parking\n• Extremely quiet, safe and secure neighborhood\n• New roof, gutters, paint, energy-efficient windows\n• Just one amazing place to live!","num_images":9,"lat":40.007511,"lng":-75.295029,"attrs":"['2BR \/ 1.5Ba', '1800ft2', 'available jul 1', 'air conditioning', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T18:58:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-good-location-this-is-1\/7621205662.html","post_id":7621205662,"title":"#GOOD LOCATION !! THIS IS A 1-BEDROOM, 1-BATHROOM APARTMENT FOR RENT!!","description":"# GOOD LOCATION !! THIS IS A 1-BEDROOM, 1-BATHROOM APARTMENT FOR RENT!!\nThis is a one-bedroom, one-bathroom apartment. The room is bright and the space is large. The location is good and the transportation is convenient. Included all utilities like water, sewer, electric, gas.\nAdd 60\/month for each air conditioner in summer,\nadd 20\/month for wi-fi.\nIncluded all utilities like water, sewer, electric, gas.\n1136 Arch St, Philadelphia, PA\n","num_images":4,"lat":39.953839,"lng":-75.158565,"attrs":"['1BR \/ 1Ba', '741ft2', '\\nsaturday 2023-05-20\\n', '\\nsunday 2023-05-21\\n', '\\nmonday 2023-05-22\\n', 'air conditioning', \"application fee details: APP FEE NONE (PER PERSON) & DON'T HAVE ANY PROCESSING FEE\", \"broker fee details: => -100% +FREE+ BROKER'S (FEE)\", 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'listed by: Carmela N. Robertson', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T18:00:48-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-studio-1br-apt-in\/7621194527.html","post_id":7621194527,"title":"Spacious studio\/1BR Apt in Powelton Village\/University City","description":"Lovely bright Studio\/one bedroom (1 BR) apartment in prime location in Powelton Village in University City. Lots of natural light.  New granite counter top and kitchen cabinets; new flooring; newer windows.  Separate living room and sleeping room( sleeping room is 11'x6' in size and can fit in a full size bed and a desk) ; Large closet with lots of storage area; High ceilings through out except bathroom; High quality built in window A\/C with remote control included.\nCoin operated washer\/dryer in basement.\nWalking distance to Drexel University Campus, University of Pennsylvania ( Upenn) , Hospital of University of Pennsylvania ( HUP), Children's Hospital of Philadelphia (CHOP) and Penn Presbyterian Medical Center and Art Museum. Close to public transportation (Bus, Subway and Trolley) and 30th St station. Easy commute to Center City, Or the Philadelphia Museum of Art.\nPlenty of shopping venues and eateries.\nGas for heat and hot\/cold water are included. Tenant pays electricity and cooking.\nAvailable September 1 , 2023 . Prospective tenants must be credit worthy, with income\/co-signer and good references. E-mail with questions\/to set up a tour.\nNote: Note: This is a lovely apartment. The only downside is that the ceiling of the bath tub is low, about 5'6\". The other area of the bathroom ceiling is fine. The rest of the rooms have tall ceilings. The height of bath tub ceiling puts a limit on  the height of the person lives there. If you are taller than 5'6\", that may not fit you.\n","num_images":7,"lat":39.962172,"lng":-75.191279,"attrs":"['0BR \/ 1Ba', '300ft2', 'available sep 1', 'air conditioning', 'application fee details: $27.50 application fee for credit check', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T17:19:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bath-apartment-for\/7621210380.html","post_id":7621210380,"title":"1 bedroom 1 bath apartment for rent in Philadelphia, PA .","description":"1 bedroom 1 bath apartment for rent in Philadelphia, PA . This ginger-bread style house has refinished hardwood floors, 10' ceiling with ceiling fans, dining area overlooking rear patio. bedroom has two Large closets for excellent storage. kitchen comes whit electric range, Refrig. And washer\/ dryer. A spacious bathroom whit fiberglass tub And Shower. The front Porch has Porch swing For Relaxing swings in The summer Breeze and privet Sitting Deck for sunning. Driveway parking is available lite by period street lamp. Door come with double-sided deadbolts and insulation has been recently updated. if you are!If you're interested Can you Tell me your name and number so that we can communicate.","num_images":0,"lat":39.9523,"lng":-75.1638,"attrs":"['1BR \/ 1Ba', '800ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T18:18:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautifully-renovated-bed\/7621196806.html","post_id":7621196806,"title":"Beautifully renovated 1 Bed 1 Bath apartment in - - Manayunk.","description":"Beautifully renovated apartment in the best location in Manayunk, right on Main St! Historic building with an elevator. The apartment has a large kitchen with high-end quartz countertops and a full stainless steel appliance package incl. a dishwasher. Large walk-in storage closet in addition to a coat closet. Washer\/Dryer in unit! Central A\/C and Heat! Large bedroom with plentiful closet space. Come check out the gorgeous 20+ foot ceilings with ornate designs and tall windows looking out to Main St. This will not last! Next to Insomnia Cookies, tons of cafes and ice cream shops, a furniture store, parks and walking trails, and much, much more! Please provide us with your mail for more information thank you.","num_images":3,"lat":40.025177,"lng":-75.222912,"attrs":"['1BR \/ 1Ba', '800ft2', 'available jun 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T17:27:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-masterfully-updated-bed-bath\/7621202573.html","post_id":7621202573,"title":"Masterfully updated 2 bed 2 bath & Granite Countertops with Cabinets","description":"Move in ready second floor 2 bedroom, 2 full bath condo with a GARAGE, large STORAGE ROOM and your own washer and dryer in beautiful Lansdale. Hardwood flooring throughout the unit, gourmet kitchen with granite countertops, modern cabinets, stainless steel appliances and sliders to a balcony; spacious living room, large main bedroom with it's own master bathroom; second good sized bedroom with sliders to a balcony and a full modern hall bath. Separate indoor stairs down to the basement where you will find a huge private storage room with washer and dryer and access to the shared garage with one parking space included with the rent. All of this with walking distance to the train and a short distance to the downtown areas of North Wales and Lansdale and close to major roads, 63, 309 and 476. First, Last and One month's security deposit due to move in. Email your number to set up a showing!","num_images":4,"lat":40.224907,"lng":-75.276834,"attrs":"['2BR \/ 2Ba', 'available now', 'air conditioning', 'furnished', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2023-05-14T17:48:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sunny-spacious-west-philly\/7621204135.html","post_id":7621204135,"title":"Sunny, spacious West Philly 1 br","description":"Hello! I'm a current tenant with New Horizons Housing looking for someone to take over my apartment with a new 12 month lease. Your lease can start any time in July and rent will be prorated for the month.\nThe space is bright and sunny 2nd floor rear unit, in walking distance to Clark Park, UPenn, Baltimore Avenue Shopping, and lots of public transportation options. 1 large bedroom with 2 windows let in plenty of natural light, featuring a walk in closet which also contains a bathroom. Also off the bedroom is another small room with a window that can be used as a closet or an office.\nThe living room also has a large hall closet plus a bathroom, as well as plenty of space for additional storage options. The kitchen is small but workable.  Willing to part with the additional counter space and storage I added. Air conditioner units also for sale.\nPay by app laundry in the basement, off street parking available for additional cost, laundromat across the street.\nHere's some need to knows:\n-Heat\/hot water included in rent. Cooking gas is a flat fee of $25 paid to the landlord.\n-They require renters insurance - $12.50\/month through landlord. I got my own policy through Lemonade closer to 100 for the year.\n-You are responsible for internet (comcast) and electric. I am on the budget electric plan and have been paying $54\/month.\nThe landlord is New Horizons. They're always good about fixing things in a timely manner and communicating any issues. You will be signing a lease directly with them for 12 months. These are their requirements:\n-$50 non-refundable application fee\n- minimum 625 credit score with no prior evictions\n(If you do not have a reported score (N\/A), proof of attendance to a local university can be used to circumvent the required credit score)\n-First month, last month, and one month security deposit to move in. (First month prorated to # of days left in the month)\n-Proof of income (net approx. 3x rent\/month)\n-Co-signers\/guarantors allowed on an approval basis\n","num_images":4,"lat":39.951925,"lng":-75.211651,"attrs":"['1BR \/ 2Ba', 'available jul 1', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T17:54:53-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-immediately-full\/7621206267.html","post_id":7621206267,"title":"!! Available immediately! 3 full bedrooms 2 full baths full size @","description":"Available immediately! 3 full bedrooms 2 full baths full size eat in kitchen . spacious living room with fireplace, the lower level is perfect for the home office or extended, sliders leas to the patio wit walk out to rear yard with an AG pool swing set, , generator, private rear yard, with sundeck fully enclosed awning. Pets at landlord approval, Occupant will provide full application proof income and full credit report. Rent security and realtor fee paid by tenant. Pets land lord approval. OPPORTUNITY to own this ready to move-in very nicely furnished and very spacious condo. the Dan can be used as a guest room. Very comfortable spacious floor plan, feel right at home. The low HOA fee includes Cable TV, le and Wi fi Internet etc. Pats are allowed!If you are interested please Call or text\n","num_images":3,"lat":39.950131,"lng":-75.170667,"attrs":"['3BR \/ 2Ba', '1000ft2', '\\nthursday 2023-05-18\\n', '\\nfriday 2023-05-19\\n', '\\nsaturday 2023-05-20\\n', \"application fee details: APP FEE NONE (PER PERSON) & DON'T HAVE ANY PROCESSING FEE\", \"broker fee details: => -100% +FREE+ BROKER'S (FEE)\", 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Carmela N. Robertson', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T18:02:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-bedroom-one-bathroom\/7621184847.html","post_id":7621184847,"title":"Great 2 bedroom One bathroom apartments for rent","description":"Freshly 2 bedroom One bathroom house for rent. This ginger-bread style house has hardwood floors, 10' ceiling with ceiling fans, dining area overlooking rear patio. Bedroom has two large closets for excellent storage. Kitchen comes with electric range, retrig. And washer\/dryer. A spacious bathroom with fiberglass tub and shower. The front porch has porch swing for relaxing swings in the summer breeze and private sitting deck for sunning. Driveway parking is available Door come with double-sided deadbolts and insulation has been recently updated in a quiet building spacious renovated with: new kitchen with granite countertops and stainless appliances dishwasher new flooring throughout new paint high efficiency heat pump\/ac great sunset views hot water, sewer & trash pickup included basement laundry. Allow pets-If you are very interested, please Contact :","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T16:44:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-upscale-city-views-urban\/7621187963.html","post_id":7621187963,"title":"Upscale. City Views. Urban Oasis.","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 to 481 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nLeasing Specials\nReduced Security Deposit when you move-in by 4\/2\/2023 and apply within 48 hours of your tour! *Security Deposit reduced from 1 Month's Rent to $750.00!\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our brand new apartment community offers you spacious Studio apartments in the sought after Fishtown\/Northern Liberties area.\nDwell 2nd Street is convenient to I-95, 676 and Girard Avenue, so getting around the city is a breeze whether you're driving, biking, walking or taking public transportation!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Full-size stackable Washer and Dryer in Unit\n» Expansive closets with dust free organizers\n» Wood style plank flooring in Living space\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» Controlled building access\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball\n» Game Room with Pool Table, Foosball and shuffleboard\n» Business Center and conference room\n» Bike storage and repair space\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced dog park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.  Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":20,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T16:55:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bd-15-bathroom-house-for\/7621165754.html","post_id":7621165754,"title":"$2,200 4bd\/1.5 Bathroom House for Rent June 3rd","description":"PET FRIENDLY & Washer & dryer in Unit! Parking on this side of Manayunk is very easy too!! Welcome to this roomy 4 spacious bedroom end-row unit in Manayunk. This home is a convenient 5-minute Walk to Main Street and the Wissahickon Train Station. This home gets lots of natural light. and is perfect for 3-4 people. The first floor features a spacious living room and dining room, a galley kitchen that connects to the back patio area, plus a half bath. The second level features a Master Bedroom and a second bedroom with a hallway full bathroom. The third floor has two more large bedrooms! This house has been a well-maintained rental property. Recent improvements include a partial new roof, new siding on the rear upper level, bathroom remodel, two walk-in closets, kitchen remodel, and Powder room addition. Newer energy-efficient replacement windows throughout. Available June 3rd. Tenants pay all utilities.\nPosted by Owner, special deal on Craiglist, can confirm and connect with Realtor if interested.\n","num_images":12,"lat":40.0275,"lng":-75.2242,"attrs":"['4BR \/ 1.5Ba', '1800ft2', 'available jun 3', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T15:40:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-we-welcome-dogs-and-cats\/7621170095.html","post_id":7621170095,"title":"We Welcome Dogs and Cats at 1 Brown! Tour Today to get Great Specials!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! Residences at One Brown 1 Brown Street, Philadelphia, PA, 19123Call Now -  show contact info\nx 81OR Text 81 to  show contact info\nto contact our leasing team.Use this link for more info:https:\/\/archcompanies.aptglance.com\/6gru74Stunning Apartments in Northern Liberties1 bedroom | 1 bath | 675 square feetApartment Features: ✓  Nest Thermostats ✓  Full Size Washer\/Dryer in unit ✓  Floor to Ceiling Windows ✓  Quartz Counter Tops ✓  Stainless Steel Appliances ✓  Gourmet Eat-In Kitchens with Cherry Wood Cupboards ✓  Generous Closet Space ✓  Spa Shower System & Jacuzzi Tub ✓  Largest Apartments in the Area ✓  Large Bathrooms ✓  9 Ft CeilingsCommunity Features: ✓  Spacious Highrise Living ✓  Amazing Views and Rooftop Lounge ✓  Rooftop Walking Track & Dining Areas ✓  24-Hour Concierge Service ✓  Fully Outfitted Fitness Center ✓  Spectacular Resort Style Pool Area ✓  Dry Cleaning ServiceCommunity Info:1 Brown will check off everything on your list of must-haves with stunning luxury apartments in the neighborhood of Northern Liberties. Take a look at the variety of floor plans and choose the perfect spot for your lifestyle. No matter which residence you choose, your home will boast a spacious layout with classic, sophisticated interior finishes.A variety of relaxing amenities await you, including a rooftop with scenic waterfront views and, a fitness center, and a heated resort style pool. Conveniently located in the heart of the Northern Liberties neighborhood of Philadelphia, you’ll be surrounded by historical sites as well as a wealth of restaurants, entertainment options, and shopping.Pet Policy:Pet Policy:Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today!Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PM Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! Equal Housing Opportunity lZbkJXMkY9\n","num_images":16,"lat":39.962145,"lng":-75.137734,"attrs":"['1BR \/ 1Ba', '675ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T15:55:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-location-community-quality\/7621170539.html","post_id":7621170539,"title":"Location, Community, Quality Living. It Starts Here!","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 to 481 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nLeasing Specials\nReduced Security Deposit when you move-in by 4\/2\/2023 and apply within 48 hours of your tour! *Security Deposit reduced from 1 Month's Rent to $750.00!\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our brand new apartment community offers you spacious Studio apartments in the sought after Fishtown\/Northern Liberties area.\nDwell 2nd Street is convenient to I-95, 676 and Girard Avenue, so getting around the city is a breeze whether you're driving, biking, walking or taking public transportation!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Full-size stackable Washer and Dryer in Unit\n» Expansive closets with dust free organizers\n» Wood style plank flooring in Living space\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» Controlled building access\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball\n» Game Room with Pool Table, Foosball and shuffleboard\n» Business Center and conference room\n» Bike storage and repair space\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced dog park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.  Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":18,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available jun 13', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T15:56:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-duplex-and-newly-renovated\/7621163270.html","post_id":7621163270,"title":"DUPLEX, and newly renovated 2 bedroom 1 bath apartment available","description":"DUPLEX, and newly renovated 2 bedroom 1 bath apartment available from 1st June. If you interested contact;;  show contact info\nThis gingerbread style home features hardwood floors, 10' ceilings with ceiling fans, dining area overlooking the back patio. The bedroom has two large closets for excellent storage. Kitchen comes with electric range, retrig. and washer\/dryer. A spacious bathroom with fiberglass tub and shower. The front porch has a porch swing for relaxing swings in the summer breeze and a private sitting deck for sunbathing. Driveway parking is available by period street lamps. Doors come with double-sided deadbolts and insulation has been recently updated. Newer appliances, including a Haier washer-dryer. 2 Bedroom 1 Bathroom Condo available for Rent in south Historic Pastures quiet Condo community. Laminate floors throughout, in-unit laundry with parking minutes away from the Palace Theater, MVP Area, , Dutch Apple Cruises and Tours, Mohawk Hudson Hike-Bike Trails and more!! Association dues included. No utilities included. Tax .Please text me.. To maximize space there is a new built-in queen size Murphy Bed and custom closet shelving. There is access to the patio with a fire pit surrounded by grape vines, as well as access to the private pool. The front porch has porch swing for relaxing swings in the summer breeze and private sitting deck for sunning. Driveway parking is available lite by period street. Door come with double-sided deadbolts and insulation has been recently updated in a quiet building spacious renovated with: new kitchen with granite countertops and stainless appliances dishwasher new flooring throughout new paint high efficiency heat pump\/ac great sunset views hot water, sewer & trash pickup included basement laundry. Allow pets-If you interested contact;;  show contact info","num_images":4,"lat":39.9502,"lng":-75.1636,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T15:31:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bath-apartment-for\/7621157805.html","post_id":7621157805,"title":"1 bedroom 1 bath apartment for rent in Philadelphia, PA .","description":"1 bedroom 1 bath apartment for rent in Philadelphia, PA . This ginger-bread style house has refinished hardwood floors, 10' ceiling with ceiling fans, dining area overlooking rear patio. bedroom has two Large closets for excellent storage. kitchen comes whit electric range, Refrig. And washer\/ dryer. A spacious bathroom whit fiberglass tub And Shower. The front Porch has Porch swing For Relaxing swings in The summer Breeze and privet Sitting Deck for sunning. Driveway parking is available lite by period street lamp. Door come with double-sided deadbolts and insulation has been recently updated. if you are interested Please Text:-(603)4 six 0 four 8 one 1","num_images":3,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T15:13:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-head-turning-style\/7621159520.html","post_id":7621159520,"title":"Head-turning Style, Extraordinary Location.","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:767-780 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 1BR floor-plans in the sought after Fishtown\/Northern Liberties area.\nConvenient to I-95, 676 and Girard Avenue, getting around the city is a breeze whether you're driving, taking public transportation or Uber\/Lyft!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home. Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":23,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '767ft2', 'available jun 13', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T15:19:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studio-apartment-open\/7621155832.html","post_id":7621155832,"title":"Studio Apartment OPEN HOUSE MAY 16  6:00PM to 8:00PM","description":"A fabulous affordable STUDIO APARTMENT has its eye on you!   Updated and modern with plenty of natural light and privacy at the same time.  There is no separate bedroom,  this is Kitchen\/bedroom space with a private bathroom. .  This 3rd floor unit has a spacious closet, newer heating, ceramic tile in kitchen and bathroom, ceramic tile tub surround. New hardwood floor in the living\/sleeping area. Two blocks away from the shops on Lancaster Avenue. Serious new construction on this block and nearby. New window blinds.\nTenant pays and electric, apartment has electric heat. References required.\n2 months security deposit and first month's rent required to move in ($1750).  $42.00 application fee. Professionally managed.  No Smoking, No Pets.\nStop by our open house MAY 16 to have a good look at this studio apartment.  If interested, you can apply during the open house.  We use my computer to go to Transunion when you pay Transunion's $42.00 fee.  You can watch as your credit record is checked\n","num_images":20,"lat":39.9597,"lng":-75.2024,"attrs":"['0BR \/ 1Ba', 'available may 18', '\\ntuesday 2023-05-16\\n', 'air conditioning', 'apartment', 'no laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T15:07:54-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedrooms-available\/7621150060.html","post_id":7621150060,"title":"Two Bedrooms Available! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N American St Suite 101\nPhiladelphia Pa 19122\nBedrooms:2\nBathrooms:2\nSquare Footage:1088-1261 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 2BR floor-plans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1,"lat":39.971179,"lng":-75.140092,"attrs":"['2BR \/ 2Ba', '1135ft2', 'available aug 2', '\\nsunday 2023-05-14\\n', '\\nmonday 2023-05-15\\n', '\\ntuesday 2023-05-16\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T14:49:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lancaster-available-bed-bath-for-rent\/7621149540.html","post_id":7621149540,"title":"Available 2 Bed \/ 1 Bath for rent in Bridgeport!!","description":"Available 2 Bedroom 1 Bathroom for rent in Bridgeport!! This is a fantastic STUDIO attached to a private residence in a beautiful neighborhood of Reading. This darling studio is new construction with light finishes and white cabinetry. Newer appliances, including a Haier washer-dryer. To maximize space there is a new built-in queen size Murphy Bed and custom closet shelving. There is access to the patio with a fire pit surrounded by grape vines, as well as access to the private pool. Parking space provided on driveway. This is a quiet setting, perfect for relaxing and getting away from it all. Driveway parking is available lite by period street lamp. Door come with double-sided deadbolts and insulation has been recently updated. The building is up to fire code with sprinklers. BACKGROUND CHECKS will be done on evictions. THE TENANT PAYS ALL UTILITIES. per month $750 Reply with your personal Phone number. Tax .Please text me waitwhitman70gmailcom","num_images":3,"lat":40.0766,"lng":-76.3107,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T14:48:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-stainless-steel-appliances\/7621146226.html","post_id":7621146226,"title":"Stainless Steel Appliances, Modern Amenities, Incredible Features","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown delivers a new standard of living with the best of everything right at your doorstep.\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nCommunity Features\n* Pet Salon\n* Sun Deck\n* Swimming Pool\n* Billiards\n* TV Lounge\n* Bark Park\n* Outdoor Grill Area\n* Minutes from Restaurants, Shopping, and Much More\n* Yoga Lounge\n* Professionally Managed\n* Spa\n* Easy Freeway Access\n* Fitness Studio\n* Community Lounge","num_images":24,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T14:37:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-must-see-riverfront-living\/7621140170.html","post_id":7621140170,"title":"Must See Riverfront Living, Views Galore and the Amenities to Match!","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card! This is a 2 Bedroom, 2 Bath, Approximately 1228 Sq. Ft. Want more information on this unit? See link (below):https:\/\/archcompanies.aptglance.com\/29xhp0Call Now -  show contact info\nx 80OR Text 80 to  show contact info\nto contact our team.Stunning Apartments in Northern LibertiesCommunity Info:1 Brown will check off everything on your list of must-haves with stunning luxury apartments in the neighborhood of Northern Liberties. Take a look at the variety of floor plans and choose the perfect spot for your lifestyle. No matter which residence you choose, your home will boast a spacious layout with classic, sophisticated interior finishes.A variety of relaxing amenities await you, including a rooftop with scenic waterfront views and, a fitness center, and a heated resort style pool. Conveniently located in the heart of the Northern Liberties neighborhood of Philadelphia, you’ll be surrounded by historical sites as well as a wealth of restaurants, entertainment options, and shopping.Features: ‣  Largest Apartments in the Area ‣  Gourmet Eat-In Kitchens with Cherry Wood Cupboards ‣  Full Size Washer\/Dryer in unit ‣  Quartz Counter Tops ‣  Spa Shower System & Jacuzzi Tub ‣  Generous Closet Space ‣  Nest Thermostats ‣  9 Ft Ceilings ‣  Stainless Steel Appliances ‣  Floor to Ceiling Windows ‣  Large BathroomsCommunity Amenities: ‣  Dry Cleaning Service ‣  Spacious Highrise Living ‣  Amazing Views and Rooftop Lounge ‣  24-Hour Concierge Service ‣  Spectacular Resort Style Pool Area ‣  Fully Outfitted Fitness Center ‣  Rooftop Walking Track & Dining AreasPet Policy:Pet Policy:Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today!Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PMResidences at One Brown 1 Brown Street, Philadelphia, PA, 19123 Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! Equal Housing Opportunity 4AQnfRBGI6\n","num_images":14,"lat":39.962145,"lng":-75.137734,"attrs":"['2BR \/ 2Ba', '1228ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T14:17:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-renovated-bedroom\/7621136642.html","post_id":7621136642,"title":"@@@New renovated_ 2 Bedroom 1 Bathroom for rent in Philadelphia!!@","description":"Two+New 2 Bedroom 1 Bathroom for rent in *Philadelphia* !! This is a fantastic STUDIO attached to a privateresidence in a beautiful neighborhood also come fresh air in bedroom%% This darling studio is new construction with light finishes and white cabinetry. Newer appliances, including a Haier washer-dryer. 2 Bedroom 1 Bathroom Condo available for Rent in southHistoric Pastures quiet Condo community. Laminate floors throughout, in-unit laundry with parking minutes away from the Palace Theater, MVP Area, , Dutch Apple Cruises and Tours, Mohawk Hudson Hike-Bike Trails and more!! Association dues included. No utilities included.Tax .Please text me.. [[[]]]]To maximize space there is a new built-in queen size Murphy Bed and custom closet shelving. There is access to the patio with a fire pit surrounded by grape vines, as well as access to the private pool. Parking space provided on driveway. This is a quiet setting, perfect for relaxing and getting away from it all. Driveway parking is available lite by period street lamp. Door come with double-sided deadbolts and insulation has been recently updated. The building is up to fire code with sprinklers. *** BACKGROUND CHECKS will be done on evictions. THE TENANT PAYS (ALL UTILITIES). per month $980 Reply with your personal Phone number.","num_images":4,"lat":39.9223,"lng":-75.2338,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T14:06:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-free-1st-month-rent-nice\/7621139125.html","post_id":7621139125,"title":"Free 1st Month Rent! Nice Three Bedroom House in West Kensington $1085","description":"Free 1st Month Rent!!! Newly remodeled three bedroom, 1 bath house in Kensington available immediately! Ready to move-in. Freshly painted throughout. All new flooring in Living Room, Dining Room and Kitchen. Large living room and dining room. Full size kitchen with tile floors. Three bedrooms upstairs with remodeled bath. All new wall to wall carpet. Bathroom includes new vanity sink, toilet, flooring, refinished tub and new tub surround. Good closet space. Double insulated Vinyl Windows installed. Refrigerator and oven\/range included. Full sized basement. Includes washer and dryer. Newer heating system installed. Fenced in backyard. Air conditioner. Easy access to I-95, Septa bus lines, close to shopping schools. Rent is $1085 per month. Cat is OK. Requirements: You must have a credit score of 650 or better, good rental history and proof of income. Security deposit required to move-in. No application fee. Cat is OK. No Dogs. Call Dave at  show contact info\nfor appointment. Please, no calls after 7PM. Call or Text Only. Do not email me. Due to Scammers, I automatically delete all emails without exception so call or text. Thank you PS Please excuse the pictures, workers were still cleaning up. Better picture coming.","num_images":6,"lat":39.994206,"lng":-75.114057,"attrs":"['3BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'house', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T14:14:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-free-1st-month-rent-large\/7621136139.html","post_id":7621136139,"title":"Free 1st Month Rent! Large Two Bedroom Apt In Olde Kensington $985mo","description":"Free 1st Month Rent to Qualified Candidate. Large nicely remodeled two bedroom apartment in Olde Kensington available now. Close to Northern Liberties, Fishtown and Temple University. 1722 North Seventh Street between Cecil B. Moore and Montgomery Streets. Easy commute to downtown Philadelphia (Center City). All new paint throughout. Large living room with real wood flooring, lots of natural light and plenty of closet space. Large remodeled eat-in kitchen with oven and refrigerator. Two large bedrooms with new flooring and air conditioner. Tile bathroom with full size tub. Insulated windows. Full access to large backyard with fruit trees and plenty of room for BBQ's, sunning and relaxing. Includes cold water. Easy commute to Temple or Center City. Walking distance to the Piazza and Girard Ave shopping and nightlife. Rent is $985 per month. Requirements: You must have a credit score of 650 or better, good rental history and good employment history (with proof of income). Security deposit required. Cat is OK. Call Dave for an appointment call or text  show contact info\n. Please, no calls after 7PM. Call or Text Only. Do not email me. Due to Scammers, All emails are deleted automatically so please call. Thank you","num_images":7,"lat":39.97804,"lng":-75.146727,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'apartment', 'w\/d hookups', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T14:05:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedrooms-dwell-2nd\/7621135712.html","post_id":7621135712,"title":"One Bedrooms! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:760-800 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '767ft2', 'available now', '\\nsunday 2023-05-14\\n', '\\nmonday 2023-05-15\\n', '\\ntuesday 2023-05-16\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T14:03:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-efficiency-norristown\/7621132664.html","post_id":7621132664,"title":"Efficiency  Norristown","description":"Efficiency, newly remodeled, central air. $1000.00 a month.  show contact info","num_images":6,"lat":40.1245,"lng":-75.3304,"attrs":"['1BR \/ 1Ba', 'available now', 'apartment', 'laundry on site', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T13:54:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1st-month-free-remodeled\/7621132337.html","post_id":7621132337,"title":"1st Month Free! Remodeled 2 Bedroom House in West Kensington $995mo","description":"First month is free to qualified candidate! Newly remodeled two bedroom, 1 bath house in West Kensington\/Port Richmond available- Ready to move-in. Freshly painted throughout. All new flooring in Living Room, Dining Room and Kitchen. Large living room and dining room. Full size kitchen with tile floors. Three bedrooms upstairs with remodeled bath. Bathroom includes new vanity sink, toilet, flooring, refinished tub and new tub surround. Good closet space. Double insulated Vinyl Windows installed. Refrigerator and oven\/range included. Full sized basement with washer and dryer. Newer heating system installed. Fenced in backyard. Air conditioner. Easy access to I-95, Septa bus lines, close to shopping, schools and public transportation. Rent is $995 per month. Cat is OK. Requirements: You must have a credit score of 650 or better, good rental history and proof of income. Security deposit required to move-in. No application fee. Call Dave at  show contact info\nfor appointment. Please, no calls after 7PM. Call or Text Only. Do not email me. Due to Scammers, I automatically delete all emails without exception. Thank you","num_images":9,"lat":39.9925,"lng":-75.1133,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'house', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T13:53:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/camden-newly-updated-unit-with-fresh\/7621099062.html","post_id":7621099062,"title":"Newly updated unit with fresh paint\/ 1st floor 2BR unit rent@@","description":"Newly updated unit with fresh paint, kitchen cabinets, appliances and bathroom fixtures. 1st floor unit, with a sunny 3 season porch\/entry-way. Laundry hookups & folding area in the basement. Beautiful hardwood floors throughout. Great location, close to many amenities including the shopping, restaurants, and so much more . Includes off Street parking. Electric is separate and up to the tenant. The property is smoke and vape free. First, Last, Security deposit.. I WOULD LOVE TO SPEAK WITH YOU. CAN YOU SEND ME A NUMBER TO DISCUSS MORE DETAILS.","num_images":3,"lat":39.9484,"lng":-75.0864,"attrs":"['2BR \/ 1Ba', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T12:06:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bed-bath-condo\/7621112905.html","post_id":7621112905,"title":"Spacious 1 bed 1 bath Condo","description":"1 bed 1 bath Condo in an upscale LUXURY HIGH RISE BUILDING with 24 hour Concierge \/ Security and VERY LOW CONDO FEES in the centrally located and sought after neighborhood of Washington Square West in downtown Philadelphia. The historic Western Union Building featuring Beaux Arts style of the time, was originally built 100 years ago as the headquarters of Western Union Telegraph Company, and was beautifully and tastefully expanded and redesigned into a luxury 12- story boutique residence by Philadelphia's renowned architect Cecile Baker in 2008. The unit itself: Nestled on the 5th floor (enabling you to take the steps OR the elevator which many people like), this very quiet spot faces the courtyard, giving it an air of peace and tranquility. Upon entering, you will note the quaint foyer, which acts as a buffer to the main living area on one side and the bedroom and bath on the other (which isn't alway the case with these size condos) . You will fall for its souring ceilings and large windows (which make the unit feel more spacious), open floor plan, modern kitchen and solid hardwood flooring! The bedroom is plenty big for a king, and boasts a large walk in closet. There is a coat closet and an in unit Washer\/Dryer included in the sale. A perfect first time purchase, downsize purchase, or pied de terre for someone looking for the convenience, luxury, security and peace of mind of a full service Center City building where PARKING IS AVAILABLE ON SITE for an extra monthly fee. The low condo fee includes water, sewer, gas cooking, a fitness center, and a courtyard with a private secure dog run. One of the great things about Wash West is its central location: less than 7 blocks in any direction to most of the great neighborhoods , historic squares and parks of Philadelphia: walkable to beautiful Washington Square and Rittenhouse Square, to the vibrant arts district on Broad St, to Restaurant Row; an easy walk to the center city business district and neighborhoods like Old City, Bella Vista, Queen Village and the Italian Market, all offering award winning dining, shopping and nightlife - and very close to public transportation and Jefferson Hospital!","num_images":4,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '874ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly']","posted_date":"2023-05-14T12:50:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-july-this\/7621096813.html","post_id":7621096813,"title":"Available July 2, this completely renovated","description":"Available July 2, this completely renovated, second floor, one BR apt is located in the heart of Washington Square in a Historically Registered Home. The apartment is situated in a prime location less than two blocks walking distance from Pennsylvania Hospital (HUP) & Thomas Jefferson Hospital (TJUH) and one block from Whole Foods, Starbucks, Wawa, and Seger Park. Short walking distance to Rittenhouse Square, Society Hill, Italian Market, Center City, and South Street. Amenities include SS Appliances, Granite Countertops, High Ceilings, Hardwood Floors, Intercom, W\/D, D\/W, M\/W, G\/D, & Shared Outdoor Space.\n$800\/month +utlilities..... 1 Year Minimum lease with first, last, one months' security deposit, and credit check required.\nIf you are interested reply with name and your number  to schedule a showing.\n","num_images":5,"lat":39.9362,"lng":-75.1563,"attrs":"['1BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T11:59:46-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-brand-new-bedroom-full\/7621106559.html","post_id":7621106559,"title":"Brand new 3 bedroom 2 full bathroom apartment with NEW CENTRAL AIR ava","description":"Brand new 3 bedroom 2 full bathroom apartment with NEW CENTRAL AIR available , the property is completed renovated from top to bottom, everything is new, new hardwood floor through out, all new windows, new stairs, new mechanic, new plumbing, new electric tasteful kitchen with granite counter top, custom backsplash, high ceiling, many closets, stainless appliances ( new stoves, refrigerators) . Great location , The property is located at spring garden . the home is surrounded by numberous new constructions and rehab projects, Walk distance to center city , Graduate hospital, South Street, Rittenhouse square, , also close to all kind of transportation. Great neighborhood!credit check , credit score 700 or above. first month, last month, and one month security deposit due at, or prior to, lease signing. Other terms may be required by Landlord. $25 application fee per applicant. $300 pet non refundable one time fee . Must see !\n****If you are interested reply with name and your number to schedule a visit.\ntenants pay water n electric\n","num_images":6,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d hookups', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T12:29:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-schedule-tour-of-your-new\/7621119149.html","post_id":7621119149,"title":"Schedule a tour of your new waterfront home! Free Month! A Must See.","description":"Apply within 24 hours of your tour to receive 1 MONTH FREE on all unit types, waived application fee and $100 Amazon gift card!  Welcome to Residences at One Brown1 Bedroom, 1 Bath | Approximately 675 Sq. Ft. 675Follow This Link for More Information:https:\/\/archcompanies.aptglance.com\/k11u81Stunning Apartments in Northern LibertiesCall Now -  show contact info\nx 79OR Text 79 to  show contact info\nto text with us. Community Info:Residences at 1 Brown offers stunning and spacious studios, one, two, and three bedroom apartments with premium features designed to help you live your best life every day. Each unit has oversized bedrooms and enough living space for both a media center and kitchen table. You will thoroughly enjoy the soaking up the ample space to relax or host guests! Upscale kitchens with cherry wood cupboards are brimming with the latest appliances complemented by granite countertops and ample storage space. Nearby, you can enjoy a spa shower and Jacuzzi tub in your bathroom, take advantage of your personal washer and dryer, and set up a special place for your pets. As you come home to your 1 Brown apartment each day, you're stepping into a place of comfort, convenience and class. Call Today!Apartment Features: ✩  Nest Thermostats ✩  Large Bathrooms ✩  Quartz Counter Tops ✩  Stainless Steel Appliances ✩  9 Ft Ceilings ✩  Spa Shower System & Jacuzzi Tub ✩  Floor to Ceiling Windows ✩  Generous Closet Space ✩  Largest Apartments in the Area ✩  Full Size Washer\/Dryer in unit ✩  Gourmet Eat-In Kitchens with Cherry Wood CupboardsCommunity Features: ✩  Spacious Highrise Living ✩  Fully Outfitted Fitness Center ✩  Rooftop Walking Track & Dining Areas ✩  24-Hour Concierge Service ✩  Dry Cleaning Service ✩  Spectacular Resort Style Pool Area ✩  Amazing Views and Rooftop LoungePet Policy:Pet Policy:Cats and Dogs Welcome - Max 2.Restrictions and fees may apply. Call us today!Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-4:00PM Photos in this ad may be of other units available too. Please contact our leasing office to schedule a tour of the variety we have! Equal Housing Opportunity JI6QhjqNc0G\n","num_images":14,"lat":39.962145,"lng":-75.137734,"attrs":"['1BR \/ 1Ba', '675ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T13:10:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-bedroom-bathroom\/7621125316.html","post_id":7621125316,"title":"Available 2 Bedroom 2 Bathroom for rent !!","description":"Available 2 Bedroom 2 Bathroom for rent !! This is A beautiful neighborhood.Newer appliances, including a Haier washer-dryer. To maximize space there is a new built-in queen size Murphy Bed and custom closet shelving. There is access to the patio with a fire pit surrounded by grape vines, as well as access to the private pool. Parking space provided on driveway. This is a quiet setting, perfect for relaxing and getting away from it all. Driveway parking is available lite by period street lamp. Door come with double-sided deadbolts and insulation has been recently updated. The building is up to fire code with sprinklers. BACKGROUND CHECKS will be done on evictions. THE TENANT PAYS ALL UTILITIES. per month $800 Reply with your personal Phone number  show contact info","num_images":4,"lat":39.9055,"lng":-75.2444,"attrs":"['2BR \/ 2Ba', '1000ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-05-14T13:30:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/mount-laurel-fantastic-studio-available\/7621113351.html","post_id":7621113351,"title":"..\"FANTASTIC STUDIO@@ AVAILABLE 2 BEDROOM 1 BA @100%free broker's fee","description":"!!....Available 2 Bedroom 1 Bathroom for rent in 4201 Church Rd E, Mt Laurel ! This is a fantastic STUDIO attached to a private residence in a beautiful neighborhood. This darling studio is new construction with light finishes and white cabinetry. Newer appliances, . Reply with your personal Phone number.\n","num_images":4,"lat":39.9478,"lng":-74.9036,"attrs":"['2BR \/ 1Ba', '550ft2', 'air conditioning', \"broker fee details: 100%free broker's fee\", 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'listed by: MJ Peterson Real Estate', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-05-14T12:52:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-live-the-lifestyle-you\/7621123439.html","post_id":7621123439,"title":"Live the Lifestyle You Deserve!","description":"Apt. 5111 — Ascott floor plan — 1,230 sq. ft. — $3,275\nThis 1st floor corner-unit apartment has so much to offer! Our brand-new construction includes white quartz countertops, subway tile backsplash, recessed lighting throughout, luxury plank flooring in the living areas and plush carpeting in the bedrooms. This Ascott also features spacious walk-in closets with custom shelving and ample living\/dining room space. This beautiful apartment home is within close proximity is our clubhouse that features a 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":12,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1230ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-05-14T13:24:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-luxury-high-rise-building\/7621111157.html","post_id":7621111157,"title":"LUXURY HIGH RISE BUILDING 1 bed 1 bath Condo","description":"affordable 1 bed 1 bath Condo in an upscale LUXURY HIGH RISE BUILDING with 24 hour Concierge \/ Security and VERY LOW CONDO FEES in the centrally located and sought after neighborhood of Washington Square West in downtown Philadelphia. The historic Western Union Building featuring Beaux Arts style of the time, was originally built 100 years ago as the headquarters of Western Union Telegraph Company, and was beautifully and tastefully expanded and redesigned into a luxury 12- story boutique residence by Philadelphia's renowned architect Cecile Baker in 2008. The unit itself: Nestled on the 5th floor (enabling you to take the steps OR the elevator which many people like), this very quiet spot faces the courtyard, giving it an air of peace and tranquility. Upon entering, you will note the quaint foyer, which acts as a buffer to the main living area on one side and the bedroom and bath on the other (which isn't alway the case with these size condos) . You will fall for its souring ceilings and large windows (which make the unit feel more spacious), open floor plan, modern kitchen and solid hardwood flooring! The bedroom is plenty big for a king, and boasts a large walk in closet. There is a coat closet and an in unit Washer\/Dryer included in the sale. A perfect first time purchase, downsize purchase, or pied de terre for someone looking for the convenience, luxury, security and peace of mind of a full service Center City building where PARKING IS AVAILABLE ON SITE for an extra monthly fee. The low condo fee includes water, sewer, gas cooking, a fitness center, and a courtyard with a private secure dog run. One of the great things about Wash West is its central location: less than 7 blocks in any direction to most of the great neighborhoods , historic squares and parks of Philadelphia: walkable to beautiful Washington Square and Rittenhouse Square, to the vibrant arts district on Broad St, to Restaurant Row; an easy walk to the center city business district and neighborhoods like Old City, Bella Vista, Queen Village and the Italian Market, all offering award winning dining, shopping and nightlife - and very close to public transportation and Jefferson Hospital!","num_images":4,"lat":39.9489,"lng":-75.1661,"attrs":"['1BR \/ 1Ba', '896ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'carport', 'rent period: monthly']","posted_date":"2023-05-14T12:44:56-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-jefferson\/7621098595.html","post_id":7621098595,"title":"One Bedroom - Jefferson Station","description":"Spacious One Bedroom apartment features hardwood flooring, with competently tiled bathroom. Upgraded kitchen cabinets with newly renovated bathroom. High ceilings giving an openness feel! The apartment also features 9 foot windows that bring in tons of sunlight. Center Heat\/Cooling, is gas.\n✔ Lively Center City Shopping (Fashion District) and Downtown Dining\n✔ Walking distance to Temple University Podiatry, Jefferson University\n✔ Public Transportation (SEPTA Trains and Buses)\n✔ Minutes form the exciting Nightlife of Center City\n✔ In the heart of Chinatown's Grocery Fresh Markets, Popular Restaurants and Karaoke Bars\n✔ The Reading Terminal Market and the Pennsylvania Convention Center just around the corner\nApartment is conveniently next to the Philadelphia Reading Terminal, Fashion District (Mall), Gray Hound, and Market Street Station. We are only seconds walking distance to all major public transportation (bus or train), grocery stores as well as restaurants.\nLaundry facility located within the building on the second floor (coin-op laundry machines). All the rooms are internet and cable ready (you just need to pick the cable provider). Tenant will be responsible for the utilities (gas and electric). Landlord will pay for all sewer, trash removal and clean of the common area.\nNon-Refundable Application Fee $60.\nThis is a must rent apartment for Med-Students\/Hospital Workers. Reply to this ad to make a viewing today!\nAsk for any promotions being offered. (studio, one bedroom, two bedroom)\nNO PETS ALLOWED.\n","num_images":7,"lat":39.954408,"lng":-75.156827,"attrs":"['1BR \/ 1Ba', 'available may 30', 'air conditioning', 'application fee details: $60', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T12:05:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studios-available-dwell\/7621105652.html","post_id":7621105652,"title":"Studios Available! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', '\\nsunday 2023-05-14\\n', '\\nmonday 2023-05-15\\n', '\\ntuesday 2023-05-16\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-05-14T12:26:38-0400"}]