[{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/chester-house-for-rent\/7605890737.html","post_id":7605890737,"title":"House For Rent","description":"Here's your chance to rent a spacious 3 bedroom, 1 bath end of row in quiet neighborhood. This house has been renewed from top to bottom and is ready to move in May 1st . The new carpets throughout the home . The kitchen has wood cabinets and opens to the dining room. The 1st floor has a sizeable living room, dedicated dining room and full kitchen. The upper level has 3 nice sized bedrooms and a full bath. The rear driveway offers off street parking. The location is optimal, just minutes from dining, shopping , amusement and major highways. Come relax in your new home. Veterans and Housing Choice welcomed to apply.  Click the link below to pre-qualify.\nNO SMOKING\nNO PETS\nhttps:\/\/app.rentredi.com\/listingDetails\/FJ5BHc68WMStnKhrxQW5moLKlc43\/-NRYSWtJBS3iIwEHT2e3\/Unit-A\nMore pictures coming soon.\n","num_images":0.0,"lat":39.862912,"lng":-75.367935,"attrs":"['3BR \/ 1Ba', '1152ft2', 'available may 1', '\\nsaturday 2023-04-08\\n', '\\nsaturday 2023-04-15\\n', '\\nsaturday 2023-04-22\\n', 'air conditioning', 'application fee details: $50.00', 'duplex', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T21:28:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/phoenixville-downtown-living-at-its-best\/7605880290.html","post_id":7605880290,"title":"Downtown Living at its Best.","description":"This one bedroom, 1 bath condo is located right in downtown Phoenixville. Within feet of all the restaurants and shops. Features include: stainless steel appliances, open living room\/kitchen concept, garage parking for 1 vehicle, plus a storage room\/area on same floor.","num_images":11.0,"lat":40.133703,"lng":-75.513366,"attrs":"['1BR \/ 1Ba', '600ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T20:41:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/conshohocken-welcome-home-to-this-move\/7605880439.html","post_id":7605880439,"title":"Welcome home to this move-in-ready 1 Bedroom.","description":"Welcome home to this move-in-ready 1 Bedroom with Den condominium in the Grande at Riverview. This generous-sized apartment, with 9' ceilings, offers an easy-living open floor plan. The kitchen has 42\" cherry cabinets, granite counter tops with breakfast bar, and gas cooking. The combination living\/dining room is large enough to allow comfortable separate spaces, and opens to a private balcony.","num_images":9.0,"lat":40.073009,"lng":-75.307827,"attrs":"['1BR \/ 1Ba', '825ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T20:41:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedroom-apartment\/7605875895.html","post_id":7605875895,"title":"One Bedroom Apartment - Washington Square West","description":"Spacious recently renovated one bedroom apartment in a great location in Washington Square West\/Gayborhood. Renovated unit in classic brownstone features central air, hardwood floors throughout. New kitchen with stainless steel appliances including dishwasher. Laundry in unit. Secure code entry to building.\nVery convenient location in Midtown Village, close to Jefferson, Old City, Broad St Line, tons of bars and restaurants on 13th St. Very walkable area, easy access to center city, Rittenhouse, old city, etc.\nMost pets allowed with deposit. 1st\/Last\/Security for move in.\nTenants pay all utilities.\nfor more information or showings call me at:+(185) 5 7 1 7 2 3 4 3\n","num_images":6.0,"lat":39.9448,"lng":-75.2288,"attrs":"['1BR \/ 1Ba', '800ft2', 'available now', 'air conditioning', 'application fee details: $45', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T20:21:22-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-balcony-perfect-for-your\/7605878623.html","post_id":7605878623,"title":"a balcony perfect for your morning coffee.","description":"Enjoy maintenance-free living, conveniently located just minutes from King of Prussia! Welcome to Trent Manor, a friendly condominium\/townhome community in Eagleville. Within walking distance of restaurants, shopping, and the Perkiomen trail, this move-in ready second floor unit offers convenience ! This home is ready for its next owner with a spacious living room with built in 5 speaker sound system and 70 inch television, a balcony perfect for your morning coffee, and generously-sized bedroom with dual closets.","num_images":10.0,"lat":40.1496,"lng":-75.3796,"attrs":"['1BR \/ 1Ba', '832ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T20:33:33-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/southeastern-this-well-maintained-one\/7605878519.html","post_id":7605878519,"title":"This well-maintained one bedroom one bathroom is ready for you.","description":"This well-maintained one bedroom one bathroom is ready for you to move right in. Walk up the steps and enter the main living room area with tons of natural light coming through. Have your morning coffee or relax after a long day on your private deck right off of the living room. The kitchen offers plenty of cabinet space with stainless steel appliances. The bedroom is spacious with a large walk-in closet. You will find another closet across from the bathroom. Newer appliances, carpet, and roof! Westtown Mews is conveniently located near major roads and offers a walking path to the near-by shopping center.","num_images":9.0,"lat":39.966455,"lng":-75.53007,"attrs":"['1BR \/ 1Ba', '1034ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T20:33:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/havertown-apartment-in-historic-home\/7605866983.html","post_id":7605866983,"title":"Apartment in Historic Home","description":"RENTAL\nPrivate apartment in historic Harford Hall one of the oldest houses in PA.\nBedroom, living room, bath with shower.\nCorner kitchen, basic appliances.\nFully furnished. Verizon Wi-Fi and TV included.\nWorking fireplace. Driveway Parking. Access to washer and dryer.\nGarden with patio. Dog permitted. (no cats)\nPrivate entrance is on the second floor up an outside steep stone staircase.\nOn site parking.\nLaundry on site.\nCross the street to the Norristown High Speed Line and Karakung Creek.\n$1,400 per month. No extra fees.\nFor the history of the house see:\nhttps:\/\/iliveinharford.com\/harford-hall.html","num_images":4.0,"lat":39.9774,"lng":-75.3106,"attrs":"['1BR \/ 1Ba', '500ft2', 'available now', 'air conditioning', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry in bldg', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T19:47:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-one-bed-bath-move\/7605848099.html","post_id":7605848099,"title":"LOVELY ONE BED *** 1 bath *** Move in Ready","description":"1 bedroom apartment in Old Kensington (Germantown and Berks). Beautifully restored with original hardwood floors throughout, custom built-in's, concrete countertops and heated bathroom floors. Small outdoor space as well as first floor laundry are shared with the other 3 units in the building. A few blocks from Reanimator Coffee on Master Street, a short walk to Berks stop on the L and Temple stop on the regional rail. Minutes away from Fishtown\/Northern Liberties restaurant\/shopping districts.","num_images":5.0,"lat":39.979887,"lng":-75.143138,"attrs":"['1BR \/ 1Ba', '750ft2', 'available now', '\\nsaturday 2023-04-01\\n', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'laundry on site', 'carport', 'rent period: monthly']","posted_date":"2023-04-01T18:38:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-townhouse-for-rent\/7605844417.html","post_id":7605844417,"title":"Townhouse for rent","description":"You can live in one of the most beautiful spots in the Delaware Valley! 312 Burnside Avenue is a deeded 5.262 acres of peace - woods, private trails and meadow with Stony Creek running the full length of the property. On those hidden acres of tranquility are four dwellings: a gracious Main House, a Cottage, an Apartment\/Guest Quarters and a Spring House. The historic Farmhouse\/Manor is one of the oldest buildings in Montgomery County, dating from c.1772 and primarily built in the 1800s. Fresh painted 2 bedroom + den apartment with an eat-in kitchen is currently for renting. Come see, and bring your hiking shoes to see how private and exquisite your trails through the woods and meadows are.\none year\n","num_images":10.0,"lat":40.1496,"lng":-75.3796,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-04-01T18:25:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-perfect-one-bed-bath-fast\/7605838428.html","post_id":7605838428,"title":"Perfect One Bed \/ 1 bath ** Fast Approve","description":"The unit features light oak color hardwood floors throughout, kitchen with stainless steel appliances, including microwave and dishwasher. Washer and dryer in the unit. Central A\/C and heat. Ceiling fans. Large size bedroom. Great size closet. Private balcony. , elevator in the building. One garage parking spot is included in the price. Walking distance to local coffee shops, restaurants and bars such as Dolce cafe, Standard Tap, Heritage, Jerry's Bar, Cantina, Urban Village and many others. Acme and GIANT Heirloom market are within 5 min of walk.","num_images":7.0,"lat":39.963069,"lng":-75.140932,"attrs":"['1BR \/ 1Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T18:05:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wilmington-coming-with-beds-full-bath\/7605838678.html","post_id":7605838678,"title":"@Coming with 2 beds 1 full bath and plenty of space@","description":"This newly remodeled home is completely move in ready!  Coming with 2 beds 1 full bath and plenty of space. An open concept and plenty of natural lighting really makes this Rancher stand out. Notable upgrades include; stainless steel appliances, new siding, new roof, new flooring throughout, new kitchen (cabinets, appliances & countertops), New bathrooms (tile, shower, & cabinets, new windows, and new AC Unit. As if that wasn't enough, a large open back yard that is perfect for hosting your next event or your furry friends! Contact:  show contact info","num_images":5.0,"lat":39.7378,"lng":-75.5497,"attrs":"['2BR \/ 1Ba', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T18:06:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-college-manor-unit-2b\/7605833094.html","post_id":7605833094,"title":"College Manor Unit-2B","description":"832 Pine Street  Unit-2B is a 350 square foot studio apartment available 6\/1\/23 for $1,220.00. The Unit offers a newer kitchen with stainless-steel appliances, central air and wood floors. The heat is included. The washer Dryers are in the basement.  There is a shared rooftop deck.  In walking distance to South Street, Old City, Penn's Landing, Center City, public transportation, large markets, restaurants and both Jefferson and Pennsylvania Hospitals.","num_images":7.0,"lat":39.944517,"lng":-75.156025,"attrs":"['0BR \/ 1Ba', '350ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T17:48:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bd-online-payments\/7605813755.html","post_id":7605813755,"title":"2\/BD, Online Payments Available, In Philadelphia","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!If you’re looking for a modern and hip space to call home, then look no further than Apex Manayunk. Located in Philadelphia, Pennsylvania, we feature modern 1, 2, and 3-bedroom loft style apartments and townhomes, many with dens. Our 2 and 3-bedroom townhomes have a fun and industrial feel. That’s because Apex Manayunk expertly blends three brand-new buildings with four historic textile mill structures to create one of the region’s most exciting luxury apartment communities. Amenities Include:9' ceilings with large windowed walls featuring unobstructed views of the river, canal or courtyardUpgraded Hardwood Floors in all Foyers, Kitchens, Dining and Living RoomsOn-site bike storageMarble master baths, some with deep linen storageAlexa or Google Home Capable in all ApartmentsOnline Payments AvailableBBQ and deck areaGame Room with Billiards Table, Shuffle Board, and moreBark parkBocce ball field48-hour Maintenance CommitmentUpgraded One, Two and Three Bedroom Loft Style Apartment Homes and Townhomes, many with densCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/lrlccsuj\/ApexManayunk\n","num_images":9.0,"lat":40.0275,"lng":-75.2242,"attrs":"['2BR \/ 2Ba', '1958ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'carport', 'rent period: monthly']","posted_date":"2023-04-01T16:51:58-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-bath\/7605793588.html","post_id":7605793588,"title":"!!@Beautiful 2 bedroom 1 Bath Durango model!@","description":"This 2 bedroom 1 Bath Durango model unit is in an excellent location with the back deck facing the woods, and so much more! Controlled gated community with access code, security cameras, lush landscaping, valet trash pick-up, on site laundry room, 24 hour responsive emergency maintenance, Pet Friendly. Our beautifully renovated three bedrooms floor plans were designed to give you the quality and comfort you deserve!Please Text For More Information (716) 625-38 26 !!\nRecently renovated, new kitchen, (716) 625-38 26 , dishwasher, garbage disposal, valet trash pick-up, newly installed floor, ceiling fans, renovated bath, gated controlled with access code, security cameras, double-pane windows... (716) 625-38 26\nRent -900\nNO-Deposit\nApplication - 24.95\nUtilities:\n- Gas Included\n- Water Included\n- Valet-Trash Pick-up Included\n- Other utilities - Monthly Pest Control\nAppliances:\n- Air Conditioning\n- Dishwasher\n- Garbage Disposal\n- Range\n- Refrigerator\n- Washer & Dryer On-Site\n-double-pane windows... (716) 625-38 26\nLeaseLengths:\n- 6 Months lease\n- 12 Months lease\nAmenities\n- On site laundry room\n- Gated community\n- Access code for entrance\/exit gate\nPets:\n- Cats Allowed\n- Small Dogs Allowed\nAny questions please feel free to contact me with your name, email, and cell phone number...........................","num_images":8.0,"lat":39.9207,"lng":-75.1595,"attrs":"['2BR \/ 1Ba', '1165ft2', 'application fee details: $24.95 Application Fee Per Adult', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T16:01:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-featuring-amenities-such\/7605684683.html","post_id":7605684683,"title":"Featuring amenities such as gym and outdoor space!","description":"TransAtlantic Building (430 Fairmount Avenue) is located in the heart of one of the country's hottest neighborhoods! An iconic revitalization surrounded by the charm of Northern Liberties' tree lined streets and historic homes. Just steps from a wide variety of store fronts, restaurants, and parks- the TransAtlantic is the perfect place to call home! White-washed original brick and beam is complemented with luxurious modern finishes for maximum aesthetic pleasure. A rare building for the neighborhood, featuring amenities such as gym and outdoor space!\n430 Fairmount Ave #103","num_images":12.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '837ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T11:46:14-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-sunny-spacious-newer\/7605683826.html","post_id":7605683826,"title":"Sunny & spacious newer construction unit in Fairmount!","description":"Welcome to 922 N 15th St #1 -- a sunny & spacious newer construction unit in Fairmount! The spacious open concept entry level includes the living area, dining area, and gorgeous kitchen with stainless steel appliances, seated island, and plenty of counter and cabinet space. Down the hall you'll find the first bedroom and full bath with tiled shower and tub. Off the kitchen is a private back patio; perfect for relaxing or entertaining. Downstairs are the second and third bedrooms, in-unit washer\/dryer, and two additional FULL baths. All throughout, you'll appreciate the ample storage space, recessed lighting, high ceilings, wide layout, and luxury finishes\/fixtures. Last but not least, the LOCATION... Walking distance to Fairmount Ave shops\/restaurants\/nightlife, The Met, Divine Lorraine, local favs like Vineyards Cafe, Cambridge St Coffee, Rybread, Bar Hygge, Lorraine, & more; Super easy access to Broad St line and Girard Ave for a breeze of a commute to Center City, Fishtown\/NoLibs, Temple, South Philly\/the stadiums & beyond; Also convenient to the Art Museum, Kelly Drive, Fairmount Park, Wissahickon, highways, hospitals, grocery stores, convenience stores - the list goes on! Schedule a tour today -- you must see this one in person! {Tenant responsible for all utilities plus $50\/mo for water paid to Landlord with monthly rent. Pet friendly on case-by-case basis with owner approval and fees. First\/last\/security due at lease signing.\n922 N 15th St #1","num_images":13.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 3Ba', '1715ft2', 'available apr 17', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T11:44:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-wonderful-living-and\/7605674988.html","post_id":7605674988,"title":"Wonderful living and dining space!","description":"THE MIDTOWN! This value priced spacious and gracious light filled 1 bedroom offers: Wonderful living and dining space which your kitchen over looks. Very well proportioned bedroom and all tile bath. Enjoy living just minutes from Avenue of the Arts, Jefferson Hospital, Pennsylvania Hospital, and the Reading Terminal Market. Walking Score 110!\n1218 Walnut St #202","num_images":8.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '600ft2', 'available may 16', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T11:23:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-dont-miss-this-beautifully\/7605674118.html","post_id":7605674118,"title":"Don't miss this beautifully renovated 2nd-floor unit !","description":"Don't miss this beautifully renovated 2nd-floor unit with its own private furnished roof terrace for seasonal plantings and a container garden (maintained by Landlord) This sunny unit has 2 bedrooms and 2 full bathrooms (both en-suite). Enjoy living on this quiet tree-lined street in desirable Fitler Square. The unit has been completely renovated with new hardwood flooring, and brand-new bathrooms (one has a walk-in shower and the other has a bathtub). Prepare gourmet meals in your brand new kitchen with all new appliances and then enjoy alfresco dining on the private furnished roof terrace. Gas & hot water is included in the rent, tenant pays electric. 880 sq feet\n2110 Lombard St #2","num_images":10.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '880ft2', 'available now', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T11:21:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-move-right-in-to-this\/7605679677.html","post_id":7605679677,"title":"Move right in to this fully updated two-bedroom\/two-bath!","description":"Move right in to this fully updated two-bedroom\/two-bath Graduate Hospital residence. Sun streams into the dramatic two-story living room, where a wood-burning fireplace is waiting to warm your winter days. Built-in bookshelves and excellent wall space for art complete the picture. Off of the living room is a storage room with laundry facilities and mechanicals for the unit. The eat-in kitchen is finished with neutral wood cabinetry topped in granite along with a stainless refrigerator, stainless undermount sink and a gas range. The kitchen also features a tile floor and backsplash, and the dining area includes bench seating with built-in storage. Access a rear deck from this level that provides a spot for a café table or chaise. There is a bedroom on this level served by a full bath with stall shower and pedestal sink. An upstairs bedroom also has a full bath with a tub\/shower. Both bedroom closets include organizers. This is a great opportunity to join one of the city’s most vibrant neighborhoods close to Center City and points west into University City. **Disclaimer BOTH bedrooms do not have carpet anymore. Newly installed vinyl floors in both bedrooms.**\n2029 Bainbridge St #1","num_images":12.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 2Ba', '1146ft2', 'available apr 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T11:34:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-water-and-parking-included\/7605678667.html","post_id":7605678667,"title":"Water and parking included in rent!","description":"Incredible top floor 1 bedroom apartment with wrap around windows PLUS parking in the middle of Rittenhouse Square!!! Located on the corner of 23rd and Walnut Street, this apartment will give you walking access to the best parts that the city has to offer! This unit boasts large living and bedroom space with a TON of natural light to match! Washer and dryers in unit. Easy access to all highways including 676 and I-95 in case you have to get out of the city limits easily and conveniently. The best restaurants within minutes' walk and the most vibrant night life as well. Elevator building that allows pets. Water and parking included in rent!\n135 S 23rd Street #B5","num_images":10.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '720ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2023-04-01T11:32:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-you-will-find-modern\/7605675933.html","post_id":7605675933,"title":"You will find modern features and amenities!","description":"Welcome to 601 N 12th St Located among all new construction on N 12th St and nuilt with top of the line appliances, finishes, and flooring, this building is a one of a kind gem in Spring Arts. Enjoy having direct access to Center City, Fairmount, N Broad St and tons of shopping and restaurant experiences. Inside you will find modern features and amenities including high efficiency central air + heat, full size washers\/dryers and spacious floorplans. The bi-level, second floor unit offers a spacious living area, gorgeous kitchen space with upgraded appliances and 2 bedrooms suitable for a King bed. Located on a corner parcel, this unit benefits from terrific natural light and large windows throughout!.\n601 N 12th St #B","num_images":11.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2Ba', '1052ft2', 'available may 3', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T11:26:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-large-bedroom-bathroom-is\/7605663657.html","post_id":7605663657,"title":"Large 2 bedroom, 1 bathroom is located in the heart of Francisville!","description":"This large 2 bedroom, 1 bathroom is located in the heart of Francisville and is ready for tenants! Unit 3 is drenched in natural light and showcases stunning hardwood floors that have been stained onsite and a spacious kitchen with gorgeous countertops, sleek white cabinets with stainless steel appliances. The unit also features a modern bathroom with a double sink vanity, designated laundry closet with a washer and dryer and lots of closet space. A monthly water fee of $75 includes all cold water usage. Living at Uber Commons I, you are blocks from the delicious restaurants on Fairmount Ave, short bus ride to Center City, and minutes from the Schuylkill River Trail. Just a short walk to Aldi, Bold Coffee Bar, Tela's Market and Kitchen, Francisville Playground, and easy access to public transportation. Photos of a similar property by the same builder.\n814 N Uber St #3","num_images":10.0,"lat":39.9677,"lng":-75.1735,"attrs":"['2BR \/ 1Ba', '934ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T10:57:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bi-level-bed-bath-in\/7605670693.html","post_id":7605670693,"title":"Bi-Level 2 bed, 2 bath in Washington Square West!","description":"Bi-Level 2 bed, 2 bath in Washington Square West! The entrance to this apartment is off Hutchinson which is a super quiet\/low traffic street! This top floor apartment has everything you are looking for! Spacious, bright, great location, updated finishes and hardwood floors! Walk into the apartment to find a dining area\/office space which leads into the updated kitchen with stainless steel appliances with a breakfast bar, dishwasher, gas stove and garbage disposal! The full sized laundry is also located there. The living area is south facing so it gets wonderful light with a fireplace! Upstairs you will find two great sized bedrooms and two renovated bathrooms! Close to Pennsylvania Hospital, Jefferson, South Street, Broad Street. Acme and Whole food 1 block away! Pets welcome for $25\/month.\n921 Lombard St #B","num_images":12.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '1300ft2', 'available apr 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T11:13:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-two-bedroom-flat\/7605668966.html","post_id":7605668966,"title":"Spacious two bedroom flat showcases gorgeous river views!","description":"Sun-soaked two bedroom, two bathroom available for rent at Pier 3 in Penn's Landing! This spacious two bedroom flat showcases gorgeous river views, oversized windows throughout and an eat-in kitchen. Enter through a foyer into the light-filled great room providing a cozy fireplace and ample space for separate living and dining areas. The well-equipped eat-in kitchen features plenty of white cabinetry, gray countertops and white appliances. Both bedrooms are generously sized and boast excellent closet space. Unique to this unit, the master suite enjoys a large private terrace serving as the perfect spot to enjoy a morning cup of coffee throughout the warmer months. The guest bedroom enjoys use of a nearby full hall bathroom with a single vanity and stall shower. Residents of Pier 3 enjoy a twenty-four hour doorman, heated indoor pool, fitness center, and parking available for an additional fee (subject to availability).\n3 N Columbus Blvd #TD411","num_images":10.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1300ft2', 'available jun 6', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T11:09:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom\/7605664917.html","post_id":7605664917,"title":"Beautiful 2-bedroom apartment with an amazing private roof deck!","description":"Beautiful 2-bedroom apartment with an amazing private roof deck! The spacious living room opens into the new kitchen, with white shaker cabinets, stone countertops, and stainless steel appliances. Off the living room is a stacked washer-dryer and 3-piece bath. Both bedrooms are large enough for queen beds and have great closet space. The smart layout--with bedrooms on either end of the apartment--gives everyone their privacy and is perfect for roommates. Primely located in the booming Graduate Hospital neighborhood, this unit is just steps to plenty eateries and nightlife with every public transit option allowing quick access to Rittenhouse Square, Fairmount, Old City, and South Philly. But, the real selling point for this apartment is the private roof deck with stunning views of the skyline! Tenant responsible for first month’s rent and security deposit.\n760 S 15th St #3","num_images":9.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1Ba', '760ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T11:00:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-luxury-location-and\/7605654936.html","post_id":7605654936,"title":"Luxury, Location, and Convenience","description":"Apt. 1504 — Dorchester floor plan — 881 sq. ft. — $2,483\nLocated on the 5th floor, this 1-bedroom apartment has a great view from a large private balcony! This apartment boats LVT flooring, central heat and air, a washer and dryer, stainless steel appliances, and plenty of cabinet space in the kitchen. This apartment also comes equipped with a spacious living area and walk-in closet. This gorgeous apartment is within close proximity to our clubhouse—featuring a 24-hour fitness center, theatre, resort-style swimming pool, and so much more!\nOur leasing office is open 7 days a week – call  show contact info\nto schedule a tour today!","num_images":13.0,"lat":39.9308,"lng":-75.0175,"attrs":"['1BR \/ 1Ba', '881ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-01T10:34:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-custom-subway-tile\/7605652819.html","post_id":7605652819,"title":"Custom Subway Tile Backsplashes, Electronic Thermostat, Fitness Center","description":"Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia.  Call Now:  show contact info\nx 41OR Text 41 to  show contact info\nto chat!Use this link for more info:https:\/\/mack.touraptnow.com\/50px40This is a 1 Bedroom, 1 Bath, Approximately 650 Sq. Ft.Features - Large Closets with Organizing Systems  - Stone Counters  - Dishwasher  - Patio\/Balcony*  - Washer\/Dryer  - Premium Stainless Steel Appliance Package  - Disposal  - Tons of Natural Lighting Throughout  - Cable Ready  - Selected  - Flush Mount Sinks with Goose Neck Faucets  - Custom Subway Tile Backsplashes  - Gas Range  - Hardwood Style Flooring  - Electronic Thermostat  - Air Conditioner *In Select Apartment Homes Community Amenities - Parisian Style Café with Demonstration Kitchen  - Free Weights  - Garage  - Fitness Center  - Elevator  - Multiple, Expansive Outdoor Spaces  - BBQ\/Picnic Area  - Selected  - Smoke-Free Community  - Playground  - Rooftop Dog Park  - Sundeck  - Off Street Parking  - Covered Parking  - Multiple Co-Working Studios  - On-Site Management  - On-Site Maintenance  - Courtyard  - Tennis Court Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMThe Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Equal Housing Opportunity Wogme6UJn\n","num_images":13.0,"lat":40.0118,"lng":-75.2342,"attrs":"['1BR \/ 1Ba', '650ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T10:28:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-disability-access-car-wash\/7605649989.html","post_id":7605649989,"title":"Disability Access, Car Wash Area, Playground","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Ceiling FansGas FireplacesDisability AccessState-of-the-Art Fitness CenterCar Wash AreaAir ConditioningPlaygroundPrivate Patio or BalconyOversized ClosetsExclusive & Newly Renovated ClubhouseDishwasherCable\/Satellite TVCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/jdoe6e56\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['1BR \/ 1Ba', '754ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T10:20:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-lease-today-playground\/7605648383.html","post_id":7605648383,"title":"Lease Today, Playground, Luxurious Bathrooms","description":"VIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nSchedule a tour today at The Point at West Chester. Our staff would love to help you find a new home that perfectly fits your style.\nThis one bedroom one bathroom apartment features a fully equipped kitchen, pantry, coat closet, washer\/dryer, walk-in closet, ensuite bathroom, and a patio\/balcony!\nApartment Features\n* Roommate Friendly Floor Plan\n* Stainless Steel Appliances\n* Refrigerator, Microwave, Dishwasher & Electric Stove\n* Breakfast Bar\n* Disposal\n* Full sized Washer and Dryer in unit\n* Linen Closet\n* Walk-in Closet\n* Private Patio or Private Balcony (on select apartments)\n* Granite Countertops\n* Central Heat and Air\n* Window Coverings\n* Pre-wired for internet and cable\n* High Efficiency Lighting Fixtures\n* Garden Tub\n* Ceiling Fan\n* Lofty Vaulted Ceilings\n* Pantry","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['1BR \/ 1Ba', '812ft2', 'available now', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T10:16:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-very-large-bedroom\/7605643219.html","post_id":7605643219,"title":"Very Large 3 Bedroom \/ 2 Bathroom Apt in Center City Philadelphia","description":"Large 3 Bedroom Apt with 2 Full Bathrooms in Center City Philadelphia.\nTwo floors includes living room, kitchen and three large bedrooms.\nHigh Ceilings and bright windows\/light throughout.\nHardwood floors throughout\nPlenty of cabinet and closet space.\nAll Appliances provided for convenience (washer\/dryer in apartment, dishwasher and garbage disposal)\nNear cafes, starbucks, wawa, South Square Market, CVS,\nGreat downtown location near shopping, colleges, hospitals and restaurants.\nAvailable June 15.\nPet friendly.\nIf interested, please reply to ad via email.\nMichael J. Blaine, Licensed Realtor®\n","num_images":14.0,"lat":39.945269,"lng":-75.178578,"attrs":"['3BR \/ 2Ba', 'available jun 15', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T10:01:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-bathroom-apartment\/7605616416.html","post_id":7605616416,"title":"2 bedroom, 2 bathroom apartment boasts modern amenities","description":"Welcome to 90 E Laurel St #B, a stunning bilevel apartment located in the highly sought-after Northern Liberties neighborhood of Philadelphia. This 2 bedroom, 2 bathroom apartment boasts modern amenities and a prime location for an unbeatable rental experience. The open floor plan and stylish finishes create a bright and airy feel throughout the space, making it perfect for those who value comfort and style. The kitchen features stainless steel appliances, granite countertops, and plenty of cabinet space, while the living area is perfect for entertaining guests or simply relaxing after a long day. Both bedrooms are generously sized and located on separate levels for added privacy, with ample closet space for all your storage needs. In addition, this unit comes with off-street parking and in-unit laundry, making daily life more convenient and enjoyable. The rooftop deck is one of the highlights of this apartment, providing stunning views of the city skyline. Whether you want to soak up the sun, enjoy a meal al fresco, or simply relax with friends and family, the rooftop provides the perfect setting. The in-unit washer and dryer also add to the convenience and comfort of living at 90 E Laurel St #B. The Northern Liberties neighborhood is known for its vibrant atmosphere, with some of the best restaurants, shops, and entertainment that the city has to offer. With a Walk Score of 97, daily errands are a breeze and public transportation options are easily accessible. You'll never run out of things to do in this bustling neighborhood, whether you want to explore\n90-94 E Laurel St #B","num_images":7.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 2.5Ba', '1027ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T08:15:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-222-rittenhouse\/7605614933.html","post_id":7605614933,"title":"Welcome to 222 Rittenhouse, an architecturally historic high-rise !!","description":"$500 security deposit! Available now! Welcome to 222 Rittenhouse, an architecturally historic high-rise tower on Rittenhouse Square. Beautifully situated on the west side of the Square, 222 offers revered park side living in Center City s most sought after neighborhood at a terrific value. This handsome 1920 s building welcomes residents with a stunning double height lobby. Choose from luxury studios, one, two and three-bedroom apartments as well as penthouses in a variety of distinctive floor plans. The apartments have been recently renovated to include new kitchen cabinets, countertops, appliances, fixtures, flooring and restored tile bathrooms. Units have central air, in-unit laundry, dishwashers and great closets! Many apartments enjoy views of beautiful Rittenhouse Square and the skyline of Philadelphia. Residents enjoy 24-hour desk services, fitness facility, business lounge and 24 - hour maintenance. The biggest amenity 222 provides is the unbeatable LOCATION. A short walk to UPENN, Drexel University, Chop, Jefferson Hospital, 30th Street Station, central business district, Kimmel Center, Schuylkill River Park, high-end retail and Philadelphia's best bars, cafes, and restaurants. Just $500 Security Deposit and 1st month's rent to move-in! Pets allowed. Extra storage available. Bike storage on site.\n222 W Rittenhouse Sq #1404","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '350ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T08:06:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-the-vine\/7605616639.html","post_id":7605616639,"title":"Welcome to The Vine located in the heart of the Francisville","description":"Welcome to The Vine located at 1723 Francis Street in the heart of the Francisville section of the highly sought-after Fairmount neighborhood. Enter into the wide-open floor plan that features large windows throughout, filling every inch with an abundance of natural light. The beautiful kitchen is equipped with walnut and white two-tone Porcelanosa cabinets and white quartz countertops, black finishes, and stainless-steel appliances. Your generously sized bedroom offers a large closet with custom built ins, and the bathroom features designer tile and custom vanities. The full-size washer and dryer is tucked away in the laundry closet in the unit for your convenience. This unit is finished with modern conveniences such as the NEST thermostat and LATCH keyless entry system! Take advantage of the shared roof deck with stunning views of Center City, an additional dog run space for pet lovers, and secured mail and package room for all of your deliveries. Don’t miss your chance to fall in love with The Vine, contact to tour today!\n1723 Francis St #1B","num_images":7.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '650ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T08:16:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/norristown-24-brant-rd-bedroom-house\/7605612745.html","post_id":7605612745,"title":"\/\/24 Brant Rd\/\/ 3-Bedroom House w\/ Garage &  Screened In Back Porch!!","description":"This 3 bedroom house is located in desirable Methacton School District. The house has gas heat, central air, washer dryer, 1 full bathroom, kitchen, living room and dining room. It also has a 1 car garage and screened in back porch.\nTenant pays for all utilities, grass cutting and snow removal.\nPlease include: Full name, phone number AND email address in reply.\n","num_images":11.0,"lat":40.1496,"lng":-75.3796,"attrs":"['3BR \/ 1Ba', 'air conditioning', 'application fee details: $25', 'broker fee details: $10', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'detached garage', 'rent period: monthly']","posted_date":"2023-04-01T07:53:52-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-location-location-bedhouse\/7605616476.html","post_id":7605616476,"title":"Location! location! 2 BED*house in 1206 S Peach St, (850 sq ft)","description":"Location! location! 2 bedroom house in 1206 S Peach St, 1bathroom (850 sq ft) apartment with new w\/w carpet, newer kitchen with stainless steel appliances, electric stove, . Off kitchen is a back yard, front of the house has a sunporch. Rooms have ceiling fans with new fixtures. The bathroom nice in size with a jacuzzi tub and shower, ceramic walls and floors, granite vanity. The dining room has a 220 line. The exterior doors are steel and have security doors. This property is close to restaurants, highways, all transportation. Off-street parking.\n*Pets are welcome!\nAppliances:\n- Dishwasher\n- Freezer\n- Microwave oven\n- Range\n- Refrigerator\n- SS appliance.\n","num_images":4.0,"lat":39.942427,"lng":-75.224543,"attrs":"['2BR \/ 1Ba', '850ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T08:15:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-new-fully-rehabbed\/7605616171.html","post_id":7605616171,"title":"New fully rehabbed apartments offer modern living in a historic distri","description":"Welcome to 1924 Spruce St! Nestled in the desirable Rittenhouse Square neighborhood, these new fully rehabbed apartments offer modern living in a historic district. The building has been home to prominent Philadelphia families such as Dr. John Hooker Packard, one of the most prominent American surgeons of the late 19th century; and the Philadelphia lawyer, Earl B. Putnam. Later covered to apartments in 1945, the most recent renovation was finalized in October 2022. The building holds eight (8) stunning brand-new units offering high-end appliances, including trash compactors, elevator access and lovely views of Center City. There are a variety of floor plans available for those seeking 1 to 3 bedrooms and you won't have to worry about laundry, as each apartment has a wash\/ dryer in the unit. With so many attractions nearby, this location is the epitome of ideal: steps away from Rittenhouse Park, Starbucks, restaurants, shopping, and so much more. Transportation is a breeze, with countless bus routes around the corner and just a quick stroll to the BSL. *pictures may be of similar unit*\n1924-26 Spruce St #3R","num_images":7.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '712ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T08:14:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-great-space-and-value-in\/7605615183.html","post_id":7605615183,"title":"Great SPACE and VALUE, in this fantastic Studio apartment","description":"FOR A LIMITED TIME RECEIVE: A HALF OF MONTH'S RENT FREE ON A 12 MONTH LEASE!!!Great SPACE and VALUE, in this fantastic Studio apartment just off RITTENHOUSE SQUARE. Enjoy living in this elevator\/doorman building with AMAZING GYM, minutes from PENN, DREXEL , 30th St TRAIN STATION and in the heart of ALL!!!!!!!Philadelphia has to offer Walking score is 110!!!!! Photo's are of model unit.\n2100-2 Walnut St #15G","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['0BR \/ 1Ba', '250ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T08:08:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-charming-and-cozy-bedroom\/7605615665.html","post_id":7605615665,"title":"Charming and cozy 1 bedroom apartment in Washington Square West","description":"Available May 1, 2023. Charming and cozy 1 bedroom apartment in Washington Square West on Locust between 11th & 12th. This 2nd floor apartment is cool and breezy with windows on three sides featuring views of a community garden. The apartment has a Washer and Dryer, dishwasher, full sized gas range, disposal in the sink and central Air. There is a huge picture window for a ton of natural light and great views. Convient to Thomas Jefferson University, Penn Hospital, Broad Street subway and High Speed lines to NJ. Plenty of amazing restaurants, stores and so much more right outside your apartment. This home is centrally located to the best of what Philadelphia has to offer. Don't hesitate to schedule your tour today!\n1112 Locust St #1","num_images":7.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '650ft2', 'available may 1', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T08:11:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-and-sunny-bedroom\/7605615399.html","post_id":7605615399,"title":"Bright and sunny 1 bedroom, large living room","description":"Bright and sunny 1 bedroom, large living room, kitchen with stainless appliances including dishwasher, built-in microwave, extra large stove (gas range), plus garbage disposal. Modern bathroom with tub and shower, wood floors throughout. Central air conditioning. Extra entrance area space for your bicycles! This is an Avenue of the Arts \/ Gradate Hospital Area apartment home on a tree-lined street. Only 1 block walk to many restaurants and shops between 15th and 17th Streets. Easy walk (2 blocks) to artistic venues along the Avenue of the Arts, including the Kimmel Center, Wilma Theatre, Suzanne Roberts Theatre, University of the Arts, and all forms of public transportation along Broad Street. Parking lots nearby for approx $250-300\/mo. Available 3\/27\/23\n1520 Kater St #B","num_images":8.0,"lat":39.9379,"lng":-75.1794,"attrs":"['1BR \/ 1Ba', '720ft2', 'available now', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T08:09:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-spacious-bi-level-bedroom\/7605614526.html","post_id":7605614526,"title":"Spacious bi-level, 2 bedroom, 1.5 bath apartment in Graduate Hospital.","description":"Available immediately! Spacious bi-level, 2 bedroom, 1.5 bath apartment in Graduate Hospital. Walkable to Center City, Lincoln Square shopping, Broad St. subway line and all the upcoming developments along Washington Ave, as well as easy access to West Philly and 76. In unit laundry and nice patio for entertaining. Pets allowed on case by case basis with pet deposit. First month and security due at lease signing.\n2107 Catharine St #UNIT A","num_images":7.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1.5Ba', '1100ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T08:04:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-renovated-bedroom\/7605614172.html","post_id":7605614172,"title":"Renovated 2 bedroom residence with a designer kitchen","description":"Renovated 2 bedroom residence with a designer kitchen and laminate flooring at The Carlyle! The home features a high-end kitchen with maple shaker cabinetry, stainless steel appliances, granite countertops, mosaic tile backsplash and a large breakfast bar; a spacious living\/dining room with ample space for entertaining; two bedrooms that enjoy use of a full hall bathroom with a shower\/tub and mosaic glass tile detail; and a washer\/dryer for added convenience. The Carlyle is a pet-friendly, doorman building only one block from Rittenhouse Square. Rent includes the security of a 24-hour doorman and use of the building's state-of-the-art gym. Tenants are responsible for paying all utilities.\n2031 Locust St #C100","num_images":7.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '958ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T08:02:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-boutique-building-in-bella\/7605606559.html","post_id":7605606559,"title":"Boutique Building in Bella Vista with your own Private Outdoor space.","description":"You are greeted by the bank of south facing windows , high ceilings, hardwood floors throughout, and sleek ceiling fans. The stainless and maple open kitchen boasts a zero radius sink, commercial style faucet, glass mosaic back splash and poured concrete counter tops. The main bath features slate tiles, polished concrete vanity with raised vessel glass sink, river rock back splash and a square-shaped Pessario dual flush toilet. Open den with Murphy bed is just off the kitchen. Glass french doors lead to the bedroom suite w\/ private powder room and stackable laundry. Sliding glass doors lead out to the terrace.","num_images":15.0,"lat":39.941237,"lng":-75.153306,"attrs":"['1BR \/ 1Ba', '988ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T07:05:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-story-bed-bath\/7605608569.html","post_id":7605608569,"title":"Lovely 3 Story 3 Bed 2 Bath Redbrick Rowhouse!!","description":"A lovely 3 Story 3 Bed 2 Full Bath redbrick rowhouse for rent with wood floors, great kitchen, stellar natural light and a backyard - close to Frankford Ave and Phila Brewing. 1ST FLOOR: Enter into large open living and dining space with plenty of room for furnishings and entertaining. Kitchen in rear is large with ample storage, all black and stainless appliances, brand new dishwasher and disposal. Kitchen exits to large rear patio with lots of space for grilling, entertaining and plants. 2ND FLOOR: Front large bedroom with incredible light, real closet space and hardwood floors. CALL For More Info:  show contact info","num_images":7.0,"lat":39.986928,"lng":-75.130794,"attrs":"['3BR \/ 2Ba', '1564ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2023-04-01T07:22:42-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-welcome-to-the-quarters-at\/7605609268.html","post_id":7605609268,"title":"Welcome to the Quarters at Fairmount 3BR\/2.5BA a Premier Living Unit!","description":"Welcome to The Quarters at Fairmount, a premier living destination in Philadelphia s Northern Liberties neighborhood. Our combination of 38 unique townhomes provide an exciting opportunity to enjoy the best this neighborhood has to offer. Enjoy your updated chef s kitchen with top of the line appliances, custom cabinetry and a perfect space for entertaining guests or spending time with your family. Bedrooms have ample closet space and bright large windows! When you live at the Quarters at Fairmount you will have the luxury of a new construction townhome without sacrificing that community feel. Here you will live within a complex that offers manicured community gardens and common space while still being within close proximity to public transportation, shopping centers and some of the best dining that the area has to offer! Enjoy the beautiful views of the city!\n634 N 5th St #18\n","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['3BR \/ 2.5Ba', '2332ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T07:27:49-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-story-bed-bath\/7605608508.html","post_id":7605608508,"title":"Lovely 3 Story 3 Bed 2 Bath Redbrick Rowhouse!!","description":"A lovely 3 Story 3 Bed 2 Full Bath redbrick rowhouse for rent with wood floors, great kitchen, stellar natural light and a backyard - close to Frankford Ave and Phila Brewing. 1ST FLOOR: Enter into large open living and dining space with plenty of room for furnishings and entertaining. Kitchen in rear is large with ample storage, all black and stainless appliances, brand new dishwasher and disposal. Kitchen exits to large rear patio with lots of space for grilling, entertaining and plants. 2ND FLOOR: Front large bedroom with incredible light, real closet space and hardwood floors. CALL For More Info:  show contact info","num_images":7.0,"lat":39.986928,"lng":-75.130794,"attrs":"['3BR \/ 2Ba', '1564ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2023-04-01T07:22:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-2br-2ba-apartment-is\/7605609297.html","post_id":7605609297,"title":"This 2BR\/2BA apartment is located on the first floor","description":"Available Dec\/Jan 2022! Credit must be in good standing. FICO score and credit history will be reviewed. Monthly income must exceed 3x the rent. No evictions or serious crimes. We only require the security deposit and first month's rent to move in (no last month's rent upfront!) This 2BR\/2BA apartment is located on the first floor. Features include hardwood floors, central AC, in-unit laundry stainless steel appliances including dishwasher and garbage disposal. There is also access to a small outdoor area. Only steps from Rittenhouse Square Park! Conveniently located within walking distance of SEPTA bus routes, subway lines, rail lines, and trolley lines. Nearby 30th Street Station is served by SEPTA Regional Rail lines. There is easy access to University City and major roadways via the Walnut Street and South Street Bridges. Water is included in the rent. Only security deposit and first month's rent needed to move in! Credit must be in good standing. Cosigners considered.\n1949 Locust St #1R\n","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 2Ba', '4710ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T07:28:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-half-month-free-for\/7605607537.html","post_id":7605607537,"title":"HALF MONTH FREE FOR APPLICATIONS BEFORE 3\/31!!!","description":"HALF MONTH FREE FOR APPLICATIONS BEFORE 3\/31!!! Just 1st month's rent and $500 security deposit to move-in!!! The Society Hill Building is a beautiful mid-rise community located in the Society Hill\/Washington Square neighborhood of Center City. This building features spacious 1 bedroom 1 bath apartments, overlooking scenic Washington Square Park. The Society Hill Building is within walking distance of historic Old City as well as close to all forms of public transportation. 10 foot high ceilings, controlled access keypad entry, hardwood floors in some units, abundant natural light, dishwasher, microwave, high-efficiency individually controlled A\/C and heat. Laundry on each floor and pet-friendly! Brand new windows in all apartments. Pictures are of a similar unit.\n701 Sansom St #602","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 2Ba', '1100ft2', 'available jun 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T07:13:34-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-just-1st-months-rent-and\/7605607541.html","post_id":7605607541,"title":"Just 1st month's rent and $500 security deposit to move-in!!! 1 Bed 1","description":"Just 1st month's rent and $500 security deposit to move-in!!! 1 Bed 1 bath unit in a splendidly renovated warehouse in Franklin Square offers unique apartment homes, abundant natural light, and spectacular views of the city. Hardwood floors in the living area and the bedroom is carpeted. The Warehouse Property is located in a highly walkable area with access to all forms of public transportation. Secured entry, gated property, gym\/fitness center, on-site parking (additional $250 month) with full-size washer\/dryer in each unit, and state-of-the-art fitness center. Pictures are of a model unit.\n9 N 9th St #808","num_images":8.0,"lat":39.9487,"lng":-75.1593,"attrs":"['1BR \/ 1Ba', '635ft2', 'available jun 7', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T07:13:41-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-new-center-city\/7605608681.html","post_id":7605608681,"title":"Beautiful, new center city Philadelphia apartments!","description":"Luxury Apartments In Center City Philadelphia. Beautiful, new center city Philadelphia apartments; our building has innovative, efficiently designed spaces that take advantage of every square inch for your comfort and convenience. The modern approach allows us to make your wish list achievable not as a dream in the future but right now when you need it most. Center City apartments at its best! Offering studios, 1 bedroom, and 2 bedroom apartment homes. Conveniently located just a few blocks from Rittenhouse Square, and is near the University Of The Arts (UARTS), Peirce College, Moore College of Art and Design, and Drexel College of Nursing. Be in the center of everything! Walk outside your front door and be steps away from Dilworth Park, Rittenhouse Square, the Avenue of the Arts, and countless restaurants, cafes, bars, and shops. See why Avenir is your ideal Center City apartment. People who participate in group fitness make it to the gym 45% more often! Experience the community within your community. Take a virtual spin class when it s convenient. Plan a Friday night workout with old friends or welcome a new neighbor to the community. Work out on your schedule, not someone else's! ** Photos are of model units * Prices and availability subject to change on daily basis **\n42 S 15th St #0B1BA","num_images":7.0,"lat":39.9489,"lng":-75.1661,"attrs":"['0BR \/ 1Ba', '321ft2', 'available may 23', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T07:23:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-incredibly-spacious-1bed\/7605608192.html","post_id":7605608192,"title":"Incredibly Spacious 1bed 1bath Unit Features Hardwood Floors Throughou","description":"This incredibly spacious one bedroom, one bath unit features hardwood floors throughout, stainless steel appliances, in-unit laundry and dedicated PARKING. The open concept living\/dining\/kitchen offers ample space for your furniture and living\/dining needs. The bedroom features an exceptionally large en-suite bathroom and walk-in closet. Oh, and there are some stunning Western views of the city! Owner is open to leaving furniture pictured (except the TV stand) for the duration of the lease if Tenant is interested. 2200 Arch Street Condominiums is a full-service, New York-style loft building that offers amazing amenities and has one of the best locations in Center City. Just a short walk from Rittenhouse Square, 30th St Station, Aramark, Morgan Lewis, Comcast the Schuylkill River Trail and the Parkway, everything you need for is within a few blocks. Adding to the convenience are Trader Joe’s and the new Giant Riverwalk, which are directly across the street. This home is within the Greenfield Catchment and includes one (1) parking spot. First, last and security. The building requires a $325 (non-refundable) move-in fee and a $300 (refundable) security deposit. Minimum lease term is 12 months. $50 application fee.\n2200-28 Arch St #816","num_images":9.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '1083ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T07:19:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-live-at-park-towne-place\/7605607509.html","post_id":7605607509,"title":"Live at Park Towne Place Apartment Homes in Center City Philadelphia","description":"Live at Park Towne Place Apartment Homes in Center City Philadelphia, and you'll be blocks from the center of nightlife in Logan Square and Rittenhouse Square. Unit features modern kitchens, quartz countertops, stainless steel appliances, in-unit washers and dryers, breakfast bars, pendant lighting, tile backsplashes, wood plank flooring throughout, walk-in closets. Stunning city and museum views are offered in a variety of floor plans! Mainstreet Market and Caf , featuring gourmet coffee and tea and much more! Fitness center with Technogym equipment, Queenax boxing gym, yoga\/spin studio with indoor\/outdoor workout space. It boasts Philadelphia's largest pools, an art studio, fitness center with boxing gym, yoga\/spin studio, social lounge with demonstration kitchen, gourmet market and cafe, outdoor lounge with fire pit, 24-hour concierge, 24\/7 package acceptance, resident shuttle service to Center City and University City and more. Make Whole Foods as your second kitchen conveniently located just 1 block away. Our apartments are within one mile of several institutions of higher education: Drexel University, Temple University, University of Penn, CHOP, Moore college of Arts, Community College of Philadelphia. You won't find a better building to live with amenities in the Fairmount Area. Park Towne Place includes 948 apartment and penthouse homes within four high-rise towers. The community is nestled between green acres on the Benjamin Franklin Parkway in the heart of Center City Philadelphia's Museum District. Park Town. ** Prices and availability subject to change on a daily basis ** Photos are of model units ** Parking may be available for additional fee **\n2200 Benjamin Franklin Pkwy #0B-S0211","num_images":6.0,"lat":39.9677,"lng":-75.1735,"attrs":"['0BR \/ 1Ba', '484ft2', 'available may 27', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T07:13:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2br-1ba-rental-home-with\/7605609287.html","post_id":7605609287,"title":"2BR\/1BA RENTAL HOME WITH A ROOF DECK AVAILABLE AT 1949 LOCUST ST.","description":"This apartment on the top level is close to Rittenhouse Square Park. Excellent location for taking in the weekly farmers market and square activities. Vibrant Coffee, Bakeshop on Twentieth, Spread, 1900 Ice Cream, La Colombe, Parc, and a plethora of other places are all within walking distance. University City, Drexel, and Penn are easily accessible. The apartment has hardwood floors, a dishwasher and trash disposal made of stainless steel, central air, in-unit laundry, and a PRIVATE ROOF DECK! For an additional monthly fee, we offer the choice to furnish every one of our apartments.\n1949 Locust St #4","num_images":9.0,"lat":39.9513,"lng":-75.1741,"attrs":"['2BR \/ 1Ba', '900ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T07:27:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-pristinevalue-priced-one\/7605606505.html","post_id":7605606505,"title":"Pristine+value PRICED ONE bedroom condo@ 1010 Race St.","description":"Light filled living area, high ceilings, exposed beams, and all hardwood floors throughout. Live in the heart of China Town, and just minutes from Reading Terminal Market, Jefferson and PA hospitals, and some of the best dining in Philadelphia!","num_images":9.0,"lat":39.955436,"lng":-75.156372,"attrs":"['1BR \/ 1Ba', '712ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T07:04:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stunning-bed-on-the\/7605608157.html","post_id":7605608157,"title":"Stunning 1 bed on the treelined block of 18th and Pine!","description":"Stunning 1 bed on the treelined block of 18th and Pine! Stainless steel appliances, fireplace, stunning crown molding, tons of natural light, central AC, combo laundry in unit! Very nice sized living room to sit around the fireplace while enjoying the sun beaming into the apartment. Free laundry in the basement as well. Close to all major highways, U Penn, Drexel, Jefferson, Pennsylvania Hospital, steps from Rittenhouse\/Fitler Squares and all the best shopping\/ restaurants. Tenant pays gas heat and electricity. Landlord pays for hot and cold water. Cat friendly with no pet deposit First, last and security due at lease signing. Come see it before it's gone! Available June 1st.\n1820 Pine St #1F","num_images":6.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '700ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T07:19:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-bed-full-bath-home\/7605608665.html","post_id":7605608665,"title":"Amazing 2 Bed 1 full bath home","description":"336-38 South 6th Street, Unit B is available for rent in Philadelphia, PA 19106. This property was listed on March 20, 2023 by AMC Delancey Group Inc at $2,195. It has been on the market for a total of 10 days and was last rented on July 10, 2020. This listing's school district is Philadelphia City School District. Nearby schools include McCall Gen George A School, Franklin Benjamin High School and Constitution High School. 336-38 South 6th Street, Unit B is a 2-bed, 1-bath, a property built in 1980.\n336-38 S 6th St #B","num_images":6.0,"lat":39.9474,"lng":-75.1473,"attrs":"['2BR \/ 1Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T07:23:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-hurry-you-do-not-want-to\/7605608652.html","post_id":7605608652,"title":"Hurry, You do not want to miss this fantastic 2 bedroom Apt!","description":"1210 Chestnut. A Bit of Old - Mixed with A Lot New – 1210 Chestnut is full of surprises. Walk through its traditional entrance into one of the District’s coolest renovations.\n1210 Chestnut St #310","num_images":8.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '800ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T07:23:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-tucked-away\/7605608177.html","post_id":7605608177,"title":"Beautiful tucked away community located in the heart of Bella Vista","description":"Welcome to Carriage Mews, a beautiful tucked away community located in the heart of Bella Vista and the Meredith School Catchment, offering 1-car garage parking and a quiet shared courtyard. This 3 bedroom, 2.5 bathroom, extra wide townhome has been nicely updated and maintained throughout the years. Enter directly through the garage to the first floor featuring an open kitchen and dining area, a large pantry, a conveniently located half bath and a coat closet. The updated kitchen with newer stainless-steel appliances, quartz countertops, a nicely tiled backsplash, gas cooking, and an island for additional storage and counterspace. The spacious dining room (could also double as additional living space) features a wood burning fireplace and glass siding doors overlooking the beautiful well-manicured courtyard. Up the stairs is an oversized living room with hardwood floors, built-in cabinets, a ceiling fan and a large storage closet. This floor also features two nicely sized bedrooms both with closets and great natural light, a laundry closet, and a full bathroom with a tub. Continue up to the beautiful primary bedroom with south facing sliding glass doors to the Juliette Balcony, a wall of closets and access to your private bathroom with a tub and stall shower. Off the bedroom is a bonus living space and additional closets, great for a home office, playroom or an additional lounging area. Lastly, exit out to the private deck with tree top views, perfect for relaxing with a good book. Many recent updates: new Anderson doors & noise cancelling windows (2019), HVAC (2021), washer & dryer (2017), kitchen appliances (2019), and more! Plenty of storage throughout the home as well as in the garage. Located on a quiet street just off Cianfrani Park. Quick walk to Whole Foods, ACME, the Italian Market and some of the city’s best restaurants. Immediate move-in available.\n705-11 Pemberton St #711","num_images":8.0,"lat":39.9362,"lng":-75.1563,"attrs":"['3BR \/ 2.5Ba', '2250ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T07:19:20-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-queen-village-new\/7605608150.html","post_id":7605608150,"title":"Queen Village NEW construction condo in MEREDITH SCHOOL!","description":"Queen Village NEW construction condo in MEREDITH SCHOOL catchment available immediately! This large, bi-level condo offers 2 bedrooms and 2 FULL baths with an extra room suitable for an office or den, as well as a large, sunny private patio. Enjoy convenient city living in a highly walk able neighborhood with amenities like Headhouse Farmers Market, lots of shopping and restaurant options as well as easy highway and public transit access. Schedule your tour today!\n742 S 2nd St #UNIT A","num_images":6.0,"lat":39.9362,"lng":-75.1563,"attrs":"['2BR \/ 2Ba', '1200ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T07:19:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-available-for-may-1st-move\/7605605635.html","post_id":7605605635,"title":"Available for May 1st move in!!! Newly constructed 5-unit building fea","description":"Available for May 1st move in!!! Newly constructed 5-unit building featuring secure video entry system that works directly from your smartphone. Floor to ceiling windows offering an incredible amount of natural light throughout. Open concept living, hardwood floors, in- unit washer\/dryer, upgraded kitchen including upgraded cabinets, upgraded kitchen countertops, kitchen island waterfall countertop, Stainless Steel Frigidaire appliance package including Fridge\/Freezer, built in microwave, dishwasher, stove\/oven. High ceilings and modern feel throughout. Good vibes continue in your custom tiled contemporary bathroom with plenty of storage and more natural light! This unit also comes with a secured storage area located in the shared basement of the building. Walking distance to some of the neighborhoods hottest restaurants, coffee shops, bars and more. Easy access to 95, 76, 676, Ben Franklin Bridge, Philadelphia International Airport, Septa, Trolley, Center City.\n820 E Thompson St","num_images":6.0,"lat":39.9788,"lng":-75.1262,"attrs":"['1BR \/ 1Ba', '618ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T06:57:06-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-transatlantic-building-is\/7605607553.html","post_id":7605607553,"title":"TransAtlantic Building is located in the heart of hottest neighborhood","description":"TransAtlantic Building (430 Fairmount Avenue) is located in the heart of one of the country's hottest neighborhoods! An iconic revitalization surrounded by the charm of Northern Liberties' tree lined streets and historic homes. Just steps from a wide variety of store fronts, restaurants, and parks- the TransAtlantic is the perfect place to call home! White-washed original brick and beam is complemented with luxurious modern finishes for maximum aesthetic pleasure. A rare building for the neighborhood, featuring amenities such as gym and outdoor space!\n430 Fairmount Ave #204","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '511ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T07:13:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-renovated-condo-in\/7605607526.html","post_id":7605607526,"title":"Bright, renovated condo in Fairmount","description":"Bright, renovated condo in Fairmount close to BSL and shops\/restaurants. In-unit laundry, dishwasher, central air, and kitchen island are just a few of the features that make this unit top-of-the-line! Pets welcome on a case-by-case basis.\n1416 Parrish St #2","num_images":6.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '613ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T07:13:29-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-roommate-wanted-in-borough\/7605607172.html","post_id":7605607172,"title":"Roommate wanted in borough west chester","description":"Available now 750 a month 1 person.","num_images":0.0,"lat":39.9845,"lng":-75.5962,"attrs":"['3BR \/ 2.5Ba', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T07:10:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bright-and-beautiful\/7605605682.html","post_id":7605605682,"title":"Bright and beautiful luxury condominium","description":"Enter from the ground floor into the bright and beautiful luxury condominium. No detail has been left to chance at Hamilton Square from the cocoa hardwood to antique granite counter tops. This is a large one bedroom and one bathroom apartment is equipped with Central A.C.\/Heat, hardwood floors throughout, stone counter tops .Open floor plan that flows perfectly from the living room\/dining room into the kitchen . in-unit washer and dryer. Located directly across from The Rail Park. Easy access to Broad St, Vine St, 76, 95 and Ben Franklin Bridge. Conveniently location, walking distance to Center City, Chinatown, Convention Center, Reading Terminal, Market and Broad Street. Surrounded by all local colleges such as Temple University, Drexel, University of Pennsylvania, Jefferson, and Community College of Philadelphia. Available Jun 1st 2023.\n1221 Noble St #1","num_images":6.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '873ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T06:57:30-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-home-with-garage\/7605605666.html","post_id":7605605666,"title":"Beautiful home with GARAGE parking in the Spring Arts area","description":"Beautiful home with GARAGE parking in the Spring Arts area, loaded with all the amenities on any renters shopping list! 1-car garage parking, extra-large rear yard, 20ft wide by almost 50ft deep floor plan with huge rooms, lots of space and tremendous natural light. This home has a beautiful brick façade, 4 bedrooms, 2.5 baths, extra living space on 2nd floor and finished basement! Washer and dryer on the second floor, large kitchen with granite countertops, stainless steel appliance package and granite island for dining and entertaining. The master suite has a designer free standing soaking tub, huge European shower with glass wall and open entrance, floating vanity, beautiful tile work and high end fixtures. As we stated, this home has it all, you will not be disappointed. Walkable to everything! photos are from previous listing.\n1118 Wallace St","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['4BR \/ 2.5Ba', '2400ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T06:57:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-this-luxury-condo-in-the\/7605605654.html","post_id":7605605654,"title":"This luxury condo in the heart of Fairmount is now available!","description":"This luxury condo in the heart of Fairmount is now available! With 3 bedrooms, 3 full bathrooms, in unit washer\/dryer and a PRIVATE ROOFTOP with unobstructed views of the city skyline, this unit has it all! The massive, upgraded kitchen on the first floor is open to the living and dining areas. It contains quartz countertops, a large island Kohler Purist black fixtures, and VIKING stainless steel appliances. The first floor features one of the three large bedrooms and full bathroom down the hall. Make your way upstairs to find two additional oversized bedrooms each with large closets and en-suite full bathrooms. There is a wet bar with beverage center located at the staircase heading up to the rooftop. Conventionally located to shops and restaurants along Fairmount Avenue such as Urban Saloon, Fare, Tela's Market and Fairmount attractions such as the Philadelphia Art Museum and The Eastern State Penitentiary. This unit won't last long, make your appointment today!\n750 N 19th St #D","num_images":7.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 3Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T06:57:18-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-looking-for-spacious\/7605605646.html","post_id":7605605646,"title":"Looking for a spacious modern home centrally located to center city","description":"Looking for a spacious modern home centrally located to center city and surrounding areas. Blocks away from award winning restaurants and theatres. This stunning 4 floor townhome with over 3,000 square feet of livable space offers an open concept great outdoor space with a patio off the kitchen and a deck off the hallway on 3rd floor, which gives an amazing view of the center city skyline. The interior of the home has 5 bedrooms , 4.5 bathrooms and finished basemen and 2 car garage with additional storage. The entrance to the home is accessed from a private walk -way off of 15th St. or from the garage . Step inside and you are greeted by luxurious amenities and stylish finishes . The foyer is nicely tiled with to the left is a full bedroom and bath , closet , entrance to basement and access to the garage. Walk up the stairs to the 2nd floor where you are greeted with an open floor plan of your main living space which consist of your living room, gourmet kitchen with beautiful black quartz counter tops and backsplash, stainless steel appliances, dishwasher , refrigerator ,walk-in pantry, formal dining room, powder room and patio. Head upstairs to the 3rd floor where you will find the master suite with an amazing walk- in closet 4 piece bathroom, soaking tub, stall shower, double vanity, dual flush toilet and two windows to take in the bright natural light of the sun. At the rear of the hallway sits bedroom #3. Head up to the 4th floor and you will find two more bedrooms and a hall bath, laundry room , storage space and deck that over looks the center city skyline. The basement is fully finished with full bathroom , very high ceilings, great for entertaining, gym or private living quarters. The two car garage has two entrances one leading directly into foyer and one that leads to basement. Truly a must see!\n1426 Kenilworth St","num_images":8.0,"lat":39.9379,"lng":-75.1794,"attrs":"['5BR \/ 4.5Ba', '2974ft2', 'available may 15', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T06:57:12-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bedroom-apartment-move-in\/7605600960.html","post_id":7605600960,"title":"1-bedroom apartment MOVE-IN-READY","description":"Corner property on a street of row houses.\nBeautiful and spacious 1-bedroom apartment on the 2nd floor of an owner-occupied duplex.\nBedroom has a large closet space and gets direct sunlight.\nHardwood floors, tiled kitchen, tiled bathroom.\nIncludes a designated uncovered parking spot behind the house.\nRecent updates:\nstainless steel refrigerator, new windows, new bathtub faucet\nTenant Requirements:\nMinimum 650 credit score\nMinimum $3500 monthly income\nFirst and last month's rent due at lease signing ($2400)\nUtilities are separate.\nNo security deposit, no application fee.\nNo pets.\n","num_images":10.0,"lat":40.030028,"lng":-75.083129,"attrs":"['1BR \/ 1Ba', '1500ft2', 'available now', 'apartment', 'no laundry on site', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T05:58:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1739-annin-st-philadelphia\/7605598702.html","post_id":7605598702,"title":"1739 Annin St, Philadelphia, PA 19146","description":"This lovingly renovated Point Breeze home includes hardwood floors throughout, a finished basement, central air and heat, alarm system, and back patio. The large, bright living area includes hardwood flooring and a nook perfect for shelving or an entertainment center. Walk back into the large kitchen with granite countertops and breakfast bar, travertine tile floors, garbage disposal and stainless steel dishwasher, microwave, refrigerator and gas stove\/oven. The second floor Master Suite has tons of storage with walk-in closet, walk out rear deck and ceiling fan. Relax in the en-suite bath in the full tub or separate stand up shower, with vessel sink. The front spacious bedroom includes a large closet, full bathroom, and Juliette balcony. The finished basement includes separate laundry room with full size washer and dryer.","num_images":9.0,"lat":39.937025,"lng":-75.172527,"attrs":"['2BR \/ 2.5Ba', '1326ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-01T05:18:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-single-family-in-quincy\/7605595746.html","post_id":7605595746,"title":"Single family In Quincy )_Plenty of parking SPACE_( First floor Apt!","description":"First floor features enclosed deck, living room, dining room, spacious kitchen, and half bathroom. Fest floor features two bedrooms and one full bathroom. Washer and dryer and storage in basement. First month, last month, and security deposit required. One month brokers fee due upon lease signing. Gas heating. Plenty of parking space.","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 1Ba', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T04:15:01-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-bedroom\/7605595728.html","post_id":7605595728,"title":"- NEWLY RENOVATED 2 BEDROOM 2 BATHROOM","description":"START THE SUMMER OFF MOVING INTO A NEWLY RENOVED 2 BEDROOM 2 BATHROOM APARTMENT.\nBRAND NEW FLOORS, STAINSLESS APPLICANCES, GRANTED COUNTER TOPS AND NEW BATHROOMS.\nPRIVATE ENTERACE THAT SITS ON 55 ACRES WITH MATURE TREES, TOT LOT, SWIMMING POOL, DOG PARK.","num_images":4.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '984ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T04:14:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-remodeled-bedroom-15\/7605586974.html","post_id":7605586974,"title":"@@##FULLY REMODELED 2 BEDROOM, 1.5 BATHROOM HOME@@","description":"YOU DON'T WANT TO MISS this fully remodeled 2 bedroom, 1.5 bathroom home in Point Breeze that includes a FINISHED BASEMENT, central air\/heat, WASHER\/DRYER IN UNIT, hardwood floors and more! Enter the open concept first floor living room and kitchen that includes granite counter tops, a garbage disposal, stainless steel appliances, including refrigerator, gas range, microwave, and dishwasher. From there, you can walk straight out to your private patio to grill or enjoy a glass of wine! The finished basement features tile flooring, powder room and added storage. THE HARDWOOD FLOORS CONTINUE UPSTAIRS, where you will find the two bedrooms, both with spacious closets and ceiling fans. The contemporary full bathroom features modern tile in the shower and an updated vanity. SMALL PETS PERMITTED WITH OWNER APPROVAL AND $200 PET FEE.CALL house owner for more information: show contact info\n.***7am-6pm**\n$975 monthly rent + 1.5% Gilbert rental tax .\n12+ month lease; 680+ credit score, background, credit and employment checks. Security deposit, cleaning fee, application fee (goes to pay for comprehensive background and credit checks) - standard items we can review.\n","num_images":5.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1.5Ba', '892ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T01:51:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-fully-remodeled-bedroom-15\/7605586979.html","post_id":7605586979,"title":"@@##FULLY REMODELED 2 BEDROOM, 1.5 BATHROOM HOME@@","description":"YOU DON'T WANT TO MISS this fully remodeled 2 bedroom, 1.5 bathroom home in Point Breeze that includes a FINISHED BASEMENT, central air\/heat, WASHER\/DRYER IN UNIT, hardwood floors and more! Enter the open concept first floor living room and kitchen that includes granite counter tops, a garbage disposal, stainless steel appliances, including refrigerator, gas range, microwave, and dishwasher. From there, you can walk straight out to your private patio to grill or enjoy a glass of wine! The finished basement features tile flooring, powder room and added storage. THE HARDWOOD FLOORS CONTINUE UPSTAIRS, where you will find the two bedrooms, both with spacious closets and ceiling fans. The contemporary full bathroom features modern tile in the shower and an updated vanity. SMALL PETS PERMITTED WITH OWNER APPROVAL AND $200 PET FEE.CALL house owner for more information: show contact info\n.***7am-6pm**\n$975 monthly rent + 1.5% Gilbert rental tax .\n12+ month lease; 680+ credit score, background, credit and employment checks. Security deposit, cleaning fee, application fee (goes to pay for comprehensive background and credit checks) - standard items we can review.\n","num_images":5.0,"lat":39.9379,"lng":-75.1794,"attrs":"['2BR \/ 1.5Ba', '892ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'townhouse', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T01:51:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-newly-renovated-loft-style\/7605591967.html","post_id":7605591967,"title":"NEWLY RENOVATED, Loft Style Condo!!","description":"NEWLY RENOVATED, Loft Style Condo!! Highlights of unit include: LED Lighting, Hardwood Flooring, top of the Line Stainless Steel Appliances, 65' Flat Screen TV, Custom Fireplace.... also Includes 1 parking space in our gated lot, access to an 8000 sq ft fitness center, 24\/7 front desk personnel & on-site maintenance. 444 Lofts is a true warehouse conversion featuring concrete beamed ceilings and exposed brick and an awesome Western Sunset View of our City. The Custom Kitchen features sleek granite counters... 7 Foot Kitchen Island & Top of the Line stainless steel appliances. Stacked washer\/dryer. Generous closet space. HVAC, high speed net\/cable access. This unit features Large Windows, City View, Large Master Bedroom with full Custom Gorgeous Bath and Tiled Shower w\/ Frameless Glass Shower Doors...Stainless Steel 32 Bottle Wine Chiller complete this extra fabulous and contemporary condo! Hurry, you do not want to miss this fantastic one bedroom condo in one of the best locations in the City!\n444 N 4th St #404","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['1BR \/ 1Ba', '870ft2', 'available may 1', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T03:06:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom\/7605564787.html","post_id":7605564787,"title":"Beautiful 1 bedroom available in June at 4900 Pine street!","description":"Great Location. Renovated One bedroom.\nRenovated one bedroom at Cedar Park.\nRosewood hardwood floors, SS appliances, ceiling fan. Shared laundry in the building.\nPets are conditional with a $250 per pet.\nResidents are responsible for gas and electric.\nRental Terms\nRent: $1,195\nApplication Fee: $55\nSecurity Deposit: $1,195\nAvailable now.\nPet Policy\nCats allowed\nSmall dogs allowed\nCall Alena for showing at  show contact info\nCity Wide Realty\n","num_images":14.0,"lat":39.952792,"lng":-75.220295,"attrs":"['1BR \/ 1Ba', 'application fee details: 60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-03-31T22:53:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bi-level-bd-35-ba-apt-ac-d\/7605562393.html","post_id":7605562393,"title":"Bi-Level 3 Bd 3.5 Ba Apt, AC, W\/D, walk to subway sta, Reading Market","description":"Bi-level apt at 3rd and 4th floor, with 3 bedrooms and 3 full bathrooms; 1 additional powder room at 3nd floor for guest use. Idea for sharing by a group of 3 friends, or family use.\nHigh ceiling, good natural lighting\n• Kitchen and Living area at 3rd fl.\n• A very spacious bedroom with good natural lighting at 3nd floor. Closet in each bedroom.\n• 2 bedrooms with separate bathrooms at 4th floor. Each room with access to a balcony\n• Center AC and heating, hardwood floor, laundry in the unit\n• Conveniently situated within short walking distances to subway station, Reading Market, Chinatown, and center city\n• Located on a relatively tranquil street. Street parking\n• Rental includes trash. Other utilities are not included\n• Move in cost is 3 mo rents, including 1 mMonth rental as deposit, plus first month and last month rents.\n","num_images":18.0,"lat":39.960988,"lng":-75.157904,"attrs":"['3BR \/ 3.5Ba', '1880ft2', 'available now', 'air conditioning', 'application fee details: 50$ Application fee', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-03-31T22:39:37-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-modern-spacious-bedroom\/7605757684.html","post_id":7605757684,"title":"Modern & Spacious 3-Bedroom Home in Vibrant Brewerytown","description":"3 generously-sized bedrooms with ample closet space\n2 full bathroom and 1 half bathroom\nBright and airy living space with beautiful hardwood flooring\nModern kitchen equipped with stainless steel appliances and ample storage\nCentral heating and air conditioning for year-round comfort\nIn-unit washer and dryer for your convenience\nPrivate backyard oasis, perfect for relaxation and entertaining\nPrivate roof deck with downtown views\nRent: $2,725 per month\nSecurity deposit: $2,725\nLease term: 12 months\nTenant responsible for utilities (gas, electricity, and water)\nPets considered on a case-by-case basis with an additional pet deposit\nAvailable May 1, 2023\nPlease contact agent for rental applications and more info.","num_images":1.0,"lat":39.975175,"lng":-75.18071,"attrs":"['3BR \/ 2.5Ba', '2005ft2', 'available may 1', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T14:21:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-very-good-condition-large\/7605797176.html","post_id":7605797176,"title":"Very Good Condition Large, two bedroom on first floor","description":"Very Good Condition Large, two bedroom on first floor with heat & hot water included. Bamboo hardwood floors throughout. Spacious living room with two closets for extra storage. Eat-in kitchen with plenty of cabinet space, stainless appliances and dishwasher. Nice bathroom with full bath and vinyl tile floor. Large bedrooms with moderately sized closets. Off St parking, and coin operated laundry on site. Easy access to downtown Philadelphia. Very Good Condition. Application fee $1 details, If you interested please contact:- sarah65895𝐆𝐦𝐚𝐢𝐥com","num_images":4.0,"lat":40.0568,"lng":-75.1379,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry on site', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T16:09:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-grab-soon-1bd-1bth\/7605763432.html","post_id":7605763432,"title":"Grab Soon..!!! 1bd\/1bth completely renovated unit Available-Now!!!!","description":"##_Grab Soon... 1bd\/1bth completely renovated unit, located in the heart of Philadelphia-PA. Located only 15 minutes away from amazing shopping and dining. Water included (power is not). There are no washer\/dryer hookups or facilities on site. NO smoking . Off street parking. No smoking. Pets Ok. For more information please text Samantha Smith: show contact info\n##_Grab Soon... 1bd\/1bth apartamento completamente renovado, ubicado en el corazón de Philadelphia-PA. Ubicado a solo 15 minutos de increíbles tiendas y restaurantes. Agua incluida (luz no). No hay conexiones para lavadora\/ secadora ni instalaciones en el lugar. No Fumar . Aparcamiento en la calle. No Fumar. Mascotas bien. Para obtener más información, envíe un mensaje de texto a Samantha Smith:  show contact info","num_images":5.0,"lat":40.0018,"lng":-75.1179,"attrs":"['1BR \/ 1Ba', '688ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T14:34:09-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/doylestown-stunning-bedroom-bath\/7605796427.html","post_id":7605796427,"title":"Stunning 4 Bedroom 4 Bath  Doylestown Home For Rent!","description":"This elegant brick colonial is located in the highly acclaimed Central Bucks School District and sits on a spacious 3\/4 acre lot. The interior boasts warm neutral colors, hardwood flooing and vaulted ceilings throughout. The beautiful eat-in kitchen is the heart of the home. It features an eat in area with a vaulted ceiling, fireplace, a large granite island, and lots of cabinetry for storing chef tools. The stainless steel apliances have all been replaced within the past few years and are a joy to cook on. The laundry room is adjacent to the kitchen and consists of a front loading washer and dryer and extra cabinet space. The family room is spacious and bright and has another fireplace for warmth and charm. Upstairs are 4 bedrooms and two full baths. The main bedroom is spacious and has a dramatic bath with a vaulted ceiling and double vanities. The additional bedrooms are all neatrally painted and offer versatility of use. The recently finished basement features vinyl plank flooring with a separate room and full bath and adds to the spacious and comfortable feel of the home. The home's roof and systems are all up-to-date, ensuring worry-free living. Conveniently located just minutes from shopping and dining in downtown Doylestown and Peace Valley Park, this home is the perfect combination of suburban living and city convenience. You will fall in love with this home, neighborhood and community as these owners have.","num_images":13.0,"lat":40.3054,"lng":-75.1489,"attrs":"['4BR \/ 4Ba', '3218ft2', 'available may 1', 'air conditioning', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T16:07:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-college-manor-unit-25\/7605789856.html","post_id":7605789856,"title":"College Manor Unit-2.5","description":"830 Pine Street – Unit 2.5 is a 250 square foot studio apartment available 5\/1\/23 for $990.00. The heat is included. The washer dryers are in the basement.  There is a shared rooftop deck  In walking distance to South Street, Old City, Penn's Landing, Center City, public transportation, large markets, restaurants, both Jefferson and Pennsylvania Hospitals.","num_images":8.0,"lat":39.944731,"lng":-75.155939,"attrs":"['0BR \/ 1Ba', '250ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T15:51:40-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-schedule-tour-granite\/7605791652.html","post_id":7605791652,"title":"Schedule a Tour, Granite Countertops, Playground","description":"A pet-friendly community, The Point at West Chester offers amazing convenience and well-appointed luxury with a full lineup of top-quality amenities designed to perfectly fit your life. Call for details!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, coat closet, washer\/dryer, ensuite bathrooms, walk-in closets, and a patio\/balcony!\nThe Point at West Chester, managed by Panco Management\n890 S. Matlack St.\nWest Chester, PA 19382\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/www.thepointatwestchester.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm\nCommunity Features\n* After-Hours Emergency Maintenance\n* Sun Deck\n* TV Lounge\n* EV Charging\n* Elevator\n* Community Kitchen\n* Package Acceptance\n* Movie Theatre\n* Renters Insurance is Required\n* Outdoor Grill Area\n* Bike Racks\n* Landscaped Courtyards\n* WiFi Access\n* Credit Cards Accepted\n* Professionally Managed\n* Dry Cleaning and Laundry Service\n* Gaming Area\n* Minutes from Restaurants, Shopping, and Much More\n* Our prices can change daily, price listed is based on today's availability. Call for details.\n* Swimming Pool\n* Playground\n* Controlled Access\n* Garage Parking\n* Pet Salon\n* Fitness Studio\n* We are a social community! Find our Yelp, Facebook or Twitter page online.\n* Easy Freeway Access\n* Extra Storage\n* Non Smoking Community\n* Long Term Lease Available\n* Short or Long Term Lease Available\n* Billiards\n* Community Lounge\n* Bark Park","num_images":23.0,"lat":39.945759,"lng":-75.587597,"attrs":"['2BR \/ 2Ba', '1217ft2', 'available apr 8', 'EV charging', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T15:56:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/wynnewood-garage-parking-quartz-kitchen\/7605785174.html","post_id":7605785174,"title":"Garage Parking, Quartz Kitchen Upgrade, New Appliances, PETS, 24\/7 Gym","description":"🏠LOVE Your New HOME- Apply Now- Reduced Rent Special🏠\nApt #D-07 First floor apartment with beautiful new kitchen upgrade and great location to parking. Near to shopping and close to the train!\nVisit your new apartment home by taking a tour with Jenna today! Please call us at  show contact info\nor email today to set up your personalized tour through our outstanding community. The Leasing Office is open Tuesday-Friday: 9 am-6 pm and Saturday 10-4 pm. We look forward to arranging your visit to view your new apartment home!\nFor more information or to start your application visit, yourMetropolitan.com\nAPARTMENT HOME FEATURES\n*Washer\/Dryer\n*Renovated Stainless Steel Kitchen\n*Hardwood Flooring\n*Dishwasher\/Microwave\n*Refrigerator w\/ Ice Maker\n*Breakfast Bar\n*Air Conditioning\n*Upgraded Bathroom\n*Spacious Closets\nCOMMUNITY AMENITIES\n*🐶PET FRIENDLY🐱\n*24 Hour Fitness Center\n*Off-Street Parking\n*Garage Parking Available\n*Lower Merion School District\n*Professional On-Site Management\n*Professional On-Site Maintenance\n*24 Hour Emergency Service\n*Free Individual Storage Units\n*Furnished Apartments Available\nWelcome to your next apartment at the Metropolitan Wynnewood! Enjoy one of the best locations on the Main Line in Lower Merion Township. Our community features spacious, pet-friendly one and two-bedroom floor plans. Our location offers easy access to the Wynnewood and Narberth SEPTA Regional Rail and is only minutes away from Center City. We are conveniently located near the best shopping and restaurants on Philadelphia’s Main Line.\nThe Metropolitan Wynnewood provides a balance of city life convenience and suburban charm. Check out our many appealing apartments and community amenities, including hardwood floors, renovated kitchens, air conditioning and garage parking. A good life begins with a great place to live! Ask our team for more details, contact our leasing office today to schedule your apartment tour!\nEQUAL HOUSING OPPORTUNITY\n*Limited time special. Restrictions apply. Special valid for new residents only and can be withdrawn at any time without prior written notice. Qualified applicants only. Call the leasing office for more details.*\n","num_images":24.0,"lat":40.0,"lng":-75.276,"attrs":"['1BR \/ 1Ba', '663ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T15:36:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stellar-amenities-at-your\/7605787033.html","post_id":7605787033,"title":"Stellar amenities at your fingertips.","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 to 481 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nLeasing Specials\nReduced Security Deposit when you move-in by 4\/2\/2023 and apply within 48 hours of your tour! *Security Deposit reduced from 1 Month's Rent to $750.00!\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our brand new apartment community offers you spacious Studio apartments in the sought after Fishtown\/Northern Liberties area.\nDwell 2nd Street is convenient to I-95, 676 and Girard Avenue, so getting around the city is a breeze whether you're driving, biking, walking or taking public transportation!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Full-size stackable Washer and Dryer in Unit\n» Expansive closets with dust free organizers\n» Wood style plank flooring in Living space\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» Controlled building access\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball\n» Game Room with Pool Table, Foosball and shuffleboard\n» Business Center and conference room\n» Bike storage and repair space\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced dog park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.  Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":19.0,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '460ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T15:42:36-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/levittown-bedroom-bath-home-for-rent\/7605786164.html","post_id":7605786164,"title":"4 Bedroom 2 Bath Home for Rent!  Nice Yard!","description":"Welcome to this 4 bedroom 2 bath home in the Crabtree section of Levittown. Available for move in May 1. Freshly painted and trimmed throughout. 1st floor has recently been renovated with new laminate. Upstairs is new neutral carpet. Living room windows have been upgraded and bring in plenty of natural light. Kitchen has been tastefully updated. Relaxing screened in porch area. Attractive mature landscaping surrounds this property all recently mulched. Many storage options. Great front, rear and side yards. This gorgeous home is situated in a friendly community. This home is just waiting for you to move in. Available for move in now. The backyard with lots of play space for the kids or pets. An application for Lease will require a $38.00 non-refundable credit and background check. Owner will require a credit score of at least 620. 1st month, plus a two-month security deposit will be required upon move-in. Pets are allowed upon approval for additional fee. Convenient to major highways, shopping and local entertainment.","num_images":8.0,"lat":40.1483,"lng":-74.8371,"attrs":"['4BR \/ 2Ba', '1200ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T15:39:45-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-1b-luxury-ss-appls-quartz\/7605778423.html","post_id":7605778423,"title":"1B Luxury w\/ SS Appls, Quartz Counters, W\/D, & Patio!","description":"Apartment 729 is a BRAND NEW Luxury Premier 1 Bedroom with a stainless steel kitchen package, breakfast bar, real quartz counter tops, and washer\/dryer in unit. Plush carpeting throughout and it's very own WALK-OUT PATIO! Pretty neat! Make this your new apartment home today!\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes! Or ask your Leasing Agent about a personalized virtual tour instead to view all the great things we have to offer from the comfort of your own home!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Gian, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-6pm | Sat, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!\nAn Equal Housing Opportunity\n","num_images":14.0,"lat":39.96681,"lng":-75.60246,"attrs":"['1BR \/ 1Ba', '780ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-01T15:14:02-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-two-bedrooms-in-northern\/7605776729.html","post_id":7605776729,"title":"Two Bedrooms in Northern Liberties! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N American St Suite 101\nPhiladelphia Pa 19122\nBedrooms:2\nBathrooms:2\nSquare Footage:1088-1261 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 2BR floor-plans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.971179,"lng":-75.140092,"attrs":"['2BR \/ 2Ba', '1128ft2', 'available now', '\\nsaturday 2023-04-01\\n', '\\nsunday 2023-04-02\\n', '\\nmonday 2023-04-03\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T15:08:39-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-playground-gas-fireplaces\/7605776282.html","post_id":7605776282,"title":"Playground, Gas Fireplaces, Garages","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:High Speed Internet AccessOversized Closets9' Ceilings w\/ Crown MoldingCar Wash AreaGas FireplacesBuilt-in Microwave OvensPrivate Patio or BalconyPlaygroundWireless & High Speed Internet AccessDisability AccessSpeakeasy Wine RoomGaragesCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/iwkghll6\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['3BR \/ 2Ba', '1394ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T15:07:21-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-story-bed-bath\/7605749003.html","post_id":7605749003,"title":"Lovely 3 Story 3 Bed 2 Bath Redbrick Rowhouse!!","description":"A lovely 3 Story 3 Bed 2 Full Bath redbrick rowhouse for rent with wood floors, great kitchen, stellar natural light and a backyard - close to Frankford Ave and Phila Brewing. 1ST FLOOR: Enter into large open living and dining space with plenty of room for furnishings and entertaining. Kitchen in rear is large with ample storage, all black and stainless appliances, brand new dishwasher and disposal. Kitchen exits to large rear patio with lots of space for grilling, entertaining and plants. 2ND FLOOR: Front large bedroom with incredible light, real closet space and hardwood floors. CALL For More Info: 888 299 89 61","num_images":1.0,"lat":39.9523,"lng":-75.1638,"attrs":"['3BR \/ 2Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T14:02:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-lovely-bedroom-bathroom\/7605768011.html","post_id":7605768011,"title":"Lovely 2 Bedroom 1 Bathroom Apartment for rent","description":"Luxury Living Lovely Rooms\nProperty Address\nProperty Contact   show contact info\nMy name is Andrew,      ,\nPhiladelphia, PA, 19102\nApplication fee $24.95\/\nThe search is over! We’ve got a charming. Ft. apartment with your name on it. Come check out our great community and tour your new home. Rents for 2 bed, 1 bath $725.00 per month. The fantastic floor plan boasts 2 bedrooms and 1 baths. Inspire your inner chef with Luxury kitchen that featuring stainless steel appliances and a high capacity vent hood. update kitchen opens up to living room with a mesmerizing fireplace, creating a warm and inviting atmosphere for all to enjoy. With rich renovations carefully underseen by new staff management, the apartments and townhomes for rent are more attractive and livable than ever before. We rent 6-bedroom apartments in a convenient location minutes from the university. So, if you are searching for the best apartments and townhomes for rent in terms of style and location, take a look. You won't turn around!Property Contact   show contact info\nFloor Plan Details\nName: Private room shared bathroom\n2 Bedrooms \/ 2 Bathrooms\nSq. Ft.\n$725.00 - $725.00\nCommunity Amenities  Resort-style swimming pool with sundeck Be the grill master on the outdoor grills Dine al fresco by the pool Fully equipped and accessible Fitness Center Take a spin on the spin bikes Stretch and meditate in the yoga studio Resident lounge with entertainment choices Work or play at the Business Center Furry friends enjoy the pup park Friendly apartment community throughout Walk, don’t drive, to our local bars downstairs Take of advantage of our parking garage Sweeping Uptown Charlotte views available Emergency Maintenance Service Convenient controlled-access building entry Walk Score of 85 for a very walkable community Walk to a Panthers or Hornets game with ease Located on the corner of 7th and McDowell, just three blocks from the Spectrum Center Additional deposit alternatives available on approved credit, powered by homeroom\nFeatures\nCable\nMicrowave\nHardwood floors\nAir conditioner\nRefrigerator\nDishwasher\nBalcony, deck, patio\nStove and oven\nHeat - gas\nPet free\nPrivate balcony\nDryer\nWasher\nStorage space\nDisposal\nMirrors\nWindow coverings\nLaundry room\nParking\nStorage space\nPool\nClub house\nPet Policy\nWe are allowed pets in our community! There is a $100 deposit nonrefundable due for each person. Please contact the office for more restrictions.\nOffice Hours\n9:00 AM to 9:00 PM\n\nProperty Contact   show contact info\n","num_images":5.0,"lat":39.9489,"lng":-75.1661,"attrs":"['2BR \/ 1Ba', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T14:44:35-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-bedrooms-in-northern\/7605765346.html","post_id":7605765346,"title":"One Bedrooms in  Northern Liberties! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:760-800 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '767ft2', 'available now', '\\nsaturday 2023-04-01\\n', '\\nsunday 2023-04-02\\n', '\\nmonday 2023-04-03\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T14:38:24-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-on-site-maintenance-rooftop\/7605764160.html","post_id":7605764160,"title":"On-Site Maintenance, Rooftop Dog Park, Custom Subway Tile Backsplashes","description":"The Kelly  10 Union Ave, Bala Cynwyd, PA, 19004Call Now -  show contact info\nx 85OR Text 85 to  show contact info\nto text our leasing team.Want more info? See the link below:https:\/\/mack.touraptnow.com\/z9295h Exuding sophistication and a high-end lifestyle, The Kelly is adorned with all the amenities and features that make life easy and carefree.This is a 3 Bedroom, 2 Bath, Approximately 1268 Sq. Ft. The Kelly offers 109 apartments in Bala Cynwyd, in a community that blends grace and glamour to perfection. Our one, two, and three-bedroom NoBA apartments are ready to satisfy a variety of needs and tastes while our coveted address puts you only a short 15-minute ride from Center City, Philadelphia. Pet Policy Cats - Max 2 allowedDogs - Max 2 allowedMaximum of Two Pet Per ApartmentPlease contact onsite team for restricted breeds. Office Hours:Monday-Friday: 9:00AM-5:00PMSaturday: 10:00AM-5:00PMEqual Housing Opportunity S0tCRoXUY\n","num_images":12.0,"lat":40.0118,"lng":-75.2342,"attrs":"['3BR \/ 2Ba', '1268ft2', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T14:35:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pet-grooming-facility\/7605762581.html","post_id":7605762581,"title":"Pet Grooming Facility, Professionally Managed, Lease Today","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nWhen you call The Point at Downingtown home you can relax in our resort-style courtyards, find inspiration in our co-working spaces, or spend quality time by our fireside lounge. Visit our location today!\nThis three bedroom two bathroom apartment features a fully equipped kitchen, utility room with a washer\/dryer, master suite, spacious closets, and a balcony!\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 9:00am - 5:00pm\nSunday 12:00pm - 5:00pm","num_images":24.0,"lat":40.013891,"lng":-75.685564,"attrs":"['3BR \/ 2Ba', '1428ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-01T14:32:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-studios-in-northern\/7605754938.html","post_id":7605754938,"title":"Studios in Northern Liberties! - DWELL 2ND STREET","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:0\nBathrooms:1\nSquare Footage:460 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious Studio floorplans in the sought after Fishtown\/Northern Liberties 19122 zip-code. Convenient to I-95, 676 and Girard Avenue,\ngetting around the city is a breeze whether you're driving, taking public transpotation or Uber\/Lyft!  DWELL 2nd is owned and managed by The Klein Company, a Philadelphia-based property management recognized for Overall Community Excellence by The Apartment Association of Greater Philadelphia.\nCall today to secure your new home!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Outdoor Foosball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home.(weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":1.0,"lat":39.971179,"lng":-75.140092,"attrs":"['0BR \/ 1Ba', '465ft2', 'available now', '\\nsaturday 2023-04-01\\n', '\\nsunday 2023-04-02\\n', '\\nmonday 2023-04-03\\n', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T14:15:43-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-fitness-center-professionally\/7605754638.html","post_id":7605754638,"title":"Fitness Center, Professionally Managed, Lease Today","description":"VIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nWhen you call The Point at Exton home you will enjoy an amazing line up of amenities including a resort style pool, fashionable outdoor space, and a controlled access parking garage. Call now for a tour!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, entry closet, walk-in closet, and a washer\/dryer!\nThe Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nApartment Features\n* Wood-Like Floors\n* Washer and Dryer in unit\n* Stainless Steel Appliances\n* Garden Tub\n* Granite Countertops\n* Kitchen Island\n* Quartz Countertops","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['1BR \/ 1Ba', '668ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T14:15:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/cherry-hill-unparalleled-views\/7605748623.html","post_id":7605748623,"title":"Unparalleled Views. Exceptional Style. Nonstop Luxury","description":"Apt. 2410 — Oxford floor plan — 1,203 sq. ft. — $3,460\nThis 4th floor 2-bedroom\/2-bathroom apartment home has much to offer! It comes upgraded with hardwood LVT flooring, central heat and air, upgraded stainless steel appliances, and a lovely tile backsplash! The master bedroom is equipped with a large closet and a generously-sized bathroom with double vanity sinks and a walk-in shower with white subway tile. The second bedroom and bathroom are equally as roomy! The expansive living area is perfect for hosting! This gorgeous apartment has a beautiful view of the Philadelphia skyline. It is also within close proximity to our Clubhouse — featuring unrivaled amenities, which included the 24-hour fitness center, theatre room, resort-style swimming pool, and so much more!\nContact our leasing office to schedule a tour!  show contact info","num_images":17.0,"lat":39.9308,"lng":-75.0175,"attrs":"['2BR \/ 2Ba', '1203ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'furnished', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-01T14:02:11-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-pets-welcome-lease-today\/7605746764.html","post_id":7605746764,"title":"Pets Welcome, Lease Today, Quiet Community","description":"VIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nThe Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nThe Point at Downingtown offers all of the modern features you are looking for in a home. Call now for details!\nThis one bedroom one bathroom apartment features a fully equipped kitchen, mudroom with a washer\/dryer, linen closet, walk-in bedroom closet, and a balcony!","num_images":23.0,"lat":40.013891,"lng":-75.685564,"attrs":"['0BR \/ 1Ba', '581ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-01T13:58:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-the-lifestyle-you-deserve\/7605746319.html","post_id":7605746319,"title":"The Lifestyle You Deserve.","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:1\nBathrooms:1\nSquare Footage:767-780 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 1BR floor-plans in the sought after Fishtown\/Northern Liberties area.\nConvenient to I-95, 676 and Girard Avenue, getting around the city is a breeze whether you're driving, taking public transportation or Uber\/Lyft!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home. Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":23.0,"lat":39.971179,"lng":-75.140092,"attrs":"['1BR \/ 1Ba', '767ft2', 'available may 10', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T13:57:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-free-parking-close-to\/7605741424.html","post_id":7605741424,"title":"Free Parking, Close To Large Parking Lot, Large Windows, Pet Friendly","description":"RENT PERIOD: YEARLY\nAsk about apartment home 165 on the first floor, available now!! This unit has a reduced special!! The market rent is $1,420 but has been reduced to $1,320 for a year.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday 9:00 am-6:00 pm and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":8.0,"lat":40.053166,"lng":-75.236179,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T13:46:38-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-location-location-great\/7605711013.html","post_id":7605711013,"title":"LOCATION, LOCATION-GREAT LOCATION Electricity is included","description":"LOCATION, LOCATION, LOCATION Electricity is included with this beautiful 2 bedroom, 2nd floor apartment located in the 224 E Washington St, West Chester, PA and only 4 miles from downtown West Chester. Don't miss this updated, affordable home that will surpass your expectations for many years! To schedule a walk-through, For quick Response Text your phone number.\nThis two bedroom second-floor unit has over 1100 sq. ft. of living with double living\/ dining and gleaming hardwoods- this apartment has been freshly painted and is immaculate. The bathroom has a new vanity and a Jacuzzi bathtub. Many oversized new windows, allowing for plenty of light, there is off street parking and your own washer, dryer in basement with plenty of storage.\nThis apartment has quiet and respectful tenants so looking for the same. There is absolutely no smoking anywhere on the property. Screening for evictions, Felonies and credit check will be verified Income needs to be 3x rent verified by paystub's 12 month lease with first and security. For more information text your phone number.","num_images":5.0,"lat":39.9845,"lng":-75.5962,"attrs":"['2BR \/ 1Ba', '1100ft2', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T12:41:04-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-additional-closets-near\/7605739716.html","post_id":7605739716,"title":"Additional Closets\/ Near The Pool\/ Sunny Apartment\/ Corner Unit\/ Gym","description":"RENT PERIOD: YEARLY\nAsk about apartment home 225 on the second floor, available soon!!\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday 9:00 am-6:00 pm and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":10.0,"lat":40.053166,"lng":-75.236179,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T13:42:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-2040-market-st-1b1b\/7605733541.html","post_id":7605733541,"title":"2040 Market St; [1B1B 800sqrt] Zip code [19103], Corner Unit","description":"$2,000 \/ 1br - 800ft2 - 2040 Market St; [1B1B 800sqrt] Zip code [19103], Corner Unit (Rittenhouse Square, Downtown, Philadelphia)\n- 1B1B 800 Sqrt, spacious apartment.\n- Corner Unit facing SouthEast. Great sunshine, no blocked view.\n- 3min walk to trolly \/ bus station, Trader Joe's, CVS, Starbucks, and all the great restaurants and bars.\n- 24hr doorman\nAvailable from 05\/01\/2023 to 08\/01\/2023. Lease can be renewed with the leasing office after.\nText:  show contact info\nRent negotiable\nAbout the apartment:\n- Layout photo: https:\/\/drive.google.com\/file\/d\/1CvDpBQ0yQEKiocijnrUe8T3Qe7vxYwO1\/view?usp=share_link\n- Video: https:\/\/drive.google.com\/file\/d\/1Cs7zZupyfzVi68LyDLztLXm0yF8-StUn\/view?usp=share_link\n- Apartment building info: https:\/\/www.pmcpropertygroup.com\/properties\/2040-market","num_images":1.0,"lat":39.953664,"lng":-75.173956,"attrs":"['1BR \/ 1Ba', '800ft2', 'available may 1', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T13:29:17-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-you-will-love-having-your\/7605729114.html","post_id":7605729114,"title":"You will love having your own washer\/dryer at Millview Apartments!","description":"Millview Apartments Featured Floorplan: 2-bed \/ 2-bath \/ 1178 sq ftMonthly Rent: $1706 - $2272Deposit: Call  show contact info\nDescription: Millview Apartment Homes features the premier location for apartments in Coatesville, PA. Spacious floor plans and a variety of upscale amenities define the comfortable, carefree lifestyle for residents of our Coatesville, PA apartments. With a convenient location just moments from Downingtown and Exton, you will love calling Millview Apartments your home.\nOur apartment homes were designed with your lifestyle in mind. Residents can choose from a variety of one or two-bedroom floor plan options which fit any budget. Each of our apartments comes with a full-size washer and dryer, 9-foot ceilings, oversized windows, and walk-in closets.Lease Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.Apartment Amenities:− Built-In Microwave− Central Heat & Air Conditioning− Disability Access In Select Units− Dishwasher− Full-Size Washer & Dryer In Every Apartment− Mini Blinds On All Windows− Refrigerator\/Freezer With Ice Maker− Walk-In Closets Community Features:− Business Center− On-Site Leasing Office− Pet-Friendly− Private Garages In Select Units− 24-Hour Emergency Maintenance− Coffee Bar Clubhouse Kitchen− Resident Referral Bonuses Call us:  show contact info\n100 Cobblestone Dr Coatesville, PA 19320Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PMWebsite: https:\/\/www.apartmentsincoatesvillepa.com\/ EQUAL HOUSING OPPORTUNITY85203226EDB24E9\n","num_images":10.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1178ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T13:19:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-incredible-bedroom\/7605700166.html","post_id":7605700166,"title":"Incredible 3 bedroom, 2-bathroom apartment!","description":"Incredible 3 bedroom, 2-bathroom apartment in the middle of Rittenhouse Square with PARKING!!! Located on the corner of 23rd and Walnut Street, this apartment will give you walking access to the best parts that the city has to offer! This unit boasts large living and bedroom space with a TON of natural light to match! Washer and dryers in every unit. Easy access to all highways including 676 and I-95 in case you have to get out of the city limits easily and conveniently. The best restaurants within minutes' walk and the most vibrant night life as well. Pets allowed. Water and parking included in rent!\n*****If you are interested reply with name and your number to schedule a visit.\n","num_images":4.0,"lat":39.9448,"lng":-75.2288,"attrs":"['3BR \/ 2Ba', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T12:18:05-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/coatesville-come-home-to-millview\/7605727484.html","post_id":7605727484,"title":"Come home to Millview Apartments! Washer\/dryer in unit. Tour today!","description":"Millview ApartmentsLocated at: 100 Cobblestone Dr Coatesville, PA 19320Featured unit: 2 bed | 2 bath | 1088 sq ft Prices start at: $1708 - $2275\/month Call Today!  show contact info\nNestled high on a wooded hillside in picturesque Chester County, Millview Apartment Homes boasts contemporary designs with bright and spacious one and two bedroom floor plans. With a brand new luxurious atmosphere, amazing amenities, and a maintenance free lifestyle, Millview Apartment Homes is more than you could imagine at less than you would expect!Wonderful Amenities!✓ Business Center✓ On-Site Leasing Office✓ Pet-Friendly✓ Private Garages In Select Units✓ 24-Hour Emergency Maintenance✓ Coffee Bar Clubhouse Kitchen✓ Resident Referral BonusesApartment Features!✓ Built-In Microwave✓ Central Heat & Air Conditioning✓ Disability Access In Select Units✓ Dishwasher✓ Full-Size Washer & Dryer In Every Apartment✓ Mini Blinds On All Windows✓ Refrigerator\/Freezer With Ice Maker✓ Walk-In Closets  show contact info\nHours: Mon - Fri: 9:00 AM - 6:00 PMSat: 10:00 AM - 5:00 PM Website: https:\/\/www.apartmentsincoatesvillepa.com\/Terms: VariablePet Policy: Allowed: Breed Restrictions Apply. Weight Restrictions Apply. Monthly pet rent $35 if less than 40 lbs, $45 if more than 40 lbs. Non-refundable pet fee $350 for 1 pet, $500 for 2 pets.EQUAL HOUSING OPPORTUNITYF0AFFD10228E4DB\n","num_images":10.0,"lat":39.9843,"lng":-75.8253,"attrs":"['2BR \/ 2Ba', '1088ft2', 'air conditioning', 'application fee details: $60', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T13:15:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/quite-building-with-only-neighbors-and\/7605684891.html","post_id":7605684891,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/bala-cynwyd-dishwasher-smoke-free\/7605723297.html","post_id":7605723297,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lansdale-live-stylishly-classic\/7605716197.html","post_id":7605716197,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-furnished-apartment-for\/7605710516.html","post_id":7605710516,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-quiet-community-luxurious\/7605712132.html","post_id":7605712132,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-month-free-rent-bed-15\/7605709261.html","post_id":7605709261,"title":null,"description":null,"num_images":null,"lat":null,"lng":null,"attrs":null,"posted_date":null},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-immaculate-bedroom-25-bath\/7605660972.html","post_id":7605660972,"title":"Immaculate 3 bedroom, 2.5 bath single home","description":"show contact info\n- AVAILABLE NOW- Immaculate 3 bedroom, 2.5 bath single home with private deck in desirable Fishtown section of the city. Beautiful hardwood flooring throughout. Beautiful kitchen with cherry wood cabinets and stainless steel appliances. Finished basement with half bath. Full size wash-dryer. Walking distance to local eateries and stores. Freshly painted single home with balcony. Tenant is responsible for gas, electric, water, cable, and wifi.","num_images":1.0,"lat":39.9788,"lng":-75.1262,"attrs":"['3BR \/ 2.5Ba', 'available now', 'application fee details: IS FREE', 'house', 'w\/d hookups', 'listed by: Nicole Gailliard', 'detached garage', 'rent period: monthly']","posted_date":"2023-04-01T10:51:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stainless-steel-appl\/7605706129.html","post_id":7605706129,"title":"Stainless Steel Appl.\/Overlooks Courtyard\/Nice Bathroom Tile\/Pool\/Gym","description":"RENT PERIOD: YEARLY\nAsk about apartment home 206 on the second floor, available now!! This unit has a new carpet, newer kitchen with nice dark brown cabinets and stainless steel appliances. The bathroom has new tile and a new vanity. The unit also has nice 6-panel doors and it overlooks the courtyard, which has a grill, a few tables, and benches. There are also two laundry rooms a few feet down the hall. This unit has a special going on. We are offering $100 off per month for a year, which drops rent to $1,535. This unit does not have a dishwasher.\nVisit your new apartment home by taking a tour with Linda or Carissa today! Please call us at  show contact info\nto set up your tour through our outstanding community. We are open and available to meet your needs. The Leasing Office is open Monday-Friday 9:00 am-6:00 pm and also Saturdays 10:00 am-4:00 pm. Need to request another time for your visit? No problem! Please ask if it is possible to schedule an appointment that is convenient for your time schedule. We look forward to arranging your visit to view your new apartment home!\nFEATURES:\n-PET FRIENDLY!\n-Spacious Closets\n-Refrigerator with Ice Maker\n-Dishwashers\/Garbage Disposal\n-Open Floor Plan\n-Window Treatments\n-Individual Storage Locker Available for Rent.\n-Intercom Entrance\nCOMMUNITY FEATURES:\n-On-site Management\n-On-Site maintenance\/24 hour emergency service\n-Septa Bus Stop on the corner\n-Online Payments Available\n-Cable Ready\n-Online service request\n-Septa Transportation outside Rental Office\n-Pool\n-Gym\n-Package Room\n-On-Site Laundry\nThe Metropolitan Roxborough apartment homes, are just minutes to Center City Philadelphia, Manayunk, Blue Bell, Germantown, Conshohocken, Chestnut Hill, Andorra and Plymouth Whitemarsh. Conveniently located minutes away from routes 1, 476, I-76, PA Turnpike. Walk to Valley Green Park. Convenient to Ivy Ridge Train Station to Center City, Target and more! The Metropolitan Roxborough apartment homes are a great choice for both convenience and quality of life. That's part of your \"wish list\"\/ Call today to set an appointment to fall in love with your new apartment home today\nEqual Housing Opportunity\n","num_images":14.0,"lat":40.053166,"lng":-75.236179,"attrs":"['2BR \/ 1Ba', 'cats are OK - purrr', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T12:30:55-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-luxury-kitchen-d-in-unit\/7605708752.html","post_id":7605708752,"title":"Luxury Kitchen, W\/D in Unit, Fitness Center, & Free Parking!","description":"Apartment 937 is a BRAND NEW top floor, Luxury Premier 1 Bedroom with a stainless steel kitchen package, breakfast bar, real quartz counter tops, and washer\/dryer in unit. Plush carpeting throughout and gets great daylight too! Make this your new apartment home today!\nOn-Site \/ Virtual Tours\nCome on by The Metropolitan West Chester for an on-site personalized tour of our amazing community and available apartment homes! Or ask your Leasing Agent about a personalized virtual tour instead to view all the great things we have to offer from the comfort of your own home!\nApartment Features:\nWasher\/dryer\nOpen Floor plans\nDishwasher \/ Microwave \/ Garbage Disposal\nRefrigerator w\/ Ice Maker\nBreakfast Bar\nCentral Air Conditioning\nPlush carpeting throughout\nSpacious Closets\nCommunity Features:\nPET FRIENDLY *\nFitness Center + In-Ground Pool\nFree off-street parking + Guest Parking\nProfessional On-Site Maintenance & 24-Hour Emergency Maintenance\nBBQ \/ Picnic Areas\nStorage Lockers Available\nThe Metropolitan West Chester apartment homes for living are located just minutes to downtown West Chester and all of its historic charm, vibrant restaurants and shops, and Chester County Hospital. Minutes to great shopping centers, featuring ShopRite, Gian, Acme and Whole Foods, along with other various retailers making shopping for your personal needs a breeze. Off Route 3\/West Chester Pike. Close to Routes 202, 100, 322, Paoli Pike, & Gay\/Market Street. Minutes to Malvern, Phoenixville, Exton, Downingtown, East Goshen, and King of Prussia.\nLeasing Office\nP:  show contact info\nHours: M-F, 9am-6pm | Sat, 10am-4pm\nThe Metropolitan West Chester\nApartment Homes For Living!\nAn Equal Housing Opportunity\n","num_images":16.0,"lat":39.966842,"lng":-75.602331,"attrs":"['1BR \/ 1Ba', '731ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-01T12:36:16-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-home-on\/7605688269.html","post_id":7605688269,"title":"Beautiful 3 Bedroom Home On The The Quiet Block!!","description":"Beautiful 3 bedroom on the the quiet block in North East Philadelphia! Original hardwood floor, fresh paint throughout, basement for extra storage. Kitchen has brand new stainless steel appliances, granite counter-top and there is a designer bathroom as well! Schedule your showing today and make it yours while you can! CALL For More Info:  show contact info","num_images":8.0,"lat":40.0547,"lng":-75.1866,"attrs":"['3BR \/ 1Ba', '1160ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T11:54:19-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-home-on\/7605688239.html","post_id":7605688239,"title":"Beautiful 3 Bedroom Home On The The Quiet Block!!","description":"Beautiful 3 bedroom on the the quiet block in North East Philadelphia! Original hardwood floor, fresh paint throughout, basement for extra storage. Kitchen has brand new stainless steel appliances, granite counter-top and there is a designer bathroom as well! Schedule your showing today and make it yours while you can! CALL For More Info:  show contact info","num_images":8.0,"lat":40.0547,"lng":-75.1866,"attrs":"['3BR \/ 1Ba', '1160ft2', 'cats are OK - purrr', 'dogs are OK - wooof', 'house', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T11:54:15-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/west-chester-bd-ba-dog-park-serene\/7605701277.html","post_id":7605701277,"title":"2\/BD 2\/BA, Dog Park, Serene Wooded View","description":"YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!At Jefferson at Westtown, luxury takes on a whole new meaning. Each home within our community offers freshly  renovated apartment features. Plus, our resort-style amenities are sure to bring ease to your day-to-day life. Begin your next chapter here - contact us today! Amenities Include:Full Size Washer and Dryer in All UnitsCable ReadyExecutive Business CenterPicnic AreaIndividual Intrusion Alarms9' Ceilings w\/ Crown MoldingNewly Renovated InteriorsExtra StorageState-of-the-Art Fitness CenterDog ParkExclusive & Newly Renovated ClubhouseSpeakeasy Wine RoomCall:  show contact info\nFor more information, visit us at: https:\/\/livewithtwocoast.com\/b6z7lene\/JeffersonatWestTown\n","num_images":9.0,"lat":39.9441,"lng":-75.5882,"attrs":"['2BR \/ 2Ba', '1271ft2', 'available now', 'apartment', 'w\/d in unit', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T12:20:31-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-enjoy-the-entertaining\/7605700607.html","post_id":7605700607,"title":"Enjoy the entertaining, open floor plan and high ceilings!","description":"Here's your opportunity to live in one of the most spacious and desired one bedroom floor plans at The Phoenix Condominiums in Center City, Philadelphia. This unit features large windows, beautiful floors, large kitchen with separate dining room, in-unit washer & dryer and ample closet space. Enjoy the entertaining, open floor plan and high ceilings. 5 X 4 Storage locker included in the price. This grand, historic and amenity filled building is centrally located and just steps away from everything Center City, Philadelphia has to offer. Amenities include a beautiful fitness center, media room, gorgeous roof top terrace with views of the city, direct access to Suburban Station, Starbucks and a full service restaurant. Valet Parking is available for an additional fee. Don't miss this wonderful opportunity.\n1600-18 Arch St #1702","num_images":10.0,"lat":39.9513,"lng":-75.1741,"attrs":"['1BR \/ 1Ba', '961ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T12:18:59-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-house-is-bedrooms-and-full\/7605689789.html","post_id":7605689789,"title":"House is 3 bedrooms and 2 full bathrooms","description":"Recently renovated row home in the Germantown area walking distance to Drexel University College of Medicine and close to Thomas Jefferson University. House is 3 bedrooms and 2 full bathrooms. There's a laundry room on the first floor, heated shower in the first floor full bath, side yard with doggie door, back deck with a wheelchair ramp","num_images":7.0,"lat":39.94662,"lng":-75.161843,"attrs":"['3BR \/ 2Ba', '1350ft2', \"application fee details: Discounted broker's fee\", 'broker fee details: App fee None (per person) & Processing fee  (Refundable)', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'listed by: Mark A. Dalton & Co., Inc', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T11:57:50-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-beautiful-bedroom-25-bath\/7605688918.html","post_id":7605688918,"title":"Beautiful 3 bedroom, 2.5 bath new construction in 2018!","description":"Coming in April, 2nd Unit Condo in Francisville. Beautiful 3 bedroom, 2.5 bath new construction in 2018 condo located in growing Francisville. The light-filled corner unit features high-end finishes throughout. High-end finishes throughout, this upper unit opens into a welcoming living room with half bath. The main living level has a gourmet kitchen with stainless steel appliances, an island great for gathering and an area for dining and relaxing. The first bedroom features a closet with built-ins and full bathroom accessible in hallway. The upper floor features two large bedrooms, a bathroom with glass shower and a laundry room. Laundry room convenient to bedrooms features washer and dryer. This gorgeous home enjoys a large, private roof deck with skyline views. Scores in the 80's for walking, biking and easy access to various modes of transportation. Within 15 minutes to Philadelphia International Airport. Across the street from a café and withing walking distances from other restaurants, museums, other points of interest. Utilities: Gas and Electric, are tenant responsibility. Water will be kept in owners name and invoiced to tenant. Renter's insurance required. Central Air and Washer & Dryer in unit. On-Street Parking. No smoking. No Pets.\n836 N 16th St #2","num_images":14.0,"lat":39.9677,"lng":-75.1735,"attrs":"['3BR \/ 2.5Ba', '2000ft2', 'available apr 8', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T11:55:47-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/downingtown-private-balcony-quiet\/7605699535.html","post_id":7605699535,"title":"Private Balcony, Quiet Community, Move In Now","description":"The Point at Downingtown, managed by Panco Management\n101 Woodbine Road\nDowningtown, PA 19335\nshow contact info\nVIEW OUR WEBSITE:\nhttp:\/\/thepointatdowningtown.com\nDiscover modern luxury blended with well-designed comfort for a truly distinct living experience. The Point at Downingtown has everything you are looking for and so much more! Call us today.\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, washer\/dryer, built-in desk, master suite, a Den, walk-in closets, and a balcony!\nApartment Features\n* Kitchen Island\n* Stainless Steel Appliances\n* Garden Tub\n* Walk-in Closet\n* Linen Closet\n* Washer and Dryer in unit\n* Private Patio or Private Balcony (on select apartments)","num_images":23.0,"lat":40.013891,"lng":-75.685564,"attrs":"['2BR \/ 2Ba', '1218ft2', 'available now', 'EV charging', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'off-street parking', 'rent period: monthly', 'wheelchair accessible']","posted_date":"2023-04-01T12:16:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-one-of-the-most-stylish\/7605699359.html","post_id":7605699359,"title":"One of the most stylish one bedroom unit!","description":"Live a short walk from Philadelphia's Art Museum steps and Kelly Drive, famous for its jogging paths along the river. This unit is one of the most stylish one bedroom units offered in 2601 Pennsylvania Avenue. It features an updated kitchen with stainless steel appliances, wood cabinets, a center island, and a classic subway tile backsplash. The spacious living room features updated floors and lots of natural light. The large bedroom has a generous-sized closet. The unit is completed with a tile bathroom and a separate laundry room. This condo building features a 24-hour front door attendant, shuttle service, a gym, and a community room. Now is the time to take advantage of being within walking distance to the finest museums and restaurants in the area. Schedule your appointment today!\n2601 Pennsylvania Ave #1028","num_images":11.0,"lat":39.9677,"lng":-75.1735,"attrs":"['1BR \/ 1Ba', '587ft2', 'available jun 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T12:16:23-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-where-convenience-meets\/7605698599.html","post_id":7605698599,"title":"Where Convenience Meets Luxury.","description":"DWELL 2nd Street Apartments\nshow contact info\n1321 N. American Street Suite 101\nPhiladelphia Pa 19122\nBedrooms:2\nBathrooms:2\nSquare Footage:767-780 sq.ft.\nPrice:Contact Us\nOffice Hours:\n\n· Monday, Tues, Thursday & Friday   9:00 - 6:00\n· Wednesday    9:00 - 7:00\n· Saturday    10:00 - 5:00\n· Sunday    12:00 - 5:00\nDWELL 2nd Street Apartments\nWhen it's time to upgrade your lifestyle...DWELL 2nd Street is just the answer! Our apartment community offers you spacious 2BR floor-plans in the sought after Fishtown\/Northern Liberties area.\nConvenient to I-95, 676 and Girard Avenue, getting around the city is a breeze whether you're driving, taking public transportation or Uber\/Lyft!\nshow contact info\nDriving Directions:\nFrom Philadelphia airport I-95N: Take I-95N to 676 W (Exit 22) on the left. Keep to right onto Callowhill St. (exit). Turn right onto N. Fifth Street. Continue N. Fifth Street to Thompson Street. Make a right on Thompson Street.\nDWELL is on your left-hand side at the corner of 2nd and Thompson Streets.\nUnit Amenities\n» Keyless smart door locks\n» Full-size stainless steel kitchen appliances\n» Quartz kitchen countertops\n» Floor to ceiling windows\n» Private balconies (in select units)\n» Stacked full-size Washer and Dryer in Unit\n» Expansive closets with organizers\n» luxury plank flooring in Living space\n» Programmable thermostats for controlled Central Heating and Cooling\n» Contemporary window shades\n» Custom designer lighting fixtures\nCommunity Features\n» secured building access control\n» Fitness Center\n» Resort pool complex\n» Outdoor living spaces\n» Outdoor pavilion with barbecue grills\n» Cozy Fire-pit seating area\n» Outdoor Bocce ball in pavilion\n» Game Room\n» Pool table\n» Business Center\n» Bike storage and workshop\n» Resident garage parking options\n» Pet friendly: Cats & Dogs Welcome\n» Fenced DOG park and pet spa\nPet Policy:\nPets are welcome at DWELL 2nd Street Apartments.  Please contact the office for additional information.Cat: Max 2 per home. Dog: Max 1 per home (weight and breed restrictions apply)\nContact DWELL 2nd Street Apartments:\nshow contact info\n\n\n\n\n\nOffer subject to change. |   Equal Housing Opportunity. Copyright ©,  DWELL 2nd Associates, L.P.  | All rights reserved.\n","num_images":23.0,"lat":39.971179,"lng":-75.140092,"attrs":"['2BR \/ 2Ba', '1135ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T12:14:51-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/lionville-theater-room-quiet-community\/7605697865.html","post_id":7605697865,"title":"Theater Room, Quiet Community, Move In Now","description":"The Point at Exton, managed by Panco Management\n181 N Pottstown Pike\nExton, PA 19341\nshow contact info\nDiscover a brand-new community designed to take luxury to the next level while keeping you close to everything you need. Lease now at The Point at Exton!\nThis two bedroom two bathroom apartment features a fully equipped kitchen, entry closet, built-in desk, ensuite bathrooms, walk-in closets, and a washer\/dryer!\nVIEW OUR WEBSITE:\nhttps:\/\/www.thepointatexton.com\/\nMonday 9:00am - 6:00pm\nTuesday 9:00am - 6:00pm\nWednesday 9:00am - 6:00pm\nThursday 9:00am - 6:00pm\nFriday 9:00am - 6:00pm\nSaturday 10:00am - 5:00pm\nSunday 11:00am - 4:00pm","num_images":24.0,"lat":40.031462,"lng":-75.628976,"attrs":"['2BR \/ 2Ba', '1234ft2', 'available now', 'air conditioning', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no smoking', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T12:13:27-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-incredible-bedroom\/7605690448.html","post_id":7605690448,"title":"Incredible 3 bedroom, 2-bathroom apartment!","description":"Incredible 3 bedroom, 2-bathroom apartment in the middle of Rittenhouse Square with PARKING!!! Located on the corner of 23rd and Walnut Street, this apartment will give you walking access to the best parts that the city has to offer! This unit boasts large living and bedroom space with a TON of natural light to match! Washer and dryers in every unit. Easy access to all highways including 676 and I-95 in case you have to get out of the city limits easily and conveniently. The best restaurants within minutes' walk and the most vibrant night life as well. Pets allowed. Water and parking included in rent!\n135 S 23rd Street #A1","num_images":10.0,"lat":39.9513,"lng":-75.1741,"attrs":"['3BR \/ 2Ba', '1250ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'detached garage', 'rent period: monthly']","posted_date":"2023-04-01T11:59:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-eelegant-living-space-is\/7605686833.html","post_id":7605686833,"title":"Eelegant living space is a MUST SEE!","description":"What a WOW! This NORTHERN LIBERTIES MAGNIFICENT HOME boasting over 2700 SQ FEET of elegant living space is a MUST SEE. Expansive living and dining area with 15 Ft ceilings, state of the art kitchen with high end appliances and tons!!! Of cabinet and counter space . Ascend an elegant stair case and you will see TW0 well proportioned bedrooms and TWO full BATHS. Top FLOOR, primary suite , your will never want to LEAVE, with a spa type bath. Completely FINISHED lower level ideal for in home gym and OFFICE. Yes there’s GARAGE PARKING , JULIET balconies & a DECK! Walking score a 100 percent to some of NORTHERN LIBERTIES best dining & night life. Also super EZ commute to Penn& and Cooper HOSPITALS!\n913 N Lawrence St","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['4BR \/ 3Ba', '2756ft2', 'available now', 'apartment', 'laundry in bldg', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T11:51:08-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-1br-988ft2-boutique\/7605676450.html","post_id":7605676450,"title":"1br - 988ft2 - Boutique Building in Bella Vista with your own Private","description":"If you are interested in the property give your phone number.I will contact you as soon as possible!\nYou are greeted by the bank of south facing windows , high ceilings, hardwood floors throughout, and sleek ceiling fans. The stainless and maple open kitchen boasts a zero radius sink, commercial style faucet, glass mosaic back splash and poured concrete counter tops. The main bath features slate tiles, polished concrete vanity with raised vessel glass sink, river rock back splash and a square-shaped Pessario dual flush toilet. Open den with Murphy bed is just off the kitchen. Glass french doors lead to the bedroom suite w\/ private powder room and stackable laundry. Sliding glass doors lead out to the terrace.\n","num_images":1.0,"lat":39.9597,"lng":-75.2024,"attrs":"['1BR \/ 1Ba', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'attached garage', 'rent period: monthly']","posted_date":"2023-04-01T11:27:25-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-located-in-one-of-the-most\/7605685481.html","post_id":7605685481,"title":"Located in one of the most beautiful neighborhoods in Philadelphia!","description":"Located in one of the most beautiful neighborhoods in Philadelphia, Washington Square West, The Lincoln Building (1222 Locust Street) boasts a blend of upscale living with modern finishes. The Lincoln Building shares the vision of the city that gives it life! A historical renovation immersed amongst the charm of one of the country's oldest cities, coupled with innovative development seen around the world-- all at your doorstep! Chic and modern finishes mesh with the original character of the building to provide the perfect combination of sophistication and comfort. Twelve22 Locust offers the convenience of living in one of Philadelphia's trendiest neighborhoods- from world class dining to shopping, it has it all! Hardwood floors, City views, W\/D in unit, dishwasher, stainless steel appliances and communal roof deck. The Lincoln has an amazing location in easy walking distance of multiple modes of public transportation and tons of shops and restaurants.\n1222 Locust St #207","num_images":10.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '967ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T11:48:00-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-bcity-views-tons-of\/7605682281.html","post_id":7605682281,"title":"Bcity views & tons of natural light!","description":"Welcome to 200 Locust Street #12E! This river view facing studio home resides in the highly desirable Society Hill neighborhood of Philadelphia. As you enter the elevator accessible building and make your way to this unit, you will immediately notice hardwood flooring throughout and oversized floor to ceiling windows, allowing for beautiful city views & tons of natural light! The kitchen features stainless steel appliances, white Shaker cabinetry, & granite countertops. There are two large corner closets, allowing for ample closet space and a full bathroom. The bathroom boasts a large vanity with under sink storage, and a tiled shower\/tub area. This condominium is in a perfect location, located in a historic and quiet neighborhood. In close proximity to all of the amazing restaurants, bars, grocery stores, coffee shops, and walks along the river, schedule your showing today!\n200 Locust St #12E","num_images":9.0,"lat":39.9474,"lng":-75.1473,"attrs":"['0BR \/ 1Ba', '522ft2', 'available now', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'laundry in bldg', 'off-street parking', 'rent period: monthly']","posted_date":"2023-04-01T11:40:44-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-amazing-two-bedroom-two\/7605671778.html","post_id":7605671778,"title":"AMAZING two bedroom two bathroom apartment!","description":"VIDEO TOUR OF THE UNIT AVAILABLE! PLEASE INQUIRE FOR IT! LEASE WILL RUN THROUGH APRIL 2024. AMAZING two bedroom two bathroom apartment in the desirable Washington Square West neighborhood! Beautifully updated with open concept kitchen, stainless steel appliances and wood floors throughout. Tons of natural light! Steps from shopping, dining, Center City, and public transportation. Excellent condition!! Make this place your own -- it will not last! AVAILABLE STARTING NOW! Central air and heat controllable inside the unit make the space comfortable all year round!! Again don't wait long, it will not last at this price! First month, last month, and one month security deposit due prior to move-in. Resident responsible for Electric and Gas. Landlord is charging a $60 monthly fee for water. $45 application fee per applicant.\n1333 Pine St #1F","num_images":10.0,"lat":39.9487,"lng":-75.1593,"attrs":"['2BR \/ 2Ba', '700ft2', 'available now', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T11:16:10-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/gladwyne-house-for-rent\/7605685054.html","post_id":7605685054,"title":"House for Rent","description":"3 Bedroom twin home located in center of historic Gladwyne Village.\nLiving room, dining room, full kitchen, remodeled bathroom, restored hardwood floors, washer & dryer in basement, gas heat, private backyard.\nEasy access for R-5 train and Schuylkill Expressway  (I-76).\n$1,850.00 per month, plus utilities.\n1 year lease, first month, last month, and 1 month's security deposit required prior to move-in.\n*Small dogs considered with additional (non refundable) pet deposit.\nContact Tel:  show contact info","num_images":6.0,"lat":40.035608,"lng":-75.278074,"attrs":"['3BR \/ 1Ba', 'available apr 3', 'house', 'w\/d in unit', 'no smoking', 'street parking', 'rent period: monthly']","posted_date":"2023-04-01T11:47:03-0400"},{"url":"https:\/\/philadelphia.craigslist.org\/apa\/d\/philadelphia-stylish-and-elegant-bi\/7605680972.html","post_id":7605680972,"title":"Stylish and elegant bi-level 2 BR apt in the heart of Northern Liberti","description":"Welcome to 987 N 5th St! A stylish and elegant bi-level 2 BR apt in the heart of Northern Liberties waiting for you to move in. Enter into a large living room with original wide plank hardwood flooring and a decorative marble fireplace mantel. Continue on into the dining area and kitchen, which is in the process of receiving an upgrade with new hardwood flooring, granite countertops and a white subway tile backsplash. All appliances were newly installed last year. Beyond the kitchen lies a mud room perfect for bike storage. Retreat to the huge, private backyard great for BBQing, outdoor entertaining and container gardening. Upstairs you will find two bedrooms and a newly updated bathroom. There is an in unit washer and dryer in the basement, which also provides more than ample storage. The location can't be beat. Steps away from all that Northern Liberties has to offer as well as a short walk to Fishtown, Olde Kensington and the Spring Arts\/Loft District. Pets are allowed on a case by case basis so bring your furry friends. Available for a May 1st move in. This one won't last so schedule your showing today!\n987 N 5th St #1","num_images":8.0,"lat":39.966,"lng":-75.151,"attrs":"['2BR \/ 1Ba', '1200ft2', 'available may 1', 'cats are OK - purrr', 'dogs are OK - wooof', 'apartment', 'w\/d in unit', 'no parking', 'rent period: monthly']","posted_date":"2023-04-01T11:37:50-0400"}]